{
    "title": "_operation oceansalt_ delivers wave after wave _ mcafee blogs",
    "text": "‘Operation Oceansalt’ Delivers Wave\nAfter Wave\nLbAedd Hnld\nSecuring Tomorrow\n\n\n\n\nUnited States / English     Privacy Legal Notices Legal Contracts & Terms Site Map Copyright ©20202019 McAfee, LLC   Home/Other Blogs /McAfee Labs /‘Operation Oceansalt’ Delivers Wave After Wave\n By Raj Samani  and Ryan Sherstobito  on Oct 17, 2018\nA wall eight feet high with three strands of barbed wire is considered su cient to deter a determined intruder, at least according to the\nadvice o ered by the CISSP professional certi cation. Although physical controls can be part of a multifaceted defense, an electronic\nattack a ords the adversary time to develop the necessary tools to bypass any logical wall set before them. In the latest  ndings from\nthe McAfee Advanced Threat Research team, we examine an adversary that was not content with a single campaign, but launched  ve\ndistinct waves adapted to their separate targets. The new report “Operation Oceansalt Attacks South Korea, U.S., and Canada with\nSource Code from Chinese Hacker Group”  analyzes these waves and their victims, primarily in South Korea but with a few in the United\nStates and Canada.\nAlthough one reaction is to marvel at the level of innovation displayed by the threat actor(s), we are not discussing  ve new, never-\nbefore-seen malware variants—rather the reuse of code from implants seen eight years prior. The Oceansalt malware uses large parts\nof code from the Seasalt implant, which was linked to the Chinese hacking group Comment Crew. The level of reuse is graphically\ndepicted below:\nCode Visualization of Recent Oceansalt with Older Seasalt\nOceansalt, 2018.\nSeasalt, 2010.\nWho is Behind the Oceansalt Attack?\nOriginally taking the title APT1, the Comment Crew was seen as the threat actor conducting o ensive cyber operations against the\nUnited States almost 10 years before. The obvious suspect is Comment Crew and, although this may seem a logical conclusion, we have\nnot seen any activity from this group since they were initially exposed. Is it possible that this group has returned and, if so, why target\nSouth Korea?\nIt is possible that the source code developed by Comment Crew has now been used by another adversary. The code to our knowledge,\nhowever, has never been made public. Alternatively, this could be a “false  ag” operation to suggest that we are seeing the re-\nemergence of Comment Crew. Creating false  ags is a common practice.\nWhat Really Matters\nIt is likely that reactions to this research will focus on debating the identity of the threat actor. Although this question is of great\ninterest, answering it will require more than the technical evidence that private industry can provide. These limitations are frustrating.\nHowever, we can focus on the indicators of compromise presented in this report to detect, correct, and protect our systems,\nregardless of the source of these attacks.\nPerhaps more important is the possible return of a previously dormant threat actor and, further, why should this campaign occur now?\nRegardless of whether this is a false  ag operation to suggest the rebirth of Comment Crew, the impact of the attack is unknown.\nHowever, one thing is certain. Threat actors have a wealth of code available to leverage new campaigns, as previous research  from the\nAdvanced Threat Research team has revealed. In this case we see that collaboration not within a group but potentially with another\nthreat actor—o ering up considerably more malicious assets. We often talk about partnerships within the private and public sector as\nthe key to tackling the cybersecurity challenges facing society. The bad actors are not putting these initiatives on PowerPoint slides and\nmarketing material; they are demonstrating that partnerships can suit their ends, too.\nAbout the Author\n\nRaj Samani\nRaj Samani is Chief Scientist and McAfee Fellow for cybersecurity  rm McAfee. He has assisted multiple law\nenforcement agencies in cybercrime cases, and is a special advisor to the European Cybercrime Centre in The\nHague. Samani has been recognized for his contribution to the computer security industry through numerous\nawards, including the Infosecurity Europe hall ...\nRead more posts from Raj Samani \n\nRyan Sherstobito \nRyan Sherstobito  is a Senior Analyst for Major Campaigns – Advanced Threat Research in McAfee. Ryan\nspecializes in threat intelligence in the Asia Paci c Region where he conducts cutting edge research into new\nadversarial techniques and adapts those to better monitor the threat landscape. He formerly was the Chief\nCorporate Evangelist at Panda Security, where ...\nRead more posts from Ryan Sherstobito  \n Previous Article Next Article \nCategories: McAfee Labs\nTags: malware, endpoint protection , cybersecurity , Advanced Threat Research\nLeave a reply\nFacebook Comments Comments (0)\nSimilar Blogs\nWhatsApp Security Hacks: Are\nYour ‘Private’ Messages Really\nEver Private?\nMar 14, 2020\nIs WhatsApp Safe for Kids? Here’s\nWhat Parents Need to Know\nMar 07, 2020\nIs Mobile Malware Playing Hide\nand Steal on Your Device?\nMar 03, 2020\nFamily Safety\n Family Safety\n Consumer\nSubscribe to McAfee Securing Tomorrow Blogs\nEmail address  Subscribe Search Blogs Blog Home Categories Authors Subscribe\nFor Home For Enterprise \n "
}