{
    "title": "_operation tropic trooper_ hits targets in taiwan_ philippines_ trend micro _ securityweek.com",
    "text": "SECURITYWEEK NETWORK: Information Security News Infosec Island CISO Forum Security Experts: WRITE FOR US\nTweet\n Recommend 13\nBrian Prince is a Contributing Writer\nfor SecurityWeek.\n U.S. Healthcare Companies Hardest Hit by 'Stegoloader'\nMalware\nCryptoWall Ransomware Cost Victims More Than $18\nMillion Since April 2014: FBI\nNew Adobe Flash Player Flaw Shares Similarities With\nPrevious Vulnerability: Trend Micro\nVisibility Challenges Industrial Control System Security:\nSurvey\nAdobe Flash Player Zero-Day Exploited in Attack\nCampaignPrevious Columns by Brian Prince:\n2020 ICS Cyber Security Conference | USA [Oct. 19-22]\n2020 Singapore ICS Cyber Security Conference | June 16-18 2020]\n2019 CISO Forum, Presented by Intel (Ritz-Carlton, Half Moon Bay CA)sponsored links\nTags: NEWS & INDUSTRY  Virus & MalwareTweet\n Recommend 13\nBy Brian Prince  on May 14, 2015\nHome  › Virus & Malware\n'Operation Tropic Trooper' Hits Targets in\nTaiwan, Philippines: Trend Micro\nA three‐year‐old cyber operation is using a mix of social engineering, Microsoft Windows\nvulnerabilities and basic stenography to target government, military and industry officials\nin Taiwan and the Philippines, according to Trend Micro.\nIn a new report, the security firm revealed the ongoing attacks ‐ which it dubbed 'Operation\nTropic Trooper' ‐ go back to 2012, but the malware the attackers are using shares traits with\nsamples Trend Micro first examined in 2011. Between March and May of this year, 62 percent\nof the malware infections have targeted Taiwanese organizations, while the remaining 38\npercent have hit entities in the Philippines. In Taiwan, the targets have included government\nministries and heavy industries, while the targets in the Philippines have been in the\nmilitary. \nWhile Trend Micro did not identify the actors behind the attacks, researchers were able to\npinpoint command and control servers in four countries: Taiwan (home to 43 percent of the\nservers), Hong Kong (14 percent), U.S. (36 percent) and the United Arab Emirates (seven\npercent).\n\"This latest attack relied on two of the most‐exploited Windows vulnerabilities to date—CVE‐\n2010‐3333 and CVE‐2012‐0158—to infiltrate the target networks,\" blogged Kervin Alintanahin,\nthreats analyst at Trend Micro. \"This suggests that the organizations were running on\nunpatched, vulnerable systems that made them more susceptible to threats.\"\n\"Aside from exploiting those vulnerabilities, the threat actors used basic steganography,\" the\nresearcher continued. \"This means they were able to conceal malicious code in JPEG files\npopularly used as Windows XP wallpapers. Steganography, although not a new cybercriminal\ntactic, is not commonly used in targeted attacks.\"\nThe attackers may have chosen this approach because of the continued use of XP systems  in\nTaiwan and the Philippines despite the operating system having reached its end‐of‐life,\nAlintanahin noted. There is also a chance the threat actors have used steganography because\nthey either still use Windows XP themselves or have in‐depth knowledge of it, the\nresearchers added.\nThe attack starts with emails laced with a malicious attachment. Opening the documents\nleads to the execution of malware that downloads an image file to the system, according to\nTrend Micro.\n\"Closer inspection of the downloaded image file reveals that it uses steganography to hide\nthe malicious content,\" the researcher explained. \"It will decrypt executable files in memory\nand will not save it to the disks. These files are installers and will drop the backdoor\nBKDR_YAHAMAM. With the backdoor’s capabilities of downloading, uploading, and creating a\nremote shell, it can easily conduct the next phase of its attack which is to find other targets\nwithin its reach.\"\n\"Operation Tropic Trooper is not highly sophisticated,\" Alintanahin noted . \"But the fact that it\nhas attained some degree of success and has managed to infiltrate crucial organizations in\nboth Taiwan and the Philippines shows the urgent need for targeted entities to rectify their\nshortcomings in terms of security. Knowing that attackers are still using old techniques and\nexploiting known vulnerabilities will make it easier for the targeted organizations to pinpoint\nand fix security gaps in their networks.\"\nThe Trend Micro report can be  read here.  \n Search\nBusiness Email AddressSUBSCRIBE TO THE DAILY BRIEFING\n   \n   \n    \nMost Recent Most Read\nCisco Patches Several Vulnerabilities in SD‐WAN\nSolution\nResearchers Track Coronavirus‐Themed\nCyberattacks\nAnalyzing Cyberspace Solarium Commission's\nBlueprint for a Cybersecure Nation\nSixgill Introduces Dark Web Data Feed Product\nAdobe Patches Critical Flaws in Reader,\nColdFusion, Other Products\nVMware Fixes Privilege Escalation Vulnerability in\nFusion for Mac\nThe Human Element and Beyond: Why Static\nPasswords Aren't Enough\nRansomware Is Mostly Deployed After Hours:\nReport\nThe Other Virus Threat: Surge in COVID‐Themed\nCyberattacks\nBarr: FBI Probing If Foreign Gov't Behind HHS\nCyber Incident\nPopular Topics\nInformation Security News\nIT Security News\nRisk Management\nCybercrime\nCloud Security\nApplication Security\nSmart Device Security\nSecurity Community\nIT Security Newsletters\nICS Cyber Security Conference\nCISO Forum, Presented by Intel\nInfosecIsland.Com\nStay Intouch\nTwitter\nFacebook\nLinkedIn Group\nCyber Weapon Discussion\nGroup\nRSS Feed\nSubmit Tip\nSecurity Intelligence Group\nAbout SecurityWeek\nTeam\nAdvertising\nEvents\nWriting Opportunities\nFeedback\nContact Us\nCopyright © 2020 Wired Business Media. All Rights Reserved.  Privacy Policy\nSubscribe 2019 CISO Forum, Presented by Intel ICS Cyber Security Conference Contact\nMalware & Threats Cybercrime Mobile & Wireless Risk & Compliance Security Architecture Security Strategy SCADA / ICS IoT Security\nShare\nShare\n "
}