{
    "title": "adobe flash zero-day used in targeted attacks _ securelist",
    "text": "Share post on:Earlier today, Adobe published the security advisory APSA16-03 , which describes a critical vulnerability in Adobe Flash Player\nversion 21.0.0.242 and earlier versions for Windows, Macintosh, Linux, and Chrome OS:\nA few of months ago, we deployed a new set of technologies into our products designed to identify and block zero day\nattacks. These technologies already proved its effectiveness earlier this year, when they caught an Adobe Flash zero day\nexploit, CVE-2016-1010 . Earlier this month, we caught another zero-day Adobe Flash Player exploit deployed in targeted\nattacks.\nWe believe these attacks are launched by an APT Group we call “ScarCruft”.\nScarCruft is a relatively new APT group; victims have been observed in several countries, including Russia, Nepal, South\nKorea, China, India, Kuwait and Romania. The group has several ongoing operations utilizing multiple exploits — two for\nAdobe Flash and one for Microsoft Internet Explorer.\nCurrently, the group is engaged in two major operations: Operation Daybreak  and Operation Erebus . The first of them,\nOperation Daybreak, appears to have been launched by ScarCruft in March 2016 and employs a previously unknown (0-day)\nAdobe Flash Player exploit, focusing on high profile victims. The other one, “Operation Erebus” employs an older exploit,\nfor CVE-2016-4117 and leverages watering holes. It is also possible that the group deployed another zero day exploit, CVE-\n2016-0147, which was patched in April.\nWe will publish more details about the attack once Adobe patches the vulnerability, which should be on June 16. Until then,\nwe confirm that Microsoft EMET is effective at mitigating the attacks. Additionally, our products detect and block the\nexploit, as well as the malware used by the ScarCruft APT threat actor.\n* More information about the ScarCruft APT and Operation Daybreak is available to customers of Kaspersky Intelligence\nServices. Contact: intelreports@kaspersky.com\n \nADOBE FLASH  APT VULNERABILITIES  ZERO-DAY VULNERABILITIES\nRelated Posts\nLEAVE A REPLY\nYour email address will not be published.  Required fields are marked *\nEnter your comment here\nName *\nEmail *\nSave my name, email, and website in this browser for the next time I comment.\n \nSUBMIT\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\n \nIN THE SAME CATEGORY\nAssessing the impact of protection from\nweb miners\nAn advertising dropper in Google Play\nAgent 1433: remote attack on Microsoft\nSQL Server\nHow to steal a million (of your data)\nOn the IoT road: perks, beneﬁts and\nsecurity of moving smartly\nINCIDENTS  RESEARCH\nCVE-2016-4171 – Adobe Flash Zero-\nday used in targeted attacks\nBy Costin Raiu  on June 14, 2016. 6:38 pm\n \nNotify me when new comments are added.\n© 2020 AO Kaspersky Lab.  All Rights Reserved. \nRegistered trademarks and service marks are the property of their respective owners.\nContact us  | Privacy Policy  | License AgreementEmail\n I agree to provide my email address to “AO Kaspersky\nLab” to receive information about new posts on the\nsite. I understand that I can withdraw this consent at\nany time via e-mail by clicking the “unsubscribe” link\nthat I find at the bottom of any e-mail sent to me for\nthe purposes mentioned above.SUBSCRIBE\nOilRig’s Poison Frog – old\nsamples, same trick\nKaspersky Security Bulletin\n2019. Statistics\nWindows 0-day exploit CVE-\n2019-1458 used in\nOperation WizardOpium\nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\n English\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPRCompanyAccount GET IN TOUCHSolutions for: Home Products  Small Business 1-50 employees Medium Business 51-999 employees Enterprise 1000+ employees\nWe use cookies to make your experience of our websites better. By using and further navigating this website you accept this. Detailed\ninformation about the use of cookies on this website is available by clicking on more information .ACCEPT AND CLOSE\n "
}