{
    "title": "advanced persistent threat groups _ fireeye",
    "text": "Ǻđvǻňčěđ Pěřșįșțěňț Țħ řěǻț Ģřǿųpș\nẄħǿ'ș ẅħǿ ǿf čỳbě ř țħřěǻț ǻčțǿ řș\nFįřěĚỳě pǻỳș șpěčįǻŀ ǻțțěňțįǿň țǿ ǻ đvǻňčěđ pěřșįșțěňț țħřěǻțș (ǺPȚ) ģ řǿųpș țħǻț řěčěįvě\nđįřěčțįǿň ǻň đ șųppǿřț fřǿm ǻň ě șțǻbŀįșħěđ ňǻțįǿň șțǻțě.\nĿįķě ǿțħě ř ǻțțǻčķě řș, ǺPȚ ģřǿųpș țřỳ țǿ șțěǻŀ đǻțǻ, đįșřųpț ǿpěřǻțįǿňș ǿř đěșțřǿỳ\nįňfřǻșțřųčțųřě. Ųňŀįķě mǿ șț čỳběř čřįmįňǻŀș, ǺPȚ ǻțțǻčķě řș pųřșųě țħěįř ǿbjěčțįvě ș ǿvěř\nmǿňțħș ǿř ỳěǻřș. Țħěỳ ǻ đǻpț țǿ čỳbě ř đěfěňșěș ǻňđ fřěqųěňțŀỳ řěțǻřģěț țħě șǻmě vįčțįm.\nJųșț běčǻųșě ỳǿų ħǻvě ǺPȚ-ŀįňķě đ mǻŀẅǻřě vǻřįǻňțș įň ỳǿųř șỳșțěm đǿěșň'ț měǻň țħǻț ỳǿ ų'řě\nǻň ǺPȚ țǻ řģěț. Bųț ỳǿųř șěčųřįțỳ țěǻm șħǿųŀđ bě ǻẅǻřě ǿf țħįș ŀįșț ǿf țħě mǿ șț ǻčțįvě ǺPȚ\nģřǿųpș ǻňđ țǻķě ěxț řǻ přěčǻųțįǿňș ẅħěň țħěỳ đěțěčț mǻŀ ẅǻřě ŀįňķěđ țǿ přěvįǿųș ǺPȚ\nǻțțǻčķș.\nŘĚǺĐ ȚĦĚ ĿǺȚĚȘȚ ŘĚPǾŘȚ \nǺ 360-Đěģřěě Vįěẅ ǿf\nțħě Ŀǻțě șț ǺPȚ Ģ řǿųpș\nŘĚĢİȘȚĚŘ FǾŘ Ț ĦĚ ẄĚBİŇǺŘ WEBINAR\nSUSPECTED ATTRIBUTION: IRAN\nǺPȚ39\nȘųșpěčțěđ ǻțțřįbųțįǿň: İřǻň\nȚǻřģěț șěčțǿřș: Ẅħįŀě ǺPȚ 39'ș țǻřģěțįňģ șčǿpě įș ģŀǿbǻŀ, įț ș ǻčțįvįțįě ș ǻřě čǿňčěňț řǻțěđ įň țħě Mį đđŀě Ěǻșț.\nǺPȚ39 ħǻș přįǿřįțįżěđ țħě țěŀěčǿmm ųňįčǻțįǿň ș șěčțǿř, ẅįțħ ǻđđįțįǿňǻŀ țǻ řģěțįňģ ǿf țħě ț řǻvěŀ įňđųșțřỳ ǻňđ\nİȚ fįřmș țħǻț șųppǿřț įț ǻňđ țħě ħįģħ-țěčħ įň đųșțřỳ.\nǾvěřvįěẅ: Țħě ģřǿųp'ș fǿčųș ǿň țħě țěŀěčǿmm ųňįčǻțįǿň ș ǻňđ țřǻvěŀ įňđųșțřįěș șųģģěșțș įňțěňț țǿ pě řfǿřm\nmǿňįțǿřįňģ, țřǻčķįňģ, ǿ ř șųřvěįŀŀǻňčě ǿpě řǻțįǿňș ǻģǻįňșț șpěčįfįč įň đįvįđųǻŀș, čǿŀŀěčț p řǿpřįěțǻřỳ ǿř čųșțǿměř\nđǻțǻ fǿř čǿmmě řčįǻŀ ǿř ǿpěřǻțįǿňǻŀ p ųřpǿșěș țħǻț șěřvě șțřǻțěģįč řěqųįřěměňțș řěŀǻțěđ țǿ ňǻțįǿňǻŀ\npřįǿřįțįěș, ǿř čřěǻțě ǻđđįțįǿňǻŀ ǻččě șșěș ǻňđ věčțǿřș țǿ fǻčįŀįțǻțě f ųțųřě čǻmpǻįģň ș. Ģǿvěřňměňț ěňțįțįě ș\nțǻřģěțįňģ șųģģěșțș ǻ pǿțěňțįǻŀ șěčǿňđǻřỳ įňțěňț țǿ čǿŀŀěčț ģěǿpǿŀįțįčǻŀ đǻțǻ țħǻț mǻỳ běňěfįț ňǻțįǿň- șțǻțě\nđěčįșįǿň mǻķįňģ.\nǺșșǿčįǻțěđ mǻŀẅǻřě: Țħě ģřǿųp přįmǻřįŀỳ ŀěvěřǻģěș țħě ȘĚǺẄĚĚĐ ǻňđ ČǺČĦĚMǾŇĚỲ bǻčķđǿǿřș ǻŀǿňģ\nẅįțħ ǻ șpěčįfįč vǻ řįǻňț ǿf țħě PǾẄBǺȚ bǻčķ đǿǿř.\nǺțțǻčķ věčțǿ řș: Fǿř įňįțįǻŀ čǿmp řǿmįșě FįřěĚỳě İňțěŀŀįģěňčě ħǻ ș ǿbșěřvěđ ǺPȚ39 ŀěvěřǻģě șpěǻřpħįșħįňģ\nẅįțħ mǻŀįčįǿ ųș ǻțțǻčħměňț ș ǻňđ/ǿř ħỳpěřŀįňķș țỳpįčǻŀŀỳ řěșųŀțįňģ įň ǻ PǾẄBǺȚ įňfěčțįǿň. İň șǿmě čǻ șěș\npřěvįǿųșŀỳ čǿmp řǿmįșěđ ěmǻįŀ ǻččǿ ųňțș ħǻvě ǻŀ șǿ běěň ŀěvě řǻģěđ, ŀįķěŀỳ țǿ ǻb ųșě įňħěřěňț țřųșțș ǻňđ\nįňčřěǻșě țħě čħǻňčě ș ǿf ǻ șųččěșșfųŀ ǻțțǻčķ. ǺPȚ 39 fřěqųěňțŀỳ řěģįșțěřș ǻňđ ŀěvěřǻģěș đǿmǻįňș țħǻț\nmǻșqųěřǻđě ǻș ŀěģįțįmǻțě ẅěb șěřvįčěș ǻňđ ǿřģǻňįżǻțįǿňș țħǻț ǻřě řěŀěvǻňț țǿ țħě įňțěň đěđ țǻřģěț.\nFųřțħěřmǿřě, țħįș ģřǿųp ħǻș řǿųțįňěŀỳ įđěňțįfįěđ ǻňđ ěxpŀǿįțě đ vųŀňěřǻbŀě ẅěb șěřvěřș ǿf țǻřģěțěđ\nǿřģǻňįżǻțįǿňș țǿ įňșțǻŀŀ ẅěb șħěŀŀș, șųčħ ǻș ǺŇȚǺĶ ǻň đ ǺȘPXȘPỲ, ǻň đ ųșěđ șțǿŀěň ŀěģįțįmǻțě č řěđěňțįǻŀș\nțǿ čǿmp řǿmįșě ěxțěřňǻŀŀỳ fǻčįňģ Ǿ ųțŀǿǿķ Ẅěb Ǻččě șș (ǾẄǺ) řěșǿųřčěș. Ẅě ħǻvě ňǿț ǿb șěřvěđ ǺPȚ39\něxpŀǿįț v ųŀňěřǻbįŀįțįěș.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nBŀǿģ  – ǺPȚ39: Ǻň İřǻňįǻň Čỳbě ř Ěșpįǿňǻģě\nĢřǿųp Fǿčųșěđ ǿň Pěřșǿňǻŀ İňfǿřmǻțįǿň\nǺPȚ34\nȘųșpěčțěđ ǻțțřįbųțįǿň: İřǻň\nȚǻřģěț șěčțǿřș: Țħįș țħřěǻț ģřǿųp ħǻș čǿňđųčțěđ břǿǻđ țǻřģěțįňģ ǻč řǿșș ǻ vǻřįěțỳ ǿf įň đųșțřįěș, įňčŀųđįňģ\nfįňǻňčįǻŀ, ģǿvě řňměňț, ěňě řģỳ, čħěmįčǻŀ, ǻň đ țěŀěčǿmm ųňįčǻțįǿň ș, ǻňđ ħǻș ŀǻřģěŀỳ fǿč ųșěđ įțș ǿpěřǻțįǿňș\nẅįțħįň țħě Mį đđŀě Ěǻșț\nǾvěřvįěẅ: Ẅě běŀįěvě ǺPȚ 34 įș įňvǿŀvě đ įň ǻ ŀǿňģ-țě řm čỳbě ř ěșpįǿňǻģě ǿpě řǻțįǿň ŀǻ řģěŀỳ fǿč ųșěđ ǿň\nřěčǿňňǻį șșǻňčě ěffǿ řțș țǿ běňěfįț İřǻňįǻň ňǻțįǿň- șțǻțě įňțě řěșțș ǻňđ ħǻș běěň ǿpě řǻțįǿňǻŀ șįňčě ǻț ŀěǻ șț\n2014. Ẅě ǻ șșěșș țħǻț ǺPȚ 34 ẅǿřķș ǿň běħǻŀf ǿf țħě İřǻňįǻň ģǿvě řňměňț bǻ șěđ ǿň įňfřǻșțřųčțųřě đěțǻįŀș\nțħǻț čǿňțǻįň řěfěřěňčěș țǿ İřǻň, ųșě ǿf İřǻňįǻň įňf řǻșțřųčțųřě, ǻňđ țǻřģěțįňģ țħǻț ǻŀįģň ș ẅįțħ ňǻțįǿň- șțǻțě\nįňțěřěșțș.\nȘųșpěčțěđ Ǻțțřįbųțįǿň\nİřǻň | Čħįňǻ  | Ňǿřțħ Ķǿřěǻ | Řųșșįǻ | Vįěțňǻm  | Ųňđįșčŀǿșěđ\nĦǿmě  Řěșǿųřčěș Ǻđvǻňčěđ Pěřșįșțěňț Țħ řěǻț Ģřǿųpș  \nČǾŇȚǺČȚ ŲȘ  ŘĚPǾŘȚ Ǻ Ň İŇČİĐĚŇȚ\nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n Ǻșșǿčįǻțěđ mǻŀẅǻřě: PǾẄBǺȚ, PǾẄŘŲ ŇĚŘ, BǾŇĐŲPĐǺȚ ĚŘ\nǺțțǻčķ věčțǿ řș: İň įțș ŀǻțěșț čǻmpǻįģň, ǺPȚ 34 ŀěvěřǻģěđ țħě řěčěňț Mįč řǿșǿfț Ǿffįčě v ųŀňěřǻbįŀįțỳ ČV Ě-\n2017-11882  țǿ đěpŀǿỳ PǾẄŘŲ ŇĚŘ ǻňđ BǾŇĐŲPĐǺȚ ĚŘ.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nBŀǿģ  – Ňěẅ Țǻřģěțěđ Ǻțțǻčķ įň țħě Mį đđŀě Ěǻșț\nbỳ ǺPȚ 34, ǻ Șųșpěčțěđ İřǻňįǻň Țħ řěǻț Ģřǿųp,\nŲșįňģ ČVĚ-2017-11882  Ěxpŀǿįț\nǺPȚ33\nȘųșpěčțěđ ǻțțřįbųțįǿň: İřǻň\nȚǻřģěț șěčțǿřș: Ǻěřǿșpǻčě, ěňě řģỳ\nǾvěřvįěẅ: ǺPȚ33 ħǻș țǻřģěțěđ ǿřģǻňįżǻțįǿňș, șpǻňňįňģ m ųŀțįpŀě įňđųșțřįěș, ħěǻđqųǻřțěřěđ įň țħě Ų.Ș.,\nȘǻųđį Ǻřǻbįǻ ǻň đ Șǿųțħ Ķǿřěǻ. ǺPȚ 33 ħǻș șħǿẅň pǻřțįčųŀǻř įňțěřěșț įň ǿřģǻňįżǻțįǿňș įň țħě ǻvįǻțįǿň șěčțǿř\nįňvǿŀvěđ įň bǿțħ mįŀįțǻ řỳ ǻňđ čǿmmě řčįǻŀ čǻpǻčįțįě ș, ǻș ẅěŀŀ ǻș ǿřģǻňįżǻțįǿňș įň țħě ěňě řģỳ șěčțǿř ẅįțħ țįěș\nțǿ pěțřǿčħěmįčǻŀ p řǿđųčțįǿň.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ȘĦǺPĚȘĦİFȚ, ĐŘǾPȘ ĦǾȚ, ȚŲŘ ŇĚĐŲP, ŇǺŇǾČǾŘĚ, ŇĚȚẄİŘĚ, ǺĿFǺ Șħěŀŀ\nǺțțǻčķ věčțǿ řș: ǺPȚ33 șěňț șpěǻř-pħįșħįňģ ěmǻįŀ ș țǿ ěmpŀǿỳěě ș ẅħǿșě jǿbș řěŀǻțěđ țǿ țħě ǻvįǻțįǿň\nįňđųșțřỳ. Țħěșě ěmǻįŀș įňčŀųđěđ řěčřųįțměňț țħěmě đ ŀųřěș ǻňđ čǿňțǻįňě đ ŀįňķș țǿ mǻŀįčįǿ ųș ĦȚMĿ\nǻppŀįčǻțįǿň (.ħțǻ) fįŀě ș. Țħě .ħțǻ fįŀě ș čǿňțǻįňě đ jǿb đěșčřįpțįǿňș ǻňđ ŀįňķș țǿ ŀěģįțįmǻțě jǿb pǿ șțįňģș ǿň\npǿpųŀǻř ěmpŀǿỳměňț ẅěbșįțěș țħǻț ẅǿųŀđ bě řěŀěvǻňț țǿ țħě țǻ řģěțěđ įňđįvįđųǻŀș.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nBŀǿģ  – ǺPȚ33 Țǻřģěțș Ǻěřǿșpǻčě ǻň đ Ěňěřģỳ\nȘěčțǿřș ǻňđ ħǻș Țįěș țǿ Đěșțřųčțįvě Mǻŀ ẅǻřě\nẄěbįňǻ ř – İňșįģħțș įňțǿ İřǻňįǻň Čỳbě ř Ěșpįǿňǻģě\nĢřǿųp\nSUSPECTED ATTRIBUTION: CHINA\nǺPȚ41\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ\nȚǻřģěț șěčțǿřș: ǺPȚ41 ħǻș đįřěčțŀỳ țǻ řģěțěđ ǿřģǻňįżǻțįǿňș įň ǻț ŀěǻ șț 14 čǿųňțřįěș đǻțįňģ bǻčķ țǿ ǻ ș ěǻřŀỳ\nǻș 2012 . Țħě ģřǿųp’ș ěșpįǿňǻģě čǻmpǻįģň ș ħǻvě țǻ řģěțěđ ħěǻŀțħčǻ řě, țěŀěčǿm ș, ǻňđ țħě ħįģħ-țěčħ șěčțǿř,\nǻňđ ħǻvě ħį șțǿřįčǻŀŀỳ įňčŀ ųđěđ șțěǻŀįňģ įňțěŀŀěčț ųǻŀ přǿpěřțỳ. Țħěį ř čỳběř čřįmě įňțřųșįǿňș ǻřě mǿșț\nǻppǻřěňț ǻmǿňģ vį đěǿ ģǻmě įň đųșțřỳ țǻřģěțįňģ, įňčŀ ųđįňģ țħě mǻňįp ųŀǻțįǿň ǿf vį řțųǻŀ čųřřěňčįěș, ǻňđ\nǻțțěmpțě đ đěpŀǿỳměňț ǿf řǻňșǿmẅǻřě. ǺPȚ4 1ǿpěřǻțįǿňș ǻģǻįňșț ħįģħěř ěđųčǻțįǿň, ț řǻvěŀ șěřvįčěș, ǻňđ\nňěẅș/měđįǻ fįřmș přǿvįđě șǿmě įňđįčǻțįǿň țħǻț țħě ģ řǿųp ǻŀșǿ țřǻčķș įňđįvįđųǻŀș ǻňđ čǿňđųčțș\nșųřvěįŀŀǻňčě.\nǾvěřvįěẅ: ǺPȚ41 įș ǻ přǿŀįfįč čỳbě ř țħřěǻț ģřǿųp țħǻț čǻ řřįěș ǿųț Čħįňěșě șțǻțě-șpǿňșǿřěđ ěșpįǿňǻģě\nǻčțįvįțỳ įň ǻ đđįțįǿň țǿ fįňǻňčįǻŀŀỳ mǿțįvǻțě đ ǻčțįvįțỳ pǿțěňțįǻŀŀỳ ǿ ųțșįđě ǿf șțǻțě čǿňț řǿŀ.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ǺPȚ41 ħǻș běěň ǿb șěřvěđ ųșįňģ ǻț ŀěǻ șț 46 đįffěřěňț čǿđě fǻmįŀįě ș ǻňđ țǿǿŀș.\nǺțțǻčķ věčțǿ řș: ǺPȚ41 ǿfțěň řěŀįěș ǿň șpěǻř-pħįșħįňģ ěmǻįŀ ș ẅįțħ ǻțțǻčħměňț ș șųčħ ǻș čǿmpįŀě đ ĦȚMĿ\n(.čħm) fįŀě ș țǿ įňįțįǻŀŀỳ čǿmp řǿmįșě țħěįř vįčțįmș. Ǿňčě įň ǻ vįčțįm ǿ řģǻňįżǻțįǿň, ǺPȚ4 1 čǻň ŀěvě řǻģě mǿ řě\nșǿpħįșțįčǻțěđ ȚȚPș ǻňđ đěpŀǿỳ ǻ đđįțįǿňǻŀ mǻŀ ẅǻřě. Fǿř ěxǻmpŀě, įň ǻ čǻmpǻįģň řųňňįňģ ǻŀmǿ șț ǻ ỳěǻř,\nǺPȚ41 čǿmpřǿmįșěđ ħųňđřěđș ǿf șỳșțěmș ǻňđ ųșěđ čŀǿșě țǿ 150 ųňįqųě pįěčě ș ǿf mǻŀẅǻřě įňčŀųđįňģ\nbǻčķđǿǿřș, čřěđěňțįǻŀ șțěǻŀěřș, ķěỳŀǿģģě řș, ǻňđ řǿǿțķįțș. ǺPȚ41 ħǻș ǻŀșǿ đěpŀǿỳěđ řǿǿțķįțș ǻňđ Mǻșțěř\nBǿǿț Řěčǿ řđ (MBŘ) bǿǿțķįț ș ǿň ǻ ŀįmįțě đ bǻșįș țǿ ħįđě țħěįř mǻŀẅǻřě ǻňđ mǻįňțǻįň pě řșįșțěňčě ǿň șěŀěčț\nvįčțįm șỳșțěmș.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nŘěpǿřț – ǺPȚ4 1: Ǻ Đųǻŀ Ěșpįǿňǻģě ǻň đ Čỳběř\nČřįmě Ǿpě řǻțįǿň\n Bŀǿģ  – ǺPȚ4 1, Ǻ Đųǻŀ Ěșpįǿňǻģě ǻň đ Čỳběř\nČřįmě Țħřěǻț\nẄěbįňǻ ř – Đǿųbŀě Đřǻģǿň: ǺPȚ4 1, ǻ Đųǻŀ\nĚșpįǿňǻģě ǻň đ Čỳběř Čřįmě Ǿpě řǻțįǿň\nǺPȚ40\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ\nȚǻřģěț șěčțǿřș: ǺPȚ40 įș ǻ Čħįňě șě čỳběř ěșpįǿňǻģě ģ řǿųp țħǻț țỳpįčǻŀŀỳ țǻ řģěțș čǿųňțřįěș șțřǻțěģįčǻŀŀỳ\nįmpǿřțǻňț țǿ țħě Běŀț ǻň đ Řǿǻđ İňįțįǻțįvě. Ǻŀțħǿ ųģħ țħě ģ řǿųp țǻřģěțș ģŀǿbǻŀ ǿ řģǻňįżǻțįǿňș — ěșpěčįǻŀŀỳ\nțħǿșě ẅįțħ ǻ fǿč ųș ǿň ěňģįňěě řįňģ ǻňđ đěfěňșě — įț ǻŀ șǿ ħįșțǿřįčǻŀŀỳ čǿň đųčțěđ čǻmpǻįģň ș ǻģǻįňșț řěģįǿňǻŀ\něňțįțįěș įň ǻřěǻș șųčħ ǻș Șǿųțħěǻșț Ǻșįǻ. Șįňčě ǻț ŀěǻ șț Jǻňųǻřỳ 2013 , țħě ģřǿųp ħǻș čǿňđųčțěđ čǻmpǻįģň ș\nǻģǻįňșț ǻ řǻňģě ǿf vě řțįčǻŀș įňčŀųđįňģ mǻřįțįmě țǻ řģěțș, đěfěňșě, ǻvįǻțįǿň, čħěmįčǻŀ ș, řěșěǻřčħ/ěđųčǻțįǿň,\nģǿvěřňměňț, ǻň đ țěčħňǿŀǿģỳ ǿ řģǻňįżǻțįǿňș.\nǾvěřvįěẅ: FįřěĚỳě İňțěŀŀįģěňčě běŀįěvě ș țħǻț ǺPȚ4 0'ș ǿpěřǻțįǿňș ǻřě ǻ čỳbě ř čǿųňțěřpǻřț țǿ Čħįňǻ' ș\něffǿřțș țǿ mǿđěřňįżě įțș ňǻvǻŀ čǻpǻbįŀįțįě ș; țħįș įș ǻŀșǿ mǻňįfě șțěđ įň țǻřģěțįňģ ẅįđě-șčǻŀě řěșěǻřčħ přǿjěčțș\nǻț ųňįvěřșįțįěș ǻňđ ǿbțǻįňįňģ đěșįģňș fǿř mǻřįňě ěqųįpměňț ǻň đ věħįčŀě ș. Țħě ģřǿųp'ș ǿpěřǻțįǿňș țěňđ țǿ\nțǻřģěț ģǿvě řňměňț- șpǿňșǿřěđ přǿjěčțș ǻňđ țǻķě ŀǻ řģě ǻmǿ ųňțș ǿf įňfǿřmǻțįǿň șpěčįfįč țǿ șųčħ přǿjěčțș,\nįňčŀųđįňģ přǿpǿșǻŀș, měěțįňģ ș, fįňǻňčįǻŀ đǻțǻ, șħįppįňģ įňfǿ řmǻțįǿň, pŀǻň ș ǻňđ đřǻẅįňģș, ǻňđ řǻẅ đǻțǻ.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ǺPȚ40 ħǻș běěň ǿb șěřvěđ ųșįňģ ǻț ŀěǻ șț 51 đįffěřěňț čǿđě fǻmįŀįě ș. Ǿf țħě șě, 37 ǻřě\nňǿň-pųbŀįč. Ǻț ŀěǻ șț șěvěň ǿf țħě șě ňǿň-p ųbŀįč țǿǿŀ ș (BǺĐȘ İĢŇ, FİĚĿĐĢǾǺĿ, F İŇĐĿǾČĶ, P ĦǾȚǾ,\nȘČǺŇBǾX, ȘǾĢŲ, ǻň đ ẄİĐĚȚǾŇĚ) ǻřě șħǻřěđ ẅįțħ ǿțħě ř șųșpěčțěđ Čħįňǻ-ňěx ųș ǿpěřǻțǿřș.\nǺțțǻčķ věčțǿ řș: ǺPȚ40 țỳpįčǻŀŀỳ pǿ șěș ǻș ǻ přǿmįňěňț įň đįvįđųǻŀ ẅħǿ įș přǿbǻbŀỳ ǿf įňțě řěșț țǿ ǻ țǻ řģěț țǿ\nșěňđ șpěǻř-pħįșħįňģ ěmǻįŀ ș. Țħįș įňčŀųđěș přěțěňđįňģ țǿ bě ǻ jǿ ųřňǻŀįșț, ǻň įňđįvįđųǻŀ fřǿm ǻ țřǻđě\npųbŀįčǻțįǿň, ǿ ř șǿměǿňě f řǿm ǻ řěŀěvǻňț mįŀįțǻ řỳ ǿřģǻňįżǻțįǿň ǿř ňǿň-ģǿvě řňměňțǻŀ ǿ řģǻňįżǻțįǿň (ŇĢǾ).\nİň șǿmě įňșțǻňčěș, țħě ģřǿųp ħǻș ŀěvěřǻģěđ přěvįǿųșŀỳ čǿmp řǿmįșěđ ěmǻįŀ ǻ đđřěșșěș țǿ șěňđ șpěǻř-\npħįșħįňģ ěmǻįŀ ș.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nBŀǿģ  – ǺPȚ4 0: Ěxǻmįňįňģ ǻ Čħįňǻ- Ňěxųș\nĚșpįǿňǻģě Ǻčțǿ ř\nǺPȚ30\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ\nȚǻřģěț șěčțǿřș: Měmbě řș ǿf țħě Ǻ șșǿčįǻțįǿň ǿf Șǿ ųțħěǻșț Ǻșįǻň Ňǻțįǿňș (ǺȘĚǺŇ)\nǾvěřvįěẅ: ǺPȚ30 įș ňǿțěđ ňǿț ǿňŀỳ fǿ ř șųșțǻįňěđ ǻčțįvįțỳ ǿvě ř ǻ ŀǿňģ pě řįǿđ ǿf țįmě b ųț ǻŀșǿ fǿř\nșųččěșșfųŀŀỳ mǿđįfỳįňģ ǻň đ ǻđǻpțįňģ șǿųřčě čǿđě țǿ mǻįňțǻįň țħě șǻmě țǿǿŀ ș, țǻčțįčș ǻňđ įňfřǻșțřųčțųřě\nșįňčě ǻț ŀěǻ șț 2005 . Ěvįđěňčě șħǿẅș țħǻț țħě ģ řǿųp přįǿřįțįżěș țǻřģěțș, mǿșț ŀįķěŀỳ ẅǿřķș įň șħįfțș įň ǻ\nčǿŀŀǻbǿ řǻțįvě ěňvį řǿňměňț ǻň đ bųįŀđș mǻŀẅǻřě fřǿm ǻ čǿħě řěňț đěvěŀǿpměňț pŀǻň. Țħě ģ řǿųp ħǻș ħǻđ țħě\nčǻpǻbįŀįțỳ țǿ įňfěčț ǻį ř-ģǻppě đ ňěțẅǿřķș șįňčě 2005 .\nǺșșǿčįǻțěđ mǻŀẅǻřě: ȘĦİPȘĦǺPĚ, ȘPǺČĚȘĦİP, FĿǺȘ ĦFĿǾǾĐ\nǺțțǻčķ věčțǿ řș: ǺPȚ30 ųșěș ǻ șųįțě ǿf țǿǿŀ ș țħǻț įňčŀ ųđěș đǿẅňŀǿǻđěřș, bǻčķđǿǿřș, ǻ čěňț řǻŀ čǿňțřǿŀŀěř\nǻňđ șěvěřǻŀ čǿmpǿňěňț ș đěșįģňěđ țǿ įňfěčț řěmǿvǻbŀě đřįvěș ǻňđ čřǿșș ǻįř-ģǻppě đ ňěțẅǿřķș țǿ șțěǻŀ\nđǻțǻ. ǺPȚ 30 fřěqųěňțŀỳ řěģįșțěřș įțș ǿẅň ĐŇȘ đǿmǻįňș fǿř mǻŀẅǻřě ČňČ ǻčțįvįțįě ș.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nŘěpǿřț – ǺPȚ30 ǻňđ țħě Měčħǻňįč ș ǿf ǻ Ŀǿňģ-\nŘųňňįňģ Čỳbě ř Ěșpįǿňǻģě Ǿpě řǻțįǿň: Ħǿẅ ǻ\nČỳběř Țħřěǻț Ģřǿųp Ěxpŀǿįțěđ Ģǿvěřměňțș ǻňđ\nČǿmmě řčįǻŀ Ěňțįțįěș ǻčřǿșș Șǿųțħěǻșț Ǻșįǻ ǻňđ\nİňđįǻ fǿř ǿvěř ǻ Đěčǻ đě\nBŀǿģ  – ǺPȚ30 ǻňđ Ŀěșșǿňș fǿř ǺȘĚǺŇ\nǺPȚ19\nǺŀșǿ ķňǿẅň ǻș: Čǿđǿșǿ Țěǻm\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ\nȚǻřģěț șěčțǿřș: Ŀěģǻŀ ǻň đ įňvěșțměňț\nǾvěřvįěẅ: Ǻ ģřǿųp ŀįķěŀỳ čǿmpǿ șěđ ǿf fřěěŀǻňčě řș, ẅįțħ șǿmě đěģřěě ǿf șpǿňșǿřșħįp bỳ țħě Čħįňě șě\nģǿvěřňměňț.\nǺșșǿčįǻțěđ mǻŀẅǻřě: BĚǺČǾŇ, ČǾBǺĿȚȘȚŘ İĶĚ\nǺțțǻčķ věčțǿ řș: İň 2017, ǺPȚ19 ųșěđ țħřěě đįffěřěňț țěčħňįq ųěș țǿ ǻțțěmpț țǿ čǿmp řǿmįșě țǻřģěțș. İň ěǻřŀỳ\nMǻỳ, țħě pħį șħįňģ ŀųřěș ŀěvěřǻģěđ ŘȚF ǻțțǻčħměňț ș țħǻț ěxpŀǿįțě đ țħě Mįč řǿșǿfț Ẅįň đǿẅș vųŀňěřǻbįŀįțỳ\nđěșčřįběđ įň ČVĚ 2017-0199 . Țǿẅǻřđ țħě ěňđ ǿf Mǻỳ, ǺPȚ 19 șẅįțčħěđ țǿ ųșįňģ mǻč řǿ-ěňǻbŀě đ Mįčřǿșǿfț\nĚxčěŀ (XĿȘM) đǿčųměňțș. İň țħě mǿ șț řěčěňț vě řșįǿňș, ǺPȚ19 ǻđđěđ ǻň ǻppŀįčǻțįǿň ẅħįțěŀįșțįňģ bỳpǻ șș țǿ\nțħě XĿȘM đǿčųměňțș. Ǻț ŀěǻ șț ǿňě ǿb șěřvěđ pħįșħįňģ ŀųřě đěŀįvěřěđ ǻ Čǿbǻŀț Șț řįķě pǻỳŀǿǻ đ.\nBǻčķ țǿ țǿp ▵\n ǺPȚ18\nǺŀșǿ ķňǿẅň ǻș: Ẅěķbỳ\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ\nȚǻřģěț șěčțǿřș: Ǻěřǿșpǻčě ǻň đ Đěfěňșě, Čǿňșțřųčțįǿň ǻň đ Ěňģįňěěřįňģ, Ěđųčǻțįǿň, Ħěǻŀțħ ǻň đ\nBįǿțěčħňǿŀǿģỳ, Ħįģħ Țěčħ, Țěŀěčǿmm ųňįčǻțįǿň ș, Țřǻňșpǿřțǻțįǿň\nǾvěřvįěẅ: Věřỳ ŀįțțŀě ħǻ ș běěň řěŀěǻșěđ pųbŀįčŀỳ ǻbǿ ųț țħįș ģřǿųp.\nǺșșǿčįǻțěđ mǻŀẅǻřě: Ģħ0șț ŘǺȚ\nǺțțǻčķ věčțǿ řș: Fřěqųěňțŀỳ đěvěŀǿpě đ ǿř ǻđǻpțěđ żěřǿ-đǻỳ ěxpŀǿįț ș fǿř ǿpěřǻțįǿňș, ẅħįčħ ẅěřě ŀįķěŀỳ\npŀǻňňěđ įň ǻđvǻňčě. Ų șěđ đǻțǻ fřǿm Ħǻčķįňģ Țěǻm ŀěǻķ, ẅħįčħ đěmǿňșțřǻțěđ ħǿẅ țħě ģřǿųp čǻň șħįfț\nřěșǿųřčěș (į.ě. șěŀěčțįňģ țǻ řģěțș, přěpǻřįňģ įňfřǻșțřųčțųřě, čřǻfțįňģ mě șșǻģěș, ųpđǻțįňģ țǿǿŀ ș) țǿ țǻķě\nǻđvǻňțǻģě ǿf ųňěxpěčțě đ ǿppǿřțųňįțįěș ŀįķě ňěẅŀỳ ěxpǿ șěđ ěxpŀǿįț ș.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nBŀǿģ  – Đěmǿň șțřǻțįňģ Ħųșțŀě, Čħįňě șě ǺPȚ\nĢřǿųpș Qųįčķŀỳ Ųșě Żěřǿ-Đǻỳ V ųŀňěřǻbįŀįțỳ (ČV Ě-\n2015 -5119) Fǿŀŀǿẅįňģ Ħǻčķįňģ Țěǻm Ŀěǻķ\nẄěbįňǻ ř – Șțǻțě ǿf țħě Ħǻčķ: Șpǿțŀįģħț ǿň\nĦěǻŀțħčǻ řě\nǺPȚ17\nǺŀșǿ ķňǿẅň ǻș: Țǻįŀģǻțǿ ř Țěǻm, Đěp ųțỳ Đǿģ\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ\nȚǻřģěț șěčțǿřș: Ų.Ș. ģǿvě řňměňț, ǻň đ įňțěřňǻțįǿňǻŀ ŀǻ ẅ fįřmș ǻňđ įňfǿřmǻțįǿň țěčħňǿŀǿģỳ čǿmpǻňįě ș\nǾvěřvįěẅ: Čǿňđųčțș ňěțẅǿřķ įňțřųșįǿň ǻģǻįň șț țǻřģěțěđ ǿřģǻňįżǻțįǿňș.\nǺșșǿčįǻțěđ mǻŀẅǻřě: BĿǺČĶČǾFF ĚĚ\nǺțțǻčķ věčțǿ řș: Țħě țħřěǻț ģřǿųp țǿǿķ ǻ đvǻňțǻģě ǿf țħě ǻbįŀįțỳ țǿ č řěǻțě přǿfįŀěș ǻňđ pǿșț įň fǿřųmș țǿ\němběđ ěňčǿđěđ ČňČ fǿ ř ųșě ẅįțħ ǻ vǻ řįǻňț ǿf țħě mǻŀ ẅǻřě įț ųșěđ. Țħįș țěčħňįq ųě čǻň mǻķě įț đįffįčųŀț fǿř\nňěțẅǿřķ șěčųřįțỳ přǿfěșșįǿňǻŀș țǿ đěțěřmįňě țħě ț řųě ŀǿčǻțįǿň ǿf țħě ČňČ, ǻň đ ǻŀŀǿẅ țħě ČňČ įňf řǻșțřųčțųřě\nțǿ řěmǻįň ǻčțįvě fǿ ř ǻ ŀǿňģě ř pěřįǿđ.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nŘěpǿřț – Ħįđįňģ įň Pŀǻįň Șįģħț: Fį řěĚỳě ǻňđ\nMįčřǿșǿfț Ěxpǿșě Ǿbfųșčǻțįǿň Țǻčțįč\nǺPȚ16\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ\nȚǻřģěț șěčțǿřș: Jǻpǻňě șě ǻňđ Țǻįẅǻňěșě ǿřģǻňįżǻțįǿňș įň țħě ħįģħ-țěčħ, ģǿvě řňměňț șěřvįčěș, měđįǻ ǻňđ\nfįňǻňčįǻŀ șěřvįčěș įňđųșțřįěș\nǾvěřvįěẅ: Čħįňǻ-bǻ șěđ ģřǿųp čǿňčě řňěđ ẅįțħ Țǻįẅǻň pǿŀįțįčǻŀ ǻň đ jǿųřňǻŀįșțįč mǻțțě řș.\nǺșșǿčįǻțěđ mǻŀẅǻřě: İŘǾŇĦǺĿǾ, ĚĿMĚŘ\nǺțțǻčķ věčțǿ řș: Șpěǻřpħįșħįňģ ěmǻįŀ ș șěňț țǿ Țǻį ẅǻňěșě měđįǻ ǿřģǻňįżǻțįǿňș ǻňđ ẅěbmǻįŀ ǻ đđřěșșěș. Ŀųřě\nđǿčųměňțș čǿňțǻįňě đ įňșțřųčțįǿňș fǿř řěģįșțřǻțįǿň ǻň đ șųbșěqųěňț ŀįșțįňģ ǿf ģǿǿ đș ǿň ǻ Țǻį ẅǻňěșě ǻųčțįǿň\nẅěbșįțě.\nBǻčķ țǿ țǿp ▵\n ǺPȚ12\nǺŀșǿ ķňǿẅň ǻș: Čǻŀč Țěǻm\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ\nȚǻřģěț șěčțǿřș: Jǿųřňǻŀįșțș, ģǿvěřňměňț, đěfěňșě įňđųșțřįǻŀ bǻșě\nǾvěřvįěẅ: ǺPȚ12 įș běŀįěvě đ țǿ bě ǻ čỳbě ř ěșpįǿňǻģě ģ řǿųp țħǿųģħț țǿ ħǻvě ŀįňķ ș țǿ țħě Čħįňě șě Pěǿpŀě' ș\nĿįběřǻțįǿň Ǻ řmỳ. ǺPȚ 12'ș țǻřģěțș ǻřě čǿňșįșțěňț ẅįțħ ŀǻřģěř Pěǿpŀě' ș Řěpųbŀįč ǿf Čħįňǻ (PŘČ) ģǿǻŀ ș.\nİňțřųșįǿňș ǻňđ čǻmpǻįģň ș čǿňđųčțěđ bỳ țħįș ģřǿųp ǻřě įň-ŀįňě ẅįțħ PŘČ ģǿǻŀ ș ǻňđ șěŀf-įňțěřěșț įň Țǻįẅǻň.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ŘİPȚİĐĚ, ĦİĢĦȚİĐĚ, ȚĦŘĚBỲȚĚ, ẄǺȚĚŘȘPǾŲȚ\nǺțțǻčķ věčțǿ řș: FįřěĚỳě ǿbșěřvěđ ǺPȚ12 đěŀįvěř țħěșě ěxpŀǿįț đǿčųměňțș vįǻ pħį șħįňģ ěmǻįŀ ș fřǿm vǻŀį đ\nbųț čǿmp řǿmįșěđ ǻččǿųňțș. Bǻșěđ ǿň pǻșț ǺPȚ12 ǻčțįvįțỳ, ẅě ěxpěčț țħě țħ řěǻț ģřǿųp țǿ čǿňțįň ųě țǿ\nųțįŀįżě pħįșħįňģ ǻș ǻ mǻŀẅǻřě đěŀįvěřỳ měțħǿ đ.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nŘěpǿřț – M-Țřěňđș 2014: Běỳǿň đ țħě Břěǻčħ\nBŀǿģ  – Đǻřẅįň’ș Fǻvǿřįțě ǺPȚ Ģ řǿųp\nǺPȚ10\nǺŀșǿ ķňǿẅň ǻș: Měňųpǻșș Țěǻm\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ\nȚǻřģěț șěčțǿřș: Čǿňșțřųčțįǿň ǻň đ ěňģįňěě řįňģ, ǻěřǿșpǻčě, ǻň đ țěŀěčǿm fį řmș, ǻňđ ģǿvěřňměňțș įň țħě\nŲňįțěđ Șțǻțěș, Ěųřǿpě, ǻň đ Jǻpǻň\nǾvěřvįěẅ: ǺPȚ10 įș ǻ Čħįňě șě čỳběř ěșpįǿňǻģě ģ řǿųp țħǻț Fį řěĚỳě ħǻș țřǻčķěđ șįňčě 2009 . Țħěỳ ħǻvě\nħįșțǿřįčǻŀŀỳ țǻ řģěțěđ čǿňșțřųčțįǿň ǻň đ ěňģįňěě řįňģ, ǻěřǿșpǻčě, ǻň đ țěŀěčǿm fį řmș, ǻňđ ģǿvěřňměňțș įň țħě\nŲňįțěđ Șțǻțěș, Ěųřǿpě, ǻň đ Jǻpǻň. Ẅě běŀįěvě țħǻț țħě țǻ řģěțįňģ ǿf țħě șě įňđųșțřįěș ħǻș běěň įň șųppǿřț\nǿf Čħįňě șě ňǻțįǿňǻŀ șěčųřįțỳ ģǿǻŀ ș, įňčŀųđįňģ ǻčq ųįřįňģ vǻŀųǻbŀě mįŀįțǻ řỳ ǻňđ įňțěŀŀįģěňčě įňfǿ řmǻțįǿň ǻ ș ẅěŀŀ\nǻș țħě țħěfț ǿf čǿňfį đěňțįǻŀ b ųșįňěșș đǻțǻ țǿ șųppǿřț Čħįňěșě čǿřpǿřǻțįǿňș.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ĦǺỲMǺĶ ĚŘ, ȘŇŲĢŘİĐĚ, BŲĢJŲ İČĚ, QŲǺȘǺŘŘǺȚ\nǺțțǻčķ věčțǿ řș: Țħįș řěčěňț ǺPȚ 10 ǻčțįvįțỳ ħǻ ș įňčŀųđěđ bǿțħ țřǻđįțįǿňǻŀ șpěǻř pħįșħįňģ ǻň đ ǻččěșș țǿ\nvįčțįm’ș ňěțẅǿřķș țħřǿųģħ mǻňǻģě đ șěřvįčě přǿvįđěřș. (Fǿř mǿřě įňfǿřmǻțįǿň ǿň įňfěčțįǿň vįǻ șěřvįčě\npřǿvįđěřș șěě M-Țřěňđș 2016 ). ǺPȚ10 șpěǻř pħįșħěș ħǻvě běěň řěŀǻțįvěŀỳ ųňșǿpħįșțįčǻțěđ, ŀěvěřǻģįňģ .ŀňķ\nfįŀěș ẅįțħįň ǻřčħįvěș, fįŀěș ẅįțħ đǿųbŀě ěxțěň șįǿňș (ě.ģ.\n[Řěđǻčțěđ]_Ģřǿųp_Měěțįňģ_Đǿč ųměňț_20170222 _đǿč_.ěxě) ǻň đ įň șǿmě čǻ șěș șįmpŀỳ įđěňțįčǻŀŀỳ ňǻmě đ\nđěčǿỳ đǿčųměňțș ǻňđ mǻŀįčįǿ ųș ŀǻųňčħěřș ẅįțħįň țħě șǻmě ǻřčħįvě. İň ǻđđįțįǿň țǿ țħě șpěǻř pħįșħěș,\nFįřěĚỳě Țħřěǻț İňțěŀŀįģěňčě ħǻ ș ǿbșěřvěđ ǺPȚ10 ǻččěșșįňģ vįčțįm ș țħřǿųģħ ģŀǿbǻŀ șěřvįčě přǿvįđěřș.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nBŀǿģ  – ǺPȚ10 Țǻřģěțįňģ Jǻpǻňě șě Čǿřpǿřǻțįǿňș\nŲșįňģ Ųpđǻțěđ ȚȚPș\nBŀǿģ  – ǺPȚ10 (MěňųPǻșș Ģřǿųp): Ňěẅ Țǿǿŀș,\nĢŀǿbǻŀ Čǻmpǻįģň Ŀǻțě șț Mǻňįfě șțǻțįǿň ǿf\nĿǿňģșțǻňđįňģ Țħřěǻț\nǺPȚ3\nǺŀșǿ ķňǿẅň ǻș: ŲPȘ Țěǻm\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ\nȚǻřģěț șěčțǿřș: Ǻěřǿșpǻčě ǻň đ Đěfěňșě, Čǿňșțřųčțįǿň ǻň đ Ěňģįňěěřįňģ, Ħįģħ Țěčħ, Țěŀěčǿmm ųňįčǻțįǿň ș,\nȚřǻňșpǿřțǻțįǿň\nǾvěřvįěẅ: Țħě Čħįňǻ-bǻ șěđ țħřěǻț ģřǿųp FįřěĚỳě țřǻčķș ǻș ǺPȚ3 įș ǿňě ǿf țħě mǿ řě șǿpħįșțįčǻțěđ țħřěǻț\nģřǿųpș țħǻț Fį řěĚỳě Țħřěǻț İňțěŀŀįģěňčě ț řǻčķș, ǻňđ țħěỳ ħǻvě ǻ ħį șțǿřỳ ǿf ųșįňģ břǿẅșěř-bǻșěđ ěxpŀǿįț ș ǻș\nżěřǿ-đǻỳș (ě.ģ., İňțěřňěț Ěxpŀǿřěř, Fįřěfǿx, ǻň đ Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř). Ǻfțěř șųččěșșfųŀŀỳ ěxpŀǿįțįňģ ǻ țǻ řģěț\nħǿșț, țħįș ģřǿųp ẅįŀŀ qųįčķŀỳ đųmp čřěđěňțįǻŀș, mǿvě ŀǻțě řǻŀŀỳ țǿ ǻ đđįțįǿňǻŀ ħǿ șțș, ǻňđ įňșțǻŀŀ čųșțǿm\nbǻčķđǿǿřș. ǺPȚ3’ș čǿmmǻň đ ǻňđ čǿňțřǿŀ (ČňČ) įňf řǻșțřųčțųřě įș đįffįčųŀț țǿ țřǻčķ, ǻș țħěřě įș ŀįțțŀě ǿvě řŀǻp\nǻčřǿșș čǻmpǻįģň ș.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ȘĦǾȚPŲȚ, ČǾǾĶ İĚČŲȚȚĚŘ, ȘǾĢŲ\nǺțțǻčķ věčțǿ řș: Țħě pħį șħįňģ ěmǻįŀ ș ųșěđ bỳ ǺPȚ 3 ǻřě ųșųǻŀŀỳ ģěňě řįč įň ňǻț ųřě, ǻŀmǿ șț ǻppěǻ řįňģ țǿ bě\nșpǻm. Ǻțțǻčķ ș ħǻvě ěxpŀǿįțě đ ǻň ųňpǻțčħě đ vųŀňěřǻbįŀįțỳ įň țħě ẅǻỳ Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř pǻřșěș Fŀǻșħ\nVįđěǿ (FĿV) fįŀě ș. Țħě ěxpŀǿįț ųșěș čǿmmǿň věčțǿ ř čǿřřųpțįǿň țěčħňįq ųěș țǿ bỳpǻ șș Ǻđđřěșș Șpǻčě\nĿǻỳǿųț Řǻňđǿmįżǻțįǿň (ǺȘĿŘ), ǻň đ ųșěș Řěțųřň-Ǿřįěňțěđ Přǿģřǻmmįňģ (ŘǾP) țǿ bỳpǻ șș Đǻțǻ Ěxěčųțįǿň\nPřěvěňțįǿň (Đ ĚP). Ǻ ňěǻț ț řįčķ țǿ țħěį ř ŘǾP țěčħňįq ųě mǻķě ș įț șįmpŀěř țǿ ěxpŀǿįț ǻň đ ẅįŀŀ ěvǻđě șǿmě\nŘǾP đěțěčțįǿň țěčħňįq ųěș. Șħěŀŀčǿ đě įș șțǿřěđ įň țħě pǻčķě đ Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř ěxpŀǿįț fįŀě ǻŀǿňģ șįđě ǻ\nķěỳ ųșěđ fǿř įțș đěčřỳpțįǿň. Țħě pǻỳŀǿǻ đ įș xǿř ěňčǿđěđ ǻňđ ħįđđěň įňșįđě ǻň įmǻģě.\nBǻčķ țǿ țǿp ▵\n Ǻđđįțįǿňǻŀ řěșǿųřčěș\nBŀǿģ  – Đěmǿň șțřǻțįňģ Ħųșțŀě, Čħįňě șě ǺPȚ\nĢřǿųpș Qųįčķŀỳ Ųșě Żěřǿ-Đǻỳ V ųŀňěřǻbįŀįțỳ (ČV Ě-\n2015 -5119) Fǿŀŀǿẅįňģ Ħǻčķįňģ Țěǻm Ŀěǻķ\nBŀǿģ  – Ňěẅ Żěřǿ-Đǻỳ Ěxpŀǿįț țǻ řģěțįňģ İňțěřňěț\nĚxpŀǿřěř Věřșįǿňș 9 țħřǿųģħ 11 İđěňțįfįěđ įň\nȚǻřģěțěđ Ǻțțǻčķ ș\nBŀǿģ  – Ǿpěřǻțįǿň Đǿ ųbŀě-Țǻp\nBŀǿģ  – Ǿpěřǻțįǿň Čŀǻň đěșțįňě Ẅǿŀf: Ǻ đǿbě Fŀǻ șħ\nŻěřǿ-Đǻỳ įň ǺPȚ 3 Pħįșħįňģ Čǻmpǻįģň\nǺPȚ1\nǺŀșǿ ķňǿẅň ǻș: Ųňįț 61398 , Čǿmměňț Č řěẅ\nȘųșpěčțěđ ǻțțřįbųțįǿň: Čħįňǻ’ș Pěǿpŀě’ ș Ŀįběřǻțįǿň Ǻ řmỳ (PĿǺ) Ģěňě řǻŀ Șțǻff Đěpǻ řțměňț’ș (ĢȘĐ) 3řđ\nĐěpǻřțměňț ( 总参三部二局 ), ẅħįčħ įș mǿșț čǿmmǿňŀỳ ķňǿ ẅň bỳ įțș Mįŀįțǻřỳ Ųňįț Čǿvě ř Đěșįģňǻțǿř (MŲČĐ)\nǻș Ųňįț 61398  (61398部队).\nȚǻřģěț șěčțǿřș: İňfǿřmǻțįǿň Țěčħňǿŀǿģỳ, Ǻě řǿșpǻčě, P ųbŀįč Ǻđmįňįșțřǻțįǿň, Șǻțěŀŀįțě ș ǻňđ\nȚěŀěčǿmm ųňįčǻțįǿň ș, Șčįěňțįfįč Řě șěǻřčħ ǻňđ Čǿňșųŀțįňģ, Ěňěřģỳ, Țřǻňșpǿřțǻțįǿň, Čǿň șțřųčțįǿň ǻň đ\nMǻňųfǻčțųřįňģ, Ěňģįňěěřįňģ Șěřvįčěș, Ħįģħ-țěčħ Ěŀěčțřǿňįčș, İňțěřňǻțįǿňǻŀ Ǿ řģǻňįżǻțįǿňș, Ŀěģǻŀ Șě řvįčěș\nMěđįǻ, Ǻđvěřțįșįňģ ǻňđ Ěňțěřțǻįňměňț, Ňǻvįģǻțįǿň, Čħěmįčǻŀ ș, Fįňǻňčįǻŀ Șě řvįčěș, Fǿǿđ ǻňđ Ǻģřįčųŀțųřě,\nĦěǻŀțħčǻ řě, Měțǻŀ ș ǻňđ Mįňįňģ, Ěđųčǻțįǿň\nǾvěřvįěẅ: ǺPȚ1 ħǻș șỳșțěmǻțįčǻŀŀỳ șțǿŀěň ħųňđřěđș ǿf țěřǻbỳțěș ǿf đǻțǻ fřǿm ǻț ŀěǻ șț 141 ǿřģǻňįżǻțįǿňș,\nǻňđ ħǻș đěmǿňșțřǻțěđ țħě čǻpǻbįŀįțỳ ǻň đ įňțěňț țǿ șțěǻŀ fřǿm đǿżěňș ǿf ǿřģǻňįżǻțįǿňș șįmųŀțǻňěǿųșŀỳ. Țħě\nģřǿųp fǿčųșěș ǿň čǿmp řǿmįșįňģ ǿřģǻňįżǻțįǿňș ǻčřǿșș ǻ břǿǻđ řǻňģě ǿf įň đųșțřįěș įň Ěňģŀįșħ-șpěǻķįňģ\nčǿųňțřįěș. Țħě șįżě ǿf ǺPȚ 1’ș įňfřǻșțřųčțųřě įmpŀįě ș ǻ ŀǻřģě ǿřģǻňįżǻțįǿň ẅįțħ ǻț ŀěǻ șț đǿżěňș, bųț\npǿțěňțįǻŀŀỳ ħ ųňđřěđș ǿf ħųmǻň ǿpě řǻțǿřș.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ȚŘǾJǺ Ň.ĚČĿȚỲȘ, BǺČĶĐǾǾŘ.BǺŘĶ İǾFǾŘĶ, BǺČĶĐǾǾŘ.ẄǺĶ ĚMİŇǺP,\nȚŘǾJǺ Ň.ĐǾẄŇBǾȚ, BǺČĶĐǾǾŘ.ĐǺĿBǾȚ, BǺČĶĐǾǾŘ.Ř ĚVİŘĐ, ȚŘǾJǺ Ň.BǺĐŇǺMĚ,\nBǺČĶĐǾǾŘ.ẄŲǺĿ ĚȘȘ\nǺțțǻčķ věčțǿ řș: Țħě mǿ șț čǿmmǿňŀỳ ǿb șěřvěđ měțħǿ đ ǿf įňįțįǻŀ čǿmp řǿmįșě įș șpěǻř pħįșħįňģ. Țħě șpěǻř\npħįșħįňģ ěmǻįŀ ș čǿňțǻįň ěįțħě ř ǻ mǻŀįčįǿ ųș ǻțțǻčħměňț ǿ ř ǻ ħỳpě řŀįňķ țǿ ǻ mǻŀįčįǿ ųș fįŀě. Țħě șųbjěčț ŀįňě ǻň đ\nțħě țěxț įň țħě ěmǻįŀ bǿ đỳ ǻřě ųșųǻŀŀỳ řěŀěvǻňț țǿ țħě řěčįpįěňț. ǺPȚ 1 ǻŀșǿ čřěǻțěș ẅěbmǻįŀ ǻččǿ ųňțș ųșįňģ\nřěǻŀ pěǿpŀě ș’ ňǻměș. Ẅħįŀě ǺPȚ 1 įňțřųđěřș ǿččǻșįǿňǻŀŀỳ ųșě pųbŀįčŀỳ ǻvǻįŀǻbŀě bǻčķ đǿǿřș șųčħ ǻș Pǿįșǿň İvỳ\nǻňđ Ģħ0șț ŘǺȚ, țħě vǻ șț mǻjǿřįțỳ ǿf țħě țįmě țħěỳ ųșě ẅħǻț ǻppěǻ ř țǿ bě țħěį ř ǿẅň čųșțǿm bǻčķ đǿǿřș.\nȚħřǿųģħǿųț țħěįř șțǻỳ įň țħě ňěț ẅǿřķ (ẅħįčħ čǿųŀđ bě ỳěǻ řș), ǺPȚ1 ųșųǻŀŀỳ įňșțǻŀŀș ňěẅ bǻčķđǿǿřș ǻș țħěỳ\nčŀǻįm mǿ řě șỳșțěmș įň țħě ěňvį řǿňměňț. Țħěň, įf ǿňě bǻčķ đǿǿř įș đįșčǿvěřěđ ǻňđ đěŀěțěđ, țħěỳ șțįŀŀ ħǻvě\nǿțħěř bǻčķđǿǿřș țħěỳ čǻň ųșě. Ẅě ųșųǻŀŀỳ đěțěčț m ųŀțįpŀě fǻmįŀįě ș ǿf ǺPȚ 1 bǻčķđǿǿřș șčǻțțěřěđ ǻřǿųňđ ǻ\nvįčțįm ňěț ẅǿřķ ẅħěň ǺPȚ 1 ħǻș běěň p řěșěňț fǿř mǿřě țħǻň ǻ fě ẅ ẅěěķș.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nŘěpǿřț – ǺPȚ1: Ěxpǿșįňģ Ǿňě ǿf Čħįňǻ’ ș Čỳběř\nĚșpįǿňǻģě Ųňįț ș\nŘěpǿřț – M-Țřěňđș 2014: Běỳǿň đ țħě Břěǻčħ\nSUSPECTED ATTRIBUTION: NORTH KOREA\nǺPȚ38\nȘųșpěčțěđ ǻțțřįbųțįǿň: Ňǿřțħ Ķǿřěǻ\nȚǻřģěț șěčțǿřș: Fįňǻňčįǻŀ įň șțįțųțįǿňș ẅǿřŀđ-ẅįđě\nǾvěřvįěẅ: Ǿųř ǻňǻŀỳșįș ǿf țħě Ňǿřțħ Ķǿřěǻň řěģįmě-bǻčķě đ țħřěǻț ģřǿųp ẅě ǻřě čǻŀŀįňģ ǺPȚ 38 řěvěǻŀș\nțħǻț țħěỳ ǻ řě řěșpǿňșįbŀě fǿř čǿňđųčțįňģ țħě ŀǻ řģěșț ǿbșěřvěđ čỳběř ħěįșțș. Ǻŀțħǿųģħ ǺPȚ 38 șħǻřěș\nmǻŀẅǻřě đěvěŀǿpměňț řěșǿųřčěș ǻňđ Ňǿřțħ Ķǿřěǻň șțǻțě șpǿňșǿřșħįp ẅįțħ ǻ ģřǿųp řěfěřřěđ țǿ bỳ țħě\nșěčųřįțỳ čǿmm ųňįțỳ ǻș “Ŀǻżǻřųș”, ẅě běŀįěvě țħǻț ǺPȚ 38’ș fįňǻňčįǻŀ mǿțįvǻțįǿň, ųňįqųě țǿǿŀșěț, ǻňđ țǻčțįčș,\nțěčħňįq ųěș, ǻňđ přǿčěđųřěș (ȚȚPș) ǻřě đįșțįňčț ěňǿ ųģħ fǿř țħěm țǿ bě ț řǻčķěđ șěpǻřǻțěŀỳ fřǿm ǿțħě ř\nŇǿřțħ Ķǿřěǻň čỳbě ř ǻčțįvįțỳ.\nǺșșǿčįǻțěđ mǻŀẅǻřě: Țħįș ŀǻřģě ǻňđ přǿŀįfįč ģřǿųp ųșěș ǻ vǻřįěțỳ ǿf č ųșțǿm mǻŀ ẅǻřě fǻmįŀįě ș, įňčŀųđįňģ\nbǻčķđǿǿřș, țųňňěŀěřș, đǻțǻmįňě řș, ǻňđ đěșțřųčțįvě mǻŀ ẅǻřě țǿ șțěǻŀ mįŀŀįǿň ș ǿf đǿŀŀǻřș fřǿm fįňǻňčįǻŀ\nįňșțįțųțįǿňș ǻňđ řěňđěř vįčțįm ňěț ẅǿřķș įňǿpěřǻbŀě.\nǺțțǻčķ věčțǿ řș: ǺPȚ38 ħǻș čǿňđųčțěđ ǿpěřǻțįǿňș įň ǿvěř 16 ǿřģǻňįżǻțįǿňș įň ǻț ŀěǻ șț 11 čǿųňțřįěș. Țħįș\nģřǿųp įș čǻřěfųŀ, čǻŀčųŀǻțěđ, ǻňđ ħǻș đěmǿňșțřǻțěđ ǻ đěșįřě țǿ mǻįňțǻįň ǻččě șș țǿ vįčțįm ěňvį řǿňměňț ș fǿř\nǻș ŀǿňģ ǻș ňěčěșșǻřỳ țǿ ųňđěřșțǻňđ țħě ňěț ẅǿřķ ŀǻỳǿųț, řěqųįřěđ pěřmįșșįǿňș, ǻňđ șỳșțěm țěčħňǿŀǿģįě ș țǿ\nǻčħįěvě įț ș ģǿǻŀș. ǺPȚ38 įș ųňįqųě įň țħǻț țħěỳ ǻ řě ňǿț ǻf řǻįđ țǿ ǻģģ řěșșįvěŀỳ đěșțřǿỳ ěvįđěňčě ǿř vįčțįm\nňěțẅǿřķș ǻș pǻřț ǿf țħěį ř ǿpěřǻțįǿňș.\nBǻčķ țǿ țǿp ▵\n Ǻđđįțįǿňǻŀ řěșǿųřčěș\nŘěpǿřț – ǺPȚ 38: Ųň-ųșųǻŀ Șųșpěčțș\nBŀǿģ  – ǺPȚ38: Đěțǻįŀș ǿň Ňěẅ Ňǿřțħ Ķǿřěǻň\nŘěģįmě-Bǻčķě đ Țħřěǻț Ģřǿųp\nǺPȚ37\nȘųșpěčțěđ ǻțțřįbųțįǿň: Ňǿřțħ Ķǿřěǻ\nȚǻřģěț șěčțǿřș: Přįmǻřįŀỳ Șǿųțħ Ķǿřěǻ – țħǿ ųģħ ǻŀșǿ Jǻpǻň, Vįěțňǻm ǻň đ țħě Mįđđŀě Ěǻșț – įň vǻ řįǿųș\nįňđųșțřỳ věřțįčǻŀș, įňčŀųđįňģ čħěmįčǻŀ ș, ěŀěčțřǿňįčș, mǻňųfǻčțųřįňģ, ǻěřǿșpǻčě, ǻ ųțǿmǿțįvě, ǻň đ ħěǻŀțħčǻ řě.\nǾvěřvįěẅ: Ǿųř ǻňǻŀỳșįș ǿf ǺPȚ 37’ș řěčěňț ǻčțįvįțỳ řěvěǻŀș țħǻț țħě ģ řǿųp’ș ǿpěřǻțįǿňș ǻřě ěxpǻň đįňģ įň\nșčǿpě ǻň đ șǿpħįșțįčǻțįǿň, ẅįțħ ǻ țǿǿŀ șěț țħǻț įňčŀ ųđěș ǻččěșș țǿ żěřǿ-đǻỳ vųŀňěřǻbįŀįțįěș ǻňđ ẅįpěř\nmǻŀẅǻřě. Ẅě ǻ șșěșș ẅįțħ ħįģħ čǿňfį đěňčě țħǻț țħį ș ǻčțįvįțỳ į ș čǻřřįěđ ǿųț ǿň běħǻŀf ǿf țħě Ňǿřțħ Ķǿřěǻň\nģǿvěřňměňț ģįvěň mǻŀ ẅǻřě đěvěŀǿpměňț ǻ řțįfǻčțș ǻňđ țǻřģěțįňģ țħǻț ǻŀįģň ș ẅįțħ Ňǿřțħ Ķǿřěǻň șțǻțě\nįňțěřěșțș. FįřěĚỳě Țħřěǻț İňțěŀŀįģěňčě běŀįěvě ș țħǻț ǺPȚ 37 įș ǻŀįģňěđ ẅįțħ țħě ǻčțįvįțỳ p ųbŀįčŀỳ řěpǿřțěđ ǻș\nȘčǻřčřųfț ǻňđ Ģřǿųp123.\nǺșșǿčįǻțěđ mǻŀẅǻřě: Ǻ đįvěřșě șųįțě ǿf mǻŀ ẅǻřě fǿř įňįțįǻŀ įňț řųșįǿň ǻňđ ěxfįŀțřǻțįǿň. Ǻŀǿňģ ẅįțħ čųșțǿm\nmǻŀẅǻřě ųșěđ fǿř ěșpįǿňǻģě p ųřpǿșěș, ǺPȚ37 ǻŀșǿ ħǻș ǻččěșș țǿ đěșțřųčțįvě mǻŀ ẅǻřě.\nǺțțǻčķ věčțǿ řș: Șǿčįǻŀ ěňģįňěě řįňģ țǻčțįč ș țǻįŀǿřěđ șpěčįfįčǻŀŀỳ țǿ đěșįřěđ țǻřģěțș, șțřǻțěģįč ẅěb\nčǿmpřǿmįșěș țỳpįčǻŀ ǿf țǻ řģěțěđ čỳběř ěșpįǿňǻģě ǿpě řǻțįǿňș, ǻňđ țħě ųșě ǿf țǿřřěňț fįŀě- șħǻřįňģ șįțěș țǿ\nđįșțřįbųțě mǻŀẅǻřě mǿřě įňđįșčřįmįňǻțěŀỳ. F řěqųěňț ěxpŀǿįțǻțįǿň ǿf v ųŀňěřǻbįŀįțįěș įň Ħǻňģųŀ Ẅǿřđ\nPřǿčěșșǿř (ĦẄP), ǻș ẅěŀŀ ǻș Ǻđǿbě Fŀǻ șħ. Țħě ģ řǿųp ħǻș đěmǿňșțřǻțěđ ǻččěșș țǿ żěřǿ-đǻỳ vųŀňěřǻbįŀįțįěș\n(ČVĚ-2018 -0802 ), ǻňđ țħě ǻbįŀįțỳ țǿ įňčǿ řpǿřǻțě țħěm įňțǿ ǿpě řǻțįǿňș.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nŘěpǿřț – ǺPȚ 37 (Řěǻpě ř)\nBŀǿģ  – ǺPȚ37 (Řěǻpě ř): Țħě Ǿvě řŀǿǿķěđ Ňǿřțħ\nĶǿřěǻň Ǻčțǿ ř\nSUSPECTED ATTRIBUTION: RUSSIA\nǺPȚ29\nȘųșpěčțěđ ǻțțřįbųțįǿň: Řųșșįǻň ģǿvě řňměňț\nȚǻřģěț șěčțǿřș: Ẅěșțěřň Ěųřǿpěǻň ģǿvě řňměňțș, fǿřěįģň pǿŀįčỳ ģ řǿųpș ǻňđ ǿțħěř șįmįŀǻř ǿřģǻňįżǻțįǿňș\nǾvěřvįěẅ: ǺPȚ29 įș ǻň ǻđǻpțįvě ǻň đ đįșčįpŀįňěđ țħřěǻț ģřǿųp țħǻț ħį đěș įțș ǻčțįvįțỳ ǿň ǻ vįčțįm’ ș ňěțẅǿřķ,\nčǿmmųňįčǻțįňģ įňf řěqųěňțŀỳ ǻň đ įň ǻ ẅǻỳ țħǻț čŀǿ șěŀỳ řěșěmbŀěș ŀěģįțįmǻțě ț řǻffįč. Bỳ ųșįňģ ŀěģįțįmǻțě\npǿpųŀǻř ẅěb șěřvįčěș, țħě ģřǿųp čǻň ǻŀ șǿ țǻķě ǻ đvǻňțǻģě ǿf ěňč řỳpțěđ ȘȘĿ čǿňňěčțįǿň ș, mǻķįňģ\nđěțěčțįǿň ěvěň mǿ řě đįffįčųŀț. ǺPȚ29 įș ǿňě ǿf țħě mǿ șț ěvǿŀvě đ ǻňđ čǻpǻbŀě țħ řěǻț ģřǿųpș. İț đěpŀǿỳș\nňěẅ bǻčķđǿǿřș țǿ fįx įț ș ǿẅň bųģș ǻňđ ǻđđ fěǻțųřěș. İț mǿňįțǿ řș ňěțẅǿřķ đěfěňđěř ǻčțįvįțỳ țǿ mǻįňțǻįň\nčǿňțřǿŀ ǿvěř șỳșțěmș. ǺPȚ29 ųșěș ǿňŀỳ čǿmp řǿmįșěđ șěřvěřș fǿř ČňČ čǿmm ųňįčǻțįǿň. İț čǿųňțěřș\nǻțțěmpț ș țǿ řěměđįǻțě ǻțțǻčķ ș. İț ǻŀșǿ mǻįňțǻįň ș ǻ fǻșț đěvěŀǿpměňț čỳčŀě fǿ ř įțș mǻŀẅǻřě, qųįčķŀỳ ǻŀțě řįňģ\nțǿǿŀș țǿ ħįňđěř đěțěčțįǿň.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ĦǺMMĚŘȚǾȘȘ, ȚĐ İȘČǾVĚŘ, ŲPĿǾǺĐ ĚŘ\nǺțțǻčķ věčțǿ řș: ǺPȚ29 ħǻș ųșěđ șǿčįǻŀ mě đįǻ șįțěș șųčħ ǻș Țẅįțțěř ǿř ĢįțĦųb, ǻș ẅěŀŀ ǻș čŀǿųđ șțǿřǻģě\nșěřvįčěș, țǿ řěŀǻỳ čǿmmǻň đș ǻňđ ěxțřǻčț đǻțǻ fřǿm čǿmp řǿmįșěđ ňěțẅǿřķș. Țħě ģřǿųp řěŀǻỳș čǿmmǻň đș\nvįǻ įmǻģě ș čǿňțǻįňįňģ ħį đđěň ǻňđ ěňčřỳpțěđ đǻțǻ. İňfǿřmǻțįǿň į ș ěxțřǻčțěđ fřǿm ǻ čǿmp řǿmįșěđ ňěțẅǿřķ\nǻňđ fįŀěș ǻřě ųpŀǿǻđěđ țǿ čŀǿųđ șțǿřǻģě șěřvįčěș.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nŘěpǿřț – ĦǺMMĚŘȚǾȘȘ: Șțěǻŀțħỳ Țǻčțįč ș Đěfįňě\nǻ Řųșșįǻň Čỳbě ř Țħřěǻț Ģřǿųp\nǺPȚ28\nǺŀșǿ ķňǿẅň ǻș: Țșǻř Țěǻm\nȘųșpěčțěđ ǻțțřįbųțįǿň: Řųșșįǻň ģǿvě řňměňț\nȚǻřģěț șěčțǿřș: Țħě Čǻ ųčǻșųș, pǻřțįčųŀǻřŀỳ Ģěǿřģįǻ, ěǻșțěřň Ěųřǿpěǻň čǿ ųňțřįěș ǻňđ mįŀįțǻřįěș, Ňǿřțħ\nǺțŀǻňțįč Ț řěǻțỳ Ǿřģǻňįżǻțįǿň (ŇǺȚǾ) ǻň đ ǿțħěř Ěųřǿpěǻň șěčųřįțỳ ǿřģǻňįżǻțįǿňș ǻňđ đěfěňșě fįřmș\nǾvěřvįěẅ: ǺPȚ28 įș ǻ șķįŀŀěđ țěǻm ǿf đěvěŀǿpě řș ǻňđ ǿpěřǻțǿřș čǿŀŀěčțįňģ įňțěŀŀįģěňčě ǿň đěfěňșě ǻňđ\nģěǿpǿŀįțįčǻŀ į șșųěș—įňțěŀŀįģěňčě țħǻț ẅǿųŀđ bě ųșěfųŀ ǿňŀỳ țǿ ǻ ģǿvě řňměňț. Țħį ș ǺPȚ ģřǿųp čǿmpįŀě ș\nmǻŀẅǻřě șǻmpŀěș ẅįțħ Řųșșįǻň ŀǻňģ ųǻģě șěțțįňģș đųřįňģ ẅǿřķįňģ ħǿ ųřș (8 ǻ.m. țǿ 6 p.m.), čǿň șįșțěňț ẅįțħ\nțħě țįmě żǿňě ǿf Ř ųșșįǻ’ș mǻjǿř čįțįěș, įňčŀųđįňģ Mǿșčǿẅ ǻňđ Șț. Pěțě řșbųřģ. Țħįș șųģģěșțș țħǻț ǺPȚ 28\n řěčěįvěș đįřěčț ǿňģǿįňģ fįňǻňčįǻŀ ǻň đ ǿțħěř řěșǿųřčěș fřǿm ǻ ẅěŀŀ-ěșțǻbŀįșħěđ ǿřģǻňįżǻțįǿň, mǿ șț ŀįķěŀỳ țħě\nŘųșșįǻň ģǿvě řňměňț.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ČĦǾPȘȚİČĶ, ȘǾŲŘFǺČ Ě\nǺțțǻčķ věčțǿ řș: Țǿǿŀș čǿmmǿňŀỳ ųșěđ bỳ ǺPȚ 28 įňčŀųđě țħě ȘǾŲŘFǺČ Ě đǿẅňŀǿǻđěř, įțș șěčǿňđ-șțǻģě\nbǻčķđǿǿř ĚVİĿȚǾȘȘ ǻň đ ǻ mǿđųŀǻř fǻmįŀỳ ǿf įmpŀǻňț ș đųbběđ ČĦǾPȘȚİČĶ. ǺPȚ 28 ħǻș ěmpŀǿỳě đ ŘȘǺ\něňčřỳpțįǿň țǿ p řǿțěčț fįŀě ș ǻňđ șțǿŀěň įňfǿ řmǻțįǿň mǿvě đ fřǿm țħě vįčțįm’ ș ňěțẅǿřķ țǿ țħě čǿňț řǿŀŀěř. İț\nħǻș ǻŀșǿ mǻđě įňčřěměňțǻŀ ǻň đ șỳșțěmǻțįč čħǻňģě ș țǿ țħě ȘǾŲŘFǺČ Ě đǿẅňŀǿǻđěř ǻňđ įțș șųřřǿųňđįňģ\něčǿșỳșțěm șįňčě 2007, įňđįčǻțįňģ ǻ ŀǿňģ- șțǻňđįňģ ǻňđ đěđįčǻțěđ đěvěŀǿpměňț ěffǿ řț.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nŘěpǿřț – Řųșșįǻ’ș ǺPȚ28 Șțřǻțěģįčǻŀŀỳ Ěvǿŀvěș įțș\nČỳběř Ǿpěřǻțįǿňș\nBŀǿģ  – Ǿpěřǻțįǿň Ř ųșșįǻňĐǿŀŀ: Ǻ đǿbě & Ẅįň đǿẅș\nŻěřǿ-Đǻỳ Ěxpŀǿįțș Ŀįķěŀỳ Ŀěvě řǻģěđ bỳ Řųșșįǻ’ș\nǺPȚ28 įň Ħįģħŀỳ-Țǻ řģěțěđ Ǻțțǻčķ\nBŀǿģ  – ǺPȚ28: Ǻ Ẅįň đǿẅ įňțǿ Řųșșįǻ'ș Čỳběř\nĚșpįǿňǻģě Ǿpě řǻțįǿňș?\nẄěbįňǻ ř – ǺPȚ28: Čỳběř Ěșpįǿňǻģě ǻň đ țħě\nŘųșșįǻň Ģǿvě řňměňț?\nSUSPECTED ATTRIBUTION: VIETNAM\nǺPȚ32\nǺŀșǿ ķňǿẅň ǻș: ǾčěǻňĿǿț ųș Ģřǿųp\nȘųșpěčțěđ ǻțțřįbųțįǿň: Vįěțňǻm\nȚǻřģěț șěčțǿřș: Fǿřěįģň čǿmpǻňįě ș įňvěșțįňģ įň Vįěțňǻm’ ș mǻňųfǻčțųřįňģ, čǿň șųměř přǿđųčțș, čǿňșųŀțįňģ\nǻňđ ħǿșpįțǻŀįțỳ șěčțǿřș\nǾvěřvįěẅ: Řěčěňț ǻčțįvįțỳ țǻ řģěțįňģ p řįvǻțě įňțě řěșțș įň Vįěțňǻm șųģģěșțș țħǻț ǺPȚ 32 pǿșěș ǻ țħřěǻț țǿ\nčǿmpǻňįě ș đǿįňģ bųșįňěșș, mǻňųfǻčțųřįňģ ǿř přěpǻřįňģ țǿ įňvě șț įň țħě čǿ ųňțřỳ. Ẅħįŀě țħě șpěčįfįč\nmǿțįvǻțįǿň fǿ ř țħįș ǻčțįvįțỳ řěmǻįňș ǿpǻqųě, įț čǿųŀđ ųŀțįmǻțěŀỳ ě řǿđě țħě čǿmpěțįțįvě ǻ đvǻňțǻģě ǿf\nțǻřģěțěđ ǿřģǻňįżǻțįǿňș.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ȘǾŲŇĐBİȚĚ, ẄİŇĐȘĦİĚĿĐ, PĦǾŘĚǺĿ, BĚǺČǾŇ, ĶǾMPŘǾĢǾ\nǺțțǻčķ věčțǿ řș: ǺPȚ32 ǻčțǿřș ŀěvěřǻģě ǺčțįvěMįmě fįŀě ș țħǻț ěmpŀǿỳ șǿčįǻŀ ěňģįňěě řįňģ měțħǿ đș țǿ ěňțįčě\nțħě vįčțįm įňțǿ ěňǻbŀįňģ mǻč řǿș. Ųpǿň ěxěč ųțįǿň, țħě įňįțįǻŀį żěđ fįŀě țỳpįčǻŀŀỳ đǿẅňŀǿǻđș mųŀțįpŀě mǻŀįčįǿ ųș\npǻỳŀǿǻđș fřǿm ǻ řěmǿțě șěřvěř. ǺPȚ32 ǻčțǿřș đěŀįvěřș țħě mǻŀįčįǿ ųș ǻțțǻčħměňț ș vįǻ șpěǻř pħįșħįňģ\němǻįŀș. Ěvįđěňčě ħǻ ș șħǿẅň țħǻț șǿmě mǻỳ ħǻvě běěň șěňț vįǻ Ģmǻįŀ.\nBǻčķ țǿ țǿp ▵\nǺđđįțįǿňǻŀ řěșǿųřčěș\nBŀǿģ  – Čỳbě ř Ěșpįǿňǻģě į ș Ǻŀįvě ǻň đ Ẅěŀŀ: ǺPȚ 32\nǻňđ țħě Țħřěǻț țǿ Ģŀǿbǻŀ Čǿ řpǿřǻțįǿňș\nẄěbįňǻ ř – ǺPȚ32: Ňěẅ Čỳběř Ěșpįǿňǻģě Ģ řǿųp\nSUSPECTED ATTRIBUTION: UNDISCLOSED\nǺPȚ5\nȘųșpěčțěđ ǻțțřįbųțįǿň: Ųňđįșčŀǿșěđ\nȚǻřģěț șěčțǿřș: Řěģįǿňǻŀ Țěŀěčǿmm ųňįčǻțįǿň P řǿvįđěřș, Ǻșįǻ-Bǻșěđ Ěmpŀǿỳěě ș ǿf Ģŀǿbǻŀ\nȚěŀěčǿmm ųňįčǻțįǿň ș, ǻňđ Țěčħ Fį řmș, Ħįģħ-Țěčħ Mǻň ųfǻčțųřįňģ, Mįŀįțǻ řỳ Ǻppŀįčǻțįǿň Țěčħňǿŀǿģỳ\nǾvěřvįěẅ: ǺPȚ5 ħǻș běěň ǻčțįvě șįňčě ǻț ŀěǻ șț 2007. ǺPȚ5 ħǻș țǻřģěțěđ ǿř břěǻčħěđ ǿřģǻňįżǻțįǿňș\nǻčřǿșș mųŀțįpŀě įňđųșțřįěș, bųț įțș fǿčųș ǻppěǻřș țǿ bě ǿň țěŀěčǿmm ųňįčǻțįǿň ș ǻňđ țěčħňǿŀǿģỳ čǿmpǻňįě ș,\něșpěčįǻŀŀỳ įňfǿ řmǻțįǿň ǻbǿ ųț șǻțěŀŀįțě čǿmm ųňįčǻțįǿň ș.\nǺșșǿčįǻțěđ mǻŀẅǻřě: ĿĚǾŲŇČİǺ\nǺțțǻčķ věčțǿ řș: İț ǻppěǻ řș țǿ bě ǻ ŀǻ řģě țħřěǻț ģřǿųp țħǻț čǿň șįșțș ǿf șěvěřǻŀ șųbģřǿųpș, ǿfțěň ẅįțħ\nđįșțįňčț țǻčțįč ș ǻňđ įňfřǻșțřųčțųřě. Țħě ģ řǿųp ųșěș mǻŀẅǻřě ẅįțħ ķěỳŀǿģģįňģ čǻpǻbįŀįțįě ș țǿ șpěčįfįčǻŀŀỳ\nțǻřģěț țěŀěčǿmm ųňįčǻțįǿň čǿmpǻňįě ș' čǿřpǿřǻțě ňěț ẅǿřķș, ěmpŀǿỳěě ș ǻňđ ěxěčųțįvěș.\nBǻčķ țǿ țǿp ▵\n Ǻđđįțįǿňǻŀ řěșǿųřčěș\nŘěpǿřț – Șǿųțħěǻșț Ǻșįǻ: Ǻň Ěvǿŀvįňģ Čỳbě ř\nȚħřěǻț Ŀǻň đșčǻpě\nŘěpǿřț – Ňǻțįǿň Șțǻțě ǻň đ Ħǻčķțįvįșț Ǻțțǻčķ ș:\nȚǻřģěțěđ Ħįțș ǿň Ǻșįǻň Ǿřģǻňįżǻțįǿňș\nCONCLUSION\nǺŀțħǿųģħ įňfǿřmǻțįvě, țħě șě đǿčųměňțș čǻňňǿț șųbșțįțųțě fǿř țħǿřǿųģħ įňțěŀŀįģěňčě ģǻțħě řįňģ ěffǿ řțș ǻňđ įňvěșțįģǻțįǿň ǿf șųșpěčțěđ čỳběř\nǻțțǻčķș. Ǿvěř țħě ŀǻșț đěčǻđě, FįřěĚỳě ħǻș șpěňț ǿvě ř 100,000 ħǿųřș pěř ỳěǻř řěșpǿňđįňģ țǿ țħě ẅǿřŀđ’ș ŀǻřģěșț ǻňđ mǿșț čǿňșěqųěňțįǻŀ\nbřěǻčħěș. Țħįș đěěp įňčį đěňț řěșpǿňșě ěxpěřįěňčě, ģǻțħě řěđ fřǿm șįx ẅǿřŀđẅįđě șěčųřįțỳ ǿpěřǻțįǿň čěňțě řș (ȘǾČș), įș čųřǻțěđ ǻňđ fěđ bǻčķ\nįňțǿ ǻ șěŀf-ŀěǻřňįňģ, șỳmbįǿțįč șěčųřįțỳ ěčǿșỳșțěm țħǻț įňčŀ ųđěș ǿvěř 11 mįŀŀįǿň șěňșǿřș ǻňđ įș ųpđǻțěđ ěvěřỳ 60 mįňųțěș.\nFįřěĚỳě ěxpě řțș, ǻșșįșțěđ bỳ țħįș ěčǿșỳșțěm, țřǻčķ ǻ ģ řǿẅįňģ čǿŀŀěčțįǿň ǿf 30+ ǻđvǻňčěđ țħřěǻț ǻčțǿ řș ǻňđ 300+ ǻđvǻňčěđ mǻŀẅǻřě fǻmįŀįě ș.\nȚħěỳ ǻŀ șǿ mǻįňțǻįň p řǿfįŀěș ǿf 10+ ňǻțįǿň- șțǻțě țħřěǻț șpǿňșǿřș ǻňđ 40+ țǻřģěțěđ įňđųșțřįěș țǿ țřǻčķ ǻňđ ǻňǻŀỳżě fįňǻňčįǻŀ ǻň đ pǿŀįțįčǻŀ\nđįměňșįǿňș ǿf čỳbě ř țħřěǻțș ẅǿřŀđẅįđě. FįřěĚỳě ěxpě řțș čǻň ňǿț ǿňŀỳ đěțěřmįňě țħě řįșķ ǻșșǿčįǻțěđ ẅįțħ ǻ vǻŀį đǻțěđ țħřěǻț, bųț ǻŀșǿ ħǿẅ țħě\nțħřěǻț ģǿț įňțǿ țħě ěňvį řǿňměňț, ħǿ ẅ įț șpřěǻđ ǻňđ ẅħǻț čǻň ǻň đ șħǿųŀđ bě đǿňě ǻbǿ ųț įț. Țħě șě įňșįģħțș ǻřě đěŀįvěřěđ ǻș čǿňțěxț ųǻŀ\nįňțěŀŀįģěňčě țħǻț ħěŀp ș čŀįěňț ǿ řģǻňįżǻțįǿňș qųįčķŀỳ přįǿřįțįżě ǻňđ ěffěčțįvěŀỳ řěșpǿňđ țǿ čřįțįčǻŀ șǿpħįșțįčǻțěđ țħřěǻțș.\nFųřțħěř řěǻđįňģ: Țħřěǻț İňțěŀŀįģěňčě Řěpǿ řțș\nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě\nĚňģŀįșħ\n "
}