{
    "title": "alert_ microsoft zero day from sandworm cyberspies! _ emsisoft _ security blog",
    "text": "SECURITY ALERTS\nAlert: Microsoft Zero Day from Sandworm Cyberspies!\nMost Recent Latest Videos Protection Guides Malware Lab Emsisoft News Enterprise Security\nIf you read the tech headlines Tuesday, you might have noticed that there\nwas another “Russian hack.” This time, however, consumers and small\nbusinesses  weren’t the target. This time, things were political.\nReports indicate the discovery of a brand new zero day vulnerability\naffecting all supported versions of the Windows operating system. That’s\nWindows Vista through Windows 8.1, but interestingly enough not\nWindows XP. In a nutshell, vulnerability CVE-2014-4114  allows attackers to\nremotely execute malicious code through shared Microsoft Office\ndocuments. In general, “malicious code” means instructions to download\nand execute any sort of malware. In observed cases, this malware is one\ncalled “Black Energy,” and it has been used in attempts to steal sensitive\ninformation. According to reports, a group of attackers used CVE-2014-\n4114 to serve Black Energy to the Ukrainian government through spear-\nphishing emails.\n \nScreenshot of slide from malicious\nPowerpoint that leveraged CVE-2014-4114\nMore specifically, these emails contained an attached Powerpoint\npresentation that leveraged the zero day vulnerability. As yet, the extent to\nwhich information was exfiltrated from this attack is unknown – however,\nfurther investigation has revealed that the attackers in question have been\nusing malware to spy on governments since 2009.\nThey’re called “The Sandworm Team”\nAccording to independent researchers, September’s spear-phishing\ncampaign was the first time CVE-2014-4114 was used; however, it was not\nthe first time the group that used it has attacked. In fact, researchers claim\nthat the group – known as “The Sandworm Team,” due to their penchant\nfor making references within their code to Frank Herbert’s Dune   – has been\ntargeting a number of governmental organizations for the last 5 years.\nNotable targets have included:\nIn all cases, methods to infection have been the same. Targets are first\nsocially engineered into opening malicious attachments, under the pretense\nthat they contain confidential or valuable political information. In reality,\nthese attachments are weaponized exploits designed to download\nmalware… that actually steals exactly the type of information the phish\npromises to provide.\nIn the specific case of CVE-2014-4114, we have a previously undisclosed\nvulnerability which actually leverages a design flaw in Microsoft Office\napplications. This flaw allows the attackers to download malware via\nWindows Network over the Internet.\n \nWindows network share operated by The\nSandworm Team\nWhat is concerning about this exploit in particular is that typically\nrecommended zero day counter measures, such as Microsoft’s Enhanced\nMitigation Experience Toolkit, do not protect unpatched systems.\nFurthermore, the malicious server in use actually appears  to be located in\nStockholm, Sweden, despite claims  that The Sandworm Team is Russian.\nProtecting yourself from this zero-day\nAs an Emsisoft user, the most important thing you need to know\nabout CVE-2014-4114 is that you are protected.  As soon the news broke,\nour analysis team began testing the Black Energy payload served by the\nzero day exploit. They found that Emsisoft’s Behavior Blocking technology\nprevents Black Energy from executing automatically, without any user\nintervention required.\n \n \nDespite the fact that you may just be an everyday user – without\nconfidential, governmental documents saved on your computer –\nprotecting yourself from this attack is still important. In the hours that\nfollow any zero day disclosure, copycat cybercriminals will often emulate\nthe reported attack to send out malware before the issue is patched.\nUtilizing a proactive anti-malware that can prevent infection from\nunregistered threats is one of the best ways to avoid this. Of course, not\nopening shady emails helps a lot too.\nIn the specific case of CVE-2014-4114, it is fortunate that the researchers\nwho disclosed did so in a responsible manner. October 14th was\nMicrosoft’s “Patch Tuesday,” the day on which all supported operating\nsystems receive their monthly updates; and, due to collaboration, a patch\nfor the zero day was included. For anyone using Emsisoft, this means that\nno direct action is required. Simply allow your computer to update the\nnext time it asks to do so. In the meantime, we’ll have your back.\nHave a great (Sandworm-free) day!\nFor the original disclosure, see iSight’s post on Sandworm.NATO\nAttendees of the 2014 GlobSec conference\nA “specific” yet undisclosed Western European government\nAn undisclosed Polish energy firm\nAn undisclosed French telecommunications firm\nDownload now: Emsisoft Anti‐Malware free trial.\nAntivirus software from the world’s leading ransomware\nexperts. Get your free trial today. Try It Now\nSteve\nFreelance writer and security enthusiast based in the USA.\nWhat to read next\nSECURITY ALERTS\n3 min read\nEmotet trojan is back with a\nvengeance\nEmotet is back. The infamous trojan now features an\nall-new email harvesting module that is helping\nmalware authors create scarily realistic malicious\nemails.SECURITY ALERTS\n3 min read\nBeware: New wave of malware\nspreads via ISO file email\nattachments\nWe’ve seen a spike in malware concealed in ISO file\nemail attachments. Learn more about this new threat\nand how you can protect yourself against ISO malware.MOBILE MALWARE ·SECURITY ALERTS\n4 min read\nMobile malware targets Android\nusers\nYour mobile phone is the journal of your digital life.\nWho is reading yours? Emsisoft explores mobile\nmalware and the best ways for you to prevent it.\nReader Comments\nNewsletter\nMalware never sleeps. Be sure to stay up‐to‐date on emerging\nthreats.Name...  Email...  \nSUBSCRIBEEmsisoft\nrequires\ncollection\nand\nprocessing\nof\ncertain\npersonal\ndata\nto\nprovide\nthe\nservices.\nPlease\nconfirm\nthat\nyou\nhave\nread\nand\naccept\nthe\nterms\nof\nour\nPrivacy\nPolicy\nPRODUCTS & SERVICES\nEmsisoft Anti‐Malware Home\nEmsisoft Mobile Security\nEmsisoft Business/Enterprise Security\nEmsisoft Cloud Console\nEmsisoft Commandline Scanner\nEmsisoft Emergency Kit ProRANSOMWARE/MALWARE\nREMOVAL\nFree Ransomware Decryption\nCustomized Ransomware Recovery\nProtection Guides\nMalware LabPARTNERS\nManaged Service Providers\nResellers\nTechnology Partners\nAffiliates\nFind a PartnerRESOURCES\nMyEMSISOFT\nUser Guides\nCommunity Forum\nChat SupportCOMPANY\nAbout\nCareers\nPress\nAwards & Reviews\nContact\nEMSISOFT© 2003‐2020 Emsisoft ‐ 03/18/2020 ‐ Legal Notice  ‐ Terms  ‐ Bug Bounty  ‐ Privacy Policy     LOGINFOR HOME FOR BUSINESS PRICING TOOLS SUPPORT BLOGWho is Emsisoft? | English\n "
}