{
    "title": "alleged iran-linked apt group raspite targets us electric utilitiessecurity affairs",
    "text": "Drupal addresses two XSS flaws by updating the CKEditor   MUST READ\nCopyright 2015 Security Affairs by Pierluigi Paganini All Right Reserved. Back to top \nSponsored Content\nDigging the Deep Web: Exploring the dark side of the\nweb\nYoroi Blog\nYoroi Blog\nSponsored Content\nSponsored Content\nSponsored Content\nSponsored ContentAlleged Iran-linked APT group RASPITE targets US\nelectric utilities\nAugust 2, 2018  By Pierluigi Paganini\nSHARE ON             \nPierluigi Paganini\nPierluigi Paganini is member of the ENISA (European Union Agency for Network\nand Information Security) Threat Landscape Stakeholder Group and Cyber G7\nGroup, he is also a Security Evangelist, Security Analyst and Freelance Writer.\nEditor-in-Chief at \"Cyber Defense Magazine\", Pierluigi is a cyber security expert\nwith over 20 years experience in the field, he is Certified Ethical Hacker at EC\nCouncil in London. The passion for writing and a strong belief that security is\nfounded on sharing and awareness led Pierluigi to find the security blog\n\"Security Affairs\" recently named a Top National Security Resource for US.\nPierluigi is a member of the \"The Hacker News\" team and he is a writer for some\nmajor publications in the field such as Cyber War Zone, ICTTF, Infosec Island,\nInfosec Institute, The Hacker News Magazine and for many other Security\nmagazines. Author of the Books \"The Deep Dark Web\" and “Digital Virtual\nCurrency and Bitcoin”.\nUK printing company Doxzoo\nexposed US and UK military docs\nMarch 20, 2020  By Pierluigi PaganiniRussia-linked APT28 has been\nscanning vulnerable email servers in\nthe last year\nMarch 20, 2020  By Pierluigi PaganiniAccording to Dragos firm, the RASPITE cyber-\nespionage group (aka Leafminer) has been targeting\norganizations in the United States, Europe, Middle\nEast, and East Asia.\nResearchers from security firm Dragos reported that a group operating out of Iran tracked\nas RASPITE has been targeting entities in the United States, Europe, Middle East, and East Asia,\nindustrial cybersecurity firm Dragos warns.\nThe group has been active at least since 2017, researchers uncovered operations aimed at government\nand other types of organizations in the Middle East.\n“Dragos has identified a new activity group targeting access operations in the electric utility sector. We call this\nactivity group RASPITE.” read a blog post  published by Dragos.\n“Analysis of RASPITE tactics, techniques, and procedures ( TTPs ) indicate the group has been active in some form\nsince early- to mid-2017. RASPITE targeting includes entities in the US, Middle East, Europe, and East Asia.\nOperations against electric utility organizations appear limited to the US at this time.”\nLast week, experts from Symantec who tracked the group as Leafminer  published a detailed report on\nthe activity of the cyber espionage team who leveraged both custom-built malware and publicly-\navailable tools in observed campaigns.\nAccording to Symantec, the extent of the campaigns conducted by the group could be wider, the\nresearchers uncovered a list, written in Iran’s Farsi language, of 809 targets whose systems were\nscanned by the attackers.\nThe list groups each entry with organization of interest by geography and industry, in includes\ntargets in the United Arab Emirates, Qatar, Bahrain, Egypt, and Afghanistan.\nNow researchers from Dragos confirmed that the RASPITE is behind attacks that has been targeting\nindustrial control systems in several states.\nAccording to the experts, the hackers also accessed operations in the electric utility sector in the\nUnited States.\nThe hackers carry on watering hole  attacks leveraging compromised websites providing content of\ninterest for the potential victims.\nRASPITE attacks appear similar to the ones conducted by other threat actors like DYMALLOY\nand ALLANITE , the hackers injected in the websites links to a resource to prompt an SMB connection\nwith the intent to gather Windows credentials.\nThen, the attackers deploy scripts to install a malware that connects to C&C ad give then attacker the\ncontrol of the compromised machine.\nAccording to Dragos, even if RASPITE has mainly focused on ICS systems, at the time there is no news\nabout destructive attacks on such kind of devices.\n“RASPITE’s activity to date currently focuses on initial access operations within the electric utility sector.\nAlthough focused on ICS-operating entities, RASPITE has not demonstrated an ICS-specific capability to\ndate.” continues Dragos.\n“This means that the activity  group is targeting electric utilities, but there is no current indication the group has\nthe capability of destructive ICS attacks including widespread blackouts like those in Ukraine.” \nSergio Caltagirone, Director of Threat Intelligence, Dragos, explained that his firm provided only\nlimited information on the activity of the group to avoid “proliferation of ideas or tradecraft to other\nactivity groups.”\nPierluigi Paganini\n(Securi ty Affairs  – RASPITE, cyber espionage)\n APT cyber espionage Hacking Leafminer Pierluigi Paganini RASPITE Security Affairs\nYOU MIGHT ALSO LIKEShare this...\nPREVIOUS ARTICLE\nThree members of FIN7 (Carbanak) gang\ncharged with stealing 15 million credit\ncards\n NEXT ARTICLE\nHundreds of thousands MikroTik Routers\ninvolved in massive Coinhive\ncryptomining campaignHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  \nTerrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact meHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  Terrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\nAlways Enabled Necessary \n "
}