{
    "title": "analyzing operation ghostsecret_ attack seeks to steal data worldwide",
    "text": "Analyzing Operation GhostSecret:\nAttack Seeks to Steal Data Worldwide\nSecuring Tomorrow \nUnited States / English     Privacy Legal Notices Legal Contracts & Terms Site Map Copyright ©20202019 McAfee, LLC Search Blogs\n   Home/Other Blogs /McAfee Labs /Analyzing Operation GhostSecret: Attack Seeks to Steal Data Worldwide\n By Ryan Sherstobito  and Asheer Malhotra  on Apr 24, 2018\nMcAfee Advanced Threat Research analysts have uncovered a global data reconnaissance campaign assaulting a wide number of\nindustries including critical infrastructure, entertainment,  nance, health care, and telecommunications. This campaign, dubbed\nOperation GhostSecret, leverages multiple implants, tools, and malware variants associated with the state-sponsored cyber group\nHidden Cobra. The infrastructure currently remains active. In this post, we dive deeply into this campaign. For a brief overview of this\nthreat, see “Global Malware Campaign Pilfers Data from Critical Infrastructure, Entertainment, Finance, Health Care, and Other\nIndustries.”\nOur investigation into this campaign reveals that the actor used multiple malware implants, including an unknown implant with\ncapabilities similar to Bankshot. From March 18 to 26 we observed the malware operating in multiple areas of the world. This new\nvariant resembles parts of the Destover malware, which was used in the 2014 Sony Pictures attack.\nFurthermore, the Advanced Threat Research team has discovered Proxysvc, which appears to be an undocumented implant. We have\nalso uncovered additional control servers that are still active and associated with these new implants. Based on our analysis of public\nand private information from submissions, along with product telemetry, it appears Proxysvc was used alongside the 2017 Destover\nvariant and has operated undetected since mid-2017.\nThe attackers behind Operation GhostSecret used a similar infrastructure to earlier threats, including SSL certi cates used by FakeTLS\nin implants found in the Destover backdoor variant known as Escad, which was used in the Sony Pictures attack. Based on our technical\nanalysis, telemetry, and data from submissions, we can assert with high con dence that this is the work of the Hidden Cobra group. The\nAdvanced Threat Research team uncovered activity related to this campaign in March 2018, when the actors targeted Turkish banks.\nThese initial  ndings appear to be the  rst stage of Operation GhostSecret. For more on the global aspect of this threat, see “Global\nMalware Campaign Pilfers Data from Critical Infrastructure of Entertainment, Finance, Health Care, and Other Industries.”\nAnalysis\nThe McAfee Advanced Threat Research team discovered a previously unknown data-gathering implant that surfaced in mid-February\n2018. This implant appears to be a derivative of implants authored before by Hidden Cobra and contains functionality similar to that of\nBankshot, with code overlaps from other Hidden Cobra implants. However, the variant is not based on Bankshot. Our analysis of the\nportable executable’s rich-header data reveals that the two implants were compiled in di erent development environments. (The PE\nrich header is an undocumented part of a Windows executable that reveals unique information to identify the Microsoft compiler and\nlinker used to create the program. It is helpful for identifying similarities between malware variants to establish common development\nenvironments.) Our analysis of the code and PE rich header indicates that Bankshot, Proxysvc, and the Destover-like implant are\ndistinct families, but also contain overlapping code and functionality with current tools of Hidden Cobra.\nPE rich header data from the 2018 Bankshot implant.\nPE rich header data from the new February 2018 implant.\nPE rich header data from Proxysvc.dll.\nWhen we compared the PE rich header data of the new February 2018 implant with a variant of Backdoor.Escad (Destover) from 2014\nshortly before the Sony Pictures attack, we found the signatures to be identical. The Destover-like variant is 83% similar in code to a\n2015 variant and contains the same rich PE header signature as the Backdoor.Escad variant we analyzed. Thus the new implant is likely\na derivative of components of Destover. We determined that the implant is not a direct copy of well-known previous samples of\nDestover; rather, Hidden Cobra created a new hybrid variant using functionality present in earlier versions.\n2014 Backdoor.Escad (hash: 8a7621dba2e88e32c02fe0889d2796a0c7cb5144).\n2015 Destover variant (7fe373376e0357624a1d21cd803ce62aa86738b6).\nThe February implant fe887fcab66d7d7f79f05e0266c0649f0114ba7c was obtained from an unknown submitter in the United States on\nFebruary 14, two days after it was compiled. This Korean-language  le used the control server IP address 203.131.222.83. The implant is\nnearly identical to an unknown 2017 sample (8f2918c721511536d8c72144eabaf685ddc21a35) except that the control server addresses\nare di erent. The 2017 sample used address 14.140.116.172. Both implants speci cally use FakeTLS with PolarSSL, which we saw in\nprevious Hidden Cobra implants. PolarSSL libraries have appeared in implants since the Sony Pictures incident and were used\nexclusively in the implant Backdoor.Destover. This implant incorporated a custom control server protocol that sends tra c over port\n443. The implementation does not format the packets in standard SSL, but rather in a custom format and transmitted over SSL—hence,\nFakeTLS. The control server tra c when compared to Backdoor.Escad is nearly identical.\nTLS tra c in Backdoor.Destover, the 2018 Destover-like variant.\nTLS tra c in Backdoor.Escad.\nFurther research into IP address 14.140.116.172 leads us to additional hidden components involved in the overall infrastructure.\nProxysvc.dll contains a list of hardcoded IP addresses, including the preceding address, all located in India. Despite the name, this\ncomponent is not an SSL proxy, but rather a unique data-gathering and implant-installation component that listens on port 443 for\ninbound control server connections.\nProxysvc was  rst collected by public and private sources on March 22 from an unknown entity in the United States. The executable\ndropper for the component was submitted from South Korea on March 19. McAfee telemetry analysis from March 16 to 21 reveals that\nProxysvc components were active in the wild. Our research shows this listener component appeared mostly in higher education\norganizations. We suspect this component is involved in core control server infrastructure. These targets were chosen intentionally to\nrun Proxysvc because the attacker would have needed to know which systems were infected to connect to them. This data also\nindicates this infrastructure had been operating for more than a year before its discovery. The Advanced Threat Research team found\nthis component running on systems in 11 countries. Given the limited capabilities of Proxysvc, it appears to be part of a covert network\nof SSL listeners that allow the attackers to gather data and install more complex implants or additional infrastructure. The SSL listener\nsupports multiple control server connections, rather than a list of hardcoded addresses. By removing the dependency on hardcoded IP\naddresses and accepting only inbound connections, the control service can remain unknown.\nThe number of infected systems by country in which Proxysvc.dll was operating in March. Source: McAfee Advanced Threat Research.\nThe 2018 Destover-like implant appeared in organizations in 17 countries between March 14 and March 18. The impacted organizations\nare in industries such as telecommunications, health,  nance, critical infrastructure, and entertainment.\nThe number of infected systems by country in which the Destover variant was operating in March. Source: McAfee Advanced Threat\nResearch.\n \nControl Servers\nFurther investigation into the control server infrastructure reveals the SSL certi cate d0cb9b2d4809575e1bc1f4657e0eb56f307c7a76,\nwhich is tied to the control server 203.131.222.83, used by the February 2018 implant. This server resides at Thammasat University in\nBangkok, Thailand. The same entity hosted the control server for the Sony Pictures implants. This SSL certi cate has been used in\nHidden Cobra operations since the Sony Pictures attack. Analyzing this certi cate reveals additional control servers using the same\nPolarSSL certi cate. Further analysis of McAfee telemetry data reveals several IP addresses that are active, two within the same network\nblock as the 2018 Destover-like implant.\nNumber of infections by Thammasat University –hosted control servers from March 15 –19, 2018. Source: McAfee Advanced Threat\nResearch.\nImplant Origins\nMcAfee Advanced Threat Research determined that the Destover-like variant originated from code developed in 2015. The code\nreappeared in variants surfacing in 2017 and 2018 using nearly the same functionality and with some modi cations to commands,\nalong with an identical development environment based on the rich PE header information.\nBoth implants (fe887fcab66d7d7f79f05e0266c0649f0114ba7c and 8f2918c721511536d8c72144eabaf685ddc21a35) are based on the 2015\ncode. When comparing the implant 7fe373376e0357624a1d21cd803ce62aa86738b6, compiled on August 8, 2015, we found it 83%\nsimilar to the implant from 2018. The key similarities and di erences follow.\nSimilarities\nDifferences\nThe following capabilities in the 2015 implant are missing from the 2018 variant:\nThe 2015 implant does not contain a hardcoded value of the IP address it must connect to. Instead it contains a hardcoded sockaddr_in\ndata structure (positioned at 0x270 bytes before the end of the binary) used by the connect() API to specify port 443 and control server\nIP addresses:\nBoth of these control servers used the PolarSSL certi cate d0cb9b2d4809575e1bc1f4657e0eb56f307c7a76.\nProxysvc\nAt  rst glance Proxysvc, the SSL listener, looks like a proxy setup tool (to carry out man-in-the-middle tra c interception). However, a\ncloser analysis of the sample reveals it is yet another implant using HTTP over SSL to receive commands from the control server.\nProxysvc appears to be a downloader whose primary capability is to deliver additional payloads to the endpoint without divulging the\ncontrol address of the attackers. This implant contains a limited set of capabilities for reconnaissance and subsequent payload\ninstallations. This implant is a service DLL that can also run as a standalone process.\nThe ServiceMain()\nsub function of Proxysvc.\nThe implant cannot connect to a control server IP address or URL. Instead it accepts commands from the control server. The implant\nbinds and listens to port 443 for any incoming connections.  \n \n \nProxysvc binding itself to the speci ed port.\nProxysvc begins accepting incoming requests to process.  \nProxysvc makes an interesting check while accepting connections from a potential control server. It checks against a list of IP addresses\nto make sure the incoming connection is not from any of the following addresses. If the incoming request does come from one of these,\nthe implant o ers a zero response (ASCII “0”) and shuts down the connection.\nSSL Listener Capabilities\nThe implant receives HTTP-based commands from a control server and parses the HTTP Content-Type and Content-Length from the\nHTTP header. If the HTTP Content-Type matches the following value, then the implant executes the command speci ed by the control\nserver:\nContent-Type: 8U7y3Ju387mVp49A\nHTTP Content-Type comparison with a custom implant value.\nThe implant has the following capabilities:\nProxysvc writing a binary to a temp directory and executing it.  \nAnalyzing the Main Implant\nThe February 2018 implant contains a wide variety of capabilities including data ex ltration and arbitrary command execution on the\nvictim’s system. Given the extensive command structure that the implant can receive from the control server, this is an extensive\nframework for data reconnaissance and ex ltration, and indicates advanced use. For example, the implant can wipe and delete  les,\nexecute additional implants, read data out of  les, etc.\nThe implant begins execution by dynamically loading APIs to perform malicious activities. Libraries used to load the APIs include:\nThe main implant dynamically loading APIs.\nAs part of its initialization, the implant gathers basic system information and sends it to its hardcoded control server 203.131.222.83\nusing SSL over port 443:\nHKLM\\HARDWARE\\DESCRIPTION\\System\\CentralProcessor\\0 ProcessorNameString\nDomain name and username extraction using Win32 WTS APIs.\nData Reconnaissance\nThe implant receives commands over SSL as encoded data. This data is decoded, and the correct command ID is derived. Valid\ncommand IDs reside between 0 and 0x1D.\nSwitch case handling command execution based on command IDs.\nBased on the command ID, the implant can perform the following functions:\nGathering volume information.\nReading  le contents and sending it the control server.\nOpen handle to a  le for writing with no shared permissions.\nWriting data received from control server to  le.\nCreating a new process for a binary speci ed by the control server.\nWiping and deleting  les.\ncmd.exe /c “< le_path> > %temp%\\PM*.tmp 2>&1”\nExecuting a command and logging results to a temp  le.\nGetting process times for all processes on the system.\nGetting username and domain from accounts associated with a running process.\nCreating a batch  le for self-deletion.\nHKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\TowCon gs Description\nSetting and getting the current working directory for the implant’s process.\nThe command handler index table is organized in the implant as follows:\nThe command handler index table.\nConclusion\nThis analysis by the McAfee Advanced Threat Research team has found previously undiscovered components that we attribute to\nHidden Cobra, which continues to target organizations around the world. The evolution in complexity of these data-gathering implants\nreveals an advanced capability by an attacker that continues its development of tools. Our investigation uncovered an unknown\ninfrastructure connected to recent operations with servers in India using an advanced implant to establish a covert network to gather\ndata and launch further attacks.\nThe McAfee Advanced Threat Research team will provide further updates as our investigation develops.\nFighting cybercrime is a global e ort best undertaken through e ective partnerships between the public and private sectors. McAfee is\nworking with Thai government authorities to take down the control server infrastructure of Operation GhostSecret, while preserving\nthe systems involved for further analysis by law enforcement authorities. By creating and maintaining partnerships with worldwide law\nenforcement, McAfee demonstrates that we are stronger together.  \nIndicators of Compromise\nMcAfee detection\nMITRE ATT&CK  techniques\nIP addresses\nHashesBoth variants build their API imports dynamically using GetProcAddress, including wtsapi32.dll for gathering user and domain names\nfor any active remote sessions\nBoth variants contain a variety of functionalities based on command IDs issued by the control servers\nCommon capabilities of both malware:\nListing  les in directory\nCreating arbitrary processes\nWriting data received from control servers to  les on disk\nGathering information for all drives\nGathering process times for all processes\nSending the contents of a speci c  le to the control server\nWiping and deleting  les on disk\nSetting the current working directory for the implant\nSending disk space information to the control server\nBoth variants use a batch  le mechanism to delete their binaries from the system\nBoth variants run commands on the system, log output to a temporary  le, and send the contents of the  le to their control servers\nCreating a process as a speci c user\nTerminating a speci c process\nDeleting a speci c  le\nSetting  le times for a speci c  le\nGetting current system time and sending it to the control server\nReading the contents of a  le on disk. If the  lepath speci ed is a directory, then listing the directory’s contents.\nSetting attributes on  les\n193.248.247.59\n196.4.67.45\n121.240.155.74\n121.240.155.76\n121.240.155.77\n121.240.155.78\n223.30.98.169\n223.30.98.170\n14.140.116.172  \nWriting an executable received from the control server into a temp  le and executing it\nGathering system information and sending it to the control server. The system information gathered from the endpoint includes:\nMAC address of the endpoint\nComputer Name\nProduct name from HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion ProductName\nThis information is concatenated into a single string in the format: “MAC_Address|ComputerName|ProductName” and is sent to\nthe control server\nRecording HTTP requests from the control server to the temporary  le prx in the implant’s install directory with the current system\ntimestamp\nKernel32.dll\nApvapi32.dll\nOleaut32.dll\nIphlpapi.dll\nWs2_32.dll\nWtsapi32.dll\nUserenv.dll\nNtdll.dll\nCountry name from system’s locale\nOperating system version\nProcessor description from\nComputer name and network adapters information\nDisk space information for disks C: through Z: including total memory in bytes, total available memory in bytes, etc.\nCurrent memory status including total physical memory in bytes, total available memory, etc.\nDomain name and usernames based on current remote sessions\nGather system information and ex ltrate to the control server (same as the basic data-gathering functionality previously described)\nGet volume information for all drives on the system (A: through Z:) and ex ltrate to the control server\nList  les in a directory. The directory path is speci ed by the control server.\nRead the contents of a  le and send it to the control server\nWrite data sent by the control server to a speci ed  le path\nCreate new processes based on the  le path speci ed by the control server.\nWipe and delete  les speci ed by the control server\nExecute a binary on the system using cmd.exe and log the results into a temp  le, which is then read and the logged results are sent\nto the control server. The command line:\nGet information for all currently running processes\nDelete itself from disk using a batch  le.\nStore encoded data received from the control server as a registry value at:\nSet and get the current working directory for the implant\nTrojan-Bankshot2\nEx ltration over control server channel: data is ex ltrated over the control server channel using a custom protocol\nCommonly used port: the attackers used common ports such as port 443 for control server communications\nService execution: registers the implant as a service on the victim’s machine\nAutomated collection: the implant automatically collects data about the victim and sends it to the control server\nData from local system: local system is discovered and data is gathered\nProcess discovery: implants can list processes running on the system\nSystem time discovery: part of the data reconnaissance method, the system time is also sent to the control server\nFile deletion: malware can wipe  les indicated by the attacker\n203.131.222.83\n14.140.116.172\n203.131.222.109\nfe887fcab66d7d7f79f05e0266c0649f0114ba7c\n8f2918c721511536d8c72144eabaf685ddc21a35\n33 bc8d6850794fa3b7bccb7b1aa1289e6eaa45  \nAbout the Author\nRyan Sherstobito \nRyan Sherstobito  is a Senior Analyst for Major Campaigns – Advanced Threat Research in McAfee. Ryan\nspecializes in threat intelligence in the Asia Paci c Region where he conducts cutting edge research into new\nadversarial techniques and adapts those to better monitor the threat landscape. He formerly was the Chief\nCorporate Evangelist at Panda Security, where ...\nRead more posts from Ryan Sherstobito  \nAsheer Malhotra\nAsheer is a Security Researcher at McAfee. He is actively involved in reverse engineering, malware analysis and\nnetwork tra c analysis.\nRead more posts from Asheer Malhotra \n Previous Article Next Article \nCategories: McAfee Labs\nTags: cybercrime , malware, advanced persistent threats , cybersecurity , Advanced Threat Research\nLeave a reply\nFacebook Comments Comments (0)\nSimilar Blogs\nWhatsApp Security Hacks: Are\nYour ‘Private’ Messages Really\nEver Private?\nMar 14, 2020\nIs WhatsApp Safe for Kids? Here’s\nWhat Parents Need to Know\nMar 07, 2020\nIs Mobile Malware Playing Hide\nand Steal on Your Device?\nMar 03, 2020\nFamily Safety\n Family Safety\n Consumer\nSubscribe to McAfee Securing Tomorrow Blogs\nEmail address  SubscribeBlog Home Categories Authors Subscribe\nFor Home For Enterprise \n "
}