{
    "title": "apt 30 government hacker group might not be from china- the inquirer",
    "text": "Home News Reviews Video INQdepth Downloads store Debates SMB Spotlight\n© Incisive Business Media (IP) Limited 2016, Published by Incisive\nBusiness Media Limited, Haymarket House, 28-29 Haymarket, London\nSW1Y 4RX, are companies registered in England and Wales with\ncompany registration numbers 9177174 & 9178013Home News Reviews Video INQdepth Downloads store Debates SMB Spotlight\nSearch\nWed Apr 15 2015, 10:16\nComment on this article Flame Author Print\nTags: Security Privacy\ndel.icio.us\n Digg\n Facebook\n Linkedin\n reddit!\nStumbleUpon\n TwitterShare this:APT 30 government hacker group might not be\nfrom China\nWe shouldn't be so quick to point the finger\nBy Lee Bell\nTHE APT 30 HACKER GROUP - which is\nsaid to have spied on Asian\ngovernments for over a decade -  might\nnot actually be from China.\nThe threat group was discovered and\ndetailed by FireEye in its latest report\nearlier this week, claiming that it has\nbeen spying on Asia Pacific countries'\ngovernments from as far back as 2004.\nFireEye's APT 30 and the Mechanics of a Long-Running Cyber Espionage\nOperation  report (PDF) said it believed the activity to be state sponsored, and\nsaid it is most likely the Chinese government.\nBut, while FireEye itself doesn't state that APT 30 is definitely Chinese,\nMalwarebytes highlights that we shouldn't be so quick to point the finger. The\nsecurity firm's head of Malware Intelligence, Adam Kujawa, told The INQUIRER  that\n as attribution is always difficult in the case of APT campaigns \"because there is\nvery rarely a smoking gun\". \nHe said: \"There are a number of factors in the report which seemingly point to\nChinese involvement, but it is impossible to be definitive as these can always be\n‘false flags'.\n\"An interesting similarity that could be made is with the incident with a US EP-3\naircraft which crash landed in China in 2001. This ended with the disputed aircraft\ncoming back in pieces after seemingly being reverse engineered.\"\nFireEye claimed that APT 30 takes a special interest in political developments in\nSoutheast Asia and India, and is particularly active at the time of Association of\nSoutheast Asian Nations summits. It also focuses on regional issues and territorial\ndisputes between China, India and Southeast Asian countries.\nAccording to the security firm, the group has consistently targeted Southeast\nAsia and India over the past 10 years, prioritising their targets, working in shifts in\na collaborative environment, and building malware from a development plan.\nAPT 30 is also said to target media organisations and journalists who report on\ntopics concerning the region.\n\"We have analysed over 200 malware samples and its GUI-based remote controller\nsoftware, and we are able to assess how the team behind APT 30 works,\" FireEye\nsaid.\n\"Their missions focus on acquiring sensitive data from a variety of targets, which\npossibly include classified government networks and other networks inaccessible\nfrom a standard internet connection.\"\nAPT 30 has not disclosed where its members reside, but FireEye said that its\nactions suggest Chinese involvement.\n\"Much of [APT 30's] social engineering efforts suggest the group is particularly\ninterested in regional political, military and economic issues, disputed territories,\nand media organisations and journalists who report on topics pertaining to China\nand the government's legitimacy,\" said the FireEye report.\nThe white paper also said that, while attribution is always difficult, evidence\nsuggests that APT30 may be sponsored by the Chinese authorities.\n\"Such a sustained, planned development effort, coupled with the group's regional\ntargets and missions, leads us to believe that this activity is state sponsored,\nmost likely by the Chinese government,\" read the report.\nThe group reportedly infects victims using phishing messages , and deploys a\nsophisticated set of attack tools and backdoors that have been developed over\nthe past 10 years.\nFireEye said that some malware being used by APT 30, primarily Backspace, shows\ncharacteristics of a modularised development framework.\n\"Our investigations into special tools - Shipshape, Spaceship and Flashflood - used\nby APT 30 suggest that, while they are not the only group to build functionality to\ninfect and steal data from air-gapped networks, they appear to have designed\nthis feature at the beginning of their efforts in 2005,\" said FireEye. µ\n \n Follow @INQ Communications  > Security\n< Previous article | Next article >\nblog comments powered by DisqusMost read Most commented Most watched\nJohn McAfee unlocks an iPhone and does not eat a\nshoe\nGalaxy S7 specs, release date and price\nMicrosoft supports more handsets in Windows 10\nMobile Build 10586.122\nThe Pirate Bay reaches out to Kanye West\nWindows 10 is now the second most popular desktop\noperating system\nSearch\nSite Credentials: About us  Advertise  Terms & Conditions  Privacy policy  About Incisive Media  Sitemap\nFollow us: Youtube  Twitter  Facebook  Linkedin  Google+\nBusiness & Technology\nwebsites:V3.co.uk  CRN UK  Computing  Business Green\nBusiness research\nresources:B2B Web Seminars  Business Technology Video  Whitepapers\nProducts: Software Reviews  Hardware Reviews  Download Reviews  Google+\nAccreditations:\n \n \n "
}