{
    "title": "apt-style bank robberies increase with metel_ gcman and carbanak 2.0 attacks _ securelist",
    "text": "Share post on:\nTHERE ARE 2 COMMENTS\nIntroduction\nIn late 2014, Kaspersky Lab researchers made a worrying prediction : financially-motivated cyber-criminals would adopt\nsophisticated tactics and techniques from APT groups for use in bank robberies.\nJust a few months later, in February 2015, we announced the discovery of Carbanak , a cyber-criminal gang that used\ncustom malware and APT techniques to steal millions of dollars while infecting hundreds of financial institutions in at least\n30 countries.\nSince then, we have seen an increase in these covert, APT-style attacks that combine the use of reconnaissance, social\nengineering, specialized malware, lateral movement tools and long-term persistence to steal money from financial\ninstitutions (particularly ATMs and money transfer systems).\nToday at the Security Analyst Summit ( SAS 2016 ), Kaspersky Lab is announcing the discovery of two new gangs engaged in\nAPT-style bank robberies – Metel and GCMAN – and the reemergence of the Carbanak group with new targets in its sights.\nIn 2015, Kaspersky Lab researchers conducted Incident Response for 29 organizations located in Russia and infected by\nthese three groups.\nDue to the active nature of law enforcement investigations and non-disclosure agreements with victim organizations,\nKaspersky Lab cannot provide extensive details of the attacks. Kaspersky Lab is releasing crucial Indicators of Compromise\n(IOCs) and other data to help organizations search for traces of these attack groups in their corporate networks (see below) .\nThe story of Metel – ATM balance rollbacks\nIn summer 2015, a bank in Russia discovered it had lost millions of rubles in a single night through a series of strange\nfinancial transactions. The bank’s clients were making withdrawals from ATMs belonging to other banks and were able to\ncash out huge sums of money while their balances remained untouched. The victim bank didn’t realize this until it tried to\nrecoup the money withdrawn from the other banks’ ATMs.\nDuring our incident response, we discovered the solution to this puzzle: Metel, a modular malware program also known as\nCorkow.\nThe malware, used exclusively by the Metel group, infected the bank’s corporate network via e-mail and moved laterally to\ngain access to the computers within the bank’s IT systems.\nHaving gained access to the bank operator’s money-processing system, the gang pulled off a clever trick by automating the\nrollback of ATM transactions. This meant that money could be stolen from ATM machines via debit cards while the balance\non the cards remained the same, allowing for multiple transactions at different ATM machines.\nEncrypted configuration for Metel malware plugins\nOur investigations revealed that the attackers drove around several cities in Russia, stealing money from ATMs belonging to\ndifferent banks. With the automated rollback in place the money was instantly returned to the account after the cash had\nbeen dispensed from the ATM. The group worked exclusively at night, emptying ATM cassettes at several locations.\nIn all, we discovered Metel in more than 30 financial institutions, but Kaspersky Lab’s incident responders were able to clean\nthe networks before any major damage could be done. It is highly likely that this threat is far more widespread and we urge\nfinancial institutions around the world to scan their networks for signs of the Metel malware.\nThe Metel criminal group is still active. At the moment, we don’t have any information about any victims outside Russia.\nGCMAN – penetration testing tools gone bad\nA second group, which we call GCMAN because the malware is based on code compiled on the GCC compiler, emerged\nrecently using similar techniques to the Metel Group to infect banking institutions and attempt to transfer money to e-\ncurrency services.\nThe initial infection mechanism is handled by spear-phishing financial institution targets with e-mails carrying a malicious\nRAR archive to. Upon opening the RAR archive, an executable is started instead of a Microsoft Word document, resulting in\ninfection.\nOnce inside the network, the GCMAN group uses legitimate and penetration testing tools such as Putty, VNC, and\nMeterpreter for lateral movement. Our investigation revealed an attack where the group then planted a cron script into\nbank’s server, sending financial transactions at the rate of $200 per minute. A time-based scheduler was invoking the script\nevery minute to post new transactions directly to upstream payment processing system. This allowed the group to transfer\nmoney to multiple e-currency services without these transactions being reported to any system inside the bank.\nDecompiled code of GCMAN malware that is responsible for connecting to CnC\nIn a stroke of luck, the financial institutions discovered the suspicious activity on their network in time to neutralize the\nthreat and cancel the transactions.\nOne interesting observation is that the real attack happened approximately 18 months before it was discovered. The group\nused an MS SQL injection in commercial software running on one of bank’s public web services, and about a year and a half\nlater, they came back to cash out. During that time they poked 70 internal hosts, compromised 56 accounts, making their\nway from 139 attack sources (TOR and compromised home routers).\nWe discovered that about two months before the incident someone was trying different passwords for an admin account on\na banking server. They were really persistent but doing it only three times a week and then only on Saturdays, in an effort to\nstay under the radar.\nKaspersky Lab’s research team responded to three financial institutions in Russia that were infected with the GCMAN\nmalware. It is likely that this threat is far more widespread and we urge banks to sweep their networks for signs of this cyber-\ncriminal group.\nCarbanak 2.0: new targets beyond banks\nAfter our exposure of the Carbanak group  exactly a year ago, the group disappeared for about five months, leading us to\nbelieve that the operation was disbanded. However, in September last year, our friends at CSIS published a blog detailing a\nnew Carbanak variant  affecting one of its customers.\nIn December 2015, we confirmed that the group was still active. Kaspersky Lab discovered signs of Carbanak in two\ninstitutions – a telecommunications company and a financial institution.\nExecutable files founded in SHIM during Carbanak incident response\nOne interesting characteristic of Carbanak 2.0 is a different victim profile. The group has moved beyond banks and is now\ntargeting the budgeting and accounting departments in any organization of interest to them, using the same APT-style tools\nand techniques.\nIn one remarkable case, the Carbanak 2.0 gang used its access to a financial institution that stores information about\nshareholders to change the ownership details of a large company. The information was modified to name a money mule as\na shareholder of the company, displaying their IDs. It’s unclear how they wanted to make use of this information in future.\nKaspersky Lab products successfully detect and block the malware used by the Carbanak 2.0, Metel and GCMAN threat\nactors with the following detection names:\nTrojan-Dropper.Win32.Metel\nBackdoor.Win32.Metel\nTrojan-Banker.Win32.Metel\nBackdoor.Win32.GCMan\nBackdoor.Win64.GCMan\nTrojan-Downloader.Win32.GCMan\nTrojan-Downloader.Win32.Carbanak\nBackdoor.Win32.Carbanak\nKaspersky Lab urges all organizations to carefully scan their networks for the presence of Carbanak, Metel and GCMAN and,\nif detected, to disinfect their systems/computers/networks and report the intrusion to law enforcement.\nAll this information has been made available to customers of our APT intelligence reporting service  and they received the\nindicators of compromise and context information as soon as they became available.\nIndicators of Compromise (IOC) are available here:\nMetel\nGCMAN\nCarbanak 2.0\nFor more about the measures to be taken against these Bank Busters and similar offensives, read this article  in the\nKaspersky Business Blog.\nAPT ATM ATTACKS  CYBERCRIME  THESAS2016  TROJAN BANKER\nRelated Posts\nkevin_borys\nPosted on February 10, 2016. 10:04 am\nsurprising and interesting technique of atm ..\nThis is stealing thieves!\nREPLY\nGerald Steck\nPosted on April 11, 2016. 8:28 pm\nWhat can I do if I have knowledge of Carbanak attack in which I was hacked along with a 170,000.00 bank account by this\ngroup via iPhone, OnStar.\nREPLY\nLEAVE A REPLY\nYour email address will not be published.  Required fields are marked *\nEnter your comment here\nName *\nEmail *\nSave my name, email, and website in this browser for the next time I comment.\n \nSUBMIT\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\n APT REPORTS\nAPT-style bank robberies increase with\nMetel, GCMAN and Carbanak 2.0\nattacks\nBy GReAT , Computer Incidents Investigation Department  on February 8, 2016. 1:20 pm\nIn summer 2015, a #bank in #Russia lost millions of\nrubles in a one night #bankingAPT #TheSAS2016\nTwee\nt\nGCMAN group planted cron script into #bank server,\nstealing $200/min #bankingAPT #TheSAS2016\nTwee\nt\n#Carbanak gang is now targeting budgeting &\naccounting departments #bankingAPT #TheSAS2016\nTwee\nt\n \nNotify me when new comments are added.\nIN THE SAME CATEGORY\nChafer used Remexi malware to spy on\nIran-based foreign diplomatic entities\nGreyEnergy’s overlap with Zebrocy\nA Zebrocy Go Downloader\nAPT review of the year\nDarkPulsar FAQ\n© 2020 AO Kaspersky Lab.  All Rights Reserved. \nRegistered trademarks and service marks are the property of their respective owners.\nContact us  | Privacy Policy  | License AgreementEmail\n I agree to provide my email address to “AO Kaspersky Lab” to\nreceive information about new posts on the site. I understand\nthat I can withdraw this consent at any time via e-mail by\nclicking the “unsubscribe” link that I find at the bottom of any e-\nmail sent to me for the purposes mentioned above.\nSUBSCRIBE\nHunting APTs with YARA\n Mobile malware evolution\n2019\nOilRig’s Poison Frog – old\nsamples, same trick\nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\n English\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPR GET IN TOUCH\n "
}