{
    "title": "apt15 is alive and strong_ an analysis of royalcli and royaldns",
    "text": "APT15 is alive and strong: An analysis of RoyalCli\nand RoyalDNS\nIn May 2017, NCC Group's Incident Response team reacted to an ongoing incident where our client, which\nprovides a range of services to UK Government, suffered a network compromise involving the advanced\npersistent threat group APT15.\nAPT15 is also known as, Ke3chang, Mirage, Vixen Panda GREF and\nPlayful Dragon.\nA number of sensitive documents were stolen by the attackers during the incident and we believe APT15\nwas targeting information related to UK government departments and military technology.\nAPT15 expands its arsenal\nDuring our analysis of the compromise, we identified new backdoors that now appear to be part of APT15's\ntoolset. The backdoor BS2005 - which has traditionally been used by the group - now appears alongside\nthe additional backdoors RoyalCli and RoyalDNS.\nThe RoyalCli backdoor appears to be an evolution of BS2005 and uses familiar encryption and encoding\nroutines. The name RoyalCli was chosen by us due to a debugging path left in the binary:\nc:\\users\\wizard\\documents\\visual studio 2010\\Projects\\RoyalCli\\Release\\RoyalCli.pdb\nRoyalCli and BS2005 both communicate with the attacker's command and control (C2) through Internet\nExplorer (IE) by using the COM interface IWebBrowser2. Due to the nature of the technique, this results in\nC2 data being cached to disk by the IE process; we'll get to this later.\nAnalysis of the domains and IP address infrastructure used by APT15 identified a number of similar\npossible domains, shown at the bottom of the post. These appeared to be hosted on either Linode or\nGoogle Cloud, with a preference for using the ASN AS63949.\nAll of the backdoors identified - excluding RoyalDNS - required APT15 to create batch scripts in order to\ninstall its persistence mechanism. This was achieved through the use of a simple Windows run key. We\nbelieve that APT15 could have employed this technique in order to evade behavioural detection, rather than\ndue to a lack of sophistication or development capability.\nAdditional tools were recovered during the incident, including a network scanning/enumeration tool, the\narchiving tool WinRAR and a bespoke Microsoft SharePoint enumeration and data dumping tool, known as\n'spwebmember'.\nspwebmember was written in Microsoft .NET and includes hardcoded values for client project names for\ndata extraction. The tool would connect to the SQL SharePoint database and issue a query to dump all data\nfrom the database to a temporary file affixed with 'spdata'. The group also used keyloggers and their own\n.NET tool to enumerate folders and dump data from Microsoft Exchange mailboxes.\nAPT15 was also observed using Mimikatz to dump credentials and generate Kerberos golden tickets. This\nallowed the group to persist in the victim's network in the event of remediation actions being undertaken,\nsuch as a password reset.\nAPT15 lives off the land\nUpon ejection from the network, APT15 managed to regain access a couple of weeks later via the\ncorporate VPN solution with a stolen VPN certificate, which they had extracted from a compromised host.\nThis time, APT15 opted for a DNS based backdoor: RoyalDNS. The persistence mechanism used by\nRoyalDNS was achieved through a service called 'Nwsapagent'.\nC2 of this backdoor was performed using the TXT record of the DNS protocol. C2 was communicating with\nthe domain 'andspurs[.]com'.\nWe mentioned earlier that due to the nature of the IE injection technique used by the HTTP-based\nbackdoors, a number of C2 commands were cached to disk. We were able to recover these files and\nreverse engineer the encoding routine used by the backdoors in order to uncover the exact commands\nexecuted by the attacker.\nIn total, we were able to recover more than 200 commands executed by the attacker against the\ncompromised hosts and were able to gain a clear insight into the attacker's TTPs. Our decode scripts can\nbe found on our Github page: https://github.com/nccgroup/Royal_APT\nAnalysis of the commands executed by APT15 reaffirmed the group's preference to 'live off the land'. They\nutilised Windows commands in order to enumerate and conduct reconnaissance activities such as\ntasklist.exe, ping.exe, netstat.exe, net.exe, systeminfo.exe, ipconfig.exe and bcp.exe.\nLateral movement was conducted through by a combination of net command, mounting the C$ share of\nhosts and manually copying files to or from compromised hosts. APT15 then used a tool known as\nRemoteExec (similar to Microsoft's Psexec) in order to remotely execute batch scripts and binaries.\nDuring our analysis of the decoded attacker commands we noticed a typographical mistake, shown below\nin the folder name 'systme'. This indicates that a human operative was executing commands on a command\nline style interface, rather than an automated or GUI process.\nIOCs\nBelow are a number of hashes relating to the backdoors identified in use by APT15\nRoyal DNS: bc937f6e958b339f6925023bc2af375d669084e9551fd3753e501ef26e36b39d>\nBS2005: 750d9eecd533f89b8aa13aeab173a1cf813b021b6824bc30e60f5db6fa7b950b\nBS2005: 6ea9cc475d41ca07fa206eb84b10cf2bbd2392366890de5ae67241afa2f4269f\nRoyalCli: 6df9b712ff56009810c4000a0ad47e41b7a6183b69416251e060b5c80cd05785\nMS Exchange Tool: 16b868d1bef6be39f69b4e976595e7bd46b6c0595cf6bc482229dbb9e64f1bce\nNCC Group & Fox-IT have created a number of Suricata IDS rules to detect APT15 activity through the use\nof these backdoors. These, along with YARA signatures for the backdoors identified, can be found in the\nGithub repository linked above.\nDomains\nThe RoyalCli backdoor was attempting to communicate to the following domains:\nNews.memozilla[.]org\nvideo.memozilla[.]org\nThe BS2005 backdoor utilised the following domains for C2:\nRun.linodepower[.]com\nSinga.linodepower[.]com\nlog.autocount[.]org\nRoyalDNS backdoor was seen communicating to the domain:\nandspurs[.]com\nPossible linked APT15 domains include:\nMicakiz.wikaba[.]org\ncavanic9[.]net\nridingduck[.]com\nzipcodeterm[.]com\ndnsapp[.]info\nPublished date:   10 March 2018\nWritten by:   Rob Smallridge\n \n  \n  \nFilter By Service\nFilter By DateSoftware Escrow & Verification\nCyber Security \nRisk Management & Governance\nCorporate\nBusiness Insights\nCareers\n2019\n2018\n2017\n2016\n2015\n2014\n2013\n2012\nCall us on:\n+44 161 209 5200Newsroom & Events\nNewsroom (Ext. website)\nBlogsAbout Us\nHistory\nBoard & Senior Management\nCareers\nResources\nOffice Locations\n©2019 NCC Group.\nAll rights reserved.Investor Relations\nShare Price\nResults & Presentations\nStock Exchange AnnouncementsLegal\nTerms & Conditions\nPrivacy Policy\nCookie Policy\nAccessibility\nModern Slavery Statement\nLatest from @NCCGroupplc\nWhich woman inspires you the most?\nRead our latest #IWD2020  ExCom\npost to find out about who inspires our\nmanaging director of assurance in\nNorth America, Nick Rowe.\nhttps:// newsroom.nccgroup.com/news/\nexecutive -committee-on-international-\nwomens-day-nick-rowe-397681 …\nCyber experts step in as criminals\nseek to exploit Coronavirus fears.\nExperts at the @NCSC  have revealed\nphishing attacks exploiting worries\nover #COVIDー19\nhttps://www. ncsc.gov.uk/news/cyber-\nexperts-step-criminals-exploit-\ncoronavirus …Menu +44 161 209 5200\n Client login\nYour sectors Our services Our research Investors About us Contact us\n "
}