{
    "title": "apt15 pokes its head out with upgraded miragefox rat _ threatpost",
    "text": "/ / / /\n Cloud Security Malware Vulnerabilities InfoSec Insider Podcasts\n  Search\nWhen It Comes To IoT Security, Liability Is Muddled\n Mylobot Botnet Emerges with Rare Level of Complexity\nAPT15 Pokes Its Head Out With Upgraded\nMirageFox RAT\nAuthor:\nJune 19, 2018 / 5:58 pm\n3 minute read\nShare this article:Tara Seals\nThis is the first evidence of the China-linked threat actor’s activity since\nhacked the U.K. government and military in 2017 (which wasn’t made\npublic until 2018).\nThe elusive APT15 cyber-espionage group, believed to be affiliated with the Chinese\ngovernment, has been spotted for the first time in many months, mounting a highly targeted\nspy campaign using an upgraded version of the Mirage remote access trojan.\nThis is the first evidence of the China-linked actor’s activity since hacking the U.K.\ngovernment and military in 2017 (which wasn’t made public until 2018).\nThe effort follows the known APT15 pattern of infiltrating specific targets with basic tools\nthat are then customized to carry out tailored data exfiltration once the victim has been\nbreached. The victim organization in this instance has not been made public, according to a\ntechnical analysis  of APT15 published by researchers at Intezer last Thursday.\nA New and Improved RAT\nThe updated version of the Mirage RAT is called MirageFox. This new version of the RAT was\ndiscovered in early June by Intezer, which recognized a specific signature based off code\nonly found in the earlier version of Mirage – and loosely related malware called Reaver . The\nMirageFox signature was a new upload to VirusTotal, with very few detections.\n“MirageFox is very similar to APT15’s old RAT, Mirage, but was upgraded to be undetected by\nmost antivirus, and was tailor-made for their target (meaning they had already breached\ntheir target, done reconnaissance work and made this version of the RAT to work\nspecifically in that environment),” Jay Rosenberg, senior researcher at Intezer, explained to\nThreatpost in an interview. “The RAT uses a hard-coded, internal network IP address as the\nC&C. This means they already have a node inside the internal network to exfiltrate the stolen\ndata.”\nMirage is an aging RAT at this point, Rosenberg noted.\n“Over the weekend, I discovered that the first version of the RAT Mirage was uploaded to\nVirusTotal in 2009, meaning that the previously believed information that the APT15 was\nactive since 2010 and Mirage originated in 2012 are wrong,” he said.\nMalware Code Retread\nThe upgraded version of the malware is an example of code reuse with a few new bells and\nwhistles, researchers said.\nThe remote shell function used for executing commands and the function for decrypting the\ndata containing the C&C configuration are recycled from the previous version of Mirage, for\ninstance. It also performs the same functions, i.e. collecting information about the computer\nlike the username, CPU information, architecture and so forth before opening a backdoor\nand awaiting orders for modifying files, gathering data, launching processes and terminating\nitself, among other things. The C&C commands are sent manually, the analysis found.\nIn terms of interesting fresh functions, looking at an unusual export feature, there appears to\nbe “some type of DLL hijacking going on,” carried out by distributing a legitimate McAfee\nbinary in a bid to look trustworthy. DLL hijacking techniques have been seen in the past with\nthe APT15 group, Rosenberg said.\nCuriously, there’s no persistence in the module—it renames itself so that future executions\nof the RAT will not be through a McAfee binary – perhaps because APT15 already has taken\nroot in the target networks making re-execution moot.\n“The future persistence could be setup through another component of the malware or even\na command sent by the C&C to the infected computer,” Rosenberg said in the analysis.\nThe decrypted C&C configuration in MirageFox is notable too, he added; the IP address\nbeing used for the C&C is actually an internal IP address on the victim company’s network.\nRosenberg said this likely indicates that the malefactors stole a VPN private key in order to\nbreach the organization. Other details on the threat vector are not known.\nA Rarely-Seen Threat Group\nThe China-linked APT15 (a.k.a. Vixen Panda, Ke3chang, Royal APT or Playful Dragon) is a\nseldom-seen threat actor, although Rosenberg believes the group is always busy without\ncoming to the attention of researchers.\n“I believe APT15’s campaigns are ongoing all the time,” he told Threatpost. “It’s only from\ntime-to-time that an incident comes out to the public, because [victim] organizations or\ncompanies do not want the public to know that they were breached.”\nAs for companies and organizations protecting themselves, “it is very difficult because the\ntools used are very basic and customized once the target has been infiltrated,” Rosenberg\nsaid in the interview. “For example, once they have infiltrated an organization, they can see if\nan AV product is installed, and test to make sure everything is undetected by that AV in their\nown environment before deploying another part of their toolset.”\nThe types of companies and organizations they go after are typical nation-state targets,\nincluding government, military, contractors, the oil industry and others.\n“Basically, [they attack] anyone they could target that would gather some type of\nintelligence,” Rosenberg told us. “This is the first evidence of their activity since they hacked\nthe U.K. government and military  in 2017.” That effort used multiple customized backdoors\ninstalled on a UK government contractor’s computer systems; information about the hack\nwas not made public  until March 2018 however, by NCC Group.\nShare this article:\nFeatured\n Hacks\n Malware\nRevamped HawkEye\nKeylogger Swoops in on\nCoronavirus Fears\nEmails claiming to be directly from\nWHO’s Dr. Tedros Adhanom\nGhebreyesus offer “drug advice” — and\nmalware infections.\nMarch 20, 2020\nTrickBot Trojan Adds RDP\nBrute-Forcing to Its Arsenal\nA fresh module aims to compromise\nremote desktop accounts to access\ncorporate resources.\nMarch 18, 2020\nAPT36 Taps Coronavirus as\n‘Golden Opportunity’ to\nSpread Crimson RAT\nThe Pakistani-linked APT has been\nspotted infecting victims with data\nexfiltration malware.\nMarch 17, 2020\nA Practical Guide to Zero-Trust\nSecurity\nJanuary 15, 2020  2\n7 Tips for Maximizing Your SOC\nDecember 31, 2019  5\nMean Time to Hardening: The Next-\nGen Security Metric\nDecember 30, 2019  4\nCombining AI and Playbooks to\nPredict Cyberattacks\nDecember 26, 2019  1\nThe Case for Cyber-Risk Prospectuses\nDecember 24, 2019  1\nNewsletter\nSubscribe to Threatpost Today  \nJoin thousands of people who receive the\nlatest breaking cybersecurity news every day.\nSubscribe now\nThe First Stop For Security News Home\n About Us\n Contact Us\n Advertise With Us\n RSS FeedsCopyright © 2020 Threatpost Privacy Policy Terms and Conditions Advertise\nBlack Hat Breaking News Cloud Security Critical Infrastructure Cryptography Facebook\nSUGGESTED ARTICLES\nDISCUSSIONINFOSEC INSIDER\nSubscribe to our newsletter, Threatpost Today ! Get the latest breaking news delivered daily to your inbox. Subscribe now\n "
}