{
    "title": "apt28_ cybercrime or state-sponsored hacking_",
    "text": "What's this?\nOutsmart cybercrime with 400+ skill\ndevelopment and certification courses.\nStart your free trial\nOnce upon the APT28\nIn October of 2014, the security firm FireEye published a report  that revealed the\nexistence of a group of Russian hackers, dubbed APT28, which managed a long-\nrunning cyber espionage campaign on US defense contractors, European security\norganizations and Eastern European government entities.\nThe hackers also targeted the attendees of European defense exhibitions, including\nthe EuroNaval 2014, EUROSATORY 2014, and the Counter Terror Expo and the\nFarnborough Airshow 2014.\nThe majority of the files analyzed by FireEye were set to Russian language settings;\nthis circumstance suggests, “that a significant portion of APT28 malware was\ncompiled in a Russian-language build environment consistently over the course of\nsix years.”\nAs usually happens in these cases, in order to profile the attacker the researchers\nanalyzed compile times and discovered that they were aligned with working hours\nin Moscow and St. Petersburg, another element that suggests the involvement of a\nRussia-based team. Nearly 96 percent of the malware was compiled between a\nMonday and Friday during an 8 AM to 6 PM workday in the Moscow time zone.\nThe researchers at FireEye analyzed the malicious code used by the APT28 group\nand their “modus operandi,” the investigation lead the experts to link the APT group\nwith the Russian Government. The APT group “does not appear to conduct\nwidespread intellectual property theft for economic gain, but instead is focused on\ncollecting intelligence that would be most useful to a government.”\n“APT28 appeared to target individuals affiliated with European security organizations\nand global multilateral institutions. The Russian government has long cited\nEuropean security organizations like NATO and the OSCE as existential threats,\nparticularly during periods of increased tension in Europe,” FireEye reported.”\nFurther investigation allowed FireEye to discover that the APT28 is active since 2007\nand it has always targeted the same kind of organizations, including government\nentities, militaries, and security organizations.\nThe hypothesis of state-sponsored hackers\nThe researchers at FireEye explained that the APT28 focused its hacking campaigns\non targets that would be of interest to Russia, such as the Caucasus region with a\nfocus on Georgia.\n“Despite rumors of the Russian government’s alleged involvement in high-profile\ngovernment and military cyber-attacks, there has been little hard evidence of any\nlink to cyberespionage,” said Dan McWhorter, FireEye vice president of threat\nintelligence. “FireEye’s latest advance persistent threat report sheds light on\ncyberespionage operations that we assess to be most likely sponsored by the Russian\ngovernment, long believed to be a leader among major nations in performing\nsophisticated network attacks.”\nThe APT28 ran spear phishing campaign. It used malicious emails to trick victims\ninto to open the infected file or to serve a malicious link.\nFigure 1 – APT 28 Targets (FireEye Report)\nThe malicious code used by the APT 28 appears very sophisticated, the group made\na large use of backdoor that was undetected across the years. Like good detectives,\nlet’s try to summarize which elements of the analysis published by FireEye can help\nus to profile the threat actors.\nEvidence Hypothesis\nChoice of targets indicates a political\nmotivation of the attacks\nThreat Actor is a state sponsored hackerAPT28 has been active since 2007\nSophisticated malicious code that\nrequested a significant effort for the\nFREE TRAINING TOOLS\nPhishing Simulator\nSecurity Awareness\nEDITORS CHOICE\nRELATED BOOT CAMPS\nInformation Security\nSecurity Awareness\nDoD 8140\nEthical Hacking\nHacker Training Online\nSecurity+\nComputer Forensics\nCISA\nCCNA\nPMP\nIncident Response\nMORE POSTS BY AUTHOR\nTop Cybersecurity\nPredictions for 2020\nHoliday Season\nCybersecurity Scams and\nHow to Avoid Them\nCybercrime and the\nUnderground Market\n[Updated 2019]\nHow big is the skills gap, really?\nTop Cybersecurity Predictions\nfor 2020\nGetting started with ethical\nhacking\nPhishing technique: Message\nfrom the boss\nCyber Work podcast: Email\nattack trend predictions for\n2020\nVirtualization-based sandbox\nmalware\nMITRE ATT&CK: System\nshutdown/reboot\nCyber Work: How to become\nan APT hunter with Carbon\nBlack\nDomain vs Workgroup accounts\nin Windows 10\nPhishing techniques: Clone\nphishing\nBluetooth security in Windows\n10\nNetwork traffic analysis for IR:\nBasic protocols in networking\nThe top 5 states for\ncybersecurity jobs\nJackpotting malware\nCyber Work: How data science\nand machine learning are\naffecting cybersecurityAPT28: Cybercrime or State-\nsponsored Hacking?\nPOSTED IN GENERAL SECURITY , HACKING  ON JUNE 4, 2015\n SHAREEthical\nHacking\nTraining\nOUR STUDENTS HAVE THE HIGHEST\nEXAM PASS RATE IN THE INDUSTRY!\nLearn moreTOPICS CERTIFICATIONS CYBERSECURITY CAREERS VIDEOS CONTRIBUTORS ABOUT INFOSEC\n development\nExploitation of Zero-Days\nHacking campaigns managed by APT28\nhit targets that would be of interest to\nRussia\nThreat Actor is RussianMalware Source codes were set to\nRussian language settings\nThe compile times and discovered that\nthey were aligned with working hours in\nMoscow and St. Petersburg\nSecurity experts involved in the investigation believe that APT28 was responsible for\nthe data breach at U.S. State Department  computers in November 2014 aimed to\ngather information to conduct further attacks. The experts speculate that the team\nused the stolen information to compromise an unclassified network  at the White\nHouse accessing sensitive information, including the President Obama agenda.\nFireEye doesn’t confirm that APT28 is behind the two incidents.\nA look to the APT28 Arsenal\nThe APT28 group used for his hacking campaigns numerous common tools,\nincluding a downloader called Sourface (aka Sofacy), the backdoor Eviltoss and a\nmodular implant dubbed Chopstick.\nThe Sofacy downloader was also identified by experts at TrendMicro that assigned to\nthe APT28 the responsibility for the “ Operation Pawn Storm .” Chopstick is considered\na distinctive element of the hacking group because according to the researchers it\n“demonstrates formal coding practices indicative of methodical, diligent\nprogrammers.”\nThe Chopstick agent has a modular structure that gives it flexibility, an essential\nability for long-term use. The researchers at FireEye analyzed two different strains of\nthe CHOPSTICK malware that presented “vastly different functionality”, depending\non modules the authors added to the core of the malware.\nETHICAL HACKING TRAINING – RESOURCES (INFOSEC)\nEarn your CEH,\nguaranteed!\nComplete the form below to receive course pricing.\nFIRST NAME*LAST NAME*\nEMAIL*PHONE*\nORGANIZATION INTERESTED IN STUDENT FINANCING?\n*\nWHO WILL FUND YOUR TRAINING?*TRAINING BUDGET*\nIn the arsenal of the APT28, there is also a Backdoor dubbed Eviltoss that uses\nasymmetric encryption to encrypt syphoned data from victims, and some sample\ndetected by the experts also use SMTP to transfer stolen data outside the\norganization.\n“APT28 is most likely supported by a group of developers creating tools intended for\nlong-term use and versatility, who make an effort to obfuscate their activity,” it wrote.\n“This suggests that APT28 receives direct ongoing financial and other resources from\na well-established organization, most likely a nation state government.”\nThe experts at Trend Micro referred the ATP28 with the name Operation Pawn\nStorm. According to the investigation conducted by Trend Micro, the hacking crew\ncompromised government websites in Poland in June 2014 and in September of the\nsame year; they infected the website for Power Exchange in Poland. The attackers\nexploited several attack techniques, including spear-phishing  to watering hole\nattacks, to serve the SEDNIT malware.\n“The cyber criminals behind Operation Pawn Storm are using several different attack\nscenarios: spear-phishing emails with malicious Microsoft Office documents lead to\nSEDNIT/Sofacy malware, very selective exploits injected into legitimate websites that\nwill also lead to SEDNIT/Sofacy malware, and phishing emails that redirect victims\nto fake Outlook Web Access login pages,” states Trend Micro in a  blog post .\nThe hackers run high-targeted attacks, among the weapons used by the hacking\nteam there is also a collection of malicious iframes pointing to very selective exploits\nthat were also used to compromise the Polish government websites.\nFigure 2 – SEDNIT/Sofacy malware (Trend Micro)\nThe post explains that in an attack on a billion-dollar multinational firm the group\nbehind the Operation Pawn Storm reached via email just three employees.\n“The e-mail addresses of the recipients are not advertised anywhere online,” he\nnoted. “The company in question was involved in an important legal dispute, so this\nshows a clear economic espionage motive of the attackers.”\nThe malware researchers believe that the bad actors behind the Operation Pawn\nStorm have great cyber capabilities, they consider very interesting the use of SEDNIT\nthat was designed to compromise targets and remain persistent in their network to\nsyphon sensitive data.\n“Their choices of targets and the use of SEDNIT malware indicate the attackers are\nvery experienced; SEDNIT has been designed to penetrate their targets’ defenses and\nremain persistent in order to capture as much information as they can.” said Jim\nGogolinski, Senior Threats Researcher at Trend Micro.\nThe hackers also adopted a very effective technique for their phishing campaigns, to\n avoid raising suspicions in fact; they used well-known events and conferences such\nas the Asia-Pacific Economic Cooperation (APEC) Indonesia 2013 and the Middle\nEast Homeland Security Summit 2014 as bait.\nTrend Micro has disclosed the details of its investigation in research in a paper titled\n“Operation Pawn Storm .”\nZero-day\nOn April 2015, researchers at FireEye discovered a new cyber espionage campaign,\ndubbed “Operation RussianDoll,” managed by APT28 group. Differently from\nprevious attacks, the hackers run highly targeted attack by exploiting two zero-day\nvulnerabilities to target an “international government entity”.\nThe hackers exploited security flaws affecting Adobe Flash software (CVE-2015-3043)\nand the Windows operating system (CVE-2015-1701).\n“While there is not yet a patch available for the Windows vulnerability, updating\nAdobe Flash to the latest version will render this in-the-wild exploit innocuous,” states\nthe report  published  by FireEye. “We have only seen CVE-2015-1701 in use in\nconjunction with the Adobe Flash exploit for CVE-2015-3043. We are working with\nthe Microsoft Security Team on CVE-2015-1701.”\n“Because CVE-2015-3043 is already patched, this remote exploit will not succeed on a\nfully patched system,” FireEye said. “If an attacker wanted to exploit CVE-2015-1701,\nthey would first have to be executing code on the victim’s machine. Baring\nauthorized access to the victim’s machine, the attacker would have to find some\nother means, such as crafting a new Flash exploit, to deliver a CVE-2015-1701\npayload.”\nThe iOS Spyware\nThe arsenal of the APT28/ Operation Pawn Storm is rich of surprises demonstrating\nthat the hacking crew is very prolific. Early this year, experts at TrendLabs discovered\nthat the group was using also a mobile spyware. The researchers have found a\npoisoned pawn spyware specifically designed to spy on Apple iOS devices.\n“In our continued research on Operation Pawn Storm, we found one interesting\npoisoned pawn—spyware specifically designed for espionage on iOS devices. While\nspyware targeting Apple users is highly notable by itself, this particular spyware is also\ninvolved in a targeted  attack. ” states a  blog post  published by TrendLabs.\nThe researchers discovered two distinct malicious iOS spyware used by hackers\nbehind the Operation Pawn Storm, a first one dubbed XAgent  and MadCap , this\nsecond name is also the name of a legitimate iOS game .\nAccording to the researchers, the malicious XAgent app was written for iOS 7, but it\nis not optimized to hide its presence on iOS 8 devices, the second app MadCap\ndoesn’t work on jailbroken  devices.\nBoth mobile apps are strains of the SEDNIT spyware that allowed the group to steal\npersonal data, acquiring audio from the microphone and making screenshots. The\nC&C server contacted by the iOS malware is still live according to the malware\nresearchers.\nThe malicious app infected Apple iOS devices without having to jailbreak them.\n“We have seen one instance wherein a lure involving XAgent” states the report.”We\nhave seen one instance wherein a lure involving XAgent simply says “Tap Here to\nInstall the Application.”\nThe attackers used the “lure” website to serve the malware via Apple’s ad-hoc\nprovisioning feature for developers , the malicious application is provided with a .plist\nfile hosted on the remote server.\nExperts discovered also other methods of infection, including the connection of the\niOS devices to a compromised or infected Windows laptop via a USB cable.\nAPT28 is planning to hit financial organizations\nSo far, we have taken the view that the group APT28 is politically motivated and\ntherefore far from the criminal ecosystem, but new revelations complicate the\nscenario.\nA new report published by the intelligence firm root9B  seems to call into question\nthe assertion that the APT28 is a state-sponsored hacking team. The researchers at\nroot9b affirm to have uncovered plans by the APT28 group to target international\nfinancial institutions.\nThe information reveals that the group targeted Bank of America, the Commercial\nBank International (CBI) in the United Arab Emirates, TD Canada Trust, Regions Bank,\nthe United Nations Children’s Fund, United Bank for Africa, and possibly Germany-\nbased Commerzbank.\n“While none of the targeted organizations are clients of root9B, we felt it imperative\nto disclose the findings to them, and as broadly as possible to the security\ncommunity,” said Eric Hipkins, CEO of root9B.\nIn April, the researchers uncovered the plans during a routine investigation; they\nspotted a spear phishing  campaign that was targeting a financial organization in the\nUnited Arab Emirates.\nThe link with the group APT28 is a server used to run the phishing campaign that\nwas previously used by the Russian hackers. The researchers also detected several\ncomponents of a new strain of malware with signatures specific to APT28.\nBy analyzing the fake information used by the hackers to register the phishing\ndomains, the experts discovered other domains set up to target other financial\ninstitutions.\n“While the continued vector of the attack remains unclear, root9B assesses that it will\nmost likely be a spear-phishing campaign. This attack vector will likely use a well-\ncrafted email containing either a malicious file or web hyperlink to what recipients\nbelieve is the actual website; but is instead a fake landing page,” states a report  from\nthe company.\nConclusions\nThe recent report published by root9B  on the APT28 regarding the plans for cyber-\nattacks against financial organizations does not contradict my opinion the initial\nconsiderations on the state-sponsored origin of the APT28 group.\nThe hypothesis of state-sponsored hacking remains the most plausible due to the\nelement highlighted at the beginning of the post. The fact that the hackers are being\ntargeting financial institutions could be analyzed under different perspectives:\n Financial institutions are anyway among critical infrastructure of a country,\nattacking them is one of primary targets for state-sponsored hackers.\nThe overlap between cybercrime and state-sponsored hacking make difficult\nto discriminate their actions, but the elements collected by various teams\ninvolved in the investigation suggest the involvement of high-skilled hackers\nbacked by a government.\nSecurity experts will continue to monitor the group despite the disclosure of its\nactivities that will make it very difficult to track them in the future, because the APT\nsurely will change its TTPs.\nReferences\nhttps://www.fireeye.com/resources/pdfs/apt28.pdf\nhttp://securityaffairs.co/wordpress/29683/intelligence/apt28-fireeye-russian-\nespionage.html\nhttp://securityaffairs.co/wordpress/36105/cyber-crime/apt28-russian-hackers.html\nhttps://www.fireeye.com/blog/threat-research/2015/04/probable_apt28_useo.html\nhttp://securityaffairs.co/wordpress/29517/cyber-crime/operation-pawn-storm.html\nhttp://securityaffairs.co/wordpress/36808/cyber-crime/apt28-financial-\ninstitutions.html\nhttps://www.alienvault.com/open-threat-exchange/blog/from-russia-with-love-sofacy-\nsednit-apt28-is-in-town#When:04:30:00Z\nhttp://blog.trendmicro.com/trendlabs-security-intelligence/operation-pawn-storm-\nthe-red-in-sednit/\nhttp://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/pawn-storm-\nespionage-attacks-use-decoys-deliver-sednit\nhttp://securityaffairs.co/wordpress/36139/cyber-crime/op-pawn-storm-continues.html\nhttp://securityaffairs.co/wordpress/33118/cyber-crime/operation-pawn-storm-ios-\nspyware.html\nhttp://securityaffairs.co/wordpress/36139/cyber-crime/op-pawn-storm-continues.html\nhttp://www.mediafire.com/view/bdr77piwp0ij0qz/FSOFACY.pdf\nhttp://thegoldenmessenger.blogspot.de/2012/12/3-disclosure-of-another-0day-\nmalware.html\nTweet    \nreddit\n \nAUTHOR\nPierluigi\nPaganiniPierluigi Paganini is CTO at Cybaze Enterprise SpA\nPierluigi is member of the ENISA (European Union\nAgency for Network and Information Security) Threat\nLandscape Stakeholder Group, member of Cyber G7\nWorkgroup of the Italian Ministry of Foreign Affairs and\nInternational Cooperation, Professor and Director of the\nMaster in Cyber Security at the Link Campus University.\nHe is also a Security Evangelist, Security Analyst and\nFreelance Writer. Editor-in-Chief at \"Cyber Defense\nMagazine\", Pierluigi is a cyber security expert with over 20\nyears experience in the field, he is Certified Ethical\nHacker at EC Council in London. The passion for writing\nand a strong belief that security is founded on sharing\nand awareness led Pierluigi to find the security blog\n\"Security Affairs\" recently named a Top National Security\nResource for US. Pierluigi is a member of the \"The Hacker\nNews\" team and he is a writer for some major\npublications in the field such as Cyber War Zone, ICTTF,\nInfosec Island, Infosec Institute, The Hacker News\nMagazine and for many other Security magazines.\nAbout Infosec\nAt Infosec, we believe knowledge is the most\npowerful tool in the fight against cybercrime.\nWe provide the best certification and skills\ndevelopment training for IT and security\nprofessionals, as well as employee security\nawareness training and phishing simulations.\nLearn more at infosecinstitute.com .Connect with us\nStay up to date with Infosec\n Follow @infoseceduLeave a Reply\nYour email address will not be published.  Required fields are marked *\nComment  \nName * \nEmail * \nWebsite  \nSave my name, email, and website in this browser for the next time I comment.\n    \nPost CommentShare 0\nLike\nPhishing\ntechnique:\nMessage from the\nboss \n\nCyber Work\npodcast: Email\nattack trend… \n\nVirtualization-\nbased sandbox\nmalware \n\nMITRE ATT&CK:\nSystem\nshutdown/reboot \n\n +  = 9\nLike 300Join our newsletter\nGet the latest news, updates & offers straight\nto your inbox.\nENTER YOUR EMAIL\n SUBSCRIBE\n © INFOSEC RESOURCES 2020\n "
}