{
    "title": "apt29 _ apt groups - apt29 2018 research - wide security",
    "text": "APT29 & APT Groups\nMy Journey in Cyber Security\nAPT29 & APT Groups\nThis report aims to give an understanding about Advanced Persistent Threat (APT). In doing so, I will be\nusing a famous APT group “APT29”. The structure is as follow:\nDescription of APT\nDescription of APT29\nMapping APT29 on the Cyber Kill Chain\nProviding SIEM solutions\nConclusion\nDescription of APT as a Threat:\nI will use the US National Institute of Standards and Technology (NIST) definition of APT:\nAn expert and resourceful adversary with the means to create opportunities to help achieve their goals.\nThe goals of an APT group are establishing and expand their foothold within a compromise system. Most\nAPT groups stay stealthy within a system for long periods of time, either stealing information or waiting\nfor the right time to accomplish their goals. APT groups tend to adapt their mechanism according to the\ndefender’s effort to stop it (NIST, 2011).\nWhy is it a threat?\nMcAfee says that what makes APT groups unique are their motives and persistency to their goals (Dmitri,\n2011). The persistency refers to the continuous act of launching attacks against their target (Frankie,\n2011).\nThe goal of APT is to gain data on intellectual property over an extended period of time due to its stealthy\nnature, rather than being focused on immediate financial gain like most attacks. Often times, these APT\nattacks make use of either trusted connections or insider threat to target systems (ISACA, 2013).\nAll of this, plus the fact that the APT group behind the attack are comprised of expert hackers, all that\nthere is left is the motivation. The motivation comes from the APT group being either cyber mercenaries\n(Kaspersky, 2013) or work for a governmental cyber unit (Mandiant, 2013).\nDescription of APT29\nAs mentioned, this report will look into a famous APT group called APT29. This group goes by many\nnames (Cozy Bear, APT29, the Dukes etc.), and it’s usually given by the cybersecurity firm that’s\ninvestigating the group (Anon, 2016).\nOverview of APT29:\nThis APT group is very well adaptive and disciplined. They hide within their targets network and\ncommunicates irregularly and in a way that looks like a legitimate network traffic. APT29 is considered to\nbe one of the most advanced and capable APT threat groups. They are also very flexible, constantly\npatching their own bugs and add new features by deploying new a backdoor. They also have a fast\ndevelopment cycle for their malware and quickly alters their tools in order to remain undetected (Anon,\n2016) . APT29 also likes to monitor the network defender’s activity to constantly be in control of the\nsystem.\nMotivations and Af liation:\nAPT29 is believed to have close affiliations with the Russian Intelligence services and to be engaged with\npolitical and economic espionage. Their attacks are typically against West Governments which benefits\nthe Russian Government (Dmitri, 2016) .\nAPT29 Activity in the recent years :\nIn recent times, the group APT29 has been known for the 2016 Democratic National Committee hack:\n \nThe attack happened in 2016, where APT29 coordinated cyber-attacks towards the Democratic National\nCommittee (DNC) (Dmitri, 2016). It is believed that the goal of that was to assist Donald Trump in winning\nthe presidency (Adam et al, 2016).\nThe impact of APT29:\nThe elaborated hacks from APT29 has brought a massive attention to cyber espionage from Russian\nGovernment. This in turn, forces Governments to be more careful with their cyber security and\npersonnel.Search …\nRECENT POSTS\n[HTB] Writeup Walkthrough\nNovember 6, 2019\n[HTB] Bastion Walkthrough\nSeptember 16, 2019\nLinux Enumeration  May 9,\n2019\nPowershell: Extract O365\nUsers and License Type\nJanuary 16, 2019\nUsing Powershell to Export\nGroup Members from Active\nDirectory  December 18, 2018\nCATEGORIES\nHack the Box Walkthroughs\nInfrastructure Pentesting\nKali Linux\nLinux\nLog Management/Analysis\nManagement Side\nRandom\nSystem Administration\nTalks\nWeb Application Security\nWindows Security\nARCHIVES\nNovember 2019\nSeptember 2019\nMay 2019\nJanuary 2019\nDecember 2018\nNovember 2018\nOctober 2018\nSeptember 2018\nAugust 2018\nJuly 2018\nHITS\nAD:\nWIDE  SECURITYHOME CONTENT\n BOOKS\n ABOUT ME CONTACT ME CTF SCORES\n This had a massive social impact as it is believed that the goal of that was to assist Donald Trump in\nwinning the presidency (Adam et al, 2016). With the DNC hack, the USA launched an ongoing\ninvestigation of Donald Trump presidential campaign and any Russian interference in the This\ninvestigation touches on any possible links between Donald Trump and the Russian Government\n(Rod, 2017).\nAPT29 and the Cyber Kill Chain:\nIn this section, I will be using the cyber kill chain to do the mapping of tactics and techniques of the APT29\ngroup. Cyber Kill Chain are phases or stages of a targeted attack. Each stage presents an opportunity to\ndetect and react to an attack (Lockheed Martin, Unknown) . These stages form a link which if broken, it can\nstop the attack. Each stage will link back to the DNC Hack that occurred in 2016, that way we are able to\nsee each stage of the attack and possibly prevent future ones.\nReconnaissance:\n The first stage is when APT29 collects information on the target. The report by the DHS and FBI shows\nthat there are two main reconnaissance techniques used on the DNC hack, one was network scanning\nand the other was credential harvesting.\nThe network scanning was done in an attempt to find websites that are vulnerable to cross-site scripting\n(XSS) and Structured Query Language (SQL) injections. These vulnerabilities were exploited to allow APT29\ninto the DNC network.\nThe other method is credential harvesting pages. A spear-phishing email was used in this method to get\nusers to click a link where they had to enter their details. This was effective to APT29 and gave them\naccess to their network through legitimate credentials (DHS & FBI, 2016).\nWeaponization:  \nAPT29 is well-known for their skills in embedding malicious macros into files (PDF, Word) as part of the\nWeaponization stage (Eyal, 2018) . The same report by Eyal, shows that APT29 made use of Microsoft\nOffice Documents to create a macro that would launch a backdoor PowerShell code called\nPOSHSPY/PowerDuke.\nThis file with the malicious code was sent in a spear-phishing email to the DNC. PowerDuke was\nembedded as a backdoor while POSHSPY was embedded as a second backdoor.\nDelivery: \nThis stage is how APT29 delivers the weaponized files to their target. It is widely known that APT29\ntraditionally use spear-phishing emails to infect their targets with malicious attachments or URL’s with\nmalicious payload (DHS & FBI, 2016). This method of delivery was used on the DNC hack in 2016 by APT29\n(Steven, 2016).\nExample of spear-phishing email by APT29:\nFigure 3: Spear-phishing email from APT29 (Steven, 2016)\n Exploitation:\n The exploit stage refers to APT29 taking advantage of a vulnerability to for their gain. In the DNC hack it is\nsafe to say that APT29 made use of Human Engineering (spear-phishing) skill to exploit the weakest link in\nany organisation – humans.\nAPT29 also developed a number of malware to exploit common vulnerabilities and exposures (CVEs)\nwithin a system. APT29 also commonly targets Microsoft Office exploits because of its popularity amongst\nusers/organisations (SecurityWeek News, 2016).\nSome of the Microsoft Office exploits used by APT29 in the past are:\nCVE-2015-1641:  Microsoft Office Memory Corruption Vulnerability (NIST, 2015-2017)\nCVE-2009-3129:  Microsoft Office Compatibility Pack for Remote Attacks (NIST, 2009-2017)\nCVE-2014-1761:  Microsoft Office Denial of Service (Memory Corruption) (NIST, 2014)\nInstallation:\n This stage defines the installation of the malicious code in the victim’s system which allows APT29 to\npermanently remain there until kicked out (Lockheed Martin, Unknown). In the DNC hack, users were sent\na spear-phishing email, within this email there was a zip file:\nFigure 4: DNC Zip contaminated File (Steven, 2016)\n Inside this zip file there was a decoy document with a dropper. This dropper would drop APT29 backdoor\nin the user’s system (“%APPDATA%\\Roaming\\”). Then after the main backdoor which was PowerDuke was\ninstalled, APT29 would download POSHSPY straight from their Command and Control Server (Eyal, 2018).\nCommand & Control:\n  This stage refers to the communication between the hosts (APT29) and the infected system (DNC).\nDuring the DNC hack, CrowdStrike found out that APT29 was using a malware called SeaDaddy. This\nmalware allowed APT29 to program a specific schedule to launch a malicious code. Therefore,\ncommunicating to and from the server.\nFigure 5: SeaDaddy Implant Indicators of Compromise (IOC) (Dmitri, 2016)\n Actions on Objectives:\n The last stage is the Actions on the Objective. So, what was APT29 end goal and did they achieve it? Yes.\nAlthough, the goal is not necessarily clear, we have an ongoing federal investigation on the President of\nthe United States Donald Trump and the Hack made by APT29 (Rod, 2017). Perhaps, the goal was to elect\nTrump into presidency. This means that the original goal of APT29 was to steal intellectual property, such\nas Email accounts and passwords (Dmitri, 2016). This stolen information was then leaked via WikiLeaks,\nwhich in turn harmed the DNC reputation thereby favouring Trump on winning the presidency (Adam et\nal, 2016).\nProviding SIEM Solutions\nIn the fourth section of this report, I will be providing SIEM solutions to different phases of the kill chain\nmentioned in the third section. As well, as solutions I will be also identifying relevant Indicators of\nCompromise.\nSolution for Reconnaissance stage:\nIn the reconnaissance stage a solution to networking scanning is to have a security analyst identifying the\ntypes of scans that are carried out against their systems that way the security analysist is able to identify\nand patch vulnerabilities within their system. A famous tool to help with this task is Splunk.\nIndicators of Compromise and further solution:\nCommon IOC’s are IP Addresses. A solution would be to feed normal traffic to the system and flag\nanything that stands out from the traffic it was fed. Geoff Webb, a director of solution strategy for NetIQ\nsaid that compromised system will send traffic back to its attackers during Command and Control phase\nand a security analyst could identify a threat before any real damage is done (Geoff W, 2014).\nGeoff also mentions credential harvesting. A method used by APT29 on the DNC hack. A mitigation is to\nmonitor the changes in the behaviour of users with escalated privileges as a hacker might be trying to\nestablish a foothold in the network. A security analyst would look for: time of activity, systems accessed,\nand the type of information accessed (Geoff W, 2014).\nThis can also be used by a Security Operation Centre Analyst to detect Actions on Objective before any\ndata is stolen just by looking for any signs of files and user credentials being moved within their own\nnetwork.\nSolution for Delivery stage:\nPerform analysis of their system to identify any malicious email that is similar to APT29 common spear-\nphishing email themes. For instance, the defender would gather emails sent by APT29 and analyse their\nsubject heading, text and their themes.\nFigure 6: DNC Spear-Phishing Email Header (Steven, 2016)\nAn example is given above, we see a topic from current events which is the election rigging in the U.S.\nSince that is a hot topic, it is likely to be opened due to curiosity. This is a form of psychology used by APT\ngroups but especially APT29. Another example of email sent by APT29 during the DNC hack is:\nFigure 7: Phishing email by APT29 (KrebsonSecurity, 2016)\n We can see common similarities to the previous email shown, they all have a link to a password\nprotected zip file and they all focus on recent events (U.S.A 2016 Election). The security analyst can use\nthis in his favour and blacklist certain emails or set up an alert that would go off whenever an email\nsimilar to the ones mentioned is received.\nSolution for Installation stage:\n Wide SecuritySecurity analysists could review their systems for any unauthorized web shells which is another indicator\nof compromise. Web shell is a script that can be used on a web server to allow remote administration of\nthat machine (US-Cert, 2015). This can also be used to leverage other exploitation techniques, so it is\nimportant for the security analyst to review their system often to try preventing this from escalating.\nConclusion\nTo conclude, the threat of APT is ever growing and often companies don’t know how to deal with it due to\nits complexity and its stealthy nature. I believe that in order to detect attacks from any APT group, the\nsecurity analyst must use tools to help them analyse traffic. Since reconnaissance is the most important\nstage of an attack, it is important to use software such as Splunk to analyse logs to prevent any damage\nbeing done.\n \nReferences\nPrevious:  Dashboard on Kibana Next:  Graylog Installation Tutorial \n "
}