{
    "title": "apt28_ turla nation-state groups deployed multiple",
    "text": "Search Dark Reading\nNetwork Computing Dark Reading\n Welcome Guest Login to your account Register Advertise About Us\nFollow DR:\n Authors Slideshows Video Tech Library University Radio Calendar Black Hat News\nTHE\nEDGEANALYTICS ATTACKS /\nBREACHESAPP SEC CAREERS &\nPEOPLECLOUD ENDPOINT IoT OPERATIONS PERIMETER RISK THREAT\nINTELLIGENCEVULNS /\nTHREATS\nSPONSORED CONTENT\nNew 'Perimeter' Requires Fresh Security\nApproach, Onapsis Say\nThe advent of mobility, cloud, and different ways of securing business-\ncritical apps has given rise to the idea that \"The perimeter is where the\ndata is,\" posits Jason Fruge, VP of business application cybersecurity\nfor Onapsis. As a former CISO himself, he describes how this new\nreality impacts customers' security planning and execution.\nLEARN MORE\nBrought to you by AxoniusSponsored Content\nAsset Management Trends: As IT\nComplexity Increases, Visibility Plummets\nThis eBook highlights the current asset visibility challenges\nthat IT and security teams are facing as the IT landscape\nbecomes more complex.\nCOMMENT   | EMAIL THIS   | PRINT   | RSS\nWebcasts\nSecurity Alert Fatigue:\nTips for Taking Control\nThe ROI Story:\nIdentifying & Justifying\nDisruptive Technology\nMORE WEBCASTS\nWhite Papers\n2020 IT Salary Survey\nResults Revealed\nNetFlow vs Packet\nData\nMORE WHITE PAPERS\nReports\n2020 IT Salary Survey\nResults Revealed\n[Report] DevSecOps &\nSecure App Delivery:\nWhat's Working &\nWhat's Not\nMORE REPORTS\n50%\n 50%\n0 COMMENTS\nCOMMENT NOW\nTweet\n5/11/2017\n01:00 PM\nJai Vijayan\nNews\nConnect Directly\nLogin\nNEWEST FIRST   |  OLDEST FIRST   |  THREADED VIEW\nAPT28, Turla Nation-State Groups\nDeployed Multiple 0Days in Recent\nAttacks\nAttack campaigns by APT28, Turla, and an unidentified group\nshowcase easy availability of zero-days.\nThreat actors rarely ever need zero-day flaws to breach enterprise networks.\nBut there appears to be a plentiful supply of such vulnerabilities for those who\ndo.\nA flurry of recent exploit activity targeting government, military, and banking\nentities mostly in Europe and the Middle East is one example.\nSecurity vendors ESET  and FireEye  this week issued separate advisories on\ncyberattacks involving the use of three Microsoft zero-day flaws. Two of them\ninvolved the Encapsulated PostScript (EPS) function in Microsoft Office, while\nthe third was a privilege escalation flaw in Windows.\nMicrosoft addressed all three issues in its monthly security update for May\nthis week.\nIn its advisory, FireEye said it had seen the three flaws being exploited in\nattacks by an unidentified group and also by APT28 and Turla, two previously\nknown Russian cyber espionage groups. The unknown group appeared to be\nmotivated by financial gain and was focused mainly on regional and global\nbanks operating in the Middle East. The APT28 and Turla attacks were likely\ntargeted at extracting geopolitical intelligence from targets in Europe.\nThe attacks by Turla and the unknown group involved the use of CVE-2017-\n0261 , a remote code execution flaw that allowed attackers to gain\nadministrative access on vulnerable systems. The EPS vulnerability,\naccording to Microsoft, could be exploited by getting users to open an Office\nfile with a malformed image or by getting them to insert a malformed image\ninto an Office file.\nThe APT28 group's attacks meanwhile exploited two zero-day flaws; CVE-\n2017-0262 , a remote code execution vulnerability in EPS handling that was\nnearly identical to the other EPS zero-day; and CVE-2017-0263 , an\nescalation of privilege flaw in Windows.\nAPT28's objective in using the two zero-day flaws was to drop Seduploader, a\nreconnaissance tool that the group is well known for using to steal\nconfidential information from targets, ESET said in its blog.\n\"These vulnerabilities show that financially motivated actors have access to\nsome of the most sophisticated tools that are sometimes thought to be the\nsole purview of nation states,\" says Benjamin Read, a security analyst at\nFireEye. \"The use of multiple zero-days by Russian actors underscores the\ntechnically sophisticated threat from cyber espionage groups in that country,\"\nhe says.\nMarc-Etienne Leveille, malware researcher at ESET, says that since 2015, the\ncompany has observed the APT28 group use at least 12 different zero-days\nexploits—six in 2015, four in 2016, and two so far in 2017.\nThe group, which is also known as Sofacy, Fancy Bear, and Sednit, has been\nactive for more than 10 years, so the actual number of zero-days it has used\nin that period is likely to be much higher. APT28 is believed to have been\ninvolved in the attacks on the Democratic National Committee (DNC) and has\nbeen cited as proof of Russian involvement in the attack. Most recently, the\nthreat group is believed  to have been behind an attempt to gain access to the\nemail accounts of those involved in just elected French President Emmanuel\nMacron's campaign.\n\"Because of the amount of zero-days they've used in the past few years, we\ncan assume that they either have very skilled people or enough financial\nresources to maintain this trend,\" Leveille says.\nESET does not have information on pricing in the Dark Market for zero-day\nflaws such as the two used by APT28 in its most recently observed\ncampaigns. But based on prices from zero-day acquisition platform Zerodium ,\nit is likely that the two exploits combined could cost up to $70,000. \"Finding or\nwriting new reliable zero-day exploits is not an easy task,\" he says.\nRelated Content:\n30% of Q4 Malware was New or Zero-Day\n10 Free or Low-Cost Security Tools\nDark Reading Radio: 'Bug Bounties & The Zero-Day Trade'\nWhat To Do When All Malware Is Zero-Da y\n \nJai Vijayan is a seasoned technology reporter with over 20 years of\nexperience in IT trade journalism. He was most recently a Senior Editor at\nComputerworld, where he covered information security and data privacy\nissues for the publication. Over the course of his 20-year ... View Full Bio\nINSIGHTS\nMORE INSIGHTS\nCOMMENTS\nBe the first to post a comment  regarding this story.\n3 Many Ransomware Attacks Can be\nStopped Before They Begin\nJai Vijayan, Contributing Writer,  3/17/2020\n2 This Tax Season, Save the Scorn\nand Protect Customers from\nPhishing Scams\nDr. Salvatore Stolfo, Founder & CTO, Allure\nSecurity,  3/17/2020\n1 Fewer Vulnerabilities in Web\nFrameworks, but Exploits Remain\nSteady\nRobert Lemos, Contributing Writer,  3/16/2020\nSUBSCRIBE TO NEWSLETTERS\nWEBINAR ARCHIVESBuilding an Enterprise Strategy for Detection and\nResponse (XDR)\nChatbots for the Enterprise\nSecurity Alert Fatigue: Tips for Taking Control\nMORE WHITE PAPERSWHITE PAPERS\n2020 IT Salary Survey Results Revealed\nNetFlow vs Packet Data\nApplication Security in the Cloud\nHacker's Almanac\nMaximize the ROI of Detection and Response\nALL VIDEOSVIDEO\nCARTOON ARCHIVECARTOON\nLatest Comment: Unfortunately nobody wants to spend\nmoney on security. Usually they change their mind but\noften it is too late\nDOWNLOAD THIS ISSUE!\n6 Emerging Cyber Threats That\nEnterprises Face in 2020\nThis Tech Digest gives an in-depth look at six emerging\ncyber threats that enterprises could face in 2020.\nDownload your copy today!\nBACK ISSUES  | MUST READSCURRENT ISSUE\nALL POLLSFLASH POLL\nHas the U.S. political climate caused\nyou to make infosecurity-related\nchanges to your disaster\nrecovery/business continuity plans?\n Yes\n No\n No but we are considering it\n Still waiting for cybersecurity guidance from\nTrump admin EO\n Don't know\n Other (Please explain in the comments)\nSubmit\nDOWNLOAD NOW!\nState of Cybersecurity Incident\nResponse\nData breaches and regulations have forced\norganizations to pay closer attention to the security\nincident response function. However, security leaders\nmay be overestimating their ability to detect and respond\nto security incidents. Read this report to find out more.\nHow Enterprises Are Developing and\nMaintaining Secure Applications0 COMMENTS\nHow Enterprises are Attacking the\nCybersecurity Problem0 COMMENTS\nHow Data Breaches affect the Enterprise\n0 COMMENTS\nMORE REPORTS\nTWITTER FEED\nBUG REPORT\nENTERPRISE VULNERABILITIES\nFrom DHS/US-CERT's National Vulnerability Database\nCVE-2019-14872\nPUBLISHED: 2020-03-19\nThe _dtoa_r function of the newlib libc library, prior to\nversion 3.3.0, performs multiple memory allocations\nwithout checking their return value. This could result in\nNULL pointer dereference.\nCVE-2019-20485\nPUBLISHED: 2020-03-19\nqemu/qemu_driver.c in libvirt before 6.0.0 mishandles\nthe holding of a monitor job during a query to a guest\nagent, which allows attackers to cause a denial of\nservice (API blockage).\nCVE-2019-19677\nPUBLISHED: 2020-03-18\narxes-tolina 3.0.0 allows User Enumeration.\nCVE-2019-19676\nPUBLISHED: 2020-03-18\nA CSV injection in arxes-tolina 3.0.0 allows malicious\nusers to gain remote control of other computers. By\nentering formula code in the following columns:\nKundennummer, Firma, Street, PLZ, Ort, Zahlziel, and\nBemerkung, an attacker can create a user with a name\nthat contains malicious code. Other use...\nCVE-2020-10365\nPUBLISHED: 2020-03-18\nLogicalDoc before 8.3.3 allows SQL Injection.\nLogicalDoc populates the list of available documents\nby querying the database. This list could be filtered by\nmodifying some of the parameters. Some of them are\nnot properly sanitized which could allow an\nauthenticated attacker to perform arbitrary queri...THREAT INTELLIGENCE\nLike\nShare\nADVERTISEMENT. CLICK FOR SOUND.\nNew 'Perimeter' Requires Fresh Security \n …\nHOT TOPICS EDITORS' CHOICE\n WEBINARS  \n REPORTS  \nDiscover More From Informa Tech\nInterop\nInformationWeek\nNetwork ComputingIT Pro Today\nData Center Knowledge\nBlack HatContact us\nAbout Us\nAdvertise\nReprintsWorking With Us Follow DarkReading On Social\nHome Cookies CCPA: Do not sell my personal info Privacy Terms\nCopyright © 2020 Informa PLC Informa UK Limited is a company registered in England and Wales with\ncompany number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.6 COMMENTS\nRansomware Trains Its\nSights on Cloud ...\n1 COMMENTS\nQualys Launches Free\nApp for IT Asset ...\n×This site uses cookies to provide you with the best user experience possible. By using Dark\nReading, you accept our use of cookies.\n "
}