{
    "title": "apt39 conducts cyberespionag operations targeted at the middle east - soc prime",
    "text": "Delaware, USA – January 31, 2019 – The newly discovered Iranian APT group collects personal information about its victims\nattacking telecommunications and traveling companies. The primary targets of APT39 attacks are located in the Middle East and\nthe United States. FireEye researchers discovered the group’s operations at the end of 2018 and tracked its activities to 2014.\nAPT39 is linked with other well-known Threat Actor, APT34 (in addition to using similar malware, the groups’ targets and\ninfrastructure are partially matched). The researchers think that attackers can collect data and prepare a foothold for the further\noperations of other Iranian groups. The main tools of APT39 are SEAWEED and CACHEMONEY backdoors, in addition, the\nattackers modified the POWBAT backdoor for their purposes. After the initial compromise, members of the group also use both\nlegitimate Windows programs and publicly available tools like Mimikatz. Stolen data before exfiltration is usually archived using\nWinRAR or 7-ZIP.\nRecently, Iran has been actively conducting operations in the Middle East, including devastating attacks of APT33 using Shamoon\nmalware  and less sophisticated cyber espionage campaigns of Leafminer group . To detect the actions of skilled attackers in a\ntimely manner, you can use the  APT Framework  rule pack, which adds sophistication to your existing security solutions connecting\nthe dots between low-level SIEM incidents and linking them to high-confidence compromises:\nhttps://my.socprime.com/en/integrations/apt-framework-arcsightSEARCH:\nFOLLOW US ON:\n\n\n\n\nRELATED POSTS\nBlackWater Backdoor Finds New\nWay to Misuse Cloudflare\nWorkers\nTurla APT Uses NetFlash\nDropper and PyFlash Backdoor\nin Watering Hole Attacks\nHacker Wars: njRat Hides in\n“Free” Hacking Tools Published\non Underground ForumsSearch...  Search\nPRODUCTS\nThreat Detection Marketplace\nPredictive Maintenance\nContinuous Compliance\nSOC Workflow AppSOLUTIONS\nSOC Use CasesSERVICES\nATT&CK Audit\nThreat Hunting as a ServiceCOMPANY\nAbout\nCustomers\nPartners\nDevelopers\nLeadership\nBlog\nNews\nCOOKIE POLICY PRIVACY POLICY PORTAL TERMS AND CONDITIONS\nPRIVACY FAQ\n\nSOC Prime, SOC Prime Logo and Threat Detection Marketplace are registered trademarks of SOC Prime, Inc. All other trademarks are the property of their respective owners.APT39 CONDUCTS CYBERESPIONAG OPERATIONS TARGETED AT THE\nMIDDLE EAST\nPRODUCTS  SOLUTIONS  SERVICES  COMPANY  SIGN UP\n Your Email SIGN IN\nThis site uses cookies and other tracking technologies to assist with navigation and your ability to provide feedback, analyse your use of our products and services, assist with our promotional and\nmarketing efforts, and provide content from third parties. Cookie Policy . DetailsREFUSE COOKIES  ACCEPT COOKIES\n "
}