{
    "title": "apt30 behind a long-running cyber espionage campaignsecurity affairs",
    "text": "Most organizations have yet to fix CVE-2020-0688 Microsoft Exchange   MUST READ\nHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  \nTerrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\nSponsored Content\nDigging the Deep Web: Exploring the dark side of the\nweb\nYoroi Blog\nYoroi Blog\nSponsored Content\nSponsored Content\nSponsored Content\nSponsored ContentAPT30 behind a long-running cyber espionage\ncampaign\nApril 13, 2015  By Pierluigi Paganini\nSHARE ON             \nPierluigi PaganiniResearchers at FireEye uncovered a new threat actor dubbed\nAPT30 that run a decade-long cyber espionage campaign\nbacked by the Chinese Government.\nSecurity experts at FireEye have uncovered a new long-running cyber espionage campaign, the\nresearchers speculate that the campaign is active since at least 2005.\nThe threat actor behind the campaign was dubbed APT30 by the researchers, its operation\ninvolved seasoned high-skill software developers.\nThe APT30 group targeted various industries demonstrating a predilection for organizations involved\nin governmental intelligence activities. The APT30 targeted organizations located in Asian countries,\nincluding Malaysia, Vietnam, Thailand, Nepal, Singapore, Philippines and Indonesia.\n““APT30 predominantly targets entities that may\nsatisfy governmental intelligence collection\nrequirements. The vast majority of APT30’s victims\nare in Southeast Asia. Much of their social\nengineering e orts suggest the group is\nparticularly interested in regional political,\nmilitary, and economic issues, disputed territories,\nand media organizations and journalists who report\non topics pertaining to China and the government’s\nlegitimacy” states the report  published by FireEye.\nThe researchers at FireEye explained that the APT30 uses three strains of malware specifically\ndesigned to infect and exfiltrate data from system inside air-gapped networks .\n“While APT30 is certainly not the only group to build functionality to infect air-gapped networks into their\noperations, they appear to have made this a consideration at the very beginning of their development efforts in\n2005, significantly earlier than many other advanced groups we track,”  continues the report.\nThe APT30 has many other tools in its arsenal that includes backdoors, malware with the ability to\ncompromise air-gapped networks, downloaders and many others. Some of these tools were used only\nby the APT30 operators.\nDifferently from other APT, hackers of the APT30 haven’t changed their attack tools, tactics, and\nprocedures (TTPs) over the years.\n” The group (or the developers supporting them) systematically labels and keeps track of their malware\nversioning. The malware uses mutexes and events to ensure only a single copy is running at any given time, and\nthe malware version information is embedded within the binary. Malware C2 communications include a version\ncheck that allows the malware to update itself to the latest copy, providing a continuous update management\ncapability.” states the report.\nWho is behind the APT30?\nBy the analysis of the technical capabilities of the attackers, its TTPs, and the nature of the targets, the\nexperts speculate that operations are backed by the Chinese government.\n “Advanced threat group like APT 30 illustrate that state-sponsored cyber espionage  affects a variety of\ngovernments and corporations across the world,” explained Dan McWhorter, VP of threat intelligence at FireEye.\n“Given the consistency and success of APT 30 in Southeast Asia and India, the threat intelligence on APT 30 we\nare sharing will empower the region’s governments and businesses to quickly begin to detect, prevent, analyze\nand respond to this established threat.”\nPierluigi Paganini\n(Security Affairs  –  APT30, FireEye)\n air gapped networks APT30 China cyber espionage FireEye Intelligence\nstate sponsored hackersShare this...\nAlways Enabled Necessary \n Copyright 2015 Security Affairs by Pierluigi Paganini All Right Reserved. Back to top \nHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  \nLaws and regulations  Malware  Mobile  Reports  Security  Social Networks  Terrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\nPierluigi Paganini is member of the ENISA (European Union Agency for Network\nand Information Security) Threat Landscape Stakeholder Group and Cyber G7\nGroup, he is also a Security Evangelist, Security Analyst and Freelance Writer.\nEditor-in-Chief at \"Cyber Defense Magazine\", Pierluigi is a cyber security expert\nwith over 20 years experience in the field, he is Certified Ethical Hacker at EC\nCouncil in London. The passion for writing and a strong belief that security is\nfounded on sharing and awareness led Pierluigi to find the security blog\n\"Security Affairs\" recently named a Top National Security Resource for US.\nPierluigi is a member of the \"The Hacker News\" team and he is a writer for some\nmajor publications in the field such as Cyber War Zone, ICTTF, Infosec Island,\nInfosec Institute, The Hacker News Magazine and for many other Security\nmagazines. Author of the Books \"The Deep Dark Web\" and “Digital Virtual\nCurrency and Bitcoin”.\nTrump signed a bill to help small\ntelecoms replace Huawei equipment\nMarch 14, 2020  By Pierluigi PaganiniMost of the attacks on Telecom\nSector in 2019 were carried out by\nChina-linked hackers\nMarch 5, 2020  By Pierluigi PaganiniYOU MIGHT ALSO LIKE\nPREVIOUS ARTICLE\nHackers took over social media accounts\nof Iranian state Al Alam TV\n NEXT ARTICLE\nA global operation took down the Simda\nbotnet\nThis site uses cookies, including for analytics, personalization, and advertising purposes. For more information or to change your cookie settings, click here.\nIf you continue to browse this site without changing your cookie settings, you agree to this use.\n Read More Accept\n "
}