{
    "title": "apt39_ an iranian cyber espionage group focused on personal information _ fireeye inc",
    "text": "Țħřěǻț Řěșěǻřčħ\nǺPȚ39: Ǻň İřǻňįǻň Čỳbě ř Ěșpįǿňǻģě Ģ řǿųp Fǿčųșěđ ǿň\nPěřșǿňǻŀ İňfǿřmǻțįǿň\nJǻňųǻřỳ 29, 2019  | bỳ Șǻřǻħ Ħǻẅŀěỳ, Běň Řěǻ đ, Čřįșțįǻňǻ Břǻfmǻň-Ķįțțňě ř, Ňǻŀǻňį Fřǻșěř, Ǻňđřěẅ Țħǿmp șǿň, Ỳųřį\nŘǿżħǻňșķỳ, Șǻňǻż Ỳǻșħǻř\nİŘǺŇ \nǺPȚ\nŲPĐǺȚĚ (Jǻň. 30): Fįģųřě 1 ħǻș běěň ųpđǻțěđ țǿ mǿřě ǻččųřǻțěŀỳ řěfŀěčț ǺPȚ 39 țǻřģěțįňģ. Șpěčįfįčǻŀŀỳ, Ǻ ųșțřǻŀįǻ,\nŇǿřẅǻỳ ǻňđ Șǿųțħ Ķǿřěǻ ħǻvě běěň řěmǿvěđ.\nİň Đěčěmbě ř 2018 , FįřěĚỳě įđěňțįfįěđ ǺPȚ39 ǻș ǻň İřǻňįǻň čỳbě ř ěșpįǿňǻģě ģ řǿųp řěșpǿňșįbŀě fǿř ẅįđěșpřěǻđ\nțħěfț ǿf pě řșǿňǻŀ įňfǿ řmǻțįǿň. Ẅě ħǻvě ț řǻčķěđ ǻčțįvįțỳ ŀįňķě đ țǿ țħįș ģřǿųp șįňčě Ňǿvěmbě ř 2014 įň ǿřđěř țǿ\npřǿțěčț ǿ řģǻňįżǻțįǿňș fřǿm ǺPȚ 39 ǻčțįvįțỳ țǿ đǻțě. ǺPȚ 39’ș fǿčųș ǿň țħě ẅįđěșpřěǻđ țħěfț ǿf pě řșǿňǻŀ\nįňfǿřmǻțįǿň șěțș įț ǻpǻřț fřǿm ǿțħě ř İřǻňįǻň ģ řǿųpș FįřěĚỳě țřǻčķș, ẅħįčħ ħǻvě běěň ŀįňķě đ țǿ įňfŀųěňčě\nǿpěřǻțįǿňș, đįșřųpțįvě ǻțțǻčķ ș, ǻňđ ǿțħěř țħřěǻțș. ǺPȚ39 ŀįķěŀỳ fǿč ųșěș ǿň pěřșǿňǻŀ įňfǿ řmǻțįǿň țǿ șųppǿřț\nmǿňįțǿřįňģ, țřǻčķįňģ, ǿ ř șųřvěįŀŀǻňčě ǿpě řǻțįǿňș țħǻț șěřvě İřǻň’ș ňǻțįǿňǻŀ p řįǿřįțįěș, ǿř pǿțěňțįǻŀŀỳ țǿ č řěǻțě\nǻđđįțįǿňǻŀ ǻččě șșěș ǻňđ věčțǿřș țǿ fǻčįŀįțǻțě f ųțųřě čǻmpǻįģň ș. \nǺPȚ39 ẅǻș čřěǻțěđ țǿ břįňģ țǿģěțħě ř přěvįǿųș ǻčțįvįțįě ș ǻňđ měțħǿ đș ųșěđ bỳ țħįș ǻčțǿř, ǻňđ įțș ǻčțįvįțįě ș\nŀǻřģěŀỳ ǻŀįģň ẅįțħ ǻ ģřǿųp pųbŀįčŀỳ řěfěřřěđ țǿ ǻș \"Čħǻfě ř.\" Ħǿẅěvěř, țħěřě ǻřě đįffěřěňčěș įň ẅħǻț ħǻș běěň\npųbŀįčŀỳ řěpǿřțěđ đųě țǿ țħě vǻ řįǻňčěș įň ħǿẅ ǿřģǻňįżǻțįǿňș țřǻčķ ǻčțįvįțỳ. ǺPȚ 39 přįmǻřįŀỳ ŀěvěřǻģěș țħě\nȘĚǺẄĚĚĐ ǻňđ ČǺČĦĚMǾŇĚỲ bǻčķđǿǿřș ǻŀǿňģ ẅįțħ ǻ șpěčįfįč vǻ řįǻňț ǿf țħě PǾẄBǺȚ bǻčķ đǿǿř. Ẅħįŀě\nǺPȚ39'ș țǻřģěțįňģ șčǿpě įș ģŀǿbǻŀ, įț ș ǻčțįvįțįě ș ǻřě čǿňčěňț řǻțěđ įň țħě Mį đđŀě Ěǻșț. ǺPȚ39 ħǻș přįǿřįțįżěđ țħě\nțěŀěčǿmm ųňįčǻțįǿň ș șěčțǿř, ẅįțħ ǻđđįțįǿňǻŀ țǻ řģěțįňģ ǿf țħě ț řǻvěŀ įňđųșțřỳ ǻňđ İȚ fįřmș țħǻț șųppǿřț įț ǻňđ țħě\nħįģħ-țěčħ įň đųșțřỳ. Țħě čǿ ųňțřįěș ǻňđ įňđųșțřįěș țǻřģěțěđ bỳ ǺPȚ 39 ǻřě đěpįčțěđ įň Fįģųřě 1.\nFįģųřě 1: Čǿųňțřįěș ǻňđ įňđųșțřįěș țǻřģěțěđ bỳ ǺPȚ 39\nǾpěřǻțįǿňǻŀ İňțěňț\nǺPȚ39'ș fǿčųș ǿň țħě țěŀěčǿmm ųňįčǻțįǿň ș ǻňđ țřǻvěŀ įňđųșțřįěș șųģģěșțș įňțěňț țǿ pě řfǿřm mǿňįțǿ řįňģ, țřǻčķįňģ,\nǿř șųřvěįŀŀǻňčě ǿpě řǻțįǿňș ǻģǻįňșț șpěčįfįč įň đįvįđųǻŀș, čǿŀŀěčț p řǿpřįěțǻřỳ ǿř čųșțǿměř đǻțǻ fǿř čǿmmě řčįǻŀ ǿř\nǿpěřǻțįǿňǻŀ p ųřpǿșěș țħǻț șěřvě șțřǻțěģįč řěqųįřěměňțș řěŀǻțěđ țǿ ňǻțįǿňǻŀ p řįǿřįțįěș, ǿř čřěǻțě ǻđđįțįǿňǻŀ\nǻččěșșěș ǻňđ věčțǿřș țǿ fǻčįŀįțǻțě f ųțųřě čǻmpǻįģň ș. Ģǿvěřňměňț ěňțįțįě ș țǻřģěțįňģ șųģģěșțș ǻ pǿțěňțįǻŀ\nșěčǿňđǻřỳ įňțěňț țǿ čǿŀŀěčț ģěǿpǿŀįțįčǻŀ đǻțǻ țħǻț mǻỳ běňěfįț ňǻțįǿň- șțǻțě đěčįșįǿň mǻķįňģ. Țǻ řģěțįňģ đǻțǻ\nșųppǿřțș țħě běŀįěf țħǻț ǺPȚ 39'ș ķěỳ mįșșįǿň įș țǿ țřǻčķ ǿř mǿňįțǿ ř țǻřģěțș ǿf įňțěřěșț, čǿŀŀěčț pě řșǿňǻŀ\nįňfǿřmǻțįǿň, įňčŀ ųđįňģ țřǻvěŀ įțįňě řǻřįěș, ǻňđ ģǻțħěř čųșțǿměř đǻțǻ fřǿm țěŀěčǿmm ųňįčǻțįǿň ș fįřmș.\nİřǻň Ňěxųș İňđįčǻțǿřș\nẄě ħǻvě mǿ đěřǻțě čǿňfį đěňčě ǺPȚ 39 ǿpěřǻțįǿňș ǻřě čǿňđųčțěđ įň șųppǿřț ǿf İřǻňįǻň ňǻțįǿňǻŀ įňțě řěșțș bǻșěđ\nǿň řěģįǿňǻŀ țǻ řģěțįňģ pǻțțě řňș fǿčųșěđ įň țħě Mį đđŀě Ěǻșț, įňfřǻșțřųčțųřě, țįmįňģ, ǻň đ șįmįŀǻřįțįěș țǿ ǺPȚ 34, ǻ\nģřǿųp țħǻț ŀǿǿ șěŀỳ ǻŀįģň ș ẅįțħ ǻčțįvįțỳ p ųbŀįčŀỳ řěpǿřțěđ ǻș “ǾįŀŘįģ”. Ẅħįŀě ǺPȚ 39 ǻňđ ǺPȚ34 șħǻřě șǿmě\nșįmįŀǻřįțįěș, įňčŀųđįňģ mǻŀ ẅǻřě đįșțřįbųțįǿň měțħǿ đș, PǾẄBǺȚ bǻčķ đǿǿř ųșě, įňfřǻșțřųčțųřě ňǿměňčŀǻț ųřě, ǻňđ\nțǻřģěțįňģ ǿvě řŀǻpș, ẅě čǿňșįđěř ǺPȚ39 țǿ bě đįșțįňčț fřǿm ǺPȚ 34 ģįvěň įț ș ųșě ǿf ǻ đįffěřěňț PǾẄBǺȚ vǻ řįǻňț. İț\nįș pǿșșįbŀě țħǻț țħě șě ģřǿųpș ẅǿřķ țǿģěțħě ř ǿř șħǻřě řěșǿųřčěș ǻț șǿmě ŀěvěŀ.\nǺțțǻčķ Ŀįfěčỳčŀě\nǺPȚ39 ųșěș ǻ vǻřįěțỳ ǿf č ųșțǿm ǻň đ pųbŀįčŀỳ ǻvǻįŀǻbŀě mǻŀ ẅǻřě ǻňđ țǿǿŀș ǻț ǻŀŀ șțǻģěș ǿf țħě ǻțțǻčķ ŀįfěčỳčŀě.\nİňįțįǻŀ Čǿmp řǿmįșě\nFǿř įňįțįǻŀ čǿmp řǿmįșě, FįřěĚỳě İňțěŀŀįģěňčě ħǻ ș ǿbșěřvěđ ǺPȚ39 ŀěvěřǻģě șpěǻř pħįșħįňģ ěmǻįŀ ș ẅįțħ mǻŀįčįǿ ųș\nǻțțǻčħměňț ș ǻňđ/ǿř ħỳpěřŀįňķș țỳpįčǻŀŀỳ řěșųŀțįňģ įň ǻ PǾẄBǺȚ įňfěčțįǿň. ǺPȚ 39 fřěqųěňțŀỳ řěģįșțěřș ǻňđ\nŀěvěřǻģěș đǿmǻįňș țħǻț mǻ șqųěřǻđě ǻș ŀěģįțįmǻțě ẅěb șěřvįčěș ǻňđ ǿřģǻňįżǻțįǿňș țħǻț ǻřě řěŀěvǻňț țǿ țħě\nįňțěňđěđ țǻřģěț. Fųřțħěřmǿřě, țħįș ģřǿųp ħǻș řǿųțįňěŀỳ įđěňțįfįěđ ǻňđ ěxpŀǿįțě đ vųŀňěřǻbŀě ẅěb șěřvěřș ǿf\nțǻřģěțěđ ǿřģǻňįżǻțįǿňș țǿ įňșțǻŀŀ ẅěb șħěŀŀș, șųčħ ǻș ǺŇȚǺĶ ǻň đ ǺȘPXȘPỲ, ǻň đ ųșěđ șțǿŀěň ŀěģįțįmǻțě\nčřěđěňțįǻŀș țǿ čǿmp řǿmįșě ěxțěřňǻŀŀỳ fǻčįňģ Ǿ ųțŀǿǿķ Ẅěb Ǻččě șș (ǾẄǺ) řěșǿųřčěș.\nĚșțǻbŀįșħ Fǿǿțħǿŀ đ, Ěșčǻŀǻțě P řįvįŀěģěș, ǻňđ İňțěřňǻŀ Řěčǿňňǻį șșǻňčě\nPǿșț-čǿmp řǿmįșě, ǺPȚ39 ŀěvěřǻģěș čųșțǿm bǻčķ đǿǿřș șųčħ ǻș ȘĚǺẄĚĚĐ, ČǺČ ĦĚMǾŇĚỲ, ǻňđ ǻ ųňįqųě vǻřįǻňț\nǿf PǾẄBǺȚ țǿ ě șțǻbŀįșħ ǻ fǿǿțħǿŀ đ įň ǻ țǻřģěț ěňvį řǿňměňț. Đ ųřįňģ přįvįŀěģě ě șčǻŀǻțįǿň, f řěěŀỳ ǻvǻįŀǻbŀě țǿǿŀ ș\nșųčħ ǻș Mįmįķǻț ż ǻňđ Ňčřǻčķ ħǻvě běěň ǿb șěřvěđ, įň ǻđđįțįǿň țǿ ŀěģįțįmǻțě țǿǿŀ ș șųčħ ǻș Ẅįňđǿẅș Čřěđěňțįǻŀ\nĚđįțǿř ǻňđ PřǿčĐųmp. İňțěřňǻŀ řěčǿňňǻį șșǻňčě ħǻ ș běěň pě řfǿřměđ ųșįňģ čųșțǿm șčřįpțș ǻňđ bǿțħ fřěěŀỳ\nǻvǻįŀǻbŀě ǻň đ čųșțǿm țǿǿŀ ș șųčħ ǻș țħě pǿ řț șčǻňňěř, BĿŲĚȚǾŘČĦ.\nĿǻțěřǻŀ Mǿvěměňț, Mǻįňțǻįň P řěșěňčě, ǻň đ Čǿmpŀěțě Mį șșįǿň\nǺPȚ39 fǻčįŀįțǻțě ș ŀǻțěřǻŀ mǿvěměňț țħ řǿųģħ mỳřįǻđ țǿǿŀș șųčħ ǻș Řěmǿțě Đě șķțǿp Přǿțǿčǿŀ (ŘĐP), Șěč ųřě Șħěŀŀ\n(ȘȘĦ), PșĚxěč, ŘěmČǿm, ǻň đ xČmđȘvč. Čųșțǿm țǿǿŀ ș șųčħ ǻș ŘĚĐȚŘİP, PİŇĶȚŘİP, ǻňđ BĿŲĚȚŘİP ħǻvě ǻŀ șǿ\nběěň ųșěđ țǿ čřěǻțě ȘǾČĶȘ 5 přǿxįěș běțẅěěň įňfěčțě đ ħǿșțș. İň ǻđđįțįǿň țǿ ųșįňģ ŘĐP fǿ ř ŀǻțěřǻŀ mǿvěměňț,\nǺPȚ39 ħǻș ųșěđ țħįș přǿțǿčǿŀ țǿ mǻįňțǻįň pě řșįșțěňčě įň ǻ vįčțįm ěňvį řǿňměňț. Țǿ čǿmpŀěțě įț ș mįșșįǿň, ǺPȚ 39\nțỳpįčǻŀŀỳ ǻ řčħįvěș șțǿŀěň đǻțǻ ẅįțħ čǿmp řěșșįǿň țǿǿŀ ș șųčħ ǻș ẄįňŘǺŘ ǿ ř 7-Żįp.\n \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n16 Mǻř 2020\n09 Mǻř 2020\n24 Fěb 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐFįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nȚħěỳ Čǿmě įň țħě Ňįģħț:\nŘǻňșǿmẅǻřě Đěpŀǿỳměňț Ț řěňđș \nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \nŘǻňșǿmẅǻřě Ǻģǻįň șț țħě Mǻčħįňě:\nĦǿẅ Ǻđvěřșǻřįěș ǻřě Ŀěǻřňįňģ țǿ\nĐįșřųpț İňđųșțřįǻŀ Přǿđųčțįǿň bỳ\nȚǻřģěțįňģ İȚ ǻňđ ǾȚ \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  ǺPȚ39: Ǻň İřǻňįǻň Čỳbě ř Ěșpįǿňǻģě Ģ řǿųp Fǿčųșěđ ǿň...   \nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n  PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚ\nFįģųřě 2: ǺPȚ39 ǻțțǻčķ ŀįfěčỳčŀě\nȚħěřě ǻřě șǿmě įňđįčǻțįǿňș țħǻț ǺPȚ 39 đěmǿňșțřǻțěđ ǻ pěňčħǻňț fǿ ř ǿpěřǻțįǿňǻŀ șěčųřįțỳ țǿ bỳpǻ șș đěțěčțįǿň\něffǿřțș bỳ ňěț ẅǿřķ đěfěňđěřș, įňčŀųđįňģ țħě ųșě ǿf ǻ mǿ đįfįěđ věřșįǿň ǿf Mįmįķǻț ż țħǻț ẅǻș řěpǻčķěđ țǿ țħẅǻřț\nǻňțį-vįřųș đěțěčțįǿň įň ǿňě čǻ șě, ǻș ẅěŀŀ ǻș ǻňǿțħě ř įňșțǻňčě ẅħěň ǻfțě ř ģǻįňįňģ įňįțįǻŀ ǻččě șș ǺPȚ39 pěřfǿřměđ\nčřěđěňțįǻŀ ħǻ řvěșțįňģ ǿųțșįđě ǿf ǻ čǿmp řǿmįșěđ ěňțįțỳ'ș ěňvįřǿňměňț țǿ ǻvǿį đ đěțěčțįǿň.\nǾųțŀǿǿķ\nẄě běŀįěvě ǺPȚ 39'ș șįģňįfįčǻňț țǻ řģěțįňģ ǿf țħě țěŀěčǿmm ųňįčǻțįǿň ș ǻňđ țřǻvěŀ įňđųșțřįěș řěfŀěčțș ěffǿřțș țǿ\nčǿŀŀěčț pě řșǿňǻŀ įňfǿ řmǻțįǿň ǿň țǻ řģěțș ǿf įňțěřěșț ǻňđ čųșțǿměř đǻțǻ fǿř țħě pųřpǿșěș ǿf șųřvěįŀŀǻňčě țǿ\nfǻčįŀįțǻțě f ųțųřě ǿpěřǻțįǿňș. Țěŀěčǿmm ųňįčǻțįǿň ș fįřmș ǻřě ǻțțřǻčțįvě țǻ řģěțș ģįvěň țħǻț țħěỳ șțǿřě ŀǻřģě ǻmǿ ųňțș\nǿf pěřșǿňǻŀ ǻň đ čųșțǿměř įňfǿřmǻțįǿň, p řǿvįđě ǻččěșș țǿ čřįțįčǻŀ įňf řǻșțřųčțųřě ųșěđ fǿř čǿmmųňįčǻțįǿň ș, ǻňđ\něňǻbŀě ǻččě șș țǿ ǻ ẅįđě řǻňģě ǿf pǿțěňțįǻŀ țǻ řģěțș ǻčřǿșș mųŀțįpŀě vě řțįčǻŀș. ǺPȚ39'ș țǻřģěțįňģ ňǿț ǿňŀỳ\nřěpřěșěňțș ǻ țħřěǻț țǿ ķňǿ ẅň țǻřģěțěđ įňđųșțřįěș, bųț įț ěxțěň đș țǿ țħěșě ǿřģǻňįżǻțįǿňș' čŀįěňțěŀě, ẅħįčħ įňčŀ ųđěș\nǻ ẅįđě vǻřįěțỳ ǿf șěčțǿřș ǻňđ įňđįvįđųǻŀș ǿň ǻ ģŀǿbǻŀ șčǻŀě. ǺPȚ 39'ș ǻčțįvįțỳ șħǿẅčǻșěș İřǻň'ș pǿțěňțįǻŀ ģŀǿbǻŀ\nǿpěřǻțįǿňǻŀ řěǻčħ ǻň đ ħǿẅ įț ųșěș čỳběř ǿpěřǻțįǿňș ǻș ǻ ŀǿẅ-čǿșț ǻňđ ěffěčțįvě țǿǿŀ țǿ fǻčįŀįțǻțě țħě čǿŀŀěčțįǿň ǿf\nķěỳ đǻțǻ ǿň pě řčěįvěđ ňǻțįǿňǻŀ șěčųřįțỳ țħřěǻțș ǻňđ ģǻįň ǻđvǻňțǻģě ș ǻģǻįňșț řěģįǿňǻŀ ǻň đ ģŀǿbǻŀ řįvǻŀș.\n \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě Ěňģŀįșħ\n "
}