{
    "title": "apt39 hacking group launch widespread attack focused on pi",
    "text": "Computer Security Cyber Security News Malware\nAPT39 Hacking Group Launch Widespread\nAttack Focused on Personal Information\n  By GURUBARAN S  -January 31, 2019 0\nIranian cyber espionage group APT39 focus on stealing on personal information o perform\nmonitoring, tracking, or surveillance operations against specific individuals.\nThe group carrying a widespread campaign focused their operations in the Middle East, the\nU.S. and South Korea. Following are the industries targeted including telecommunications,\ntravel industries, high-tech industry, and government entities.\n“We have moderate confidence APT39 operations are conducted in support of Iranian\nnational interests based on regional targeting patterns focused in the Middle East,\ninfrastructure, timing, and similarities to APT34”, reads FireEye report .\nFocused Attack – APT39\nThe attack starts with spear phishing emails, stolen credentials, and web server\ncompromise. Phishing emails carry malicious attachments resulting in downloading the\nPOWBAT malware.\nFor C2 server communications the hacker group register domains that pose as a legitimate\none and relevant to organizations.\nAlso, the group compromise web servers with know vulnerabilities of the targeted\norganizations and inject web shells such as ANTAK and ASPXSPY. Stolen credentials used\nto gain access to the email accounts.\nAPT39 uses custom backdoors such as SEAWEED, CACHEMONEY variants of POWBAT to\ngain access to the target organizations and to escalate privileges using freely available tools\nsuch as Mimikatz and Ncrack.\nLateral movement carried out through popular tools such as Remote Desktop Protocol\n(RDP), Secure Shell (SSH), PsExec, RemCom, xCmdSvc and with custom tools REDTRIP,\nPINKTRIP, and BLUETRIP.\nTo archive, the stolen data the APT 39 group uses WinRAR or 7-Zip and they use a modified\nversion of Mimikatz to evade anti-virus detection.\nTelecommunication and travel industries are the prime targets for the group as they as they\nstore  large amounts of personal and customer information,\n“APT39’s targeting not only represents a threat to known targeted industries, but it extends\nto these organizations’ clientele, which includes a wide variety of sectors and individuals on\na global scale,” researchers concluded.\nYou can follow us on Linkedin , Twitter , Facebook  for daily Cybersecurity updates\nalso you can take the Best Cybersecurity courses online  to keep your self-updated.\nRelated Read\nPenetration Testing as a Service\nBrexit ebook\nNewsletter\nSignup to get Hacking News &\nTutorials to your Inbox\nName\nEmail*\nSubscribe\nCyber Security Courses\nComputer Security\nCoronaVirus Cyber Attack Panic\n– Threat Actors Targets Victims\nWorldwide\nMarch 16, 2020\nMicrosoft Released Patches for\nWormable Windows SMBv3 RCE\nFlaw – More...\nMarch 13, 2020\nUnpatched Wormable Windows\nSMBv3 RCE Zero-day Flaw\nLeaked in Microsoft ...\nMarch 12, 2020\nBest and Effective Ways to Keep\nYour Files Safe From Hackers...\nFebruary 26, 2020\n\n\n\n\n\n\nHOME HACKS THREATS PENTEST KALI SOC INFOSEC TECH TOOLS COURSES Tuesday, March 17, 2020         Home kalitutorials Malware Ransomware Cryptocurrency hack SOC Resources Advertise GBH Team       \n TAGS APT39 computer security Cyber Attack hacker group Malware\nAPT Group Actively Exploiting Internet-facing Vulnerable ColdFusion Server and\nUploading Webshell\nAPT Group Uses Datper Malware To Launch Cyber Attack on Asia Countries by Executing\nShell Commands\nAPT28 Hacking Group’s New Espionage Operations Targets Military and Government\nOrganizations\nShare and Support Us :\nGURUBARAN S\nhttp://gbhackers.com\nGurubaran is a PKI Security Engineer. Certified Ethical Hacker, Penetration Tester,\nSecurity blogger, Co-Founder & Author of GBHackers On Security.\n       \nLeave a Reply\nEnter your comment here...Enter your comment here...\nCoronaVirus Cyber Attack Panic –\nThreat Actors Targets Victims\nWorldwideChinese APT Hackers Exploit MS\nWord Bug to Drop Malware Via\nWeaponized Coronavirus Lure\nDocumentsCookiethief – Android Malware that\nGains Root Access to Steal Browser &\nFacebook App CookiesRELATED ARTICLES MORE FROM AUTHOR\nComputer Security\n Cyber Attack\n Android\n\nLoad moreWhat is DNS Attack and How\nDoes it Works?\nFebruary 26, 2020\n\nABOUT US\nGBHackers on security is a Cyber Security platform that\ncovers daily Cyber Security News, Hacking News, Technology\nupdates and Kali Linux tutorials. Our mission is to keep the\ncommunity up to date with happenings in the Cyber World.\nContact us: admin@gbhackers.comFOLLOW US\n     \n \n \n\n \n \n\nHome  TECH NEWS  Infosec- Resources  OWASP – Top 10  Privacy Policy  Contact Us  About Us © GBHackers on Security 2016 - 2019. All Rights ReservedWe use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.\n OKOK\n Learn MoreLearn More\n "
}