{
    "title": "apt32 returns with new techniques to attack south east asian countries - soc prime",
    "text": "Delaware, USA – March 22, 2019 – APT32, also known as the OceanLotus group, is notorious for the cyber espionage campaigns\ntargeting Asian countries and large-scale watering hole attacks . Researchers of ESET analyzed recent group campaigns and\nfound changes in the group’s actions. The adversaries send carefully crafted emails for each target, disguised as current political\nnews and contained legitimate images. In earlier attacks, they used Word documents containing modified exploits for the CVE-\n2017-11882 vulnerability as attachments. If the victim enabled macros, the code dropped the legitimate EXE file along with the\nmalicious libraries on the system and created scheduled tasks to execute this file every 10 minutes. The executable was used to\ninstall backdoor leveraged by APT32 in earlier attacks, however, it connected to the new set of command and control servers.\nSince the beginning of this year, the group started to use self-extracting archives to drop and execute malicious OCX files. To avoid\ndetection by antivirus solutions, attackers continually modify the configuration of their backdoors. Each new version leaves fewer\ntraces on the attacked system performing most of the operations in memory and creating files with random names. As in the past\ncampaigns, attackers use an extensive network for C&C communications. To detect the exploitation of the CVE-2017-11882\nvulnerability, you can use free SIEM and Yara rules available at Threat Detection Marketplace :\nhttps://tdm.socprime.com/tdm/info/1132\nhttps://tdm.socprime.com/tdm/info/1786/\nYou can also study all the known techniques used by the APT32 and find the means to detect them in the MITRE ATT&CK section:\nhttps://tdm.socprime.com/att-ck/SEARCH:\nFOLLOW US ON:\n\n\n\n\nRELATED POSTS\nBlackWater Backdoor Finds New\nWay to Misuse Cloudflare\nWorkers\nTurla APT Uses NetFlash\nDropper and PyFlash Backdoor\nin Watering Hole Attacks\nHacker Wars: njRat Hides in\n“Free” Hacking Tools Published\non Underground ForumsSearch...  Search\nPRODUCTS\nThreat Detection Marketplace\nPredictive Maintenance\nContinuous Compliance\nSOC Workflow AppSOLUTIONS\nSOC Use CasesSERVICES\nATT&CK Audit\nThreat Hunting as a ServiceCOMPANY\nAbout\nCustomers\nPartners\nDevelopers\nLeadership\nBlog\nNews\nCOOKIE POLICY PRIVACY POLICY PORTAL TERMS AND CONDITIONS\nPRIVACY FAQ\n\nSOC Prime, SOC Prime Logo and Threat Detection Marketplace are registered trademarks of SOC Prime, Inc. All other trademarks are the property of their respective owners.APT32 RETURNS WITH NEW TECHNIQUES TO ATTACK SOUTH EAST\nASIAN COUNTRIES\nPRODUCTS  SOLUTIONS  SERVICES  COMPANY  SIGN UP\n Your Email SIGN IN\nThis site uses cookies and other tracking technologies to assist with navigation and your ability to provide feedback, analyse your use of our products and services, assist with our promotional and\nmarketing efforts, and provide content from third parties. Cookie Policy . DetailsREFUSE COOKIES  ACCEPT COOKIES\n "
}