{
    "title": "apt_ in action for six years - isssource",
    "text": " \nAPT: IN ACTION FOR SIX YEARS\nAUG 5, 2014  | RESEARCH\nThe “Pitty Tiger” advanced persistent threat (APT) group may have been active for over six years, researchers said.\nThe activities of the Pitty Tiger group first came to light in mid-July by the cybersecurity unit at Airbus Defense &\nSpace. Airbus researchers determined the attackers, which they believe operate out of China have been active\nsince at least 2011. However, researchers at FireEye found more evidence suggesting they have been targeting\norganizations for much longer.\nRELATED STORIES\nIoT Devices Vulnerable to Attacks: Report\nSpam Indicates Security Vulnerabilities\nOrganizations ‘More Vulnerable Than They Think’\nEndpoints Need More Security: Report\nFireEye said the group uses spear phishing emails, social engineering, email phishing pages, malware and other\ntools to accomplish their goals. The spear phishing emails analyzed by FireEye were in French, English and Chinese.\nIn one attack against a French company, the attackers sent out emails written in English and French that appeared\nto come from someone within the targeted organization. The malicious messages carried harmless-looking\nMicrosoft Word documents that were set up to drop a first-stage payload, Backdoor.APT.Pgift (Troj/ReRol.A), by\nexploiting both old (CVE-2012-0158) and new (CVE-2014-1761) vulnerabilities affecting the Microsoft Office suite.\nOnce it infects a computer, the Trojan sends some information on\nthe compromised device back to its command and control (C&C)\nserver, after which it downloads the second-stage malware.\nThis wasn’t the first time researchers identified an attack using\nBackdoor.APT.Pgift. They found the same threat at the beginning\nof this year in a campaign targeting an organization in Taiwan.\nThis and the idea quite a few of the C&C servers used by the\ncybercriminals are on .tw domains, indicates the attackers have an\ninterest in Taiwan, FireEye researchers said.\nThe threat group has been using several pieces of malware over\nthe past years. Based on samples that connected to the domain\nnames used in their operations, FireEye said the attackers relied\non PoisonIvy during 2008 and 2009.\nBackdoor.APT.PittyTiger1.3 (CT RAT) has also seen use, most likely as a second-stage malware since it provides\nattackers with a remote shell on the compromised system.\nBackdoor.APT.PittyTiger is a piece of malware leveraged by the group in 2012 and 2013. The threat is capable of\ncapturing screenshots, uploading and downloading files, and providing a remote shell. Backdoor.APT.Lurid, and\nvariants of Gh0st RAT, including Paladin RAT and Leo RAT, have also seen action by the Pitty Tiger group, FireEye\nresearchers said.\nClick here for more information on the APT .\nSubmit a Comment\nYour email address will not be published.  Required fields are marked *\nThis site uses Akismet to reduce spam. Learn how your comment data is processed .\nSUBMIT COMMENT\n     HOME ARCHIVES FOCAL POINTS3NEWS CONTACT US U\n\n\n\n\n "
}