{
    "title": "attacchi in corso su vulnerabilità in internet explorer - yoroi",
    "text": "Privacy  - Terms\nAttacchi in corso su Vulnerabilità in Internet Explorer\nProto: N060918.\nCon la presente Yoroi desidera informarLa relativamente ad emergenti cyber-attacchi volti alla compromissione di client di rete per via dello\nsfruttamento di vulnerabilità all’interno di Internet Explorer . La criticità in questione è nota con l’identificativo CVE-2018-8373.\nA seguito della pubblicazione dei dettagli tecnici relativi alla problematica, sono stati registrati tentativi di attacco  di varia natura che mirano a\nsfruttare lacune nel motore VBScript  all’interno delle recenti versioni dei browser web Microsoft.\nLa pericolosità di questa vulnerabilità risiede nella limitata interazione utente richiesta: un eventuale attaccante di rete può essere in grado di\neseguire codice arbitrario  sulla macchina vittima a seguito della sola navigazione  su siti web compromessi o malevoli.\nLa criticità è stata sfruttata all'interno della serie di exploit “ Double Kill ” operati dall’attore malevolo “ Dark Hotel ” in ambito cyber-espionage (rif.\nEarly Warning N040518 ), oltre che in recenti campagne  di propagazione di varianti malware RAT/Quasar.\nFigura 1. Esempio payload malevolo caricato a seguito dello sfruttamento di CVE-2018-8373\nIl Produttore ha trattato la problematica in un apposito bollettino di sicurezza  pubblicato lo scorso Agosto, dove sono stati resi disponibili\naggiornamenti di sistema per i browser Internet Explorer 9, 10 e 11.\nLe circostanze recentemente osservate, la tipologia di vulnerabilità ed il suo abuso da parte di più attori malevoli, suggeriscono un crescente\nrischio  di tentativi di compromissioni facenti uso di schemi di attacco di tipologia “ Watering Hole ”, “Malvertising ” ed “ Exploit-Kit ”. A questo proposito\nYoroi suggerisce di verificare lo stato di aggiornamento  del Vostro parco macchine Microsoft.\nYoroi consiglia infine di mantenere alto il livello di consapevolezza degli utenti, avvisandoli periodicamente delle minacce in corso e di\nutilizzare un team di esperti per salvaguardare la sicurezza del perimetro \"cyber\". Per avere un indice di minaccia in tempo reale si consiglia di\nvisitare il seguente link: Yoroi Cyber Security Index\n \n \nSeat\nYoroi S.r.l.\nVia Giovanni Battista Martini 6,\nRoma RM, 00198Contact\ninfo@yoroi.company\n+39 051 0301005Legal\nTerms & Conditions\nPrivacy PolicyWarning system\nSubscribe to our early warning\nsystem\nDownloads\nNewsSocial\nP.IVA. 03407741200 - R.E.A. RM 1559639 - Codice Fiscale 03407741200 - Capitale Sociale: Euro 50.000 IV\ncredits: SimpleNetworksDefence center Solutions Blog Downloads About us Contacts\nWe use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.\n OkOk\n Privacy PolicyPrivacy Policy\n "
}