{
    "title": "bayer points finger at wicked panda in cyberattack _ business_ economy and finance news from a german perspective _ dw _ 04.04.2019(1)",
    "text": "DW.COM IN 30 LANGUAGES DW AKADEMIE ABOUT DW DW.COM\nDate  04.04.2019\nKeywords  Bayer , cyberattack\nFeedback : Send us your feedback.\nPrint  \nPrint this page\nPermalink  https://p.dw.com/p/3GDyu\nCoronavirus forces EU\nleaders to weigh\nnationalization options\n19.03.2020\nItaly has recapitalized its airline\nAlitalia, and France is considering\nsimilar moves to rescue affected\ncompanies. Now even Germany\nseems ready to use the ultimate\nweapon in the coronavirus battle:\nnationalization.COVID-19 to plunge\nGermany into recession\n19.03.2020\nThe head of the Munich-based\neconomic think tank ifo, Clemens\nFuest, tells DW that Europe's\npowerhouse will face a serious\nrecession should the coronavirus\nscare be around for a longer time. \nTraffic chaos at German-\nPolish border a threat to\nlocal supply chains?\n19.03.2020\nTrucks are clogging up highways in\nEastern Germany as they wait for\nborder checks that Poland\nintroduced at the weekend as\nCOVID-19 spreads. Some local\nsuppliers find it hard to do their\njob, as Hardy Graupner reports.MORE CONTENTBUSINESS\nBayer points finger at Wicked Panda in\ncyberattack\nGerman chemicals giant Bayer claims it has found malware from a Winnti hacker group\nin China which attacked the company in early 2018. The attack is part of a rising wave of\ncyberattacks worrying firms.\nBayer factory\nA group of hackers known as Wicked Panda accessed Bayer's network in early 2018, the company said\nin a statement on Thursday. \nThe hackers reportedly used Winnti malware, which had also been detected at three other, smaller,\ncompanies in Germany this year.\nWinnti is a China-based hacker groups, of which Wicked Panda is believed to be a member. In\nGermany they already targeted the computer systems of technology group ThyssenKrupp  in 2016. \n\"This type of attack points towards the Wicked Panda group in China, according to security experts,\" a\ncompany spokesman said, citing evidence gathered by the DCSO cybersecurity group, which was set\nup by Bayer in 2015 and includes other German companies such Allianz, BASF and Volkswagen.\nBayer, Germany's largest drugmaker, said it had covertly monitored and analyzed the attack up to the\nend of this March and then cleared the threat from its systems.\"There is no evidence of data theft,\" the\nstatement goes on. \nWhile public prosecutors in Cologne, Germany have opened an investigation into the incident, the\nformer head of Germany's BND foreign intelligence service, Gerhard Schindler, said on Thursday it\nwas difficult to determine the hackers' location.\nBayer is also the world's largest agricultural supplies company after it has taken over US chemicals\nmaker Monsanto.\nGermany watchful\nThe news comes in the wake of one of Germany's biggest data breaches, in which the private data of\nalmost 1,000 public figures were leaked in January, including email conversations and private photos.\nCybersecurity has become a matter of urgency for German politics after the United States has ramped\nup pressure on its allies to desist using Chinese firm Huawei technology in the roll out of 5G internet .\nGermany’s Office for Security in Information Technology (BSI) recently issued a warning to several\nGerman companies seen as potential targets for Chinese cyber espionage. There are mounting fears in\nGermany that Chinese hackers could be targeting companies involved in construction and materials\nresearch, engineering firms and big commercial enterprises.\nAccording to a BSI report in February, Germany has seen a rising  number of incidents  hitting critical\ninfrastructure, such as power grids and water suppliers. Among the companies most recently targeted\nby the Chinese hackers was the Hagen Hohenlimburg specialty steel mill in western Germany.\nTechnical trade secrets were stolen from the steel production and manufacturing plant design divisions\nof ThyssenKrupp in the attacks. At the time, the company said it had been targeted by attackers\nlocated in Southeast Asia. In 2014, a blast furnace at a steelworks in Germany was also badly\ndamaged by a cyber attack, resulting in \"massive damage to machinery\" at the unnamed German\nsteel mill.\nThis followed an attack on Deutsche Telekom routers that caused outage for nearly 1 million\ncustomers. \nCosts\nAccording to a survey published by Germany's IT sector association Bitkom in 2018, two thirds of\nGerman manufacturers have already come under the attack of cybercriminals. The association\nestimates that this costs Europe's largest economy €43 billion ($50 billion) annually. \nRead more : German firms warned about Chinese 'cloud hopper' hackers\nBitkom has also found that small and medium-sized companies are particularly vulnerable to attacks.\nSome 19 percent of those polled said their IT and production systems had been sabotaged digitally,\nwith 11 percent reporting tapping of their communications.\n \nDW RECOMMENDS\nSix hack attacks that shook the world\nThe data breach that affected lawmakers from across Germany's political spectrum was the latest in a string of\nprominent cyberattacks around the world. DW looks at five others that have made headlines. (04.01.2019)  \nTOP STORIES\nGermany\nCoronavirus\nWorld\nBusiness\nScience\nEnvironment\nCulture\nSports\n \nA - Z IndexMEDIA CENTER\nLive TV\nAll media content\nLatest Programs\nPodcastsTV\nSchedule and Reception\nTV Programs\n \nRADIOLEARN GERMAN\nGerman Courses\nGerman XXL\nCommunity D\nTeaching GermanABOUT DW\nWho we are\nPress\nGMF\nBusiness & Sales\nAdvertising\nTravelSERVICE\nReception\nApps & Co.\nNewsletters & Co.\nFAQ\nContact\n \nDW AKADEMIE\nAbout us\nMedia Development\nMaster's Degree\nTraineeship\nTraining\n© 2020 Deutsche Welle | Privacy Policy  | Legal notice  | Contact  | Mobile versionAdvertisement\nWatch video 01:55\nData theft and cyber attacks\nDeutsche Welle\nGERMANY CORONAVIRUS WORLD BUSINESS SCIENCE ENVIRONMENT CULTURE SPORTS\nTOP STORIES / BUSINESSSearch TOP STORIES\nTOP STORIES MEDIA CENTER TV RADIO LEARN GERMAN\n "
}