{
    "title": "bronze union cyberespionage persists despite disclosures _ secureworks",
    "text": " Research BRONZE UNION Cyberespionage Persists Despite Disclosures\nTHREAT ANALYSIS\nBRONZE UNION\nCyberespionage Persists\nDespite Disclosures\nTUESDAY, JUNE 27, 2017\nBY: COUNTER THREAT UNIT RESEARCH TEAM\n   \nSummary\nIn 2015, the SecureWorks® Counter Threat Unit™ (CTU) research team  the BRONZE UNION\nthreat group (formerly labeled TG-3390), which CTU™ analysis suggests is based in the People's Republic of\nChina (PRC). Since that analysis, CTU researchers have observed multiple BRONZE UNION threat campaigns\nthat illustrate the evolution of the group's methods and espionage objectives. Despite multiple public\ndisclosures of their activities, BRONZE UNION remains an active and formidable threat as of this publication.documented\nCTU researchers divided the  about this group into two sections:  and .\nExecutives can use the strategic assessment of the ongoing threat to determine how to reduce risk to their\norganization's mission and critical assets. Computer network defenders can use the tactical information\ngathered from incident response investigations and research to reduce the time and effort associated with\nresponding to the threat group's activities.threat intelligence strategic tactical\nKey points\nCTU researchers assess it is highly likely that the BRONZE UNION threat group gathers defense,\nsecurity, and political intelligence from organizations around the world. CTU researchers have observed\nit targeting organizations in the aerospace, government, defense, technology, energy, and\nmanufacturing verticals.\nCTU researchers assess it is likely that the group is located in the People's Republic of China.\nBRONZE UNION has historically used strategic web compromises (SWCs) in its campaigns, CTU\nresearchers have also observed it exploiting vulnerable Internet-facing services to gain access to\ntargeted networks.\nAfter accessing a network, the threat actors leverage a range of proprietary, publicly available, and\nnative tools to search for and acquire desirable data.\nStrategic threat intelligence\nAnalysis of a threat group's targeting, origin, and competencies can determine which organizations could be\nat risk. This information can help organizations make strategic defensive decisions regarding this threat.\nIntent\nBased on BRONZE UNION's targeting activity, CTU researchers assess it is highly likely that the group\nfocuses on political and defense organization networks. In 2016, the threat actors conducted a strategic\nweb compromise (SWC) on the website of an international industry organization that affected aerospace,\nacademic, media, technology, government, and utilities organizations around the world. During a discrete\nperiod of activity, this SWC was used to speciﬁcally target Turkish government, banking, and academic\nnetworks. These focused attacks suggest a concerted effort to compromise strategically signiﬁcant networks\nin Turkey, possibly due to Turkey's political, economic, and military relationships in Europe and the Middle\nEast.\nIn addition, BRONZE UNION activity on multiple U.S.-based defense manufacturer networks included the\nthreat actors seeking information associated with aerospace technologies, combat processes, and naval\ndefense systems. Third-party  suggests that systemic issues in the PRC’s defense technology\nindustries could inﬂuence demand for this type of information because this type of data could potentially\naddress innovation and supply deﬁcits which exist within this industry sector in the PRC.analysis\nAttribution\nIn 2015, CTU researchers assessed that BRONZE UNION likely originates in the PRC based on factors such\nas targeting, operating hours, and tool selection. Observed activity since 2015 reinforces that association;\nfor example:\ncontinued focus on information that would be of interest to individuals or groups living in a country that\nhas a signiﬁcant manufacturing base and a strategic interest in U.S. military capabilities\nuse of web shells that have historically been leveraged by threat groups believed to be operating in the\nPRC\nconnections between a subset of the group's operational infrastructure and PRC-based Internet\nservice companies\nCapability\nBRONZE UNION has consistently demonstrated the capability to conduct successful large-scale intrusions\nagainst high-proﬁle networks and systems. CTU researchers identiﬁed evidence of the group exploiting\nvulnerabilities in Internet-facing service desk software to gain an initial foothold on desirable networks, while\nconcurrently compromising systems of interest via SWCs. During the observed intrusions, the group rapidly\ncollected account credentials, escalated privileges, and deployed multiple web shells presumably to extend\nits access across the compromised network.\nBRONZE UNION is disciplined and takes proactive steps to avoid detection. For example, at the end of 2016\nCTU researchers observed the threat actors using native system functionality to disable logging processes\nand delete logs within a network. The group also manipulated native Windows features on compromised\nsystems to access additional legitimate functionality. These behaviors indicate that the threat actors quickly\ngain a detailed understanding of the environments they compromise and use this understanding to conceal\ntheir activity from network defenders. Although CTU researchers have observed BRONZE UNION modifying its\ntools, likely in response to public reporting on its activities, there is no evidence that the group's capabilities\nhave changed substantially or that its operations have been deterred.\nTactical threat intelligence\nInvestigating BRONZE UNION activity and evicting the threat actors from compromised networks have given\nCTU researchers unique insight into the group's tools and tactics.\nTools\nCTU researchers observed BRONZE UNION using the following tools in intrusions since the 2015 analysis, but\nclients should assume that the threat group still has access to the previously reported tools.\nOwaAuth — This web shell and credential stealer deployed to Microsoft Exchange servers is installed as\nan ISAPI ﬁlter. Captured credentials are DES-encrypted using the password “12345678” (see Figure 1),\nand are written to a text ﬁle (log.txt) in the system's root directory.\nFigure 1. Conﬁguration ﬁle from OwaAuth.dll. (Source: SecureWorks)\nChina Chopper web shell — This web-based executable script communicates with a full-featured user\ninterface to allow threat actors to transfer and create ﬁles, open a command terminal, and interact\nwith database servers.\nRcmd — This lateral movement tool facilitates the execution of commands on systems across the target\nenvironment.\nWrapikatz — This tool wraps Mimikatz code in a custom loader to evade antivirus detection, and\nchanges the command-line usage to evade process-telemetry detection and make the tool easier to\nuse. This tool is not exclusive to BRONZE UNION. CTU researchers have observed various threat groups\nleveraging Wrapikatz binaries with different usage options.\nNetview — This  host-enumeration tool presents details about IP addresses, network\nshares, remote sessions, and logged-on users.publicly available\nKekeo — This  toolset manipulates the Kerberos authentication protocol. CTU\nresearchers identiﬁed BRONZE UNION actors using a ﬁle named ms.exe that was likely a credential-\nabuse tool from the Kekeo toolset.publicly available\nTactics, techniques, and procedures\nObservations of BRONZE UNION activity during several network compromises gave CTU researchers insight\ninto the tactics the group employs.\nAccess vectors and command and control\nCTU researchers observed BRONZE UNION delivering malware to systems via SWCs and scan-and-exploit\ntechniques. The threat actors appear to be able to create and leverage multiple SWCs in parallel. They\nhave also demonstrated the ability to create SWCs and malware-staging sites by leveraging websites linked\nto networks previously compromised by the group. Apparent overlap between existing compromises and new\ncampaigns suggests that the group considers leveraging existing network compromises when planning\ninfrastructure requirements. Figure 2 shows a BRONZE UNION infection chain leveraging an SWC.\nFigure 2. Likely BRONZE UNION infection chain observed in 2016. (Source: SecureWorks)\nIn multiple instances, CTU researchers observed artifacts from unsuccessful attempts to create a web shell\non web-accessible JBOSS-based service desk software, followed by use of a functional shell to gain access\nto the environment. These events strongly suggest that the threat actors leveraged the web application as\npart of the initial compromise vector.\nBRONZE UNION appears to use a combination of self-registered IP addresses and commercial VPN services\nin its command and control (C2) and operational infrastructure. The threat actors also integrate\ninfrastructure they likely previously compromised for espionage purposes. For example, CTU researchers\nidentiﬁed the group using IP addresses owned by several, presumably compromised, research organizations\nto interact with web shells in other target environments.\nHost enumeration and lateral movement\nAfter gaining an initial foothold in a compromised environment, the threat actors quickly identify and explore\naccessible systems. In one example, BRONZE UNION actors leveraged initial web shell access on Internet-\nfacing systems to conduct internal reconnaissance, including domain enumeration and network state, via\nipconﬁg, net use, net user, and net view commands. In a separate incident, CTU researchers identiﬁed a ﬁle\nnamed s.txt, which is consistent with the output of the  tool. Netview host-enumeration\nKnowledge of the compromised environment allows the threat actors to move laterally between systems.\nCTU researchers identiﬁed ten compromised hosts in one environment that contained artifacts associated\nwith the Rcmd lateral-movement tool. Use of the tool leaves a small helper script (read.vbs) on the target\nsystem. This script relays commands and output between the controller and the system.\nDefensive evasion\nCTU researchers observed BRONZE UNION actors reconﬁguring legitimate Windows features to establish\nPowerShell  and  (see Figure 3). These remote management technologies allow a full range\nof conﬁguration, data transfer, and remote execution capabilities over HTTP/HTTPS channels. Enabling these\nfeatures gives the threat actor a remote control channel to persistently access the victim's environment\nwithout using malicious software that could be detected.remoting WinRM\nFigure 3. PowerShell commands. (Source: SecureWorks)\nSome payloads leveraged DLL side loading, a technique that involves running a legitimate, typically digitally\nsigned, program that loads a malicious DLL. The DLL acts as a stub loader, which loads and executes shell\ncode. BRONZE UNION previously used this technique to enable execution of PlugX and HttpBrowser tools in\na way that is challenging for network defenders to detect.\nIn 2016, CTU researchers observed the group using native system functionality to disable logging processes\nand delete logs within a compromised environment. The threat actors used the  command-line tool\nto unlock and disable the default logging component on the server (systsm.webServer/httplogging) and then\ndelete existing logs from the system (see Figure 4).appcmd\nFigure 4. Threat actor using appcmd to delete logs and disable logging. (Source: SecureWorks)\nCredential access\nBRONZE UNION uses various tools for credential theft. In one incident, the threat actor used the Wrapikatz\ntool (w.exe) with a usage statement that retrieves various passwords and Windows credentials from memory\nand compiles them in w.txt:\nc:\\programdata\\w.exe –w –l –c>>c:\\programdata\\w.txt\nIn a separate incident, the threat actor used access provided by extensive web shell deployment to harvest\naccount credentials:\n2016-10-03T09:27:47 dir\n2016-10-03T09:28:11 w64.log >ppp.log\n2016-10-03T09:30:10 PowerShell.exe -ExecutionPolicy Bypass -File getpwd.ps1\n>iistail.log\nIn another example, BRONZE UNION leveraged the Kekeo credential abuse tool to exploit , a\nvulnerability in Microsoft's implementation of the Kerberos network authentication protocol. Exploitation of this\nvulnerability allows an attacker to escalate privileges on the affected system.CVE-2014-6324\nExﬁltration\nBRONZE UNION has also leveraged various web shells to collect and stage data for exﬁltration. In one\ninstance, the threat actor gained remote access to a high-value system in a compromised network, ran\n to identify existing RDP sessions on the device, immediately ran a command to compile a RAR\narchive that speciﬁed ﬁle types the threat actor did not want, and used a password to encrypt the archive:quser.exe\nYYYY-MM-DD hh:mm:ss quser\nYYYY-MM-DD hh:mm:ss C:\\windows\\temp\\svchost.exe a -m5 -v2000m -hp{password} -\ninul -r \"{destination_file.rar}\" \"{multiple user directories linked to the\nvictim's projects}\" -x*.exe -x*.msi -x*.cab -x*.inc -x*.dll -x*.db -x*.mdb -\nx*.htm -x*.html -x*.css -x*.jar -x*.js -x*.tmp -x*.bak -x*.dat -x*.log -\nx*.xml -x*.dmp -x*.dbf -x*.avi -x*.mp3 -x*.mp4 -x*.mpg -x*.mpeg -x*.asp -\nx*.aspx -x*.gif -x*.jpg -x*.mpp -x*.pst\nThe threat actors typically rename the encrypted RAR archives. In the following example, archives for\nexﬁltration were renamed as .tmp ﬁles:\nmove \\\\{FILE PATH}\\c$\\programdata\\AT.part01.rar \\\\{FILE\nPATH}\\c$\\programdata\\at01.tmp\nThe TMP ﬁles were then staged for exﬁltration on Internet-facing servers that had previously been\ncompromised with the China Chopper web shell. From those servers the threat actor could use a web shell\nto retrieve the encrypted archives:\ncopy \\\\{FILE PATH}\\c$\\programdata\\*.tmp \\\\{FILE PATH}\\ServiceDesk\\custom\\style\nAfter exﬁltrating the ﬁles, the threat actor used web shell access on the staging server to delete the\nstaged RAR archives and detach their network shares, likely to avoid detection. Figure 5 shows the\ncommands used to perform these activities on a RAR archive renamed with a *.jpg extension.\nFigure 5. BRONZE UNION commands. (Source: SecureWorks)\nReentry attempt\nAfter BRONZE UNION was evicted from a compromised environment, which involved blocking the group's\nknown infrastructure, CTU researchers observed the group attempting to reconnect to its OWA web shells\nand a backup web shell it had deployed during the intrusion. The threat actor also attempted to use OWA\naccount credentials likely acquired during an earlier phase of the intrusion. BRONZE UNION appeared to\nleverage other compromised infrastructure, presumably to make reentry attempts seem legitimate. This\nattempt illustrates the importance of thorough planning when conducting an eviction and the need for\ncontinuous vigilance for evidence of reentry.\nConclusion\nAs of this publication, BRONZE UNION remains a formidable threat group that targets intellectual property\nand executes its operations at a swift pace. Its activities indicate a preference for leveraging SWCs and\nscan-and-exploit techniques to compromise target systems. To mitigate these threats, CTU researchers\nrecommend that clients conduct regular internal vulnerability scanning, patching, and upgrading of priority\nsystems, particularly Internet-facing systems and users' devices.  (AETD)\ncan help detect activity associated with web shells and lateral movement, and network technologies that\nuse sandboxing techniques to detonate binaries in network trafﬁc can prevent malicious trafﬁc from\nreaching internal systems. Early detection and response can minimize exposure and damage.Advanced endpoint threat detection\nThreat indicators\nThe threat indicators in Table 1 are associated with BRONZE UNION activity. Note that IP addresses can be\nreallocated. The IP addresses may contain malicious content, so consider the risks before opening them in a\nbrowser.\nIndicator Type Context\n198.56.185.179 IP\naddressUsed by\nBRONZE\nUNION to\nconnect to\nChina\nChopper\nweb shell\n211.255.155.194 IP\naddressLikely\nassociated\nwith VPN\nused by\nBRONZE\nUNION to\nconnect to\nChina\nChopper\nweb shell\n211.255.155.199 IP\naddressLikely\nassociated\nwith VPN\nused by\nBRONZE\nUNION to\nconnect to\nChina\nChopper\nweb shell\n211.255.155.202 IP\naddressLikely\nassociated\nwith VPN\nused by\nBRONZE\nUNION to\nconnect to\nChina\nChopper\nweb shell\n211.255.155.204 IP\naddressLikely\nassociated\nwith VPN\nused by\nBRONZE\nUNION to\nconnect to\nChina\nChopper\nweb shell\n211.255.155.215 IP\naddressLikely\nassociated\nwith VPN\nused by\nBRONZE\nUNION to\nconnect to\nChina\nChopper\nweb shell\n211.255.155.218 IP\naddressLikely\nassociated\nwith VPN\nused by\nBRONZE\nUNION to\nconnect to\nChina\nChopper\nweb shell\n211.255.155.219 IP\naddressLikely\nassociated\nwith VPN\nused by\nBRONZE\nUNION to\nconnect to\nChina\nChopper\nweb shell\n211.255.155.224 IP\naddressLikely\nassociated\nwith VPN\nused by\nBRONZE\nUNION to\nconnect to\nChina\nChopper\nweb shell\n104.130.244.126 IP\naddressUsed by\nBRONZE\nUNION to\nconnect to\nweb shells\n96.90.63.57 IP\naddressUsed by\nBRONZE\nUNION to\nconnect to\nweb shells\n117.136.63.145 IP\naddressUsed by\nBRONZE\nUNION to\nconnect to\nweb shells\ncd5aaa37ee165071f914ceec8fd09e0f MD5\nhashOwaAuth\nweb shell\nused by\nBRONZE\nUNION\n2b5aa30f8f0575bdfe1ddebc8dac8c56a91137a8 SHA1\nhashOwaAuth\nweb shell\nused by\nBRONZE\nUNION\n0e823a5b64ee761b70315548d484b5b9c4b61968b5068f9a8687c612ddbfeb80 SHA256\nhashOwaAuth\nweb shell\nused by\nBRONZE\nUNION\njavaws.exe Filename Malware\nused in\nBRONZE\nUNION SWC\nthat\ndownloads\nand\nexecutes a\nsecond-\nstage\npayload\n98c5f2a680fe9de19683120be90ea75c MD5\nhashMalware\nused in\nBRONZE\nUNION SWC\n(javaws.exe)F\ndaa03d4aa72a16fff910142982b057b195018e6d SHA1\nhashMalware\nused in\nBRONZE\nUNION SWC\n(javaws.exe)\nec60e57419f24fabbe67451cb1055b3d2684ab2534cd55c4a88cc395f9ed1b09 SHA256\nhashMalware\nused in\nBRONZE\nUNION SWC\n(javaws.exe)\n45.114.9.174 IP\naddressUsed by\nBRONZE\nUNION to\nhost second-\nstage\npayload for\nSWC\nTable 1. BRONZE UNION indicators.\n Enjoyed what you read? Share\nit!   \nRELATED CONTENT\n  \nREPORTS\nThreat Intelligence\nExecutive Report 2020:\nVol. 1\nBLOG\nBusiness as Usual For\nIranian Operations\nDespite Increased\nTensions\nCounter Threat Unit™ Research Team\nREPORTS\nThreat Intelligence\nExecutive Report 2019:\nVol. 6\nCareers RSS Feed Manage Subscriptions Sitemap Privacy Policy\nSupply Chain Transparency Terms & Conditions Dell Technologies Cookie Settings English\n©  SecureWorks, Inc. 2020How Much Risk Does\nYour Organization\nFace?\nGet your cybersecurity risk score\nLEARN MORE\n\n     Products Services Solutions Research Resources CompanyEmergency Incident Response Report a Conﬁrmed or Potential Breach? Call +1 770-870-6343\nBlog Contact Support Login\n "
}