{
    "title": "bronze butler_ redbaldknight_ tick_ group g0060 _ mitre att_ck®",
    "text": "JUST RELEASED: ATT&CK for Industrial Control Systems\nGROUPS\nOverview\nadmin@338\nAPT1\nAPT12\nAPT16\nAPT17\nAPT18\nAPT19\nAPT28\nAPT29\nAPT3\nAPT30\nAPT32\nAPT33\nAPT37\nAPT38\nAPT39\nAPT41\nAxiom\nBlackOasis\nBRONZE BUTLER\nCarbanak\nCharming Kitten\nCleaver\nCobalt Group\nCopyKittens\nDark Caracal\nDarkhotel\nDarkHydrus\nDeep Panda\nDragonfly\nDragonfly 2.0\nDragonOK\nDust Storm\nElderwood\nEquation\nFIN10\nFIN4\nFIN5\nFIN6\nFIN7\nFIN8\nGallmaker\nGamaredon Group\nGCMAN\nGorgon Group\nGroup5\nHoneybee\nKe3chang\nKimsuky\nLazarus Group\nLeafminer\nLeviathan\nLotus Blossom\nMachete\nMagic Hound\nmenuPass\nMoafee\nMolerats\nMuddyWater\nNaikon\nNEODYMIUM\nNight Dragon\nOilRig\nOrangeworm\nPatchwork\nPittyTiger\nPLATINUM\nPoseidon Group\nPROMETHIUM\n Putter Panda\nRancor\nRTM\nSandworm Team\nScarlet Mimic\nSilence\nSilverTerrier\nSoft Cell\nSowbug\nStealth Falcon\nStolen Pencil\nStrider\nSuckfly\nTA459\nTA505\nTaidoor\nTEMP.Veles\nThe White Company\nThreat Group-1314\nThreat Group-3390\nThrip\nTropic Trooper\nTurla\nWinnti Group\nWIRTE\nHome\n>Groups\n>BRONZE BUTLER\nBRONZE BUTLER\nAssociated Group Descriptions\nName Description\nREDBALDKNIGHT\nTick  \nTechniques Used\nDomain ID Name Use\nEnterprise T1087 Account Discovery BRONZE BUTLER  has used net user /domain  to identify account information.\nEnterprise T1009 Binary Padding BRONZE BUTLER  downloader code has included \"0\" characters at the end of the file to inflate the file size in a likely attempt to evade anti-virus detection.\nEnterprise T1088 Bypass User Account Control BRONZE BUTLER  malware xxmm contains a UAC bypass tool for privilege escalation.\nEnterprise T1059 Command-Line Interface BRONZE BUTLER  uses the command-line interface.\nEnterprise T1003 Credential Dumping BRONZE BUTLER  has used various tools to perform credential dumping.\nEnterprise T1024 Custom Cryptographic Protocol BRONZE BUTLER  has used a tool called RarStar that encodes data with a custom XOR algorithm when posting it to a C2 server.\nEnterprise T1002 Data Compressed BRONZE BUTLER  has compressed data into password-protected RAR archives prior to exfiltration.\nEnterprise T1132 Data Encoding Several BRONZE BUTLER  tools encode data with base64 when posting it to a C2 server.\nEnterprise T1022 Data Encrypted BRONZE BUTLER  has compressed and encrypted data into password-protected RAR archives prior to exfiltration.\nEnterprise T1005 Data from Local System BRONZE BUTLER  has exfiltrated files stolen from local systems.\nEnterprise T1039 Data from Network Shared Drive BRONZE BUTLER  has exfiltrated files stolen from file shares.\nEnterprise T1140 Deobfuscate/Decode Files or\nInformationBRONZE BUTLER  downloads encoded payloads and decodes them on the victim.\nEnterprise T1189 Drive-by Compromise BRONZE BUTLER  compromised three Japanese websites using a Flash exploit to perform watering hole attacks.\nEnterprise T1203 Exploitation for Client Execution BRONZE BUTLER  has exploited Microsoft Word vulnerability CVE-2014-4114 for execution.\nEnterprise T1083 File and Directory Discovery BRONZE BUTLER  has collected a list of files from the victim and uploaded it to its C2 server, and then created a new list of specific files to steal.\nEnterprise T1107 File Deletion The BRONZE BUTLER  uploader or malware the uploader uses command  to delete the RAR archives after they have been exfiltrated.\nEnterprise T1036 Masquerading BRONZE BUTLER  has given malware the same name as an existing file on the file share server to cause users to unwittingly launch and install the\nmalware on additional systems.\nEnterprise T1097 Pass the Ticket BRONZE BUTLER  has created forged Kerberos Ticket Granting Ticket (TGT) and Ticket Granting Service (TGS) tickets to maintain administrative access.\nEnterprise T1086 PowerShell BRONZE BUTLER  has used PowerShell for execution.BRONZE BUTLER  is a cyber espionage group with likely Chinese origins that has been active since at least 2008. The group primarily targets\nJapanese organizations, particularly those in government, biotechnology, electronics manufacturing, and industrial chemistry.  [1][2]\nID: G0060\nAssociated Groups : REDBALDKNIGHT, Tick\nVersion : 1.0\nCreated: 16 January 2018\nLast Modified: 22 March 2019\n[1]\n[1][3]\nATT&CK  Navigator Layers  ®\n[2]\n[2]\n[2]\n[2]\n[2]\n[2]\n[2]\n[2]\n[2]\n[2]\n[2]\n[2]\n[3]\n[3]\n[2]\n[2]\n[2]\n[2]\n[2]\n Domain ID Name Use\nEnterprise T1060 Registry Run Keys / Startup Folder BRONZE BUTLER  has used a batch script that adds a Registry Run key to establish malware persistence.\nEnterprise T1105 Remote File Copy BRONZE BUTLER  has used various tools to download files, including DGet (a similar tool to wget).\nEnterprise T1018 Remote System Discovery BRONZE BUTLER  typically use ping  and Net to enumerate systems.\nEnterprise T1053 Scheduled Task BRONZE BUTLER  has used at and schtasks  to register a scheduled task to execute malware during lateral movement.\nEnterprise T1113 Screen Capture BRONZE BUTLER  has used a tool to capture screenshots.\nEnterprise T1064 Scripting BRONZE BUTLER  has used VBS, VBE, and batch scripts for execution.\nEnterprise T1193 Spearphishing Attachment BRONZE BUTLER  used spearphishing emails with malicious Microsoft Word attachments to infect victims.\nEnterprise T1071 Standard Application Layer\nProtocolBRONZE BUTLER  malware has used HTTP for C2.\nEnterprise T1032 Standard Cryptographic Protocol BRONZE BUTLER  has used RC4 encryption (for Datper malware) and AES (for xxmm malware) to obfuscate HTTP traffic.\nEnterprise T1124 System Time Discovery BRONZE BUTLER  has used net time  to check the local time on a target system.\nEnterprise T1204 User Execution BRONZE BUTLER  has attempted to get users to launch malicious Microsoft Word attachments delivered via spearphishing emails.\nEnterprise T1102 Web Service BRONZE BUTLER 's MSGET downloader uses a dead drop resolver to access malicious payloads.\nSoftware\nID Name References Techniques\nS0110 at Scheduled Task\nS0106 cmd Command-Line Interface, File and Directory Discovery, File Deletion, Remote File Copy, System Information Discovery\nS0187 Daserf Code Signing, Command-Line Interface, Credential Dumping, Data Compressed, Data Encoding, Data Encrypted, Data Obfuscation, Indicator Removal from Tools, Input\nCapture, Masquerading, Obfuscated Files or Information, Remote File Copy, Screen Capture, Software Packing, Standard Application Layer Protocol, Standard Cryptographic\nProtocol\nS0008 gsecdump Credential Dumping\nS0002 Mimikatz Account Manipulation, Credential Dumping, Credentials in Files, DCShadow, Pass the Hash, Pass the Ticket, Private Keys, Security Support Provider, SID-History Injection\nS0039 Net Account Discovery, Create Account, Network Share Connection Removal, Network Share Discovery, Password Policy Discovery, Permission Groups Discovery, Remote System\nDiscovery, Service Execution, System Network Connections Discovery, System Service Discovery, System Time Discovery, Windows Admin Shares\nS0111 schtasks Scheduled Task\nS0005 Windows\nCredential\nEditorCredential Dumping\nReferences[2]\n[2]\n[2]\n[2]\n[2]\n[2]\n[3]\n[2]\n[2]\n[2]\n[3]\n[2]\n[2]\n[2]\n[1] [3]\n[2] [3]\n[2] [3]\n[2]\n[2]\n[2] [3]\n1. Chen, J. and Hsieh, M. (2017, November 7). REDBALDKNIGHT/BRONZE BUTLER’s Daserf Backdoor Now Using Steganography. Retrieved December 27, 2017.\n2. Counter Threat Unit Research Team. (2017, October 12). BRONZE BUTLER Targets Japanese Enterprises. Retrieved January 4, 2018.\n3. DiMaggio, J. (2016, April 28). Tick cyberespionage group zeros in on Japan. Retrieved July 16, 2018.\n© 2015-2020, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\nPrivacy Policy\nTerms of Use\nATT&CK v6.3\n @MITREattack\nContact\n "
}