{
    "title": "buckeye_ espionage outfit used equation group tools prior to shadow brokers leak _ symantec blogs",
    "text": "Symantec's Enterprise Security business will now operate as the Symantec Enterprise division of Broadcom. Click for details.\n\nCritical Attack\nDiscovery and\nIntelligence Team\nSymantec\n\n\n SUBSCRIBE\nBuckeye: Espionage Outfit Used\nEquation Group Tools Prior to Shadow\nBrokers Leak\nWindows zero day was exploited by Buckeye alongside Equation Group tools\nduring 2016 attacks. Exploit and tools continued to be used after Buckeye's\napparent disappearance in 2017.\nKey Findings\nThe Buckeye attack group was using Equation Group tools to gain persistent access to target organizations at least\na year prior to the Shadow Brokers leak.\nVariants of Equation Group tools used by Buckeye appear to be different from those released by Shadow Brokers,\npotentially indicating that they didn't originate from that leak.\nBuckeye's use of Equation Group tools also involved the exploit of a previously unknown Windows zero-day\nvulnerability. This zero day was reported by Symantec to Microsoft in September 2018 and patched in March 2019.\nWhile Buckeye appeared to cease operations in mid-2017, the Equation Group tools it used continued to be used in\nattacks until late 2018. It is unknown who continued to use the tools. They may have been passed to another group\nor Buckeye may have continued operating longer than supposed.\nThe 2017 leak of Equation Group tools by a mysterious group calling itself the Shadow Brokers was one of the most\nsignificant cyber security stories in recent years. Equation is regarded as one of the most technically adept espionage\ngroups  and the release of a trove of its tools had a major impact, with many attackers rushing to deploy the malware and\nexploits disclosed. One of these tools, the EternalBlue exploit, was used to devastating effect in the May 2017 WannaCry\nransomware outbreak .SHAREPOSTED: 7 MAY, 2019 8 MIN READ THREAT INTELLIGENCEBlogs Threat Intelligence/ Menu\n However, Symantec has now found evidence that the Buckeye cyber espionage group ( aka APT3, Gothic Panda) began\nusing Equation Group tools in attacks at least a year prior to the Shadow Brokers leak.\nBeginning in March 2016, Buckeye began using a variant of DoublePulsar ( Backdoor.Doublepulsar ), a backdoor that was\nsubsequently released by the Shadow Brokers in 2017. DoublePulsar was delivered to victims using a custom exploit tool\n(Trojan.Bemstour ) that was specifically designed to install DoublePulsar.\nBemstour exploits two Windows vulnerabilities in order to achieve remote kernel code execution on targeted computers.\nOne vulnerability is a Windows zero-day vulnerability ( CVE-2019-0703 ) discovered by Symantec. The second Windows\nvulnerability ( CVE-2017-0143 ) was patched in March 2017 after it was discovered to have been used by two exploit tools\n—EternalRomance and EternalSynergy—that were also released as part of the Shadow Brokers leak.\nThe zero-day vulnerability allows for the leaking of information and can be exploited in conjunction with other\nvulnerabilities to attain remote kernel code execution. It was reported by Symantec to Microsoft in September 2018 and\nwas patched on March 12, 2019 .\nHow Buckeye obtained Equation Group tools at least a year prior to the Shadow Brokers leak remains unknown.\nBuckeye disappeared in mid-2017 and three alleged members of the group were indicted in the U.S.  in November 2017.\nHowever, while activity involving known Buckeye tools ceased in mid-2017, the Bemstour exploit tool and the\nDoublePulsar variant used by Buckeye continued to be used until at least September 2018 in conjunction with different\nmalware.\nHistory of attacks\nThe Buckeye attack group had been active since at least 2009, when it began mounting a string of espionage attacks,\nmainly against organizations based in the U.S.\nThe group has a record of exploiting zero-day vulnerabilities. These include CVE-2010-3962  as part of an attack\ncampaign in 2010 and CVE-2014-1776  in 2014. Although other zero-day attacks have been reported, they have not been\nconfirmed by Symantec. All zero-day exploits known, or suspected, to have been used by this group are for vulnerabilities\nin Internet Explorer and Flash.\nTimeline of attacks\nBeginning in August 2016, a group calling itself the Shadow Brokers began releasing tools it claimed to have originated\nfrom the Equation Group. It initially released samples of the information it had, offering the full trove to the highest\nbidder. Over the coming months, it progressively released more tools, until April 2017, when it released a final, large\ncache of tools, including the DoublePulsar backdoor, the FuzzBunch framework, and the EternalBlue, EternalSynergy, and\nEternalRomance exploit tools.\nHowever, Buckeye had already been using some of these leaked tools at least a year beforehand. The earliest known use\nof Equation Group tools by Buckeye is March 31, 2016, during an attack on a target in Hong Kong. During this attack, the\nBemstour exploit tool was delivered to victims via known Buckeye malware ( Backdoor.Pirpi ). One hour later, Bemstour\nwas used against an educational institution in Belgium.\nBemstour is specifically designed to deliver a variant of the DoublePulsar backdoor. DoublePulsar is then used to inject a\nsecondary payload, which runs in memory only. The secondary payload enables the attackers to access the affected\ncomputer even after DoublePulsar is removed. It is worth noting that earlier versions did not include any means of\nuninstalling the DoublePulsar implant. This functionality was added in later versions.\nA significantly improved variant of the Bemstour exploit tool was rolled out in September 2016, when it was used in an\nattack against an educational institution in Hong Kong. While the original variant was only capable of exploiting 32-bit\nsystems, the new variant could exploit both 32-bit and 64-bit targets, adding support for newer Windows versions.\n Another new feature of the payload in the second variant allowed the attacker to execute arbitrary shell commands on\nthe infected computer. This custom payload is also designed to copy arbitrary files and execute arbitrary processes on\nthe targeted computer. When used against 32-bit targets, Bemstour still delivered the same DoublePulsar backdoor.\nHowever, against 64-bit targets it delivered only the custom payload. The attackers typically used it to execute shell\ncommands that created new user accounts.\nBemstour was used again in June 2017 in an attack against an organization in Luxembourg. Unlike earlier attacks when\nBemstour was delivered using Buckeye’s Pirpi backdoor, in this attack Bemstour was delivered to the victim by a\ndifferent backdoor Trojan ( Backdoor.Filensfer ). Between June and September 2017, Bemstour was also used against\ntargets in the Philippines and Vietnam.\nDevelopment of Bemstour has continued into 2019. The most recent sample of Bemstour seen by Symantec appears to\nhave been compiled on March 23, 2019, eleven days after the zero-day vulnerability was patched by Microsoft.\nThe purpose of all the attacks was to acquire a persistent presence on the victim’s network, meaning information theft\nwas the most likely motive of the attacks. \nTable 1. Buckeye Tool Usage Over TimeMarch 2016 September 2016 April 2017 June 2017 June 2017 August 2017\nTarget\nlocationsHong Kong,\nBelgiumHong Kong Luxembourg Philippines Vietnam\nTools Backdoor.Pirpi Unknown Backdoor.Filensfer Unknown Unknown\nBemstour\nExploit Tool\n(V1)Bemstour Exploit\nTool (V2)Shadow\nBrokers\nLeakBemstour Exploit\nTool (V1)Bemstour\nExploit Tool (V1\n& V2)Bemstour\nExploit Tool\n(V2)\nDoublePulsar DoublePulsar (32-\nbit) or custom\npayload only (64-bit)DoublePulsar DoublePulsar\n(32-bit) or\ncustom payload\nonly (64-bit)DoublePulsar\n(32-bit) or\ncustom payload\nonly (64-bit)\nThe Filensfer connection\nFilensfer is a family of malware that has been used in targeted attacks since at least 2013. Symantec has found multiple\nversions of the malware, including a C++ version, a compiled Python version (using py2exe), and a PowerShell version.\nOver the past three years, Filensfer has been deployed against organizations in Luxembourg, Sweden, Italy, the UK, and\nthe U.S. Targets included organizations in the telecoms, media, and manufacturing sectors. While Symantec has never\nobserved the use of Filensfer alongside any known Buckeye tools, information shared privately by another vendor\nincluded evidence of Filensfer being used in conjunction with known Buckeye malware ( Backdoor.Pirpi ).\nBemstour exploit tool\nBemstour exploits two Windows vulnerabilities in order to achieve remote kernel code execution on targeted computers.\nThe zero-day vulnerability found and reported by Symantec ( CVE-2019-0703 ) occurs due to the way the Windows SMB\nServer handles certain requests. The vulnerability allows for the leaking of information.\nThe second vulnerability ( CVE-2017-0143 ) is a message type confusion vulnerability. When the two vulnerabilities are\nexploited together, the attacker can gain full access in the form of kernel mode code execution, enabling them to deliver\nmalware to the targeted computer.\nWhen Bemstour was first used in 2016, both vulnerabilities were zero days, although CVE-2017-0143 was subsequently\npatched by Microsoft in March 2017 ( MS17-010 ). CVE-2017-0143 was also used by two other exploit tools—\nEternalRomance and EternalSynergy—that were released as part of the Shadow Brokers leak in April 2017.  \nBuckeye's exploit tool, EternalRomance, as well as EternalSynergy, can exploit the CVE-2017-0143 message type\nconfusion vulnerability to perform memory corruption on unpatched victim computers. In order to obtain remote code\nexecution capabilities, all three exploit tools needed to collect information about the memory layout of attacked systems\nin addition to exploiting the aforementioned message type confusion vulnerability. Each tool performed this differently,\nrelying on different vulnerabilities. In the case of the Buckeye exploit tool, the attackers exploited their own zero-day\nvulnerability (CVE-2019-0703).\nDoublePulsar development\nThe variant of DoublePulsar used in the first attacks performed by Buckeye was different to that leaked by the Shadow\nBrokers. It appears to contain code to target newer versions of Windows (Windows 8.1 and Windows Server 2012 R2),\nindicating that it is a newer version of the malware. It also includes an additional layer of obfuscation. Based on technical\nfeatures and timing, it is possible that this obfuscation was created by DoublePulsar's original authors.\nIt is noteworthy that the attackers never used the FuzzBunch framework in its attacks. FuzzBunch is a framework\ndesigned to manage DoublePulsar and other Equation Group tools and was leaked by the Shadow Brokers in 2017. This\nsuggests that Buckeye only managed to gain access to a limited number of Equation Group tools.\n Unanswered questions\nThere are multiple possibilities as to how Buckeye obtained Equation Group tools before the Shadow Brokers leak. Based\non the timing of the attacks and the features of the tools and how they are constructed, one possibility is that Buckeye\nmay have engineered its own version of the tools from artifacts found in captured network traffic, possibly from\nobserving an Equation Group attack. Other less supported scenarios, given the technical evidence available, include\nBuckeye obtaining the tools by gaining access to an unsecured or poorly secured Equation Group server, or that a rogue\nEquation group member or associate leaked the tools to Buckeye. \nMystery also surrounds the continued use of the exploit tool and DoublePulsar after Buckeye's apparent disappearance. It\nmay suggest that Buckeye retooled following its exposure in 2017, abandoning all tools publicly associated with the\ngroup. However, aside from the continued use of the tools, Symantec has found no other evidence suggesting Buckeye\nhas retooled. Another possibility is that Buckeye passed on some of its tools to an associated group. \nProtection\nSymantec has the following protection in place to protect customers against these attacks:\nFile-based protection\nTrojan.Bemstour\nBackdoor.Doublepulsar\nBackdoor.Pirpi\nBackdoor.Filensfer\nNetwork-based protection (Intrusion Prevention System)\nAttack: SMB Double Pulsar Ping\nAttack: SMB Double Pulsar Response\nAttack: SMB Double Pulsar V2 Activity\nAttack: RDP Double Pulsar Ping\nIndicators of Compromise\nMD5 SHA256 Description\n7020bcb347404654e17f6303848b7ec4 cbe23daa9d2f8e1f5d59c8336dd5b7d7ba1d5cf3f0d45e66107668e80b073ac3 Pirpi (first\nvariant)\naacfef51a4a242f52fbb838c1d063d9b 53145f374299e673d82d108b133341dc7bee642530b560118e3cbcdb981ee92c Pirpi (second\nvariant)\nc2f902f398783922a921df7d46590295 01f53953db8ba580ee606043a482f790082460c8cdbd7ff151d84e03fdc87e42 Command line\nutility to list\nuser accounts\non remote\nmachine\n6458806a5071a7c4fefae084791e8c67 6b1f8b303956c04e24448b1eec8634bd3fb2784c8a2d12ecf8588424b36d3cbc Filensfer\n(C/C++)\n0d2d0d8f4989679f7c26b5531096b8b2 7bfad342ce88de19d090a4cb2ce332022650abd68f34e83fdc694f10a4090d65 Filensfer\n(Powershell)\na3932533efc04ac3fe89fb5b3d60128a 3dbe8700ecd27b3dc39643b95b187ccfd44318fc88c5e6ee6acf3a07cdaf377e Filensfer\n(py2exe)\n58f784c7a292103251930360f9ca713e 1c9f1c7056864b5fdd491d5daa49f920c3388cb8a8e462b2bc34181cef6c1f9c Command line\nSMB client\na469d48e25e524cf0dec64f01c182b25 951f079031c996c85240831ea1b61507f91990282daae6da2841311322e8a6d7 HTran\nThreat intelligence\nIn addition to file-based protection, customers of the DeepSight Intelligence Managed Adversary and Threat Intelligence\n(MATI) service have received reports on Buckeye, which detail methods of detecting and thwarting activities of this\ngroup.\nSymantec Integrated Cyber Defense\n  SUBSCRIBE Privacy Policy Cookie Policy Data Processing and Data Transfers Supplier Responsibility Terms of Use Sitemap\nCopyright © 2005-2020 Broadcom. All Rights Reserved. The term \"Broadcom\" refers to Broadcom Inc. and/or its subsidiaries.Related Blog PostsLearn More About Symantec Integrated Cyber Defense\n2019 Symantec Internet Security\nThreat Report\n\n DOWNLOAD REPORT NOW\nWe encourage you to share your thoughts on your favorite social platform.\n\n INDUSTRY REPORT\nAbout the Author\nCritical Attack Discovery and Intelligence Team\nSymantec\nThe Critical Attack Discovery and Intelligence team is a group of\nsecurity experts within Symantec whose mission is to investigate\ntargeted attacks, drive enhanced protection in Symantec products,\nand offer analysis that helps customers respond to attacks.\nWant to comment on this post?\nMicrosoft Patch Tuesday – March\n2020\nPOSTED: 11 MAR, 2020 28 MIN READ\nMicrosoft Patch Tuesday –\nFebruary 2020\nPOSTED: 12 FEB, 2020 24 MIN READ\nGeopolitical Tensions May\nIncrease Risk of Destructive\nAttacks\nPOSTED: 3 FEB, 2020 3 MIN READ\nIncrease in Emotet Spam\nObserved, Blocked by Symantec\nPOSTED: 20 JAN, 2020 4 MIN READ\n "
}