{
    "title": "carefirst blue cross breach hits 1.1m — krebs on security",
    "text": "ABOUT THE AUTHOR ADVERTISING/SPEAKING\n21\nMAY 15\nThis entry was posted on Thursday, May 21st, 2015 at 9:03 am and is filed under A Little Sunshine , Data\nBreaches . You can follow any comments to this entry through the RSS 2.0  feed. Both comments and pings\nare currently closed.Carefirst Blue Cross Breach Hits 1.1M\nCareFirst BlueCross BlueShield  on Wednesday said it had been hit with a data breach\nthat compromised the personal information on approximately 1.1 million customers. There\nare indications that the same attack methods may have been used in this intrusion as with\nbreaches at Anthem  and Premera , incidents that collectively involved data on more than 90\nmillion Americans.\nAccording to a statement  CareFirst issued\nWednesday, attackers gained access to names,\nbirth dates, email addresses and insurance\nidentification numbers. The company said the\ndatabase did not include Social Security or credit\ncard numbers, passwords or medical information.\nNevertheless, CareFirst is offering credit\nmonitoring and identity theft protection for two\nyears.\nNobody is officially pointing fingers at the parties\nthought to be responsible for this latest health\nindustry breach, but there are clues implicating the same state-sponsored actors from China\nthought to be involved in the Anthem and Premera attacks.\nAs I noted in this Feb. 9, 2015 story , Anthem was breached not long after a malware campaign\nwas erected that mimicked Anthem’s domain names at the time of the breach. Prior to its\nofficial name change at the end of 2014, Anthem was known as Wellpoint. Security researchers\nat cybersecurity firm ThreatConnect Inc.  had uncovered a series of subdomains for\nwe11point[dot]com (note the “L’s” in the domain were replaced by the numeral “1”) —\nincluding myhr.we11point[dot]com and hrsolutions.we11point[dot]com.\nThreatConnect also found that the domains were registered in April 2014 (approximately the\ntime that the Anthem breach began), and that the domains were used in conjunction with\nmalware designed to mimic a software tool that many organizations commonly use to allow\nemployees remote access to internal networks.\nOn Feb. 27, 2015, ThreatConnect published more information  tying the same threat actors and\nmodus operandi to a domain called “ prennera[dot]com ” (notice the use of the double “n”\nthere to mimic the letter “m”).\n“It is believed that the prennera[dot]com\ndomain may have been impersonating the\nHealthcare provider Premera Blue Cross ,\nwhere the attackers used the same character\nreplacement technique by replacing the ‘m’\nwith two ‘n’ characters within the faux\ndomain, the same technique that would be\nseen five months later with the\nwe11point[dot]com command and control\ninfrastructure,” ThreatConnect observed in\na February 2015 blog post.\nTurns out, the same bulk registrant in China\nthat registered the phony Premera and Anthem domains in April 2014 also registered two\nCarefirst look-alike domains — careflrst[dot]com  (the “i” replaced with an “L”) and\ncaref1rst[dot]com  (the “i” replaced with the number “1”).\nAdditionally, ThreatConnect has unearthed evidence  showing the same tactics were used on\nEmpireB1ue.com  (note the “L” replaced with a number “1”), a domain registered April 11,\n2014 (the same day as the phony Carefirst domains). EmpireBlue BlueCross BlueShield\nwas o ne of the organizations impacted by the Anthem breach .\nTags: carefirst bluecross blueshield breach , EmpireBlue BCBS breach , premera , prennera , ThreatConnect ,\nwe11point , wellpoint\n60 comments \nMailing List\nSubscribe here\nRecent Posts\nCoronavirus Widens the Money\nMule Pool\nThe Web’s Bot Containment Unit\nNeeds Your Help\nLive Coronavirus Map Used to\nSpread Malware\nCrafty Web Skimming Domain\nSpoofs “https”\nMicrosoft Patch Tuesday, March\n2020 Edition\nAll About Skimmers\nClick image for my skimmer series.\nSpam Nation\nA New York Times Bestseller!\nThe Value of a Hacked PC\nBadguy uses for your PC\nTools for a Safer PC\nTools for a Safer PC\nThe Pharma Wars\nSpammers Duke it Out\nBadguy Uses for Your Email\nYour email account may be worth\nfar more than you imagine.\neBanking Best Practices\neBanking Best Practices for\nBusinesses\nMost Popular Posts\nSextortion Scam Uses Recipient's\nHacked Passwords  (1076)\nOnline Cheating Site\nAshleyMadison Hacked  (798)\nSources: Target Investigating Data\nBreach  (620)\nCards Stolen in Target Breach\nFlood Underground Markets  (445)\nReports: Liberty Reserve Founder\nArrested, Site Shuttered  (416)\nWas the Ashley Madison Database\nLeaked?  (376)\nTrue Goodbye: 'Using TrueCrypt\nIs Not Secure'  (363)\nWho Hacked Ashley Madison?\n(361)\nFollowing the Money, ePassporte\nEdition  (353)\nU.S. Government Seizes\nLibertyReserve.com  (315)\nCategory: Web Fraud 2.0\nInnovations from the Underground\nID Protection Services Examined\nIs Antivirus Dead?\nThe reasons for its decline\nThe Growing Tax Fraud\nMenace\nFile 'em Before the Bad Guys Can\nInside a Carding Shop\nA crash course in carding.\nBeware Social Security Fraud\nSign up, or Be Signed Up!\nHow Was Your Card Stolen?\nFinding out is not so easy.\nKrebs’s 3 Rules…\n...For Online Safety.\n© 2020 Krebs on Security.  Powered by WordPress .  Privacy Policy\n Subscribe to RSS\n Follow me on Twitter\n Join me on FacebookAdvertisement\nKatrina L.\nMay 21, 2015 at 9:13 am\nSo they managed to only steal insurance ID info but not SSNs, medical information and\ncredit card info? Sorry, that just does not sound true.\nmike~acker\nMay 21, 2015 at 9:17 am\nonce again the real issue is that client computers are not required to authenticate and\ncountersign x.509 certificates using their local copy of PGP or GnuPG.\nCertificates distributed en mass by browser software makers should be accorded only\nmarginal trust\nbefore using a certificate for critical processing the client needs to make sure that the\ncorrect certificate is being used.\nthis will require a second authentication over and above the current system of Certficate\nAuthorities.\nmy suggestion is that local credit unions could help with this. then need to do it for their\nonline banking activity anyway …\nwe also need to dispel the myth that PGP is too complicated for people to use. it isn’t,\nparticularly when properly packaged .\nFred Schlip\nMay 21, 2015 at 4:03 pm\nThe problem is that end users are dumb. No amount of authentication magic will stop\nstupid.\npatti\nMay 21, 2015 at 11:03 pm\nHarsh. Most folks don’t have any idea what makes the internet work. What we need\nis a better system.\npboss\nMay 22, 2015 at 7:45 am\nA better system would probably be going back to paper. But even then, people\nare mind-boggling stupid when it comes to challenging people trying to sneak in\na building.\nMark Allyn\nMay 22, 2015 at 3:06 pm\nOnce upon a time, when I showed up at a building for a job interview, I did\nnot know it I was even at the correct campus, let alone building as my\ndirections in the invite mail (paper days) were poor.\nWhen I arrived, they not only buzzed me in but all but pulled me in by the\narm through the lobby and into the inner-sanctum. When we found out that I\nwas in the wrong building, they did not bother to escort me back out but to\npoint through the window to the building I was supposed to go to.\nPlease, folks, check me out before pulling me in by the arm into the wrong\nbuilding and please do not leave me standing there, but escort me to the\ncorrect place.\nNow, these types of errors are not unique to now. They happened\nthroughout the ages!\nMarkus\nMay 24, 2015 at 11:02 pm\nI have a friend who was a teacher at a school. She was sitting in the staff room\ndoing some work when an IT guy came in to take some of the laptops away to\n‘service’ them. She even had a chat with him for a while. It wasn’t until after\nhe left that another teacher came in and asked where all the computers\nwhere. Turned out he was just some guy off the street dressed like a IT\nprofessional. Doesn’t matter what safeguards you put in place, people will\nalways be the weakest link.\nLisa\nMay 21, 2015 at 9:22 am\nWhy don’t these companies/insurers/etc learn from each other and take steps to prevent\nthis from happening? I understand the ‘It’ll never happen to me’ mentality to a point but\nc’mon people you’ve been entrusted with very valuable information and if it ever does get\nfully cleaned up it’ll take years!\nGeorge G\nMay 21, 2015 at 10:08 am\n“I understand the ‘It’ll never happen to me’ mentality to a point”\nI don’t.\nOne of the things I learned from Brian’s blog:\nIt is not a question of if, but when.\nDave B.\nMay 21, 2015 at 10:11 am\nBecause in order to implement what was learned they would have to spend money.\nBillbo\nMay 21, 2015 at 12:08 pm\nAnd there’s no penalty if they leave the barn door open.\ntimeless\nMay 22, 2015 at 8:15 am\nIt sounds like the various health insurance breaches discussed here were carried out in\nparallel, we’re just learning about them serially. You can’t blame one of these companies\nfrom not learning from its peers given that they were all attacked at the same time and\ntook over a year to analyze and report…\nAlso, the attacks are basically social engineering. A company can know that’s a risk, but\nit’s really hard to protect against that risk. I’m not sure if people were attacked only\nthrough corporate devices or also through personal ones, if the latter, then there’s very\nlittle the company could have done– you can’t log connections that aren’t made by your\ndevices and aren’t made to your devices. You could ask people to review the connection\nlog each time they connect, but people will quickly adapt to the “yeah, whatever”\nbutton.\nwhatever\nMay 22, 2015 at 6:25 pm\nBecause the don’t care? Because these breaches won’t hurt them in any way?\nSoy Tenley\nMay 23, 2015 at 2:45 am\nMaybe it’s because the CEOs are too big for their breaches.\nLeon J.\nMay 26, 2015 at 11:57 pm\nKeep in mind that it is difficult to change an environment where there are several\nlayers, or more, of staff below the CEO. For various reasons, they may have been\ndeficient in providing adequate security, and now these people will feel defensive\nand threatened. This situation acts as a coagulant to the change that needs to occur.\nI also suspect that the threatscape now is a complex problem to comprehend for\npeople who don’t live and breathe cyber security. That being said, I also see the\nfinancial aspect as a valid culprit, as often times the basics get neglected in favor of\nlanding a working product.\nChristopher Karel\nMay 21, 2015 at 10:02 am\nFor anyone out there looking to avoid falling for this sort of trap: Get a password manager.\n(Lastpass, 1Pass, etc) Modern password managers come with browser plugins that can auto-\nfill your credentials for the website you’re on. They’re also not fooled by domain names\nthat look like another. Computers are impossible to trick with such character substitutions.\nThe fact that your password manager doesn’t allow you to auto-fill your credentials is an\neasy red flag that you’re being phished.\nAnd that’s on top of all the other incredible security benefits a password manager provides.\nmarkD\nMay 21, 2015 at 10:30 am\nAny recommendations as to which pw manager to use?\nJimV\nMay 21, 2015 at 10:36 am\n+1 for LastPass — I have used it now for several years with no problems or issues,\nalthough there are a few sites where it won’t automatically fill in the blanks (likely a\nscript being blocked by NoScript). In those instances, a right-click in the UI/PW\nboxes brings up a window from which a LP instruction can be issued, so it’s not a big\ndeal.\nJon Marcus\nMay 21, 2015 at 11:00 am\nI’ve been happy with LastPass so far. (Had it for a few years now.)\nChristopher Karel\nMay 21, 2015 at 11:08 am\nI’m personally a fan of LastPass ( https://lastpass.com/ ) because it’s the easiest to\nsetup and use. The notable downside is that the data is stored (encrypted) on\nLastPass’ servers. Creating a significant and obvious target for hackers.\nBut in my experience, it’s hard enough getting people started at all. So the additional\noverhead of having to configure separate backup/synchronization for other\nsolutions is just too much.\nAndrew Rossetti\nMay 21, 2015 at 11:33 am\nLastPass, without any hesitation. Been using it for years (premium version). Well\nworth $1 per month.\nKT\nMay 21, 2015 at 1:17 pm\nThere are several to choose from, but I landed on SafeInCloud. Works on Android,\nIOS, and Windows.\nFred Schlip\nMay 21, 2015 at 4:05 pm\nExcept now you are giving the exact tools to hackers. What happens when\nmalware running on your endpoint harvests your password locker?\nNow it knows not only your password, but what site it is associated with.\nIan McKenzie\nMay 21, 2015 at 5:27 pm\nI use LastPass premium across all my devices in addition to enabling two-factor auth\non every service that offers it.\npatti\nMay 21, 2015 at 11:05 pm\nAdding complexity doesn’t necessarily solve a problem and can create new ones.\nAny time you use the cloud, you risk everything.\nJohn B\nMay 21, 2015 at 11:52 pm\nLastpass is by far the best in terms of ease of use and methods they use to protect\nyour security.\nBuddha Chris\nMay 22, 2015 at 2:03 pm\nLastpass +1 (WITH TWO-FACTOR AUTHENTICATION), and it should force\nyou to log in each time you start the browser. For sensitive sites it should not\nauto-log in but force you to re-enter the pass phase. For your sensitive sites, it\nshould be set to prompt for the password to review the clear text version of it.\nThe issue here is if your computer gets pwnd, and your Lastpass is set to auto-\neverything then all your passwords can be sucked down in a single gulp and in\nsome ways it’s just as bad or worse then using the same passwords on all sites.\nThe best part is I as an attacker now have a list of all the sites your on. So\npassword repositories can be a two-edged sword.\nSome sites like your bank, brokerage or other sensitive accounts should have a\nsolid pass phase in your human storage unit only.\nLastpass is AWESOME, but even great tools can be misused or mis-configured.\nCNorm\nMay 22, 2015 at 11:26 am\nTo all who are suggesting auto-fill from a password manager is a good feature,\nremember that this is a heavy tradeoff:\nhttps://www.schneier.com/blog/archives/2014/09/security_of_pas.html\nPassword safety is a little bit difficult, and requires discipline to stay ahead of the curve,\nbut consider the information your password safeguards (card #s, address, retirement\ninfo, etc.).\nFred Schlip is right, and keep in mind coffee shop landing pages can be configured to\ngrab all of your passwords without you even knowing it.\nA password manager, however, is basically a prerequisite for safer online commerce. I\nuse KeePass without any plugins, copy and paste works just fine (KeePass clears your\nclipboard after a user-configurable delay).\nYair\nMay 22, 2015 at 5:32 pm\nI’m surprised not a word has been said about strengthening user awareness to Phishing\nattacks.\nThere are some very powerful Phishing Simulation tools available today that empower\nCISOs to effectively manage their organization’s susceptibility to Phishing attacks.\nEd\nMay 21, 2015 at 10:05 am\nIn my experience, it’s not just the “it won’t happen to me/us” mentality, it’s also the fact\nthat many of these organizations are penny wise and dollar foolish when it comes to\nmanaging IT security. Throw in the sophistication of the attacks, not to mention that the\nonly “ethic” the fraudsters have is that they have none…these will continue to promulgate.\nConsider healthcare in the US. It is the most heavily regulated industry in the country by\nfar. In fact, it’s so heavily regulated, you have parts of one law literally contradicting the\nparts of another law. For example, federal laws are requiring the open sharing of patient\ninformation between various electronic health Record (EHR) software vendors. On the\nsurface, the reasons are pure. If, for example, your EHR records are present at a facility\nwhich is managed by Allscripts EHR software, and you have a health emergency, and you\nwind up in a hospital managed by Epic’s EHR, there could be gaps in your care unless the\nhospitals can seamlessly share your medical information. The problem is, this very concept\nflies in the face of federal HIPAA laws. Not to mention, how do you protect those sensitive\ncommunications from breaches….if what’s going on is any indication, you will be hard-\npressed. So, here’s one example where it can be argued federal laws are contradicting each\nother. This is a very real problem for healthcare IT departments to deal with. What does\nthis mean to a fraudster? Opportunity, my friends, opportunity.\nmarkD\nMay 21, 2015 at 10:28 am\nOne wonders how it is that the other blues around the country, all pretty much related in\nthe same way the baby bells are, don’t immediately know to take steps after hearing about\nAnthem.\nEd\nMay 21, 2015 at 10:37 am\nIt is entirely possible that they WERE taking those steps. The Anthem breach without\nquestion exposed certain vulnerabilities. So, let’s say BCBS saw this and said…”oh wow,\nthat could happen to us. The logistics of having to identify the issue throughout hosts of\nservers and endpoints, identifying the best remedy, identifying the vendor from which\nto purchase it or developing it on your own, installing it, getting it to mesh with existing\nsoftware, rolling it out to thousands of endpoints, etc. and so on. I don’t know for sure\nthat BCBS did, in fact, recognize the issue and try to prevent, but even if they did, it’s\nnot always as simple as downloading a patch. Believe me, hackers know this.\nmarkD\nMay 21, 2015 at 12:13 pm\nHere’s some folks offering a start.\nhttp://www.darkreading.com/radio.asp?\nwebinar_id=194&cid=DRRS03_0602&gateway_return=true\nRob\nMay 22, 2015 at 11:22 am\nThis looks like it was discovered as part of CareFirst’s response to the Anthem attack.\nThe statement from CareFirst that Brian linked to, states “This was discovered as a part\nof the company’s ongoing Information Technology (IT) security efforts in the wake of\nrecent cyberattacks on health insurers.”\nThe breach happened in June 2014, long before the Anthem attack had been\ndiscovered/announced. So I don’t think it’s fair to imply that they didn’t learn from the\nAnthem attack.\nBlanche Dubois\nMay 21, 2015 at 10:52 am\nBrian\nHas there been any discussion/serious speculation on the reasons why a state actor would\nwork over months to penetrate US large medical insurers or administrators?\nWhat’s the material direct or indirect national interest to them from stealing this data?\nI can understand a state actor targeting a large US defense contractor (get F-35\nblueprints/avionics suit, nuke weapon miniaturization, etc).\nStealing medical access credentials makes sense for a private enterprise criminal group for\nresale to those without US medical insurance (uninsured citizens, illegal aliens, etc.)\nMillions of potential sales there.\nInsert spies with US credentials?\nOr are these attacks considered training exercises to raise/test skills at the high school\nlevel, in prep for the serious stuff?\n(Will presume the state actors have bigger objectives here than just embarrassing private\nUS firms.)\nWhat are the announced reasons on the US side for the attacks on health insurer’s?\nwiredog\nMay 22, 2015 at 7:05 am\nThere’s a blackmail potential. You have AIDS, or Herpes, or some other disease that\ncarries a social stigma, especially in a more conservative place. Or maybe a past mental\nhealth issue. One day you get the call “Start feeding us information or we’ll tell your co-\nworkers|neighbors|parents” about it.\nThe security clearance process is often looking for people who are blackmail or bribery\nrisks. Which is why I put everything that got me into AA down on the SF-86, even\nthough I probably didn’t have to. If some Chinese agent comes to me and says “Tell us\nall your secrets or we’ll tell your friends|employers|family you’re a former crack\ndealer” I can reply “They already know” and call the security hotline. Only downside is,\nI can never work a DEA contract.\nLee Church\nMay 24, 2015 at 9:59 pm\nRE: decouple the ‘why’ from likelihood of the ‘what’ (probability of event does not\ndepend on our understanding of why an event happens)\nAs human beings we try to make sense of the world. In doing so, we often fall to a\nmental error of requiring the ‘why’ before we can accept the ‘what’. In general, just\nbecause the ‘why’ of something is not understood should not influence our assessment\nof the probability of a scenario. In other words, our own understanding does not make\nthe ‘what’ more or less likely.\nI often hear folks discuss the ‘why’ as a modifier to the likelihood of an event, and it’s a\nhuge logical mistake. It’s whether it’s possible and the consequences, not whether we\nunderstand ‘why’ it would happen. Coupling them basically multiplies the odds of the\nevent and our understanding, making the result even less clear.\nBrian Krebs has succumbed to this error as well (notably in his NK attribution posts), so\nit’s by no means a rare mistake. Our analysts missed 9/11 in part due to dismissing an\nevent because it had no known ‘why’ answer to why would anyone want to do such a\nthing.\nA corollary to demanding ‘why’ to accept ‘what’ is that we are also tricked by a false\n‘why’. Once we think we understand ‘why’ we assign a greater likelihood to the event,\neven if the ‘why’ is false. We all know people who just want an answer, and any answer is\nfine with them.. but until they get an answer they are not satisfied. So another\nexploitation is to present a false but plausable ‘why’ and it leads to errors on the flip\nside, or over estimating likelihood.\nSo please folks, particularly Infosec and security people, when you find yourself giving\nup on a scenario because of lack of clarity on ‘why’, resist the natural human urge to\ndismiss a probability of the event, particularly if the consequence of the event is large\nor unknown. And when we think we know ‘why’, remember we can be wrong as much, if\nnot more than if we don’t know ‘why’ at all.\nSometimes, the ‘why’ presents itself much later after an event… and sometimes never.\nThis is the nature of tail event risks and I would suspect that most tail events have the ‘it\ncould not have been otherwise’ though pre-event analysis never sees it coming.\nOne final thought for those that are interested. When the ‘black hats’ know folks dismiss\nevents that have no readily answerable ‘why’, they can design events that exploit that\nbehavior. So it’s up to the Infosec and security folks to make sure we take away that bit\nof human behavior exploitation.\nanyway, hope this was of use.\nregards\nSoy Tenley\nMay 25, 2015 at 12:14 am\n“Why” reminds me of little kids, and of the character Mindy in the Animaniacs\ncartoons. From Wikipedia :\nOften she would try asking grown-ups questions, and for each answer they gave, she\nwould ask “Why?”, get another answer, and then ask “Why?” again. Once the adult\nwas fed up with her, she would say “Okay, I love you, bye-bye,” and leave.\nJon Marcus\nMay 21, 2015 at 11:02 am\nOh, Carepoint is offering free credit monitoring and ID theft prevention services? Well\nthen it’s all okay, their customers will be completely safe.\nRobert Scroggins\nMay 21, 2015 at 11:26 am\nWhat happens to these companies that are breached? Besides owning up to it and suffering\nloss of customers/respect, are there any penalties to which they are subject? Some of\nthrese companies suffer multiple breaches after the first one. If loss of customers doesn’t\nhave any effect on their future security posture, then perhaps a penalty would do it.\nRegards,\nBill Stadler\nMay 21, 2015 at 12:08 pm\nThis is what an attitude of arrogance gets you. The mind games the execs at the Blues play\nwith themselves is astonishing. Yes it can and does happen and we the American Health\nCare Consumers pay the price. They try to justify and no doubt mitigate expense by\ninsinuating no sensitive information was obtained-ridicules. Adding insult to injury.\nNeo\nMay 21, 2015 at 2:55 pm\nThe saddest part about this is that most healthcare companies don’t give a dam about there\nIT infrastructure and just see it as an expense, and why they should dump money into “IT”\nand could still get hacked. They are being careless with our information and are most likely\nnot taking the proper precautions with our sensitive information. They would rather take a\nchance and possible have more money in their pockets at the end of the year, rather then\ninvest it into solid security infrastructure. And the weakest link still is human stupidity.\nCan’t fix stupid.\nBob Adams, MD, MBA\nMay 21, 2015 at 4:11 pm\nThese attacks are now detectable almost instantly.\nOur Eagle Vision software can watch an entire BCBS database for date transfers to\nunauthorized locations.\nGiovanni\nMay 21, 2015 at 5:57 pm\nAnd if the data is siphoned through a trusted channel?\nSoy Tenley\nMay 23, 2015 at 2:51 am\nBut cannot detect MITM exfiltration (Man-In-The-Middle).\nGPC\nMay 21, 2015 at 4:48 pm\nThere’s a pretty heavy strain of “blame the victim” in the comments, as if these companies\nare akin to banks that left the safe door wide open, or car owners that left the keys on the\ndriver’s seat. Given the facts as Brian describes them, it may be unfair to assume that these\ncompanies were asleep at the security switch. They got hacked because their employees fell\nvictim to a phishing scheme, and once the bad guy has the credentials of a trusted user, it’s\npretty close to game over. Perhaps there’s something they could have done to prevent the\nbad guys from getting into the actual company network once they phished\nusernames/passwords (2FA springs to mind–Brian?), but getting user creds is a ticket\ninside, and one that might not easily be prevented through additional company-side\nmeasures.\nPresident Donald J Trump\nMay 21, 2015 at 7:48 pm\nChina can not be trusted !\njim\nMay 22, 2015 at 11:03 am\nIs it not possible that a website or attack can come from a compromised device? Or from a\nthird party area? Or register a domains name in another country? Just saying, don’t look at,\nthe attack came from China. And say they are the bad guy. That’s too simple. It could have\nbeen a weak defense to start with.\nAbout using a third party, for password protection, I believe, the major news services\nannounced one had been broken into, and compromised. It may be safer to encrypt your\ndevice. But then, if you upgrade. Did you write it all down.\nAnd remember this, all the devices made for consumer use, phones and tablets are made in\na third country, the report back, is a built in feature. But what is it reporting back?\nSoy Tenley\nMay 23, 2015 at 2:52 am\nCould be a cheap router that is compromised.\nsteven\nMay 22, 2015 at 1:47 pm\nChina is working together with Latin America and North America as they work this region,\nnobody paid attention to this type of fraud, sale of information and identities. China saw a\nvery good business, now work together and this being more effective attacks\nat some point I could see the sale of information, which wanted to integrate the market, in\nthe forums fraud,\nnobody gave importance and now ranks China as it spread in North, Central America and\nsub America\nJim\nMay 22, 2015 at 3:26 pm\nWouldn’t two factor authentication of prevented this or am I missing something?\ntimeless\nMay 25, 2015 at 3:59 am\nI think you’re missing something.\nThink about how Remote Access Trojans work.\nImagine an employee is authorized to do certain things, and imagine someone\nsuccessfully spearfishes them with the intent to deliver malware to their computer.\nThat computer is now compromised, they get a “your session has expired” message–\nsomething that they’re used to experiencing due to company policy. They log in and\nreceive their 2FA message. They use it to confirm their connection. The software now\nborrows that confirmed connection and performs the attacks and data exfiltration.\n(This kind of attack has been described on this blog for banking account compromises–\ntypically payroll)\n2FA isn’t a panacea. In this case, an older technology from the credit card industry is\nmore important: atypical customer pattern detection. When I make a purchase using\nmy credit card, my credit card issuer compares all the details of the transaction against\nmy profile, and if the transaction isn’t a good match for my profile, or perhaps for\npeople with similar profiles, then they either block the transaction or my account in\ngeneral and contact me to explain that they’ve detected a problem.\nIf the databases that the employee is authorized to access aren’t directly compromised\nand are capable of comparing the employee’s requests to typical requests by that\nemployee, then they could potentially recognize a query for too much data…\nThe other technology that would help is really similar technology, but instead of having\ndetection running between the users and the databases that holds the data, similar\ntechnology could run between the employees and the rest of the Internet. —\nunfortunately, since the Internet is moving to encrypted traffic for everything, this task\nis much harder, so the analysis would be mostly looking at time & date, network\ndestination (which is a poor indicator since any network can host compromised\ncomputers), and data volume (which means that it could catch large scale leaks, but\nwould probably miss targeted instances).\nSKINET\nMay 22, 2015 at 8:53 pm\nIt’s more trouble than it is worth, thanks to the law.\nIgor Artimovich\nMay 24, 2015 at 7:26 am\nIt looks like that Brian worries that stolen database nevertheless includes medical\ninformation. Yes, Brian, that’s true reason to be nervous because now all hackers know how\nmuch money was paid to your doctors for the treatment of your acute dementia.\nItguyatl\nMay 24, 2015 at 12:22 pm\nI am just postulating here but …. Why do we think “whomever” is targeting insurance\ncompanies….??? A theory I have is that we were all supposed to get health care because the\npresident said so. In the country where these hackers originate “” if their leader said do\nsomething they would have to. Does anyone think we are all being compiled in a data base\nsomewhere… I shudder to think what purpose someone could put the information too if\never they decided to.\nSoy Tenley\nMay 25, 2015 at 12:38 am\nPrior to the ACA, gaining access to all the data would give hackers and scammers\ninformation about people who actually had money to spare, the middle class and upper\nmiddle class, as low-income and no-income (poor) people would not be in those\ndatabases. A those people have little to take directly, and nothing to take remotely, they\nare not targets for scamming.\nYou have heard of the enormous number of scammer calls claiming to be with the IRS\nand demanding immediate payment? With fresh data – names, addresses, phone\nnumbers – the scammers are better able to target people with threats and intimidation,\nthrough voice training, even when the targets know the IRS handles notifications by\nmail.\nGo to the 800notes.com website and peruse the home page, or better yet, when you get\nany scam call, Google the CallerID number and see what appears in the search results.\nMike\nMay 25, 2015 at 1:18 pm\n“…Does anyone think we are all being compiled in a data base somewhere…”\nWhat do you think all those massive data centers are for? What do you think Facebook\nis for? What do you think online advertising is for? What do you think targeted\nadvertising is for? What do you really think all these updates are for\n(sercurity….lmfao)? Why do you think no one has much desire to get rid of flash or\njava? Why do think think websites are demading you use your real name as logins?\nThere are many many more…..\nWhat would the point in any of this be if not THAT?\ndbalad123\nMay 24, 2015 at 3:52 pm\nMandient was called in to do the post mortem of the attack. That is how they know there\nwas no penetration of the SSN and Medical Data DBs which are separated for this very\nreason.\nMandient was the Security group that identified the Chinese special military group that was\ntasked with hacking for the country.\nAs to why these insurance companies were attacked, it’s because they serve the area that\nincludes NSA, CIA, DIA, NRO, NPIC (now geospatial) and the like. The espionage value of\nthe data lies in gaining further access to employee accounts who work at targeted agencies\nthrough bank and medical records to see who is most susceptible for recruitment through\nbribes based on their lifestyle and needs.\nJayren Ho\nMay 25, 2015 at 5:08 am\nWell then, I think the biggest immediate threat for CareFirst customers may come from\nphishing scams, as criminals attempt to use customers’ stolen email addresses to coax them\ninto clicking malicious links or disclosing more sensitive data.\nsydkdy\nJune 2, 2015 at 11:15 am\nAnd they said, give us all your data for our wellness program and we will help you feel\nbetter, enjoy life more, be healthier. It’s safe, it’s the right thing for you to do. Then the evil\nones came and stole the data and now they say, it’s not so bad, they don’t have all your data,\njust some pieces which are useless without the other pieces. Believe in the magic, drink the\nkool-aid, have no fear, sleep well my friends. TRUST ME??? REALLY!!! What a bunch of\nmanure.Advertisement\n "
}