{
    "title": "catching up on the opm breach — krebs on security",
    "text": "ABOUT THE AUTHOR ADVERTISING/SPEAKING\nOPM offices in Washington, DC. Image: Flickr.15\nJUN 15\n← Older CommentsThis entry was posted on Monday, June 15th, 2015 at 11:25 am and is filed under A Little Sunshine , The\nComing Storm . You can follow any comments to this entry through the RSS 2.0  feed. Both comments and\npings are currently closed.Catching Up on the OPM Breach\nI heard from many readers last week who were curious why I had not weighed in on the\nmassive (and apparently still unfolding) data breach at the U.S. Office of Personnel\nManagement  (OPM). Turns out, the easiest way for a reporter to make sure everything hits\nthe fan from a cybersecurity perspective is to take a two week vacation to the other end of the\nworld. What follows is a timeline that helped me get my head on straight about the events that\npreceded this breach, followed by some analysis and links to other perspectives on the matter.\nJuly 2014:  OPM investigates a\nbreach of its computer networks\ndating back to March 2014.\nAuthorities trace the intrusion to\nChina. OPM offers employees\nfree credit monitoring\nand assures employees  that no\npersonal data appears to have\nbeen stolen.\nAug. 2014:  It emerges\nthat USIS , a background check\nprovider for the U.S.\nDepartment of Homeland Security , was hacked. USIS offers  27,000 DHS employees\ncredit monitoring through AllClearID  (full disclosure: AllClear is an advertiser on this blog).\nInvestigators say Chinese are hackers responsible, and that the attackers broke in\nby exploiting a vulnerability  in an enterprise management software product from SAP. OPM\nsoon suspends work with USIS.\nNovember 2014:  A report  (PDF) by OPM’s Office of the Inspector General  on the\nagency’s compliance with Federal Information Security Management Act  finds “significant”\ndeficiencies in the department’s IT security. The report found OPM did not maintain a\ncomprehensive inventory of servers, databases and network devices, nor were auditors able to\ntell if OPM even had a vulnerability scanning program. The audit also found that multi-factor\nauthentication (the use of a token such as a smart card, along with an access code) was not\nrequired to access OPM systems. “We believe that the volume and sensitivity of OPM systems\nthat are operating without an active Authorization represents a material weakness in the\ninternal control structure of the agency’s IT security program,” the report concluded.\nDec. 2014 : KeyPoint , a company that took over background checks for USIS, suffers\nbreach . OPM states that there is “no conclusive evidence to confirm sensitive information was\nremoved from the system.” OPM vows to notify 48,439 federal workers that their information\nmay have been exposed in the attack.\nFeb. 2015:  Health insurance giant Anthem discloses breach  impacting nearly 80 million\ncustomers. Experts later trace domains, IP addresses implicated in attack to Chinese hackers .\nAnthem offers  two years of free credit monitoring services through AllClearID.\nMay 2015:  Premera Blue Cross, one of the insurance carriers that participates in the Federal\nEmployees Health Benefits Program, discloses a breach affecting 11 million customers. Federal\nauditors at OPM warned Premera  three weeks prior to the breach that its network security\nprocedures were inadequate. Unlike the Anthem breach, the incident at Premera exposes\nclinical medical information in addition to personally identifiable information. Premera offers\ntwo years of free credit monitoring through Experian .\nMay 2015:  Carefirst Blue Cross discloses breach impacting 1.1 million customers. Clues\nunearthed by researchers point to the same attack infrastructure and methods  used in the\nAnthem and Premera breach. Carefirst  offers  two years free credit monitoring through\nExperian.\nJune 2015:  OPM discloses breach affecting up to 4 million federal employees, offers  18\nmonths of free credit monitoring through CSID . Follow-up reports indicate that the breach\nmay extend well beyond federal employees to individuals who applied for security clearances\nwith the federal government.\nANALYSIS\nAs the OPM’s Inspector General report put it, “attacks like the ones on Anthem and Premera\n[and OPM] are likely to increase. In these cases, the risk to Federal employees and their\nfamilies will probably linger long after the free credit monitoring offered by these companies\nexpires.”\nThat would appear to be the understatement of the year. The OPM runs a little program\ncalled e-QIP , which processes applications for security clearances for federal agencies,\nincluding top secret and above. This bit, from a July 10, 2014 story  in The Washington Post ,\nputs the depth and breadth of this breach in better perspective:\n“In those files are huge treasure troves of personal data, including “applicants’\nfinancial histories and investment records, children’s and relatives’ names,\nforeign trips taken and contacts with foreign nationals, past residences, and\nnames of neighbors and close friends such as college roommates and co-workers.\nEmployees log in using their Social Security numbers.”\nThat quote aptly explains why a nation like China might wish to hoover up data from the OPM\nand a network of healthcare providers that serve federal employees: If you were a state and\nwished to recruit foreign spies or uncover traitors within your own ranks, what sort of\ngoldmine might this data be? Imagine having access to files that include interviews with a\ntarget’s friends and acquaintances over the years, some of whom could well have shared useful\ninformation about that person’s character flaws, weaknesses and proclivities.\nFor its part, China has steadfastly denied involvement. Politico cites a news story from\nthe Chinese news service Xinhua  which dismissed  the U.S. allegations as “obviously another\ncase of Washington’s habitual slander against Beijing on cybersecurity.”\n“It also pointed to the information disclosed by former NSA subcontractor Edward Snowden,\nsaying the U.S. itself is guilty of ‘large-scale, organized cyber theft, wiretapping and\nsupervision of political figures, enterprises and individuals of other countries, including\nChina’,” Politico ‘s David Perera  writes .\nThere are some who would say it is wrong or at least foolhardy to dwell on forensic data and\nother clues  suggesting that hackers closely allied with the Chinese government were involved\nin these attacks. Indeed, there is a contingent of experts who argue that placing so much\nemphasis on attribution in these sorts of attacks is a diversion that distracts attention and\nresources from what really matters: learning from one’s mistakes and focusing on better\nsecuring and maintaining our critical systems.\nAs part of my visit to Australia (and then to gorgeous  New Zealand) these past few weeks, I was\ninvited to speak at two separate security conferences. At one of them, my talk was preceded by\na speech from Mike Burgess , chief information security officer at Telstra , Australia’s\nlargest telecom provider. Burgess knows a few things about attribution: He is an 18-year\nveteran of the Australian Signals Directorate  (formerly the Defence Signals Directorate\nand the Australian equivalent of the U.S. National Security Agency ).\nIn his speech, Burgess railed against media reports about high-profile cyber attacks that\ncreated an atmosphere of what he called “attribution distraction” and “threat distraction.” A\nreporter with ZDNet captured  Burgess’s thoughts with this quote:\n“Don’t get me wrong….I’m not saying that attribution isn’t important. I’m not\nsaying that issues of source, great technical intelligence, and other forms of\nintelligence to understand the threat and the intentions of those looking to steal\ninformation from you, or disrupt your organisation for some purpose that may\nbe unknown to you, [are not important].”\n“But what I observe, what I fear, what I see too much of, is many commentators,\nmany in the industry, and many in media, focus on attribution, with very little\nfocus on the root cause. No-one should lose valuable information where at the\nroot cause there is a known remedy. For me, that is unforgivable in this day and\nage. And I’ve got to tell you — my view at least — too much of this distraction\naround attribution takes away from focusing on what’s really important here.”\nThere is, no doubt, a great deal of wisdom in Mr. Burgess’s words. After all, OPM clearly could\nhave been doing much more  to beef up security around its very sensitive stores of data. But\nperhaps Burgess was onto something for a different reason: At least as it relates to the United\nStates’ tenuous relations with China, having strong indicators of attribution in an attack of this\nmagnitude puts the White House rather publicly between a rock and a hard place.\nAs The New York Times  writes , the Obama administration now finds itself under pressure to\nrespond in some way, and is reportedly considering financial sanctions against China. But as\nThe National Journal  wryly observes, this is a bit of an awkward position for a government\nthat hardly holds the moral high ground when it comes to spying on and hoovering up data\nfrom foreign governments.\n“That’s partially because in the two years since Edward Snowden’s leaks about U.S.\nsurveillance, the Obama administration has repeatedly argued that hacking into computer\nnetworks to spy on foreigners is completely acceptable behavior,” writes  Brendan Sasso. “It\nwon’t be so easy for the U.S. to express indignant outrage just because it’s on the opposite side\nof the surveillance this time.”\nIf you’re affected by these breaches and wondering what you can do to protect yourself\nbesides signing up for credit monitoring services, please see this story .\nTags: Brendan Sasso , David Perera , Mike Burgess , National Journal , national security agency , New York\nTimes , OPM Breach , OPM hack , Politico , Telstra , washington post\n73 comments \nMailing List\nSubscribe here\nRecent Posts\nCoronavirus Widens the Money\nMule Pool\nThe Web’s Bot Containment Unit\nNeeds Your Help\nLive Coronavirus Map Used to\nSpread Malware\nCrafty Web Skimming Domain\nSpoofs “https”\nMicrosoft Patch Tuesday, March\n2020 Edition\nAll About Skimmers\nClick image for my skimmer series.\nSpam Nation\nA New York Times Bestseller!\nThe Value of a Hacked PC\nBadguy uses for your PC\nTools for a Safer PC\nTools for a Safer PC\nThe Pharma Wars\nSpammers Duke it Out\nBadguy Uses for Your Email\nYour email account may be worth\nfar more than you imagine.\neBanking Best Practices\neBanking Best Practices for\nBusinesses\nMost Popular Posts\nSextortion Scam Uses Recipient's\nHacked Passwords  (1076)\nOnline Cheating Site\nAshleyMadison Hacked  (798)\nSources: Target Investigating Data\nBreach  (620)\nCards Stolen in Target Breach\nFlood Underground Markets  (445)\nReports: Liberty Reserve Founder\nArrested, Site Shuttered  (416)\nWas the Ashley Madison Database\nLeaked?  (376)\nTrue Goodbye: 'Using TrueCrypt\nIs Not Secure'  (363)\nWho Hacked Ashley Madison?\n(361)\nFollowing the Money, ePassporte\nEdition  (353)\nU.S. Government Seizes\nLibertyReserve.com  (315)\nCategory: Web Fraud 2.0\nInnovations from the Underground\nID Protection Services Examined\nIs Antivirus Dead?\nThe reasons for its decline\nThe Growing Tax Fraud\nMenace\nFile 'em Before the Bad Guys Can\nInside a Carding Shop\nA crash course in carding.\nBeware Social Security Fraud\nSign up, or Be Signed Up!\nHow Was Your Card Stolen?\nFinding out is not so easy.\nKrebs’s 3 Rules…\n...For Online Safety.\n© 2020 Krebs on Security.  Powered by WordPress .  Privacy Policy\n Subscribe to RSS\n Follow me on Twitter\n Join me on FacebookAdvertisement\nGreg Scott\nJune 15, 2015 at 10:49 pm\nI dug into this one a little bit myself. And I read that Nov. 2012 Inspector General report\nfront to back. Shocked does not adequately describe my reaction. I wrote down my\nthoughts last week with a link to the IG report here:\nhttp://www.infrasupport.com/the-chinese-may-now-have-personal-information-on-4-\nmillion-us-government-employees/\n– Greg Scott\nGreg Scott\nJune 15, 2015 at 10:50 pm\nWoops – typo – that should have said Nov. 2014. I wish I could edit comments.\nRon G.\nJune 18, 2015 at 12:14 am\nPlease help to fire OPM Director Katherine Archueta from her job:\nhttp://wh.gov/i0nyA\njim\nJune 16, 2015 at 8:39 am\nSo, I wonder, if the American businesses in china, supplying our government with security\npersonnel will be fired? Or retained for further business. If the outsourcing of government\nis getting to it logical conclusion? To stop outsourcing your security! Who has a more\nnuanced view of my security, me or you? Even a trained monkey could figure that one out.\nBut MBA, and the no tax idiots must not be that smart.\nLikes2LOL\nJune 16, 2015 at 9:12 am\nGee, there really is something to be said for storing data on paper, eh? \nNotMe\nJune 16, 2015 at 11:00 am\nNice photo from your trip Mr. Krebs!\nYour absence was noticed, thanks for heads up on the email storm as well.\nThe comments on attribution could not come at a better time, as a possible victim of the\nbackground checking leak, I could care less who took it. Once the data is lost it could end\nup anywhere. Glad to see it is not for sale yet.\nIt’s what they are doing to fix the issue that interests me. We hear a lot from the Feds about\nhow we should be protecting our information assets, then to have the them mess up this bad\nis disheartening. Frankly I’m tired of adhering to some pretty unrealistic standards only to\nfind that the same standards are not followed by the Feds.\nRon G.\nJune 17, 2015 at 6:34 pm\nThe data is not for sale yet??? What makes you think it’s not? Just because it hasn’t\nshown up on pansey assed “carder” boards, that means nothing.\nIf I had 4+ million records of virtually every federal government employee *and* also\nhad excruciatingly detailed info on every person who either had or even applied for a\nUS security clearance in the past 30 years, I’d be discreetly and quietly shopping that to\na very select group of foreign intelligence services… for SERIOUS money.\nsickofidtheft\nJune 16, 2015 at 12:11 pm\nOkay, hubby was a victim, and we got the letter in the mail from OPM yesterday, offering\nCSID monitoring. This is the Fourth theft of our identity info in LESS than one year, with\nno fault of our own. 1st Medical records CMS data base, target, home depot, and now this.\nOurs was having worked at the USPS years ago.. like 20! I will not be using CSID to monitor\nus, because, they will eventually be hacked.. I mean, it is the obvious next step, if one were\na hacker. So, we are dumbing down our lives, getting rid of credit cards, etc.. in hopes of at\nleast being smart. What I wish our politicians would do, is realize that once somebody’s info\nis stolen, it is a lifelong monitoring issue for the individual, not just “18” months of\nwatching, as CSID is offering. At anytime, somebody can attempt to be you, it could be\ntoday, next year, or when you attempt to collect your social security checks. I am\ndisgusted that our government, which interestingly has the knowledgeable ability to attack\nwith drones, cannot safeguard information. What a joke! Are monkeys the Gov. I.T. guys?\n(although perhaps they may DO a better job). I would like to see fines, and punishments for\nthose companies, and gov. entities who REFUSE to spend the money to protect\ninformation, because their system is, “good enough.” ENOUGH IS ENOUGH!\nLee Church\nJune 16, 2015 at 12:48 pm\nBurgess is correct that folks can be distracted with attribution, as attribution includes\nanswering the question ‘why would party x do y?’.\nI will repeat one of my recent posts to Brian’s carefirst breach entry:\n………..\nMay 24, 2015 at 9:59 pm\nRE: decouple the ‘why’ from likelihood of the ‘what’ (probability of event does not depend\non our understanding of why an event happens)\nAs human beings we try to make sense of the world. In doing so, we often fall to a mental\nerror of requiring the ‘why’ before we can accept the ‘what’. In general, just because the\n‘why’ of something is not understood should not influence our assessment of the\nprobability of a scenario. In other words, our own understanding does not make the ‘what’\nmore or less likely.\nI often hear folks discuss the ‘why’ as a modifier to the likelihood of an event, and it’s a huge\nlogical mistake. It’s whether it’s possible and the consequences, not whether we understand\n‘why’ it would happen. Coupling them basically multiplies the odds of the event and our\nunderstanding, making the result even less clear.\nBrian Krebs has succumbed to this error as well (notably in his NK attribution posts), so it’s\nby no means a rare mistake. Our analysts missed 9/11 in part due to dismissing an event\nbecause it had no known ‘why’ answer to why would anyone want to do such a thing.\nA corollary to demanding ‘why’ to accept ‘what’ is that we are also tricked by a false ‘why’.\nOnce we think we understand ‘why’ we assign a greater likelihood to the event, even if the\n‘why’ is false. We all know people who just want an answer, and any answer is fine with\nthem.. but until they get an answer they are not satisfied. So another exploitation is to\npresent a false but plausable ‘why’ and it leads to errors on the flip side, or over estimating\nlikelihood.\nSo please folks, particularly Infosec and security people, when you find yourself giving up\non a scenario because of lack of clarity on ‘why’, resist the natural human urge to dismiss a\nprobability of the event, particularly if the consequence of the event is large or unknown.\nAnd when we think we know ‘why’, remember we can be wrong as much, if not more than if\nwe don’t know ‘why’ at all.\nSometimes, the ‘why’ presents itself much later after an event… and sometimes never. This\nis the nature of tail event risks and I would suspect that most tail events have the ‘it could\nnot have been otherwise’ though pre-event analysis never sees it coming.\nOne final thought for those that are interested. When the ‘black hats’ know folks dismiss\nevents that have no readily answerable ‘why’, they can design events that exploit that\nbehavior. So it’s up to the Infosec and security folks to make sure we take away that bit of\nhuman behavior exploitation.\nanyway, hope this was of use.\nregards\nStienke\nJune 16, 2015 at 3:12 pm\nThis particular breach made me laugh,\n1. I am a Veteran; Strike one\n2. Applied for serveral government postions; Strike two\n3. recieved letter from Homeland Security RE: Keypoint Breach.\nI am wiating for the notification that my security clearance information was breached…\n3 cheers for….oh wait nevermind!\nAllyn Kirkham\nJune 16, 2015 at 4:33 pm\nAs a federal employee with constant reminders about the need to keep everything secure,\nencrypted laptop, forced encryption on removable media, etc. this is just ridiculous. OPM\nwas pretty careless when they did their background check for my hiring – they shared my\nSSN with a neighbor who protested that they should not be showing her that info.\nCS\nJune 17, 2015 at 10:53 am\nYour comment “If you’re affected by these breaches and wondering what you can do to\nprotect yourself besides signing up for credit monitoring services, please see this story.” is\nthe all too common response to this breach. Not all concerns are financial. The amount of\nsecurity data provided depends in no small part on the level of clearance requested.\nWhoever has this data can cull through it to find those with the highest levels. Those people\nmight be exposed to extortion, intimidation or even kidnapping in order to get what they\nknow.\nPatrick\nJune 17, 2015 at 4:29 pm\nI agree with CS on this one. In many cases credit monitoring is useless for breaches like\nthis. If the hackers don’t intend to open up credit accounts in your name then the credit\nbureaus probably won’t see anything anyway. And the cost for this monitoring is likely\ncovered by cyber insurance, so offering the monitoring may not even be very painful for\nthe breached organization. The sad part is that technologies exist that can detect and/or\nstop most of the breaches (I didn’t say ‘all’) if used correctly but organizations choose to\nnot use them. Sometimes it is because they don’t think anyone will attack them (“We sell\nhammers”). Other times their security folks may not know about them and other times it is\njust budgetary priorities. Unfortunately it can also be because the org thinks it is secure\nwhen it really isn’t. It is often difficult for finance folks to calculate the ROI on incremental\nsecurity spend, so I think we will continue to see these breaches happen until everyone is\nforced to raise their security standards. Maybe the cyber insurance companies can start\nnudging folks in the right direction. I also agree that too much attention is being paid to\nattribution and not enough on good ol’ security 101. Companies get wrecked because they\nare wreckable and hacked because they are hackable (hat-tip to Gordon Gekko). Just be\nsure you are at least less hackable than everyone else.\nThomas\nJune 17, 2015 at 5:10 pm\nSo I went to FBO.gov to see the contract for the OPM credit monitoring contract of $20mil,\ndidn’t see it but a couple of others like NARA (3200) and Maryland National Guard (79).\nI set up an agent that tells me on a daily basis if there are new Government RFPs looking for\ncredit monitoring services.\nThomas\nJeffrey Carr\nJune 17, 2015 at 6:32 pm\nBrian, welcome to the dark side. You’ve finally acknowledged that we spend far too much\ntime searching for who to blame instead of looking at what we need to do better. And\nthanks to Mike Burgess for evangelizing that viewpoint!\nRon G.\nJune 17, 2015 at 7:59 pm\nEVERYBODY! PLEASE SIGN my brand new Whitehouse Petition! I am asking for the\nincompetent director of OPM to be fired. (In the private sector, this would have happened\nalready, but she is your typical ethnic-checkbox political appointee and former Democratic\nparty apparatchik hack operative who did a lot of work on Obama’s campaign, so now\nObama is defending her of course… just like Bush did for the director of FEMA during\nHurricane Katrina. But the size of this breach is too big to push under the rug.)\nPlease sign my petition here and please spread this URL as far and wide as possible:\nhttp://wh.gov/i0nyA\nNote that the petition won’t even be FULLY published on the Whitehouse web site until I\nget at least 150 signatures… SO I NEED YOUR HELP!\nAnother_Proposal\nJune 17, 2015 at 11:56 pm\n(Signed)\nHere is a petition for the heads of government and ICANN to disconnect select Chinese\nnetworks from the Internet, by signing on the right side if you are in agreement\n(digitally sign by submitting). Millions of people have been affected by compromised\ndata (from OPM, Anthem, Home Depot, Target Corporation…) so you may wish to pass\nthis along for more than one signature. https://www.change.org/p/icann-internet-\ncorporation-for-assigned-names-and-numbers-tell-the-worldwide-internet-\nmaintainers-to-disconnect-select-networks-in-china-from-the-internet-internet-2-0\nZelco Munye\nJune 18, 2015 at 5:50 pm\nIf you are going to do that to specific Chinese nets, let’s also include our own spy\nservice nets to that list. I don’t want them snorting around in my life any more than\nthe Chinese.\nK-Dee\nJune 18, 2015 at 2:47 pm\nA couple of us just realized something this morning that I haven’t seen mentioned yet. OPM\nhas my wife’s and my children’s personal information for TSP beneficiary information as\nwell as health insurance coverage!! :-/\npassword protect pdf\nJune 20, 2015 at 1:14 pm\nSimilarly, secret questions and password hints cannot be hashed, as they want\nto have the ability to read them once more.\nSLC\nJune 24, 2015 at 11:29 pm\nWeighing in a bit late, but arrived home after a 3-week vacation to find my OPM letter in\nthe held mail stack.\nGiven that I left Federal service in 1992, I suspect that the number of affected individuals is\nfar, far higher than OPM has let on.\nWill probably be instituting a credit freeze for the spouse & me. Not sure about using the\n“complimentary” CSID credit monitoring services but will look into it to see what’s\ninvolved and if I have to do things like given them a credit card number “to keep on file.”\nJim Mooney\nJune 26, 2015 at 6:28 pm\nOh gee, the idiots offer “credit monitoring” for a short period. When your bank account is\nemptied and you can’t make your rent or pay your employees, and the bank, as usual, is\nstalling, that monitoring will be a big help.\nPIV Guy\nJuly 2, 2015 at 9:32 am\nI have been involved in the authentication world for years. No credit agency is going to\nkeep you secure. Two Factor Authentication (2FA) does. Not cell phone based as they are\nsusceptible to Man in the Middle attacks. The Yubi key is the way to go and the vendors\nthat use it. It’s based on the FIDO and OpenID standards (Federal recognized). Don’t\nretreat. Build your security fortress around 2FA. If the hacker doesn’t have your token he\ndoesn’t get your data. Period.\nJonathan Jaffe\nJuly 2, 2015 at 11:34 am\nYubi is another device to carry while imposing requirements and operational\nconstraints on the consumer. See details at\nhttps://www.yubico.com/products/yubikey-hardware/\nIt is an example of the traditional inverse relationship between security and ease of use\nwhere More Secure > Harder to Use. see http://nc3.mobi/about-us/\nWhy not use equipment many people already  carry and increased security makes it\neasier to use?\nThere is a better way.\nJonathan @nc3mobiAdvertisement\n "
}