{
    "title": "china-linked spies use recent zero-day to target financial firms _ securityweek.com",
    "text": "SECURITYWEEK NETWORK: Information Security News Infosec Island CISO Forum Security Experts: WRITE FOR US\nTweet\n Recommend 16\nEduard Kovacs ( @EduardKovacs )\nis a contributing editor at\nSecurityWeek. He worked as a high\nschool IT teacher for two years\nbefore starting a career in journalism\nas Softpedia’s security news reporter. Eduard\nholds a bachelor’s degree in industrial informatics\nand a master’s degree in computer techniques\napplied in electrical engineering.\nVMware Fixes Privilege Escalation Vulnerability in Fusion\nfor Mac\nTrend Micro Patches Two Vulnerabilities Exploited in the\nWild\nFinancial Services Firms Exposed 500,000 Sensitive\nDocuments\nPrivate Application Access Firm Axis Security Emerges\nFrom Stealth\nUsers Complain About Windows Update That Patches\nSMBGhost VulnerabilityPrevious Columns by Eduard Kovacs:\n2020 Singapore ICS Cyber Security Conference | June 16-18 2020]\n2019 CISO Forum, Presented by Intel (Ritz-Carlton, Half Moon Bay CA)\n2020 ICS Cyber Security Conference | USA [Oct. 19-22]sponsored links\nTags: Cyberwarfare  NEWS & INDUSTRY  Virus &\nThreats  Virus & MalwareTweet\n Recommend 16\nBy Eduard Kovacs  on May 02, 2017\nHome  › Cyberwarfare\nChina-Linked Spies Use Recent Zero-Day to\nTarget Financial Firms\nA cyber espionage group has targeted analysts working at major financial firms using a\nrecently patched Microsoft Office vulnerability, Proofpoint reported last week.\nThe threat actor, tracked by the security firm as TA459, has been active since at least 2013\nand it’s believed to be operating out of China. The cyberspies have been known for using\nmalware such as NetTraveler  (aka TravNet), PlugX, Saker, Netbot, DarkStRat, and ZeroT in\nattacks aimed at organizations in Russia and neighboring countries.\nProofpoint recently detailed a series of attacks  launched by the group against military and\naerospace organizations in Russia and Belarus.\nOn April 20, researchers spotted a campaign aimed at global financial firms  operating in\nRussia and neighboring countries. Given that the attacks were apparently aimed at analysts\ncovering the telecommunications industry, experts believe this latest operation is likely a\ncontinuation of a similar campaign  first analyzed in the summer of 2015.\nIn the recent attacks, TA459 sent out spear‐phishing emails containing a Word document set up\nto exploit a recently patched remote code execution vulnerability tracked as CVE‐2017‐0199.\nThe attackers started leveraging this flaw just days after Microsoft released a fix .\nWhen the malicious document is opened, an HTML application (HTA) file disguised as an RTF\ndocument is downloaded. PowerShell is then used to download and execute a script that\nfetches and runs the ZeroT downloader.\nZeroT was analyzed by Proofpoint when it investigated the recent attacks aimed at military\nand aerospace organizations, but some changes and improvements have been made in the\nlatest version. One of the changes is the use of a legitimate McAfee utility for sideloading\ninstead of a Norman Safeground utility.\nWhile ZeroT is the threat actor’s most common first stage payload, the second payload\nincludes various pieces of malware. In recent attacks, Proofpoint noticed both PlugX and a\nTrojan tracked as PCrat/Gh0st, which is used less often by the group.\n“Multinational organizations like the financial services firms targeted here must be acutely\naware of the threats from state‐sponsored actors working with sophisticated malware to\ncompromise users and networks,” Proofpoint researchers explained. “Ongoing activity from\nattack groups like TA459 who consistently target individuals specializing in particular areas of\nresearch and expertise further complicate an already difficult security situation for\norganizations dealing with more traditional malware threats, phishing campaigns, and socially\nengineered threats every day.”\nThe fact that the threat actor has used CVE‐2017‐0199 in its operation is not surprising. The\nflaw had been exploited by several groups before Microsoft released a patch for it, and\nothers, including Iranian hackers , started using it  shortly after its existence came to light.\nRelated:  China‐Linked \"DragonOK\" Group Expands Operations\nRelated:  Chinese Hacking Group Linked to NetTraveler Espionage Campaign\n Search\nBusiness Email AddressSUBSCRIBE TO THE DAILY BRIEFING\n   \n   \n    \nMost Recent Most Read\nResearchers Track Coronavirus‐Themed\nCyberattacks\nAnalyzing Cyberspace Solarium Commission's\nBlueprint for a Cybersecure Nation\nSixgill Introduces Dark Web Data Feed Product\nAdobe Patches Critical Flaws in Reader,\nColdFusion, Other Products\nVMware Fixes Privilege Escalation Vulnerability in\nFusion for Mac\nThe Human Element and Beyond: Why Static\nPasswords Aren't Enough\nRansomware Is Mostly Deployed After Hours:\nReport\nThe Other Virus Threat: Surge in COVID‐Themed\nCyberattacks\nBarr: FBI Probing If Foreign Gov't Behind HHS\nCyber Incident\nTrend Micro Patches Two Vulnerabilities Exploited\nin the Wild\nPopular Topics\nInformation Security News\nIT Security News\nRisk Management\nCybercrime\nCloud Security\nApplication Security\nSmart Device Security\nSecurity Community\nIT Security Newsletters\nICS Cyber Security Conference\nCISO Forum, Presented by Intel\nInfosecIsland.Com\nStay Intouch\nTwitter\nFacebook\nLinkedIn Group\nCyber Weapon Discussion\nGroup\nRSS Feed\nSubmit Tip\nSecurity Intelligence Group\nAbout SecurityWeek\nTeam\nAdvertising\nEvents\nWriting Opportunities\nFeedback\nContact Us\nCopyright © 2020 Wired Business Media. All Rights Reserved.  Privacy Policy\nSubscribe 2019 CISO Forum, Presented by Intel ICS Cyber Security Conference Contact\nMalware & Threats Cybercrime Mobile & Wireless Risk & Compliance Security Architecture Security Strategy SCADA / ICS IoT Security\nShare\nShare\n "
}