{
    "title": "chinese hackers compromised forbes.com using ie_ flash zero days _ threatpost",
    "text": "/ / / /\n Cloud Security Malware Vulnerabilities InfoSec Insider Podcasts\n  Search\nMozilla to Enforce Signing for Firefox Extensions Soon\n Ryan Naraine on SAS 2015\nChinese Hackers Compromised Forbes.com\nUsing IE, Flash Zero Days\nAuthor:\nFebruary 11, 2015\n/ 4:07 pm\n2:30  minute read\nShare this article:Chris Brook\n\nA Chinese APT group has been linked to a watering hole attack on\nForbes.com used to target defense and financial targets.\nA Chinese APT group was able to chain together two zero day vulnerabilities, one against\nAdobe’s Flash Player and one against Microsoft’s Internet Explorer 9, to compromise a\npopular news site late last year.\nThe group’s aim was to gain access to computers at several U.S. defense and financial firms\nby setting up a watering hole attack on the site that would go on to drop a malicious .DLL.\nResearchers with Invincea and iSIGHT Partners worked in tandem to dig up information\nabout the group, which was able to compromise a part of Forbes.com’s website that\nappears to users before they’re ported over to articles they’ve clicked on. That portion of the\nsite, Forbes.com’s Thought of the Day, is powered by a Flash widget.\nAccording to researchers with Invincea the group was able to use a zero day vulnerability to\nhijack that widget for a short period, from Nov. 28 to Dec. 1. Over the course of those four\ndays, the group targeted visitors to the site who worked at a handful of unnamed U.S.\ndefense and financial firms.\nResearchers with iSIGHT discovered  that in addition to the Flash flaw, the attackers also\nexploited an Internet Explorer vulnerability, a zero day that helped attackers bypass Address\nSpace Layout Randomization (ASLR) in IE 9.\nWhile the Adobe bug, a buffer overflow (CVE-2014-9163) was patched back on Dec. 9 , the\nASLR mitigation bypass (CVE-2015-0071) was one of many patched yesterday in Microsoft’s\nmonthly Patch Tuesday round of patches, an update that was especially heavy on Internet\nExplorer fixes .\nIn a technical writeup of the attack  yesterday, Invincea explained how Forbes’ site was able\nto redirect to an IP address, load the Flash exploit, and drop a DLL, hrn.dll, to be loaded into\nthe machine’s memory.\n“Once in memory, the exploit gains administrative privileges and opens a command\nprompt,” Invincea’s executive summary reads, “Next the victim system was scanned to\nreport on its current patch levels, network mapping, and complete IP configuration,\nincluding any VPN connections.”\nBoth firms agreed to set their disclosures for yesterday to coincide with Microsoft’s patching\nof the Internet Explorer bug.\nWhile Chinese APT groups have been in the news lately – some reports  have already pinned\nlast week’s Anthem breach  on shadowy hackers from the PRC – several firms are already\nfamiliar with the APT group behind this campaign. FireEye, first published research on the\ngroup back in 2013, referring to the collective as the Sunshop Group . Researchers there\ncaught the group carrying out a campaign that hit a series of victims – a science and\ntechnology journal, a website for evangelical students, etc. – by exploiting an IE zero day\nand several Java bugs in May of that year.\nThroughout its research, dating back to 2010, iSIGHT has taken to calling the group Codoso\nTeam. This attack, like others its linked back to them, used similar malware (Derusbi) and\ncalled on a command and control (C+C) domain its been seen using in the past as well.\nRegardless of what it goes by, the group has been seen targeting U.S. government entities,\nthe military/defense sector, and financial services groups for at least five years running.\nFireEye found the same group was also responsible for hacking the Nobel Peace Prize\nCommittee website in 2010. That attack also used a watering hole and made use of a\nbrowser (Firefox) zero day.\nWhile neither iSIGHT or Invincea could give concrete numbers regarding the number of\nvictims Codoso was able to compromise with this campaign, both were firm in their stance\nthat the attacks were highly targeted in nature and only visitors who worked at the defense\nand financial firms were infected.\nChinese APT group uses IE, Flash zero days to compromise\nForbes.com, via @threatpost\nTweet\nA Practical Guide to Zero-Trust\nSecurity\nJanuary 15, 2020  2\n7 Tips for Maximizing Your SOC\nDecember 31, 2019  5\nMean Time to Hardening: The Next-\nGen Security Metric\nDecember 30, 2019  4\nCombining AI and Playbooks to\nPredict Cyberattacks\nDecember 26, 2019  1\nThe Case for Cyber-Risk Prospectuses\nDecember 24, 2019  1\nNewsletter\nSubscribe to Threatpost Today  \nJoin thousands of people who receive the\nlatest breaking cybersecurity news every day.\nSubscribe now\nTwitter\nAs the threat of \ncontinues to spread, businesses are\nsending employees home to work\nremotely - But wit… \n31 mins ago\nFollow @threatpost\n#coronavirus\nhttps://t.co/DCvZKitL4DINFOSEC INSIDER\n Share this article:\nGovernment\n Malware\nCoronavirus-Themed APT\nAttack Spreads Malware\nThe APT group was spotted sending\nspear-phishing emails that purport to\ndetail information about coronavirus –\nbut they actually infect victims with a\ncustom RAT.\nMarch 13, 2020\nMicrosoft Exchange Server\nFlaw Exploited in APT Attacks\nA vulnerability is Microsoft Exchange\nservers is being actively exploited by\nmultiple APT groups, researchers warn.\nMarch 9, 2020\nCritical Adobe Flaws Fixed in\nOut-of-Band Update\nTwo critical Adobe vulnerabilities have\nbeen fixed in Adobe After Effects and\nAdobe Media Encoder.\nFebruary 20, 2020\nThe First Stop For Security News Home\n About Us\n Contact Us\n Advertise With Us\n RSS Feeds\nCopyright © 2020 Threatpost Privacy Policy Terms and Conditions Advertise\n Black Hat Breaking News Cloud Security Critical Infrastructure Cryptography Facebook\nGovernment Hacks IoT Malware Mobile Security Podcasts Privacy RSAC\nSecurity Analyst Summit Videos Vulnerabilities Web Security\nSUGGESTED ARTICLES\nDISCUSSION\nTOPICS\nSubscribe to our newsletter, Threatpost Today ! Get the latest breaking news delivered daily to your inbox. Subscribe now\nWe use cookies to make your experience of our websites better. By using and further navigating this website you accept this. Detailed information about the use of cookies on this website is available by clicking on more information .\n ACCEPT AND CLOSE\n "
}