{
    "title": "chinese threat intel start-up finds darkhotel",
    "text": "Search Dark Reading\nNetwork Computing Dark Reading\n Welcome Guest Login to your account Register Advertise About Us\nFollow DR:\n Authors Slideshows Video Tech Library University Radio Calendar Black Hat News\nTHE\nEDGEANALYTICS ATTACKS /\nBREACHESAPP SEC CAREERS &\nPEOPLECLOUD ENDPOINT IoT OPERATIONS PERIMETER RISK THREAT\nINTELLIGENCEVULNS /\nTHREATS\nSPONSORED CONTENT\nThreat Hunting Adds Proactive Element to\nSecurity Strategy\nWider use of encryption along with the rise of cloud services has\nprompted SOC personnel to consider threat hunting to get ahead of\nthe security curve, according to Brian Dye, chief products office for\nCorelight. He offers tips for organizations looking to create or refine a\nthreat hunting program, as well as important metrics to include.\nLEARN MORE\nBrought to you by Devo Technology, Inc.Sponsored Content\nNext-Gen SOC Is On Its Way and Here's\nWhat It Should Contain\nThe next-gen-SOC starts with the next-gen SIEM, and Jason\nMical of Devo Technology and Kevin Golas from OpenText talk\nabout what capabilities are required, including threat hunting\nand greater automation, and how security professionals\nshould exploit the tools.\nCOMMENT   | EMAIL THIS   | PRINT   | RSS\nWebcasts\nChatbots for the\nEnterprise\nSecurity Alert Fatigue:\nTips for Taking Control\nMORE WEBCASTS\nWhite Papers\n2020 IT Salary Survey\nResults Revealed\nNetFlow vs Packet\nData\nMORE WHITE PAPERS\nReports\n2020 IT Salary Survey\nResults Revealed\n[Report] DevSecOps &\nSecure App Delivery:\nWhat's Working &\nWhat's Not\nMORE REPORTS\n50%\n 50%\n0 COMMENTS\nCOMMENT NOW\nTweet\n3/1/2016\n04:21 AM\nSara Peters\nNews\nConnect Directly\nLogin\nNEWEST FIRST   |  OLDEST FIRST   |  THREADED VIEW\nChinese Threat Intel Start-up Finds\nDarkHotel Exploiting Chinese\nTelecom\nNew China-based threat intelligence company ThreatBook wants to\nbe the 'trusted contact in China.'\nSAN FRANCISCO, RSA Conference -- The DarkHotel threat group is targeting\nexecutives at telecommunications companies in North Korea and China,\nalready compromising at least one, according to researchers at Beijing-based\nthreat intelligence start-up ThreatBook.\nIn operation since 2007, DarkHotel is named for their habit of exploiting\nexecutives while they were using unsecured hotel WiFi networks, a behavior\nthe group has since abandoned. In this campaign, which ThreatBook refers to\nas DarkHotel Operation 8651, the group is using spearphishing messages\nwith malicious documents attached -- specifically, a crafted SWF file\nembedded as a downloadable link in a Word document.\nThe SWF file exploits Adobe Flash vulnerability CVE-2015-8651. According to\nThreatBook, the earliest infections associated with that bug and this\ncampaign are Dec. 24. Adobe released an out-of-band patch for it Dec. 28.\nThe payload, update.exe, is a Trojan downloader, disguised as a component\nof OpenSSL. It then uses a variety of anti-detection measures, including anti-\nsandbox, and anti-anti-virus, as well as just-in-time decryption.\nFeng Xue and Hong Jia, friends from their days working at Microsoft, first had\nthe idea to start ThreatBook in May. After a hurried meeting at the Beijing\nairport Starbucks during Jia's two-hour layover en route to Redmond, Wash.,\nthe two quit their jobs -- Jia as principal anti-virus research manager at\nMicrosoft and Feng as CISO of Amazon.cn -- and launched ThreatBook in\nJune.\n\"I never thought I would leave [Microsoft],\" says Jia. \"The career path was\nquite good and I love Microsoft.\"\n\"I got excited and I could not sleep,\" says Xue.\nThe idea that hooked Xue and Jia was realizing that there was no threat\nintelligence market in China, but the need for one was great.\n\"Threat intelligence is not just a tool, it's a new wave. A trend,\" says Xue.\nThreatBook uncovered information  about the identity and intentions of the\nXCodeGhost authors in October. This week they are exhibiting at RSA,\nintroducing their security threat analysis platform and Threat Intelligence\nCenter.\nXue says that at previous positions he's held there was a lack of\nunderstanding of China's unique landscape. He'd have to spend some of time\nat old jobs educating colleagues about, for example, enormous cybersecurity\nincidents in China that are so underreported in the West that they aren't even\nmentioned in yearly wrap-ups of top global attacks. \"I feel sometimes\nfrustrated,\" Xue says.\nJia says this is one of the things she wants ThreatBook to be able to fix. She\nsays their focus is China-focused threat intelligence, and they're very open to\nexchanging information with other companies and other organizations.\n\"Our company is a bridge,\" she says. \"We want to be the trusted contact in\nChina.\"\nRelated Content:\nCybercrime And Hacking Atlas (China)\nSony Hackers Behind Previous Cyberattacks Tied To North\nKorea\nSony Hackers Still Active, ‘Darkhotel’ Checks Out Of Hotel\nHacking\n \nFind out more about security threats at Interop 2016,\nMay 2-6, at the Mandalay Bay Convention Center, Las\nVegas. Register today  and receive an early bird discount\nof $200.\nSara Peters is Senior Editor at Dark Reading and formerly the editor-in-chief\nof Enterprise Efficiency. Prior that she was senior editor for the Computer\nSecurity Institute, writing and speaking about virtualization, identity\nmanagement, cybersecurity law, and a myriad ... View Full Bio\nINSIGHTS\nMORE INSIGHTS\nCOMMENTS\nBe the first to post a comment  regarding this story.\n2 Many Ransomware Attacks Can be\nStopped Before They Begin\nJai Vijayan, Contributing Writer,  3/17/2020\n1 Why CSP Isn't Enough to Stop\nMagecart-Like Attacks\nHadar Blutrich, CTO & Co-founder, Source\nDefense,  3/11/2020\n1 How the Rise of IoT Is Changing the\nCISO Role\nPhil Neray, VP of IoT & Industrial Cybersecurity\nat CyberX,  3/11/2020\nSUBSCRIBE TO NEWSLETTERS\nWEBINAR ARCHIVESBuilding an Enterprise Strategy for Detection and\nResponse (XDR)\nChatbots for the Enterprise\n5 Steps to Integrate SAST into the DevSecOps Pipeline\nMORE WHITE PAPERSWHITE PAPERS\n2020 IT Salary Survey Results Revealed\nNetFlow vs Packet Data\nGlobal Application and Network Security Report\nResearch Report: Evaluating Your Organization's\nCybersecurity Readiness\nHow to Pick a Winner in EDR\nALL VIDEOSVIDEO\nCARTOON ARCHIVECARTOON\nLatest Comment: Unfortunately nobody wants to spend\nmoney on security. Usually they change their mind but\noften it is too late\nDOWNLOAD THIS ISSUE!\n6 Emerging Cyber Threats That\nEnterprises Face in 2020\nThis Tech Digest gives an in-depth look at six emerging\ncyber threats that enterprises could face in 2020.\nDownload your copy today!\nBACK ISSUES  | MUST READSCURRENT ISSUE\nALL POLLSFLASH POLL\nHas the U.S. political climate caused\nyou to make infosecurity-related\nchanges to your disaster\nrecovery/business continuity plans?\n Yes\n No\n No but we are considering it\n Still waiting for cybersecurity guidance from\nTrump admin EO\n Don't know\n Other (Please explain in the comments)\nSubmit\nDOWNLOAD NOW!\nState of Cybersecurity Incident\nResponse\nData breaches and regulations have forced\norganizations to pay closer attention to the security\nincident response function. However, security leaders\nmay be overestimating their ability to detect and respond\nto security incidents. Read this report to find out more.\nHow Enterprises Are Developing and\nMaintaining Secure Applications0 COMMENTS\nHow Enterprises are Attacking the\nCybersecurity Problem0 COMMENTS\nHow Data Breaches affect the Enterprise\n0 COMMENTS\nMORE REPORTS\nTWITTER FEED\nBUG REPORT\nENTERPRISE VULNERABILITIES\nFrom DHS/US-CERT's National Vulnerability Database\nCVE-2020-3922\nPUBLISHED: 2020-03-18\nLisoMail, by ArmorX, allows SQL Injections, attackers\ncan access the database without authentication via a\nURL parameter manipulation.\nCVE-2020-10659\nPUBLISHED: 2020-03-18\nEntrust Entelligence Security Provider (ESP) before\n10.0.60 on Windows mishandles errors during SSL\nCertificate Validation, leading to situations where (for\nexample) a user continues to interact with a web site\nthat has an invalid certificate chain.\nCVE-2020-8468\nPUBLISHED: 2020-03-18\nTrend Micro Apex One (2019), OfficeScan XG and\nWorry-Free Business Security (9.0, 9.5, 10.0) agents\nare affected by a content validation escape vulnerability\nwhich could allow an attacker to manipulate certain\nagent client components. An attempted attack requires\nuser authentication.\nCVE-2020-8470\nPUBLISHED: 2020-03-18\nTrend Micro Apex One (2019), OfficeScan XG and\nWorry-Free Business Security (9.0, 9.5, 10.0) server\ncontains a vulnerable service DLL file that could allow\nan attacker to delete any file on the server with SYSTEM\nlevel privileges. Authentication is not required to exploit\nthis vulnerability.\nCVE-2020-8598\nPUBLISHED: 2020-03-18\nTrend Micro Apex One (2019), OfficeScan XG and\nWorry-Free Business Security (9.0, 9.5, 10.0) server\ncontains a vulnerable service DLL file that could allow\na remote attacker to execute arbitrary code on affected\ninstallations with SYSTEM level privileges.\nAuthentication is not required to exploit th...THREAT INTELLIGENCE\nLike\nShare\nCorelight: Threat Hunting Adds Proactiv\n …\nHOT TOPICS EDITORS' CHOICE\n WEBINARS  \n REPORTS  \nDiscover More From Informa Tech\nInterop\nInformationWeek\nNetwork ComputingIT Pro Today\nData Center Knowledge\nBlack HatContact us\nAbout Us\nAdvertise\nReprintsWorking With Us Follow DarkReading On Social\nHome Cookies CCPA: Do not sell my personal info Privacy Terms\nCopyright © 2020 Informa PLC Informa UK Limited is a company registered in England and Wales with\ncompany number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.6 COMMENTS\nRansomware Trains Its\nSights on Cloud ...\n1 COMMENTS\nQualys Launches Free\nApp for IT Asset ...\n "
}