{
    "title": "china_s apt3 pilfers cyberweapons from the nsa _ threatpost",
    "text": "/ / / /\n Cloud Security Malware Vulnerabilities InfoSec Insider Podcasts\n  Search\nBack-to-School Scams Target Students with Library-Themed Emails\n ThreatList: Police Use of Facial Recognition is Just Fine, Say Most Americans\nChina’s APT3 Pilfers Cyberweapons from\nthe NSA\nAuthor:\nSeptember 6, 2019\n/ 3:18 pm\n5 minute read\nSkip to:\nShare this article:Tara Seals\nA Tale of Two Bugs\nLarge portions of APT3’s remote code-execution package were likely\nreverse-engineered from prior attack artifacts.\nThe advanced persistent threat (APT) group known as APT3, which researchers across the\nboard link to the Chinese government , has built a full in-house battery of exploits and\ncybertools collectively dubbed “UPSynergy.” An analysis of the toolkit has uncovered a\ngeopolitical cat-and-mouse spy game: It turns out that many parts of the package are likely\ngleaned from watching attacks by the National Security Agency’s Equation Group APT on\ntarget networks where APT3 also has a presence.\nPrior research from Symantec  shows that APT3 was able to acquire a variant of the NSA-\ndeveloped cyberweapon known as EternalRomance – prior to the Shadow Brokers leak  of\nthe spy agency’s arsenal in 2017. It has been a bit of a mystery as to how APT3 accomplished\nthat – but research from Check Point offers a hypothesis.\n“The threat group known as APT3 recreated its own version of an Equation group exploit\nusing captured network traffic,” according to the analysis , published Thursday. “We believe\nthat this artifact was collected during an attack conducted by the Equation Group against a\nnetwork monitored by APT3, allowing it to enhance its exploit arsenal with a fraction of the\nresources required to build the original tool…One possible modus operandi – the Chinese\ncollect attack tools used against them, reverse-engineer and reconstruct them to create\nequally strong digital weapons.”\nAPT3 (a.k.a Buckeye or UPS Team) from there went on to equip the reverse-engineered\nattack tool, named Bemstour, with an additional zero-day, researchers said. Bemstour is\nused by APT3 to gain remote code-execution on a victim’s machine; the enhancement\nconsists of a new exploit that allows APT3 to cast a wider net in terms of victimology.\n“EternalRomance  targeted mostly Windows 7 systems (as well as lower version of Windows\nNT where SMBv1 is located),” Check Point explained. “One of the problems in adapting\nEternalRomance to higher Windows versions was a patch introduced in Windows 8 which\neliminated the possibility to use an information leak vulnerability leveraged by it.”\nThe NSA got around this by chaining EternalRomance to a different tool that exploited\nWindows 8, called EternalChampion, to create a hybrid exploit named EternalSynergy. APT3\ninstead found a whole new zero-day information leak exploit to bolt onto its\nEternalRomance variant, which allowed the group to upgrade their version to be effective\nagainst OS higher than Windows 7.\n“All of this activity suggests that the group was not exposed to an actual NSA exploitation\ntool, as they would then not need to create another zero-day exploit,” according to the\nanalysis. “We decided to name APT3’s bundle of exploits UPSynergy, since, much like in the\ncase of Equation group, it combines two different exploits to expand the support to newer\noperating systems.”\nInterestingly, the goal of the weapon is to deploy a payload on the victim’s machine which is\ninjected to a running process using an implant, which bears striking resemblance to the\nEquation group’s DoublePulsar tool.\n“As far as APT3’s implant is concerned, it seems likely that the DoublePulsar code was\nreused as is,” Check Point researchers noted. “The code is not executed directly, but has\nseveral layers of obfuscation. Essentially, the Equation Group’s DoublePulsar code is\nwrapped with an APT3 position independent crypter and loader.”\nIn all, the research shows a cyberspy drama played out between the United States and\nBeijing.\n“If network traffic was indeed used by the group as a reference, the traffic was likely\ncollected from a machine controlled by APT3,” Check Point researchers pointed out. “This\nmeans either a Chinese machine that was targeted by the NSA and monitored by the group,\nor a machine compromised by the group beforehand on which foreign activity was noticed.\nWe believe the former is more likely, and in that case could be made possible by capturing\nlateral movement within a victim network targeted by the Equation Group.”\nAlong with spying on each other, the U.S. and China are apparently in the midst of a cyber-\narms race to develop new exploits.\n“Finding a zero-day info leak, recreating the exploit based on the aforementioned\nvulnerability, and utilizing a lot of internal undocumented structures of SMB in the implants,\nimplies that there was a similar expertise with and analysis performed on SMB drivers (with\nan eye to exploiting them) on the Chinese side, roughly at the same time it was widely used\nA Practical Guide to Zero-Trust\nSecurity\nJanuary 15, 2020  2\n7 Tips for Maximizing Your SOC\nDecember 31, 2019  5\nMean Time to Hardening: The Next-\nGen Security Metric\nDecember 30, 2019  4\nCombining AI and Playbooks to\nPredict Cyberattacks\nDecember 26, 2019  1\nThe Case for Cyber-Risk Prospectuses\nDecember 24, 2019  1\nNewsletter\nSubscribe to Threatpost Today  \nJoin thousands of people who receive the\nlatest breaking cybersecurity news every day.\nSubscribe now\nTwitter\nAs the threat of \ncontinues to spread, businesses are\nsending employees home to work\nremotely - But wit… \n4 hours ago\nFollow @threatpost\n#coronavirus\nhttps://t.co/DCvZKitL4DINFOSEC INSIDER\n by the NSA,” according to the analysis.\nA Tale of Two Bugs\nThe zero-day that APT3 found (CVE-2019-0703) is “an information disclosure vulnerability\n[that] exists in the way […] the Windows SMB Server handles certain requests,” according to\nMicrosoft. However, the flaw is actually a logical bug related to querying information from\nthe Windows Named Pipes mechanism, according to Check Point, and not a vulnerability in\nthe SMB protocol nor its implementation.\n“While it can be triggered using SMB, there are other ways to leverage it, e.g. using the\nNtQueryInformationFile Windows API call that is unrelated to SMB,” the researchers said.\n“The bug resides within npfs.sys (Name Pipe File System driver) in a function named\nNpQueryInternalInfo. The latter is used to query named pipes and return a value called a file\nreference number….[the number] is a pointer to a kernel structure named CCB (Client\nControl Block). This is an undocumented struct defined in npfs.sys, which has a partial\ndefinition (named NP_CCB) provided by the ReactOS project. Clearly, this is not the\nintended value to be returned in this case, and the leak of this struct discloses useful\ninformation that can be leveraged by attackers.”\nIn APT3’s case, the group triggered the vulnerability by establishing an SMB connection to a\nnamed pipe on the victim’s machine via SMB.\n“The method was used to determine the bitness of the attacked operating system and\noverwrite (using a write primitive) a field in the leaked structure, which eventually provided\nthe group with remote code-execution,” according to Check Point.\nMeanwhile, the original vulnerability (CVE-2017-0143) targeted by EternalRomance and\nrepurposed by APT3 is rooted in a type confusion bug; as a result of type confusion between\nSMB messages, the server considers an unrelated SMB message as part of an SMB\nTransaction of a different type, and activates the wrong type of SMB handler.\n“This handler in turn shifts the Transaction struct’s pointer to the incoming data buffer by the\namount of data received in the SMB message,” said the researchers. “Because the pointer\nvalue was shifted by the wrong handler, data of further SMB messages (which are treated by\nthe correct type of handler) can be potentially written outside the boundaries of the\nincoming data buffer. If there was successful grooming (i.e. the heap was correctly shaped\nbeforehand), this out-of-bound write may allow us to overwrite an adjacent SMB\nTransaction structure.”\nIn all, the research shows two highly sophisticated nation-state actors jockeying for cyber-\ndominance with exploit developments and tool espionage.\n“It’s not always clear how threat actors achieve their exploitation tools, and it’s commonly\nassumed that actors can conduct their own research and development or get it from a third\nparty,” Check Point concluded. “In this case we have evidence to show that a third (but less\ncommon) scenario took place – one where attack artifacts of a rival (i.e. Equation Group)\nwere used as the basis and inspiration for establishing in-house offensive capabilities by\nAPT3.”\nInterested in more on the internet of things (IoT)? Don’t miss our on-\ndemand Threatpost webinar , IoT: Implementing Security in a 5G World. Join experts\nfrom Nokia, iboss and Sectigo as they offer enterprises and other organizations insights\nabout how to approach security for the next wave of IoT deployments. Click here to\nlisten to the recorded webinar.\n \nShare this article:\nGovernment\n Vulnerabilities\nDropbox Passes $1M\nMilestone for Bug-Bounty\nPayouts\nThe file-sharing service also disclosed\ndetails of past notable bugs for the first\ntime.\nFebruary 6, 2020\nNew Bill Proposes NSA\nSurveillance Reforms\nThe newly-introduced bill targets the\nPatriot Act’s Section 215, previously\nused by the U.S. government to collect\ntelephone data from millions of\nAmericans.\nJanuary 24, 2020  2\nPoC Exploits Published For\nMicrosoft Crypto Bug\nTwo proof-of-concept exploits were\npublicly released for the major\nMicrosoft crypto-spoofing vulnerability.\nJanuary 16, 2020  1\nThe First Stop For Security News Home\n About Us\n Contact Us\n Advertise With Us\n RSS Feeds\nCopyright © 2020 Threatpost Privacy Policy Terms and Conditions Advertise\n Black Hat Breaking News Cloud Security Critical Infrastructure Cryptography Facebook\nGovernment Hacks IoT Malware Mobile Security Podcasts Privacy RSAC\nSecurity Analyst Summit Videos Vulnerabilities Web Security\nSUGGESTED ARTICLES\nDISCUSSION\nTOPICS\nSubscribe to our newsletter, Threatpost Today ! Get the latest breaking news delivered daily to your inbox. Subscribe now\nWe use cookies to make your experience of our websites better. By using and further navigating this website you accept this. Detailed information about the use of cookies on this website is available by clicking on more information .\n ACCEPT AND CLOSE\n "
}