{
    "title": "clandestine fox_ part deux _ fireeye inc",
    "text": "Țħřěǻț Řěșěǻřčħ\nČŀǻňđěșțįňě Fǿx, Pǻ řț Đěųx\nJųňě 10, 2014 | bỳ Mįķě Șčǿțț\nČĿǺŇĐĚȘȚİŇĚ FǾX  \nȘǾČİǺĿ ĚŇĢİŇĚĚ ŘİŇĢ \nȘǾČİǺĿ MĚĐİǺ \nȘǾČİǺĿ ŇĚȚẄǾŘĶȘ  \nǺĐVǺŇČĚĐ ȚǺŘĢ ĚȚĚĐ ǺȚȚǺČĶ\nẄě řěpǿřțěđ ǻț țħě ěňđ ǿf Ǻpřįŀ ǻňđ țħě běģįňňįňģ ǿf Mǻỳ  ǿň ǻň ǺPȚ țħ řěǻț ģřǿųp ŀěvěřǻģįňģ ǻ żěřǿ-đǻỳ\nvųŀňěřǻbįŀįțỳ įň İňțěřňěț Ěxpŀǿřěř vįǻ pħį șħįňģ ěmǻįŀ ǻțțǻčķ ș. Ẅħįŀě Mįč řǿșǿfț qųįčķŀỳ řěŀěǻșěđ ǻ pǻțčħ țǿ ħěŀp čŀǿ șě\nțħě đǿǿř ǿň fųțųřě čǿmp řǿmįșěș, ẅě ħǻvě ňǿ ẅ ǿbșěřvěđ țħě țħřěǻț ǻčțǿ řș běħįňđ “Ǿpěřǻțįǿň Čŀǻň đěșțįňě Fǿx”\nșħįfțįňģ țħěį ř pǿįňț ǿf ǻțțǻčķ ǻň đ ųșįňģ ǻ ňě ẅ věčțǿř țǿ țǻřģěț țħěį ř vįčțįmș: șǿčįǻŀ ňěț ẅǿřķįňģ.\nǺň ěmpŀǿỳěě ǿf ǻ čǿmpǻňỳ įň țħě ěňě řģỳ șěčțǿř řěčěňțŀỳ řěčěįvěđ ǻň ěmǻįŀ ẅįțħ ǻ ŘǺŘ ǻ řčħįvě ěmǻįŀ\nǻțțǻčħměňț f řǿm ǻ čǻň đįđǻțě. Țħě ǻțțǻčħměňț, ǿ șțěňșįbŀỳ čǿňțǻįňįňģ ǻ řěșųmě ǻňđ șǻmpŀě șǿfțẅǻřě přǿģřǻm\nțħě ǻppŀįčǻňț ħǻ đ ẅřįțțěň, ẅǻș fřǿm șǿměǿňě ẅě’ŀŀ čǻŀŀ “ Ěmįŀỳ” ẅħǿ ħǻđ přěvįǿųșŀỳ čǿňțǻčțě đ țħě ǻčț ųǻŀ\němpŀǿỳěě vįǻ ǻ pǿp ųŀǻř șǿčįǻŀ ňěț ẅǿřķ.\nFįřěĚỳě ǻčqųįřěđ ǻ čǿpỳ ǿf țħě șųșpįčįǿųș ěmǻįŀ – șħǿẅň běŀǿẅ įň Fįģųřě 1 – ǻňđ ǻțțǻčħměňț f řǿm țħě țǻ řģěțěđ\němpŀǿỳěě ǻň đ įňvěșțįģǻțěđ. Țħě țǻřģěțěđ ěmpŀǿỳěě čǿňfį řměđ țħǻț “Ěmįŀỳ” ħǻ đ čǿňțǻčțě đ ħįm vįǻ țħě pǿp ųŀǻř\nșǿčįǻŀ ňěț ẅǿřķ, ǻňđ țħǻț, ǻfțě ř țħřěě ẅěěķș ǿf bǻčķ ǻň đ fǿřțħ měșșǻģįňģ “ șħě” șěňț ħěř “řěșųmě” țǿ ħį ș pěřșǿňǻŀ\němǻįŀ ǻ đđřěșș.  \n[čǻpțįǿň į đ=\"ǻțțǻčħměňț_ 5658 \" ǻŀįģň=\"ǻŀįģňčěňțě ř\" ẅįđțħ=\"441\"]\n Fįģųřě 1: Șǻmpŀě ěmǻįŀ įŀŀ ųșțřǻțįňģ ħǿ ẅ “Ěmįŀỳ”\nǻțțǻčķș ǻ vįčțįm ěmpŀǿỳěě[/čǻpțįǿň]\nẄǿřķįňģ ǿųř ẅǻỳ bǻčķ ẅǻřđș, ẅě řěvįěẅěđ “Ěmįŀỳ’ș” șǿčįǻŀ ňěț ẅǿřķ přǿfįŀě ǻň đ ňǿțįčěđ ǻ fěẅ șțřǻňģě ǻșpěčțș\nțħǻț řǻįșěđ șǿmě řěđ fŀǻģș. Fǿř ěxǻmpŀě, “ħě ř” ŀįșț ǿf čǿňțǻčț ș ħǻđ ǻ ňųmběř ǿf pěǿpŀě fřǿm țħě vįčțįm’ ș șǻmě\němpŀǿỳě ř, ǻș ẅěŀŀ ǻș ěmpŀǿỳěě ș fřǿm ǿțħě ř ěňěřģỳ čǿmpǻňįě ș; “șħě” ǻŀșǿ đįđ ňǿț șěěm țǿ ħǻvě mǻňỳ ǿțħě ř\n“fřįěňđș” țħǻț fįț “ħě ř” ǻŀŀěģě đ pěřșǿňǻ. “Ħěř” ěđųčǻțįǿň ħį șțǿřỳ ǻŀșǿ čǿňțǻįňě đ șǿmě fǻķě ěňț řįěș.\nFųřțħěř řěșěǻřčħ ǻňđ đįșčųșșįǿňș ẅįțħ țħě țǻ řģěțěđ čǿmpǻňỳ řěvěǻŀěđ țħǻț “Ěmįŀỳ,” pǿ șįňģ ǻș ǻ přǿșpěčțįvě\němpŀǿỳěě, ħǻđ ǻŀșǿ čǿňțǻčțě đ ǿțħěř pěřșǿňňěŀ ǻț țħě șǻmě čǿmpǻňỳ . Șħě ħǻ đ ǻșķěđ ǻ vǻřįěțỳ ǿf p řǿbįňģ\nqųěșțįǿňș, įňčŀųđįňģ įňqųįřįňģ ẅħǿ țħě İȚ Mǻňǻģě ř ẅǻș ǻňđ ẅħǻț věřșįǿňș ǿf șǿfțẅǻřě țħěỳ řǻň – ǻŀŀ įňfǿ řmǻțįǿň\nțħǻț ẅǿųŀđ bě věřỳ ųșěfųŀ fǿř ǻň ǻțțǻčķě ř ŀǿǿķįňģ țǿ č řǻfț ǻň ǻțțǻčķ.\nİț’ș ẅǿřțħ ěmpħǻ șįżįňģ țħǻț įň țħě įň șțǻňčěș ǻbǿvě, țħě ǻțțǻčķě řș ųșěđ ǻ čǿmbįňǻțįǿň ǿf đįřěčț čǿňțǻčț vįǻ șǿčįǻŀ\nňěțẅǿřķș ǻș ẅěŀŀ ǻș čǿňțǻčț vįǻ ěmǻįŀ , țǿ čǿmm ųňįčǻțě ẅįțħ țħěįř įňțěňđěđ țǻřģěțș ǻňđ șěňđ mǻŀįčįǿ ųș\nǻțțǻčħměňț ș. İň ǻđđįțįǿň, įň ǻŀmǿ șț ǻŀŀ čǻșěș, țħě ǻțțǻčķě řș ųșěđ țħě țǻřģěț’ș pěřșǿňǻŀ ěmǻįŀ ǻ đđřěșș, řǻțħěř țħǻň\nħįș ǿř ħěř ẅǿřķ ǻđđřěșș. Țħįș čǿųŀđ bě bỳ đěșįģň, ẅįțħ ǻ vįě ẅ țǿẅǻřđ čįřčųmvěňțįňģ țħě mǿ řě čǿmp řěħěňșįvě\němǻįŀ șěčųřįțỳ țěčħňǿŀǿģįě ș țħǻț mǿ șț čǿmpǻňįě ș ħǻvě đěpŀǿỳěđ, ǿř ǻŀșǿ đųě țǿ mǻňỳ pěǿpŀě ħǻvįňģ țħěį ř șǿčįǻŀ\nňěțẅǿřķ ǻččǿųňțș ŀįňķěđ țǿ țħěį ř pěřșǿňǻŀ řǻțħěř țħǻň ẅǿřķ ěmǻįŀ ǻ đđřěșșěș.\nĐěțǻįŀș - Ěmǻįŀ Ǻțțǻčħměňț # 1\nȚħě resume.rar  ǻřčħįvě čǿňțǻįňě đ țħřěě fįŀěș: ǻ ẅěǻpǿňįżěđ věřșįǿň ǿf țħě ǿpěň- șǿųřčě ȚȚČǻŀč ǻppŀįčǻțįǿň (ǻ\nmǻțħěmǻțįčǻŀ bįģ ň ųmběř čǻŀčųŀǻțǿř), ǻ běňįģň  țěxț čǿpỳ ǿf țħě ȚȚČǻŀč řěǻđmě fįŀě, ǻň đ ǻ běňįģň  PĐF ǿf Ěmįŀỳ’ș\nřěșųmě. Țħě řěșųmě ẅǻș ǻ ňěǻřŀỳ įđěňțįčǻŀ čǿpỳ ǿf ǻ șǻmpŀě řěșųmě ǻvǻįŀǻbŀě ěŀ șěẅħěřě ǿň țħě İňțěřňěț.  Țħě fįŀě\nđěțǻįŀș ǻřě běŀǿẅ.\nFilename MD5 Hash\nresume.rar 8b42a80b2df48245e45f99c1bdc2ce51\nreadme.txt 8c6dba68a014f5437c36583bbce0b7a4\nresume.pdf ee2328b76c54dc356d864c8e9d05c954\nttcalc.exe e6459971f63612c43321ffb4849339a2\nŲpǿň ěxěč ųțįǿň, ttcalc.exe  đřǿpș țħě țẅǿ fįŀěș ŀįșțěđ běŀǿẅ, ǻňđ ǻŀșǿ ŀǻųňčħěș ǻ ŀěģįțįmǻțě čǿpỳ ǿf ȚȚČǻŀč\nv0.8.6 ǻș ǻ đěčǿỳ:\n%USERPROFILE%/Application Data/mt.dat\n%USERPROFILE%/Start Menu/Programs/Startup/vc.bat\nȚħě fįŀě mț. đǻț įș țħě ǻčț ųǻŀ mǻŀẅǻřě ěxěčųțǻbŀě, ẅħįčħ ẅě đěțěčț ǻș Bǻčķđǿǿř.ǺPȚ.ČǿǿķįěČ ųțțěř. (Vǻřįǻňțș ǿf\nțħįș fǻmįŀỳ ǿf bǻčķ đǿǿř ǻřě ǻŀșǿ řěfěřřěđ țǿ ǻș “Pįřpį” įň țħě șěčųřįțỳ įňđųșțřỳ). İň țħįș čǻșě, țħě mǻŀ ẅǻřě ẅǻș\nčǿňfįģųřěđ țǿ ųșě țħě fǿŀŀǿ ẅįňģ řěmǿțě șěřvěřș fǿř čǿmmǻň đ ǻňđ čǿňțřǿŀ:\n \nswe[.]karasoyemlak[.]com\nįňfǿřm[.]běđįřčǻțį[.]čǿm ( Ňǿțě: Țħį ș đǿmǻįň ẅǻș ǻŀșǿ ųșěđ đųřįňģ Ǿpě řǻțįǿň Čŀǻň đěșțįňě Fǿx)\n122.49.215.108\nMěțǻđǻțǻ fǿř mț.đǻț:\nDescription MD5 Hash\nmd5 1a4b710621ef2e69b1f7790ae9b7a288\n.text 917c92e8662faf96fffb8ffe7b7c80fb\n.rdata 975b458cb80395fa32c9dda759cb3f7b\n.data 3ed34de8609cd274e49bbd795f21acc4\n.rsrc b1a55ec420dd6d24ff9e762c7b753868\n.reloc afd753a42036000ad476dcd81b56b754\nImport Hash fad20abf8aa4eda0802504d806280dd7\nCompile date 2014-05-27 15:48:13\nČǿňțěňț ș ǿf vč.bǻț:\n @echo offcmd.exe /C start rundll32.exe \"C:\\Documents and\nSettings\\admin\\Application Data\\mt.dat\" UpdvaMt\nĐěțǻįŀș - Ěmǻįŀ Ǻțțǻčħměňț # 2\nȚħřǿųģħ ǻđđįțįǿňǻŀ řěșěǻřčħ, ẅě ẅěřě ǻbŀě țǿ ǿbțǻįň ǻňǿțħě ř ŘǺŘ ǻ řčħįvě ěmǻįŀ ǻțțǻčħměňț șěňț bỳ țħě șǻmě\nǻțțǻčķě řș țǿ ǻň ěmpŀǿỳěě ǿf ǻňǿțħě ř čǿmpǻňỳ. Ňǿțě țħǻț ẅħįŀě țħě řě ǻřě ǻ ŀǿț ǿf șįmįŀǻřįțįěș, șųčħ ǻș țħě fǻķě\nřěșųmě ǻňđ įňčŀųșįǿň ǿf ȚȚČǻŀč, țħěřě įș ǿňě mǻjǿ ř đįffěřěňčě, ẅħįčħ įș țħě đěŀįvěřỳ ǿf ǻ čǿmpŀěțěŀỳ đįffěřěňț\nmǻŀẅǻřě bǻčķđǿǿř. Țħě ǻțțǻčħměňț ňǻmě țħį ș țįmě ẅǻș “mỳ řěșųmě ǻňđ projects.rar ,” bųț țħįș țįmě įț ẅǻș\npřǿțěčțěđ ẅįțħ țħě pǻ șșẅǿřđ “TTcalc .”\nFilename MD5 Hash \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n09 Mǻř 2020\n24 Fěb 2020\n20 Fěb 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐFįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \nŘǻňșǿmẅǻřě Ǻģǻįň șț țħě Mǻčħįňě:\nĦǿẅ Ǻđvěřșǻřįěș ǻřě Ŀěǻřňįňģ țǿ\nĐįșřųpț İňđųșțřįǻŀ Přǿđųčțįǿň bỳ\nȚǻřģěțįňģ İȚ ǻňđ ǾȚ \nM-Țřěňđș 2020 : İňșįģħțș Fřǿm țħě\nFřǿňț Ŀįňě ș \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  Jųňě 2014 Țħřěǻț Řěșěǻřčħ Bŀǿģ Pǿ șțș  Čŀǻňđěșțįňě Fǿx, Pǻ řț Đěųx    \nČǾŇȚǺČȚ ŲȘ  ŘĚPǾŘȚ Ǻ Ň İŇČİĐĚŇȚ\nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n my resume and projects.rar ab621059de2d1c92c3e7514e4b51751a\nSETUP.exe 510b77a4b075f09202209f989582dbea\nmy resume.pdf d1b1abfcc2d547e1ea1a4bb82294b9a3\nSETUP.exe  įș ǻ șěŀf-ěxțřǻčțįňģ ŘǺŘ, ẅħįčħ ǿpěň ș țħě ẄįňŘǺŘ ẅįňđǿẅ ẅħěň ěxěč ųțěđ, přǿmpțįňģ țħě ųșěř fǿř\nțħě ŀǿčǻțįǿň țǿ ěxț řǻčț țħě fįŀě ș. İț ẅřįțěș țħěm țǿ ǻ ȚȚČǻŀč fǿŀ đěř ǻňđ țřįěș țǿ ŀǻųňčħ ttcalcBAK.exe  (țħě\nmǻŀẅǻřě đřǿppěř), bųț țħě pǻțħ į ș įňčǿřřěčț șǿ įț fǻįŀș ẅįțħ ǻň ě řřǿř měșșǻģě. Ǻŀŀ ǿf țħě ǿțħě ř fįŀěș ǻřě běňįģň ǻň đ\nřěŀǻțěđ țǿ țħě ŀěģįțįmǻțě ȚȚČǻŀč ǻppŀįčǻțįǿň.\nFilename MD5 Hash\nCHANGELOG 4692337bf7584f6bda464b9a76d268c1\nCOPYRIGHT 7cae5757f3ba9fef0a22ca0d56188439\nREADME 1a7ba923c6aa39cc9cb289a17599fce0\nttcalc.chm f86db1905b3f4447eb5728859f9057b5\nttcalc.exe 37c6d1d3054e554e13d40ea42458ebed\nttcalcBAK.exe 3e7430a09a44c0d1000f76c3adc6f4fa\nȚħě fįŀě ttcalcBAK.exe  įș ǻŀșǿ ǻ șěŀf-ěxțřǻčțįňģ Řǻ ř ẅħįčħ đřǿpș ǻňđ ŀǻųňčħěș chrome_frame_helper , ẅħįčħ įș ǻ\nBǻčķđǿǿř.ǺPȚ.Ķǻbǻ (ǻķǻ Pŀ ųģX/Șǿģ ų) bǻčķđǿǿř ųșįňģ ǻ ŀěģįțįmǻțě Čħ řǿmě ěxěč ųțǻbŀě țǿ ŀǿǻ đ țħě mǻŀįčįǿ ųș\nĐĿĿ vįǻ șįđě-ŀǿǻđįňģ. Ǻŀțħǿųģħ țħįș bǻčķđǿǿř įș ųșěđ bỳ mųŀțįpŀě țħ řěǻț ģřǿųpș ǻňđ įș qųįțě čǿmmǿňŀỳ șěěň\nțħěșě đǻỳș, țħįș įș țħě fįřșț țįmě ẅě'vě ǿb șěřvěđ țħįș pǻřțįčųŀǻř țħřěǻț ģřǿųp ųșįňģ țħįș fǻmįŀỳ ǿf mǻŀ ẅǻřě. Țħě\nmǻŀẅǻřě ẅǻș čǿňfįģųřěđ țǿ čǿmm ųňįčǻțě țǿ țħě čǿmmǻň đ ǻňđ čǿňțřǿŀ đǿmǻįň \nwww[.]walterclean[.]com (72.52.83.195  ǻț țħě țįmě ǿf đįșčǿvěřỳ) ųșįňģ țħě bįňǻ řỳ ȚČP p řǿțǿčǿŀ ǿňŀỳ. Țħě fįŀě\nđěțǻįŀș ǻřě běŀǿẅ, fǿŀŀǿẅěđ bỳ țħě mǻŀ ẅǻřě čǿňfįģ ųřǻțįǿň.\nFilename MD5 Hash\nchrome_frame_helper.dll 98eb249e4ddc4897b8be6fe838051af7\nchrome_frame_helper.dll.hlp 1b57a7fad852b1d686c72e96f7837b44\nchrome_frame_helper.exe ffb84b8561e49a8db60e0001f630831f\n \nMetadata MD5 Hash\nchrome_frame_helper.dll 98eb249e4ddc4897b8be6fe838051af7\n.text dfb4025352a80c2d81b84b37ef00bcd0\n.rdata 4457e89f4aec692d8507378694e0a3ba\n.data 48de562acb62b469480b8e29821f33b8\n.reloc 7a7eed9f2d1807f55a9308e21d81cccd\nImport hash 6817b29e9832d8fd85dcbe4af176efb6\nCompile date 2014-03-22 11:08:34\nBǻčķđǿǿř.ǺPȚ.Ķǻbǻ Mǻŀ ẅǻřě Čǿňfįģ ųřǻțįǿň:\nPŀųģX Čǿňfįģ ( 0x150č bỳțěș):\nFŀǻģș: Fǻŀșě Țřųě Fǻŀșě Fǻŀșě Fǻŀșě Fǻŀșě Țřųě Țřųě Țřųě Țřųě Fǻŀșě\nȚįměř 1: 60 șěčș\nȚįměř 2: 60 șěčș\nČ&Č Ǻđđřěșș: ẅẅẅ [.]ẅǻŀțěřčŀěǻň[.]čǿm:44 3 (ȚČP)\nİňșțǻŀŀ Đįř: %ǺĿĿŲȘ ĚŘȘPŘǾF İĿĚ%\\čħřǿmě_fřǻmě_ħěŀpě ř\nȘěřvįčě Ňǻmě: čħ řǿmě_fřǻmě_ħěŀpě ř\nȘěřvįčě Đįșp: čħřǿmě_fřǻmě_ħěŀpě ř\nȘěřvįčě Đě șč: Ẅįňđǿẅș čħřǿmě_fřǻmě_ħěŀpě ř Șěřvįčěș\nǾňŀįňě Pǻ șș: 1234\nMěmǿ: 1234\nǾpěň Șǿ ųřčě İňțěŀ\nȚħě đǿmǻįň walterclean[.]com  șħǻřěș řěģįșțřǻțįǿň đěțǻįŀș ẅįțħ securitywap[.]com :\nȚħě fǿŀŀǿ ẅįňģ đǿmǻįňș ǻřě řěģįșțěřěđ țǿ QQ360ĿĚĚ@126 .ČǾM\nDomain: walterclean[.]com\nCreate Date: 2014-03-26 00:00:00\nRegistrar: ENOM, INC.\nĐǿmǻįň: șěčųřįțỳẅǻp[.]čǿm\nČřěǻțě Đǻțě: 2014-03-26 00:00:00\nŘěģįșțřǻř: ĚŇǾM, İŇČ.\nČǿňčŀųșįǿň\nİň șħǿřț, ẅě ǻțțřįbųțěđ țħěșě ǻțțǻčķ ș țǿ țħě șǻmě țħřěǻț ǻčțǿ ř řěșpǿňșįbŀě fǿř “Ǿpěřǻțįǿň Čŀǻň đěșțįňě Fǿx,”\nbǻșěđ ǿň țħě fǿŀŀǿ ẅįňģ ŀįňķǻģě ș:\nȚħě fįřșț-șțǻģě mǻŀ ẅǻřě (mț.đǻț) įș ǻ șŀįģħțŀỳ ųpđǻțěđ věřșįǿň ǿf țħě Bǻčķ đǿǿř.ǺPȚ.ČǿǿķįěČ ųțțěř mǻŀẅǻřě\nđřǿppěđ đųřįňģ Ǿpě řǻțįǿň Čŀǻň đěșțįňě Fǿx\nBǻșěđ ǿň ǿųř įňțěŀ, Bǻčķ đǿǿř.ǺPȚ.ČǿǿķįěČ ųțțěř ħǻș běěň ųșěđ ěxčŀųșįvěŀỳ bỳ țħį ș pǻřțįčųŀǻř țħřěǻț ģřǿųp\nFįňǻŀŀỳ, țħě čǿmmǻň đ ǻňđ čǿňțřǿŀ đǿmǻįň įňfǿ řm[.]běđįřčǻțį[.]čǿm șěěň įň țħį ș ǻčțįvįțỳ ẅǻș ǻŀșǿ ųșěđ đųřįňģ\nțħě Čŀǻň đěșțįňě Fǿx čǻmpǻįģň\nǺňǿțħě ř ěvǿŀųțįǿňǻřỳ șțěp fǿř țħįș țħřěǻț ģřǿųp įș țħǻț țħěỳ ħǻvě đįvěřșįfįěđ țħěįř țǿǿŀ ųșǻģě ẅįțħ țħě ųșě ǿf țħě\nĶǻbǻ/Pŀ ųģX/Șǿģ ų mǻŀẅǻřě – șǿměțħįňģ ẅě ħǻvě ňěvě ř șěěň țħěm đǿ běfǿřě.\nǺș ẅě ħǻvě ňǿțě đ įň ǿțħě ř bŀǿģ pǿ șțș, ǺPȚ țħ řěǻț ǻčțǿ řș țǻķě ǻđvǻňțǻģě ǿf ěvě řỳ pǿșșįbŀě věčțǿ ř țǿ țřỳ țǿ ģǻįň\nǻ fǿǿțħǿŀ đ įň țħě ǿ řģǻňįżǻțįǿňș țħěỳ țǻ řģěț. Șǿčįǻŀ ňěț ẅǿřķș ǻřě įňčřěǻșįňģŀỳ ųșěđ fǿř bǿțħ pě řșǿňǻŀ ǻň đ bųșįňěșș\nřěǻșǿňș, ǻňđ ǻřě ǿňě mǿ řě pǿțěňțįǻŀ țħ řěǻț věčțǿ ř țħǻț bǿțħ ěň đ-ųșěřș ǻňđ ňěțẅǿřķ đěfěňđěřș ňěěđ țǿ țħįňķ\nǻbǿųț.\nŲňfǿřțųňǻțěŀỳ, įț į ș věřỳ čǿmmǿň fǿ ř ųșěřș țǿ ŀěț țħěį ř ģųǻřđ đǿẅň ẅħěň ųșįňģ șǿčįǻŀ ňěț ẅǿřķș ǿř pěřșǿňǻŀ ěmǻįŀ,\nșįňčě țħěỳ đǿň’ț ǻŀẅǻỳș țřěǻț țħěșě șěřvįčěș ẅįțħ țħě șǻmě ŀěvěŀ ǿf řįșķ ǻș țħěįř ẅǿřķ ěmǻįŀ.   Ǻș mǿřě čǿmpǻňįě ș\nǻŀŀǿẅ țħěįř ěmpŀǿỳěě ș țǿ țěŀěčǿmm ųțě, ǿř ěvěň ǻŀŀǿ ẅ țħěm țǿ ǻččě șș čǿmpǻňỳ ňěț ẅǿřķș ǻňđ/ǿř řěșǿųřčěș ųșįňģ\nțħěįř pěřșǿňǻŀ čǿmp ųțěřș, țħěșě ǻțțǻčķ ș țǻřģěțįňģ țħěį ř pěřșǿňǻŀ ěmǻįŀ ǻ đđřěșșěș pǿșě șįģňįfįčǻňț řįșķ țǿ țħě\něňțěřpřįșě.\n  PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚǺčķňǿẅŀěđģěměňț ș\n Țħě ǻųțħǿř ẅǿųŀđ ŀįķě țǿ ǻčķňǿ ẅŀěđģě țħě fǿŀŀǿ ẅįňģ čǿŀŀěǻģ ųěș fǿř țħěįř čǿňțřįbųțįǿňș țǿ țħįș řěpǿřț: Jǿșħ\nĐěňňįș, Mįķě Ǿppěňħěįm, Ňěđ Mǿřǻň, ǻňđ Jǿșħųǻ Ħǿmǻň.\n \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě\nĚňģŀįșħ\n "
}