{
    "title": "dark caracal_ good news and bad news _ electronic frontier foundation",
    "text": "BY GENNIE GEBHART JANUARY 19, 2018\nCONTACT ABOUT ISSUES UPDATES PRESS DONATEDark Caracal: Good News and Bad News\nSan Francisco—The Electronic Frontier Foundation (EFF)\ntoday called on Congress to support implementation of an\nInternet protocol that encrypts web traffic, a critical tool\nthat will lead to dramatic improvements in user privacy\nand help impede the ability of governments to track and\ncensor people.EFF, joined by Consumer Reports and...EFF and Partners Urge U.S. Lawmakers to\nSupport New DoH Protocol for a More\nSecure Internet\nRecently, Google’s Project Zero published a report\ndescribing a newly-discovered campaign of surveillance\nusing chains of zero day iOS exploits to spy on iPhones.\nThis campaign employed multiple compromised websites\nin what is known as a “watering hole” attack. The\ncompromised websites would automatically run the chain\nof exploits...Watering Holes and Million Dollar\nDissidents: the Changing Economics of\nDigital Surveillance\nThroughout 2018, new surveillance practices continued to\nerode the privacy of people in Latin America. Yet local and\nregional digital rights organizations continue to push\nback with strategic litigation, journalists and security\nresearchers investigate to shed light on government use\nof malware, and local activists work tirelessly to fight\noverarching...Where Governments Hack Their Own People\nand People Fight Back: 2018 in Review\nLast week, researchers at Citizen Lab  discovered that\nSandvine's PacketLogic devices were being used to hijack\nusers' unencrypted internet connections , making yet\nanother case for encrypting the web  with HTTPS. In\nTurkey and Syria, users who were trying to download\nlegitimate applications were instead served malicious\nsoftware...We Still Need More HTTPS: Government\nMiddleboxes Caught Injecting Spyware,\nAds, and Cryptocurrency Miners\nSan Francisco – The Electronic Frontier Foundation (EFF)\nand mobile security company Lookout have uncovered a\nnew malware espionage campaign  infecting thousands of\npeople in more than 20 countries. Hundreds of gigabytes\nof data has been stolen, primarily through mobile devices\ncompromised by fake secure messaging clients. The ...EFF and Lookout Uncover New Malware\nEspionage Campaign Infecting Thousands\nAround the World\nIf 2016 was the year government hacking went\nmainstream , 2017 is the year government hacking played\nthe Super Bowl halftime show. It's not Fancy Bear and\nCozy Bear making headlines. This week, the Trump\nadministration publicly attributed  the WannaCry\nransomware attack to the Lazarus Group, which allegedly\nworks...Nation-State Hacking: 2017 in Review\nThe Electronic Frontier Foundation, for example,\ncommended the feds for asking a judge to review exactly\nwhat data the FBI would and would not touch in\nvictimized devices, which were located across the country.\nIt was a \"positive step\" toward accountability and\ntransparency in FBI computer break-ins, EFF staff\nattorney...FBI allays some critics with first use of new\nmass-hacking warrant\nWashington, D.C. – The Electronic Frontier Foundation\n(EFF) urged  an appeals court today to review a dangerous\ndecision by a three-judge panel that would allow foreign\ngovernments to spy on Americans on U.S. soil—just as\nlong as they use technology instead of human agents. In\nKidane v. Ethiopia ...EFF Urges Court to Roll Back Ruling\nAllowing Remote-Control Spying\nThe United States Court of Appeals for the District of\nColumbia Circuit today held that foreign governments are\nfree to spy on, injure, or even kill Americans in their own\nhomes--so long as they do so by remote control. The\ndecision comes in a case called ...D.C. Circuit Court Issues Dangerous\nDecision for Cybersecurity: Ethiopia is Free\nto Spy on Americans in Their Own Homes\nAs with any tool designed for military and civilian uses,\nthere are dangers of these hacking programs falling into\nthe wrong hands. To be sure, the misuse of government-\ngrade exploits unnerves many civil liberties groups.\n“Governments shouldn’t be able to use them to crack\ndown on free speech or dissidents,”...The secret world of vulnerability huntersENGLISH\nYesterday, EFF and Lookout announced  a new report, Dark Caracal , that\nuncovers a new, global malware espionage campaign. One aspect of that\ncampaign was the use of malicious, fake apps to impersonate legitimate\npopular apps like Signal and WhatsApp. Some readers had questions about\nwhat this means for them. This blog post is here to answer those questions\nand dive further into the Dark Caracal report.\nRead the full Dark Caracal report here\nFirst, the good news: Dark Caracal does not mean that Signal or WhatsApp\nthemselves are compromised in any way.  It only means that attackers found\nnew, insidious ways to create and distribute fake Android versions of them.\n(iOS is not affected.) If you downloaded your apps from Google’s official app\nstore, Google Play, then you are almost certainly in the clear. The threat\nuncovered in the Dark Caracal report referred to “ trojanized ” apps, which are\nfake apps that pretend to look like real, trusted ones. These malicious spoofs\noften ask for excessive permissions and carry malware. Such spoofed versions\nof Signal and WhatsApp were involved in the Dark Caracal campaign.\nThe malicious actors behind Dark Caracal got these fake, malicious apps onto\npeople’s phones by spearphishing . Several types of phishing emails directed\npeople—including military personnel, activists, journalists, and lawyers—to go\nto a fake app store-like page, where fake Android apps waited. There is even\nevidence that, in some cases, Dark Caracal used physical access to people’s\nphones to install the fake apps. Again, if you downloaded your apps from the\nofficial app store, you can rest easy that this has likely not affected you.\nAnd now the bad news: Dark Caracal has wide-reaching implications for how\nstate-sponsored surveillance and malware works. Most people do not have to\nworry about this very specific threat. But for the small minority of users who\nmay be directly targeted by nation-states or other skilled, motivated\nadversaries—and for the malware researchers who try to track those\nadversaries down—the Dark Caracal report uncovers a new infrastructure that\nmakes it even harder to attribute attacks and malware campaigns to a\nparticular nation or actor. More details are available in the report .\nDark Caracal is also a reminder that most modern hacking requires the\nunwitting participation of the user. The most dangerous thing in the online\nenvironment is not necessarily complex, headline-grabbing vulnerabilities, but\nwell-crafted phishing messages and fake apps that trick users into handing\nover log-in credentials and granting excessive permissions. Keep an eye\nout for links, attachments, and apps pretending to be something they’re not,\nand make sure your friends, neighbors, and others in your community  are\ninformed too.\nRELATED UPDATES\nPRESS RELEASE  | OCTOBER 22, 2019\nDEEPLINKS BLOG  BY COOPER QUINTIN , THREAT LAB  | SEPTEMBER 9,\n2019\nDEEPLINKS BLOG  BY KATITZA RODRIGUEZ  | DECEMBER 30, 2018\nDEEPLINKS BLOG  BY SYDNEY LI  | MARCH 12, 2018\nPRESS RELEASE  | JANUARY 18, 2018\nDEEPLINKS BLOG  BY EVA GALPERIN  | DECEMBER 27, 2017\nEFF IN THE NEWS\nPRESS RELEASE  | APRIL 13, 2017\nDEEPLINKS BLOG  BY NATE CARDOZO  | MARCH 14, 2017\nEFF IN THE NEWSJoin Our Newsletter!\nEmail updates on news, actions, events in your\narea, and more.\nEmail Address\nPostal Code (optional)\nAnti-spam question: Enter the three-letter abbreviation\nfor Electronic Frontier Foundation :\nSUBMIT\n  \nRELATED ISSUES :\nSTATE-SPONSORED MALWARE\nSECURITY EDUCATION\nFOLLOW EFF:\nGeneral\nLegal\nSecurity\nMembership\nPressCalendar\nVolunteer\nVictories\nHistory\nInternships\nJobs\nStaffFree Speech\nPrivacy\nCreativity & Innovation\nTransparency\nInternational\nSecurityBlog\nEvents\nPress Releases\nWhitepapersPress Contact Join or Renew Membership Online\nOne-Time Donation Online\nShop\nOther Ways to Give\nCOPYRIGHT (CC BY) TRADEMARK PRIVACY POLICY THANKSAbout Issues Our Work Take Action Tools Donate  \n "
}