{
    "title": "darkhotel hackers are back targeting chinese telecomsecurity affairs",
    "text": "TrueFire Guitar tutoring website was hacked, financial data might have  MUST READ\nCopyright 2015 Security Affairs by Pierluigi Paganini All Right Reserved. Back to top\n\nSponsored Content\nDigging the Deep Web: Exploring the dark side of the\nweb\nYoroi Blog\nYoroi Blog\nSponsored Content\nSponsored Content\nSponsored Content\nSponsored ContentDarkHotel hackers are back targeting Chinese\nTelecom\nMarch 2, 2016  By Pierluigi Paganini\nSHARE ON       \nPierluigi Paganini\nPierluigi Paganini is member of the ENISA (European Union Agency for Network\nand Information Security) Threat Landscape Stakeholder Group and Cyber G7\nGroup, he is also a Security Evangelist, Security Analyst and Freelance Writer.\nEditor-in-Chief at \"Cyber Defense Magazine\", Pierluigi is a cyber security expert\nwith over 20 years experience in the field, he is Certified Ethical Hacker at EC\nCouncil in London. The passion for writing and a strong belief that security is\nfounded on sharing and awareness led Pierluigi to find the security blog\n\"Security Affairs\" recently named a Top National Security Resource for US.\nPierluigi is a member of the \"The Hacker News\" team and he is a writer for some\nmajor publications in the field such as Cyber War Zone, ICTTF, Infosec Island,\nInfosec Institute, The Hacker News Magazine and for many other Security\nmagazines. Author of the Books \"The Deep Dark Web\" and “Digital Virtual\nCurrency and Bitcoin”.The DarkHotel APT group is back and it is targeting executives\nat telecommunications companies in China and North Korea.\nAccording to threat intelligence start-up ThreatBook, the DarkHotel  APT group is targeting\nexecutives at telecommunications companies in China and North Korea.\nThe Darkhotel espionage campaign was first uncovered by security experts at Kaspersky Lab in\nNovember 2014. The experts discovered that the hacking campaign was ongoing for at least four years\nwhile targeting selected corporate executives  traveling abroad. According to the experts, threat actors\nbehind the Darkhotel campaign aimed to steal sensitive data from executives while they are staying in\nluxury hotels, the worrying news is that the hacking crew is still active.\nThe attackers appeared as highly skilled professionals that exfiltrate data of interest with a surgical\nprecision and deleting any trace of their activity. The researchers noticed that the gangs never go after\nthe same target twice. The list of targets includes  CEOs, senior vice presidents, top R&D\nengineers, sales and marketing directors from the USA and Asia traveling for business in the APAC\nregion.\nExperts at ThreatBook dubbed the new campaign DarkHotel Operation 8651, the hackers have\nalready compromised at least one organization by using spear phishing emails.\nThe spear phishing messages came with malicious documents attached, typically a crafted SWF file\nembedded as a downloadable link in a Word document.\nThe DarkHotel hackers exploited the Adobe Flash vulnerability CVE-2015-8651 , patched by Adobe\non Dec. 28 with an out-of-band patch.\nThe attackers disguise the malicious code a component of the OpenSSL library. Experts noticed that\nthe malware implements a number of anti-detection measures, including anti-sandbox and just-in-\ntime decryption.\nTo better understand the DarkHotel group, let me provide you further details  emerged by an update\nprovided by Kaspersky Lab  in August 2015. Kaspersky confirmed that the organizations targeted by\nthe DarkHotel APT in 2015 were located in North Korea, Russia, South Korea, Japan, Bangladesh,\nThailand, India, Mozambique and Germany.\nDarkhotel relied on phishing emails containing links to Flash Player exploits disclosed following\nthe data breach  suffered by the Hacking Team  surveillance firm.\n“…at the beginning of July, it began to distribute what is reported to be a leaked Hacking Team Flash 0day. It\nlooks like the Darkhotel  APT may have been using the leaked HackingTeam Flash 0day to target specific\nsystems. We can pivot from “tisone360.com” to identify some of this activity. ” Kaspersky wrote in a blog post .\nThe DarkHotel APT used obfuscated HTML Application (HTA) files to serve backdoor and\ndownloader code on infected systems since 2010, in August security experts discovered new variants\nof the malicious HTA files.\n“It’s somewhat strange to see such heavy reliance on older Windows-specific technology like HTML applications,\nintroduced by Microsoft in 1999,” experts noted.\nThe hackers also improved the obfuscation techniques using more efficient evasion methods, in one\ncase the attackers used a signed downloaders developed to detect known antivirus solutions.\nThe spear-phishing  emails used by the Darkhotel group in the past contain .rar archives that appeared\nto include a harmless .jpg file. In reality, the file is a .scr executable that appears like a JPEG using a\ntechnique known as right-to-left override ( RTLO ). When the file is opened, an image is displayed in the\nPaint application, while the malicious code is executed in the background.\nAnother novelty for the espionage campaign run by the Darkhotel APT group is the use of stolen\ndigital certificates  that are used to sign malware.\nAccording to the experts at Kaspersky, the APT group appears to be Korean speaker.\nPierluigi Paganini\nSecur ity Affairs  –  (Darkhotel, cyber espionage )\nShare this...\n\nPREVIOUS ARTICLE\nBrazilian police arrested Facebook Vice\nPresident for Latin America\n NEXT ARTICLE\nUS DoD invites a restricted number of\nhackers to Hack the Pentagon \nHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  \nTerrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact meHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  Terrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\n "
}