{
    "title": "darkhotel apt gang taps flash flaw - bankinfosecurity",
    "text": "TRENDING:\nAround the Network  ISMG Network USA Sign in Register CyberEd.io Membership\nTopics   News   Training   Resources   Events   Jobs  \n• ISMG at RSAC 2020 - View Coverage from the Conference Floor • Live Webinar | Ensuring Faster Payments Do NOT Equate to Faster Fraud\nYou might also be interested in …  Application Security  , Fraud Management & Cybercrime  , Governance & Risk Management\nDarkhotel APT Gang Taps Flash Flaw\nAttacks Tied to South Korea Aim to Trick Potential Victims\nMathew J. Schwartz  (euroinfosec ) • August 11, 2015     \nThe advanced persistent threat gang behind a long-running series of cyberespionage-\nfocused campaigns quickly tapped a zero-day exploit for a flaw in Adobe Flash after it was\nleaked in July, as part of the 400 GB dump of data stolen from hacked  spyware vendor\nHacking Team . But the APT gang has long employed trickery to exploit a number of high-\nprofile targets, suggesting that potential victims will need to do more than just update their\nversion of Flash Player to counter these types of attacks in the future.\nSee Also:  451 Research Report: Tackling the Visibility Gap in Information Security\nThat warning is being sounded by security firm Kaspersky Lab , which says that the long-\nactive group, known as \"Darkhotel,\" continues to favor diplomatic targets, as well as\norganizations that have \"strategic commercial interests\" - ranging from electronics and\npharmaceuticals firms to private equity institutions and automotive manufacturers - in the\nAsia-Pacific region.\nThe APT group's use of Flash exploits is not new. In February 2014, Kaspersky Lab reported\ntracing back to the group a zero-day Flash attack  used successfully against both Mac OS X\nand Windows 7 machines. Adobe quickly patched the related vulnerability. \"Darkhotel\nseems to have burned through a pile of Flash zero-day and half-day exploits over the past\nfew years, and it may have stockpiled more to perform precise attacks on high-level\nindividuals globally,\" writes Kurt Baumgartner, principal security researcher at Kaspersky\nLab, in a research report. \"From previous attacks we know that Darkhotel spies on CEOs,\nsenior vice presidents, sales and marketing directors and top R&D staff.\"\nOther security firms have been tracking the same group - also known as Fallout Team, as\nwell as Tapaoux - and report that since at least 2007, the APT gang has relied on targeted\nspear-phishing attacks to infect victims, but may also sometimes have gained physical\naccess to targeted systems. The gang has also been tied to attacks involving peer-to-peer\nnetworks that infect large numbers of PCs at once, after which the attackers then exfiltrate\ndata from targets of interest.\nNew Flash Flaw Targeted Fast\nThe new Kaspersky Lab report builds on a July 8 warning from Weimin Wu , a malware\nresearcher at security firm Trend Micro, who reported that an exploit for an Adobe Flash\nzero-day flaw - CVE-2015-5119  - leaked via the July 5 dump of data stolen from Hacking\nTeam had been used in spear-phishing attack against a target in South Korea. While the\nDarkhotel group was not named, Wu added that systems from both South Korea and\nJapan appeared to have visited an attack site being run by the attackers, which attempted\nto exploit visiting PCs with drive-by attacks based on Hacking Team's Flash flaw (see Hacking\nTeam Zero-Day Attack Hits Flash ).\n\"Fallout Team - publicly referred to as Darkhotel - has been using this Hacking Team exploit\nsince July,\" threat-intelligence firm iSight Partners says in an Aug. 11 research note. \"Fallout\nTeam is a sophisticated espionage operation that we believe has a nexus to South Korea.\nThe team has demonstrated access to significant operational resources and has also\npreviously exploited zero-day vulnerabilities to compromise targets with a vested interest in\nsecurity issues oriented around the Korean peninsula.\"\nExploits Launched Via Hotel WiFi\nThe Darkhotel moniker dates from November 2014, when Kaspersky Lab warned that the\nAPT group had been using hotel networks across Asia and the United States to infect and\ntrack thousands of targets as they moved around the globe. \"The more interesting travelling\ntargets include top executives from the U.S. and Asia doing business and investment in the\nAPAC region,\" Kaspersky Lab said. It added that the targets appeared to be carefully\nselected, and that after a hotel network was used to infect a victim, the related attack tools\nthen appeared to be quickly deleted from the network, to help disguise the attack.\nSince then, the Darkhotel group has reportedly continued to employ many of the same\nattack techniques. For example, Kaspersky Lab says that the zero-day Flash exploit\nobtained from the Hacking Team dump was launched from a website that the group had\npreviously used to target an older Flash flaw. The group has also continued to sign some of\nits malware  with digital certificates that have been stolen from Chinese-based firm Xuchang\nHongguang Technology, and also still relies in large part on executable HTML - .hta - files in\nits attacks.\nSpear-Phishing Continues\nThe group's attacks have continued throughout 2015, with Kaspersky Lab reporting that it\nhas seen the attackers hit targets and victims located in at least nine countries: Bangladesh,\nGermany, India, Japan, Mozambique, North Korea, Russia, South Korea and Thailand.\nMeanwhile, systems from Amazon Web Services, as well as from France, Germany, Ireland\nand Ukraine also visited the attack infrastructure, but Kaspersky Lab says it believes those\nsystems were associated with researchers.\nDarkhotel also continues to target victims with spear-phishing attacks that send files to\ntargets that are stored in the .rar WinRAR archiver format, with such names as\n\"schedule(2.11~16).rar\" and \"schedule(6.1~6).rar\" as well as \"letter.rar,\" and will often keep\nattacking targets until they are successfully infected, Kaspersky Lab says. \"For example, the\nattachment 'schedule(2.11~16).rar' could be sent on February 10th, with Darkhotel\nreturning to the same targets in late May for a second attempt with attachment\n'schedule(6.1~6).rar.'\"\nMany of the group's attacks rely on the right-to-left override technique , or RTLO, which\nattackers can abuse to spoof file extension names, Kaspersky Lab says. In the case of the\nDarkhotel attacks, RTLO has been used in some cases to disguise executable .scr files as\n.jpg files. If a target opens the supposed image file, however, it instead drops a link onto\ntheir desktop and executes it, which launches a \"target shell script\" that initiates an AJAX-\nbased download of a 1.2 MB executable, which then \"injects malicious code and spawns\nremote threads into legitimate processes\" - thus fully compromising the system - Kaspersky\nLab says.\nIt adds that the most recent versions of the attackers' malware downloader includes\ndefenses against 27 different types of antivirus software, ranging from Avast and\nIntel/McAfee to Kaspersky Lab and F-Secure.\nDespite the technical moves, however, Martijn Grooten , who edits malware research site\nVirus Bulletin, notes that related attacks still rely largely on tricking would-be victims.\nExploit Kits at Work Too\nOf course, Darkhotel is not the only group that used the Flash exploits that were leaked\nfrom Hacking Team. In fact, the Hacking Team breach \"has facilitated multiple operations\nby known operators, particularly in the short term after the breach,\" iSight Partners says\n(see Zero-Day Exploit Alert: Flash, Java ). Indeed, in the days and weeks following the data\ndump, the French malware researcher Kafeine reported that related exploits had been\nadded not only to the open source Metasploit penetration-testing framework, but also to\nsix separate exploit kits  that are sold - and employed - by cybercriminals for in-the-wild\nattacks.\nAbout the Author\n Twitter\n Facebook\n LinkedIn Credit Eligible  Get Permission\nApplication Security Fraud Management & Cybercrime Governance & Risk Management\nNext-Generation Technologies & Secure Development\n\n Twitter\n Facebook\n LinkedIn Credit Eligible  Get Permission\n Previous\nWire Fraud Just Got More ChallengingNext \nFeds Charge 9 with $30M Insider Trading, Hacking Scheme\nMathew J. Schwartz\nExecutive Editor, DataBreachToday & Europe\nSchwartz is an award-winning journalist with two decades of experience in magazines,\nnewspapers and electronic media. He has covered the information security and\nprivacy sector throughout his career. Before joining Information Security Media Group\nin 2014, where he now serves as the executive editor, DataBreachToday and for\nEuropean news coverage, Schwartz was the information security beat reporter for\nInformationWeek and a frequent contributor to DarkReading, among other\npublications. He lives in Scotland.\n  \nThe Need For A Business-Driven\nSecurity Posture\nTenable Research: How\nLucrative Are Vulnerabilities?\nBehavioral Analytics and the\nInsider ThreatFollow us on TwitterGET DAILY EMAIL UPDATES\nCovering topics in risk management, compliance,\nfraud, and information security.\nBy submitting this form you agree to our Privacy &\nGDPR Statement\nRESOURCES\nLATEST NEWS\nLATEST TWEETS AND MENTIONSSubmit\nThree Steps to Securing\nEnterprise Data on Cloud\nPlatforms\nContainer Security Best\nPractices: A How-To Guide\n5 Best Practices For\nApplication Security: A How-\nTo Guide\nContainer Security Best\nPractices: A How-To Guide\nDeception Technology:\nMaking the Case\nDigital Identity\nData Governance: How to\nTackle Three Key Issues\nCloud Security\nUncertain Markets May Drive\nCybersecurity Consolidation\nApplication Security\nSecurity Firm Checkmarx\nGetting New Owner\nArtificial Intelligence & Machine\nLearning\nACLU Files Lawsuit Over Facial\nRecognition at US Airports\nEndpoint Security\nCOVID-19 Response: 5 Tips for\nSecuring Remote Workplace\nMyersEH\nCheck out this video interview w/\n@LNSundra  @Forescout  where she\naddresses tough questions such as\nenterprise… https://t.co/NjzqC5jAsn\nabout a minute ago. Retweet\nandynorton27000\nData Governance: How to Tackle Three\nKey Issues https://t.co/cvH1V5IH4y\nhttps://t.co/9P2J99jxlo\nabout a minute ago. Retweet\nvishne0\nRT @ArrakisConsult : Contact Arrakis for\nyour confidential needs. Security Firm\nCheckmarx Getting New Owner\nhttps://t.co/039Z4uGkmO sales…\n8 minutes ago. Retweet\nnickster2407\nSome great cybersecurity tips on WFH\nfrom Phil Reitinger of Global Cyber\nAlliance https://t.co/iNMrxP8N6n\n11 minutes ago. Retweet\nhealthinfosec\n#HHS  #OCR  Issues Limited #HIPAA\nWaivers Amid #Coronavirus  Pandemic:\nIncludes Moves to Facilitate #Telehealth ;\nDrops… https://t.co/vtWtvQAH6Y\n12 minutes ago. Retweet\nThe New Insider Risk: When Creativity\nGoes Bad\nMaking the Healthcare Supply Chain\n'Smarter'\nCOVID-19: How to Adjust Business\nContinuity Plans\nCOVID-19 Response: 5 Tips for Securing\nRemote Workplace\nExplore\nNews\nTraining\nResources\nEvents\nJobsAbout\nEditorial\nBoard of Advisers\nPress\nAdvertise\nContactResource Centers\nDDoS Resource Center\nFFIEC Authentication Guidance\nGDPR\nHIPAA Omnibus Rule\nRansomware\nSecurity IntelligenceFollow Us\n\nNewsletter\nBy submitting this form you agree to our Privacy & GDPR\nStatementSign up\n© 2020 Information Security Media Group, Corp.  | About ISMG  | Privacy & GDPR Statement  | CCPA: Do Not Sell My Personal Data\n| Sitemap  | Advertise\nEmail address\nEmail\nOur website uses cookies. Cookies enable us to provide the best experience possible and help us understand how visitors use our website. By browsing bankinfosecurity.com, you agree to our use of cookies.\n "
}