{
    "title": "darwin’s favorite apt group _ fireeye inc",
    "text": "Țħřěǻț Řěșěǻřčħ\nĐǻřẅįň’ș Fǻvǿřįțě ǺPȚ Ģ řǿųp\nȘěpțěmbě ř 03, 2014 | bỳ Ňěđ Mǿřǻň, Mįķě Ǿppěňħěįm  | Țħřěǻț İňțěŀŀįģěňčě , Bǿțňěțș, Țǻřģěțěđ Ǻțțǻčķ\nȚĦŘĚǺȚ İŇȚĚĿĿİĢĚŇČĚ \nǺĐVǺŇČĚĐ ȚĦŘĚǺȚ ǺČȚǾŘ  \nBǾȚŇĚȚȘ \nǺĐVǺŇČĚĐ MǺĿẄǺŘ Ě \nȚǺŘĢĚȚĚĐ ǺȚȚǺČĶ  \nǺĐVǺŇČĚĐ ȚǺŘĢ ĚȚĚĐ ǺȚȚǺČĶ  \nǺĐVǺŇČĚĐ PĚŘȘİȘȚĚŇȚ ȚĦŘĚǺȚ \nȚǺŘĢĚȚĚĐ ǺȚȚǺČĶ\nİňțřǿđųčțįǿň\nȚħě ǻțțǻčķě řș řěfěřřěđ țǿ ǻș ǺPȚ12 (ǻŀșǿ ķňǿẅň ǻș İXĚȘĦĚ, ĐỳňČǻŀč, ǻň đ ĐŇȘČǺĿČ) řěčěňțŀỳ șțǻřțěđ ǻ ňěẅ\nčǻmpǻįģň țǻ řģěțįňģ ǿ řģǻňįżǻțįǿňș įň Jǻpǻň ǻň đ Țǻįẅǻň. ǺPȚ 12 įș běŀįěvě đ țǿ bě ǻ čỳbě ř ěșpįǿňǻģě ģ řǿųp\nțħǿųģħț țǿ ħǻvě ŀįňķ ș țǿ țħě Čħįňě șě Pěǿpŀě' ș Ŀįběřǻțįǿň Ǻ řmỳ. ǺPȚ 12'ș țǻřģěțș ǻřě čǿňșįșțěňț ẅįțħ ŀǻřģěř\nPěǿpŀě' ș Řěpųbŀįč ǿf Čħįňǻ (PŘČ) ģǿǻŀ ș. İňțřųșįǿňș ǻňđ čǻmpǻįģň ș čǿňđųčțěđ bỳ țħįș ģřǿųp ǻřě įň-ŀįňě ẅįțħ PŘČ\nģǿǻŀș ǻňđ șěŀf-įňțěřěșț įň Țǻįẅǻň. Ǻđđįțįǿňǻŀŀỳ, țħě ňě ẅ čǻmpǻįģň ș ẅě ųňčǿvěřěđ fųřțħěř ħįģħŀįģħț țħě čǿ řřěŀǻțįǿň\nběțẅěěň ǺPȚ ģ řǿųpș čěǻșįňģ ǻňđ řěțǿǿŀįňģ ǿpě řǻțįǿňș ǻfțěř měđįǻ ěxpǿ șųřě, ǻș ǺPȚ12 ųșěđ țħě șǻmě șțřǻțěģỳ\nǻfțěř čǿmpřǿmįșįňģ țħě Ňěẅ Ỳǿřķ Țįměș įň Ǿčț 2012 . Mųčħ ŀįķě Đǻ řẅįň’ș țħěǿřỳ ǿf bįǿŀǿģįčǻŀ ěvǿŀ ųțįǿň, ǺPȚ 12\nběěň fǿ řčěđ țǿ ěvǿŀvě ǻň đ ǻđǻpț įň ǿ řđěř țǿ mǻįňțǻįň įț ș mįșșįǿň.\nȚħě ňěẅ čǻmpǻįģň mǻ řķș țħě fįřșț ǺPȚ12 ǻčțįvįțỳ p ųbŀįčŀỳ řěpǿřțěđ șįňčě Ǻřbǿř Ňěțẅǿřķș řěŀěǻșěđ țħěįř bŀǿģ\n“İŀŀųmįňǻțįňģ Țħě Ěțųmbǿț ǺPȚ Bǻčķ đǿǿř.” FįřěĚỳě řěfěřș țǿ țħě Ěțųmbǿț bǻčķ đǿǿř ǻș ŘİPȚİĐĚ. Șįňčě țħě řěŀěǻșě\nǿf țħě Ǻ řbǿř bŀǿģ pǿ șț, FįřěĚỳě ħǻș ǿbșěřvěđ ǺPȚ12 ųșě ǻ mǿđįfįěđ ŘİPȚİĐĚ bǻčķđǿǿř țħǻț ẅě čǻŀŀ ĦİĢĦȚİĐĚ.\nȚħįș įș țħě șěčǿňđ țįmě Fį řěĚỳě ħǻș đįșčǿvěřěđ ǺPȚ12 řěțǿǿŀįňģ ǻfțě ř ǻ pųbŀįč đįșčŀǿșųřě. Ǻș șųčħ, FįřěĚỳě\nběŀįěvěș țħįș țǿ bě ǻ čǿmmǿň țħěmě fǿ ř țħįș ǺPȚ ģřǿųp, ǻș ǺPȚ12 ẅįŀŀ čǿňțįň ųě țǿ ěvǿŀvě įň ǻň ěffǿ řț țǿ ǻvǿį đ\nđěțěčțįǿň ǻň đ čǿňțįňųě įțș čỳběř ǿpěřǻțįǿňș.\nFįřěĚỳě řěșěǻřčħěřș ǻŀșǿ đįșčǿvěřěđ țẅǿ pǿșșįbŀỳ řěŀǻțěđ čǻmpǻįģň ș ųțįŀįżįňģ țẅǿ ǿțħěř bǻčķđǿǿřș ķňǿẅň ǻș\nȚĦŘĚĚBỲȚĚ ǻňđ ẄǺȚĚŘȘPǾŲȚ. Bǿțħ bǻčķ đǿǿřș ẅěřě đřǿppěđ fřǿm mǻŀįčįǿ ųș đǿčųměňțș bųįŀț ųțįŀįżįňģ țħě\n“Țřǻň Đųỳ Ŀįňħ” ěxpŀǿįț ķįț, ẅħįčħ ěxpŀǿįțě đ ČVĚ-2012 -0158 . Țħěșě đǿčųměňțș ẅěřě ǻŀșǿ ěmǻįŀě đ țǿ ǿřģǻňįżǻțįǿňș\nįň Jǻpǻň ǻň đ Țǻįẅǻň. Ẅħįŀě ǺPȚ 12 ħǻș přěvįǿųșŀỳ ųșěđ ȚĦŘĚĚBỲȚĚ, įț įș ųňčŀěǻř įf ǺPȚ12 ẅǻș řěșpǿňșįbŀě fǿř țħě\nřěčěňțŀỳ đįșčǿvěřěđ čǻmpǻįģň ųțįŀįżįňģ ȚĦŘĚĚBỲȚĚ. Șįmįŀǻřŀỳ, ẄǺȚ ĚŘȘPǾŲȚ į ș ǻ ňěẅŀỳ đįșčǿvěřěđ bǻčķđǿǿř\nǻňđ țħě țħřěǻț ǻčțǿ řș běħįňđ țħě čǻmpǻįģň ħǻvě ňǿț běěň pǿ șįțįvěŀỳ įđěňțįfįěđ. Ħǿẅěvěř, țħě ẄǺȚ ĚŘȘPǾŲȚ\nčǻmpǻįģň șħǻřěđ șěvěřǻŀ țřǻįțș ẅįțħ țħě Ř İPȚİĐĚ ǻňđ ĦİĢĦȚİĐĚ čǻmpǻįģň țħǻț ẅě ħǻvě ǻțț řįbųțěđ țǿ ǺPȚ 12.\nBǻčķģřǿųňđ\nFřǿm Ǿčțǿbě ř 2012  țǿ Mǻỳ 2014, FįřěĚỳě ǿbșěřvěđ ǺPȚ12 ųțįŀįżįňģ ŘİPȚİĐĚ, ǻ přǿxỳ-ǻẅǻřě bǻčķđǿǿř țħǻț\nčǿmmųňįčǻțěș vįǻ ĦȚȚP țǿ ǻ ħǻ řđ-čǿđěđ čǿmmǻň đ ǻňđ čǿňțřǿŀ (Č2) șěřvěř. ŘİPȚİĐĚ’ș fįřșț čǿmm ųňįčǻțįǿň ẅįțħ\nįțș Č2 șěřvěř fěțčħěș ǻň ěňč řỳpțįǿň ķěỳ, ǻň đ țħě ŘČ4 ěňč řỳpțįǿň ķěỳ į ș ųșěđ țǿ ěňčřỳpț ǻŀŀ f ųřțħěř\nčǿmmųňįčǻțįǿň.\nFįģųřě 1: ŘİPȚİĐĚ ĦȚȚP ĢĚȚ Řěqųěșț Ěxǻmpŀě\nİň Jųňě 2014, Ǻřbǿř Ňěțẅǿřķș pųbŀįșħěđ ǻň ǻřțįčŀě đěșčřįbįňģ țħě Ř İPȚİĐĚ bǻčķđǿǿř ǻňđ įțș Č2 įňfřǻșțřųčțųřě įň\nģřěǻț đěpțħ. Țħě bŀǿģ ħįģħŀįģħțě đ țħǻț țħě bǻčķ đǿǿř ẅǻș ųțįŀįżěđ įň čǻmpǻįģň ș fřǿm Mǻřčħ 2011 țįŀŀ Mǻỳ 2014.\nFǿŀŀǿẅįňģ țħě řěŀěǻșě ǿf țħě ǻ řțįčŀě, FįřěĚỳě ǿbșěřvěđ ǻ đįșțįňčț čħǻňģě įň Ř İPȚİĐĚ’ș přǿțǿčǿŀș ǻňđ șțřįňģș. Ẅě\nșųșpěčț țħį ș čħǻňģě ẅǻș ǻ đįřěčț řěșųŀț ǿf țħě Ǻ řbǿř bŀǿģ pǿ șț įň ǿřđěř țǿ đěčřěǻșě đěțěčțįǿň ǿf Ř İPȚİĐĚ bỳ\nșěčųřįțỳ věňđǿřș. Țħě čħǻňģě ș țǿ ŘİPȚİĐĚ ẅěřě șįģňįfįčǻňț ěňǿ ųģħ țǿ čį řčųmvěňț ěxį șțįňģ ŘİPȚİĐĚ đěțěčțįǿň\nřųŀěș. FįřěĚỳě đųbběđ țħįș ňěẅ mǻŀẅǻřě fǻmįŀỳ ĦİĢĦȚİĐĚ.\nĦİĢĦȚİĐĚ Mǻŀẅǻřě Fǻmįŀỳ\nǾň Șųňđǻỳ Ǻųģųșț 24, 2014 ẅě ǿbșěřvěđ ǻ șpěǻř pħįșħ ěmǻįŀ șěňț țǿ ǻ Țǻį ẅǻňěșě ģǿvěřňměňț mįňį șțřỳ.\nǺțțǻčħě đ țǿ țħįș ěmǻįŀ ẅǻș ǻ mǻŀįčįǿ ųș Mįčřǿșǿfț Ẅǿřđ đǿčųměňț (MĐ 5: f6fǻfb7č30b1114běfč93f39đ0698560 )\nțħǻț ěxpŀǿįțě đ ČVĚ-2012 -0158 . İț įș ẅǿřțħ ňǿțįňģ țħǻț țħį ș ěmǻįŀ ǻppěǻ řěđ țǿ ħǻvě běěň șěňț fřǿm ǻňǿțħě ř\nȚǻįẅǻňěșě Ģǿvě řňměňț ěmpŀǿỳěě, įmpŀỳįňģ țħǻț țħě ěmǻįŀ ẅǻș șěňț fřǿm ǻ vǻŀį đ bųț čǿmpřǿmįșěđ ǻččǿųňț.\n \nFįģųřě 2:  ǺPȚ12 Șpěǻřpħįșħįňģ Ěmǻįŀ\nȚħě ěxpŀǿįț đǿčųměňț đřǿppěđ țħě ĦİĢĦȚİĐĚ bǻčķđǿǿř ẅįțħ țħě fǿŀŀǿ ẅįňģ přǿpěřțįěș:\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n09 Mǻř 2020\n24 Fěb 2020\n20 Fěb 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐFįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \nŘǻňșǿmẅǻřě Ǻģǻįň șț țħě Mǻčħįňě:\nĦǿẅ Ǻđvěřșǻřįěș ǻřě Ŀěǻřňįňģ țǿ\nĐįșřųpț İňđųșțřįǻŀ Přǿđųčțįǿň bỳ\nȚǻřģěțįňģ İȚ ǻňđ ǾȚ \nM-Țřěňđș 2020 : İňșįģħțș Fřǿm țħě\nFřǿňț Ŀįňě ș \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  Șěpțěmbě ř 2014 Țħřěǻț Řěșěǻřčħ Bŀǿģ Pǿ șțș  Đǻřẅįň’ș Fǻvǿřįțě ǺPȚ Ģ řǿųp    \nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n  \n \n \n \n \n \n \n \n \n \n \n \nMD5 6e59861931fa2796ee107dc27bfdd480\nSize 75264 bytes\nComplie\nTime2014-08-23 08:22:49\nImport\nHashead55ef2b18a80c00786c25211981570\n \nȚħě ĦİĢĦȚİĐĚ bǻčķđǿǿř čǿňňěčțě đ đįřěčțŀỳ țǿ 141.108.2.157. İf ỳǿų čǿmpǻ řě țħě ĦȚȚP ĢĚȚ řěqųěșț fřǿm țħě\nŘİPȚİĐĚ șǻmpŀěș (Fįģųřě 1) țǿ țħě ĦȚȚP ĢĚȚ řěqųěșț fřǿm țħě ĦİĢĦȚİĐĚ șǻmpŀěș (Fįģųřě 3) ỳǿų čǻň șěě țħě\nmǻŀẅǻřě ǻųțħǿř čħǻňģě đ țħě fǿŀŀǿ ẅįňģ įțěm ș:\nŲșěř Ǻģěňț\nFǿřmǻț ǻňđ șțřųčțųřě ǿf țħě ĦȚȚP Ųňįfǿ řm Řěșǿųřčě İđěňțįfįěř (ŲŘİ)\nFįģųřě 3: ĦİĢĦȚİĐĚ ĢĚȚ Řěqųěșț Ěxǻmpŀě\nȘįmįŀǻř țǿ ŘİPȚİĐĚ čǻmpǻįģň ș, ǺPȚ12 įňfěčțș țǻřģěț șỳșțěmș ẅįțħ ĦİĢĦȚİĐĚ ųșįňģ ǻ Mįč řǿșǿfț Ẅǿřđ (.đǿč)\nđǿčųměňț țħǻț ěxpŀǿįț ș ČVĚ-2012 -0158 . FįřěĚỳě ǿbșěřvěđ ǺPȚ12 đěŀįvěř țħěșě ěxpŀǿįț đǿčųměňțș vįǻ pħį șħįňģ\němǻįŀș įň mųŀțįpŀě čǻ șěș. Bǻșěđ ǿň pǻșț ǺPȚ12 ǻčțįvįțỳ, ẅě ěxpěčț țħě țħ řěǻț ģřǿųp țǿ čǿňțįň ųě țǿ ųțįŀįżě pħįșħįňģ\nǻș ǻ mǻŀẅǻřě đěŀįvěřỳ měțħǿ đ.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nMD5 File Name Exploit\n73f493f6a2b0da23a79b50765c164e88 議程最新修正及注意事項 .docCVE-2012-\n0158\nf6fafb7c30b1114befc93f39d0698560 0824.1.docCVE-2012-\n0158\neaa6e03d9dae356481215e3a9d2914dc簡易名冊 0全國各警察機關主官至分局\n長.docCVE-2012-\n0158\n06da4eb2ab6412c0dc7f295920eb61c4 附檔.docCVE-2012-\n0158\n53baedf3765e27fb465057c48387c9b6 103年第3屆通訊錄 .docCVE-2012-\n0158\n00a95fb30be2d6271c491545f6c6a7072014 09 17 Welcome Reception for\nBob and Jason_invitation.docCVE-2012-\n0158\n4ab6bf7e6796bb930be2dd0141128d06產諮會_Y103(2) 委員會 _從東協新興國家\n崛起(0825).docCVE-2012-\n0158\n \nFįģųřě 4: İđěňțįfįěđ ěxpŀǿįț đǿčųměňțș fǿř ĦİĢĦȚİĐĚ \nẄħěň țħě fįŀě į ș ǿpěňěđ, įț đřǿpș ĦİĢĦȚİĐĚ įň țħě fǿ řm ǿf ǻň ěxěč ųțǻbŀě fįŀě ǿňțǿ țħě įňfěčțě đ șỳșțěm.\nŘİPȚİĐĚ ǻňđ ĦİĢĦȚİĐĚ đįffěř ǿň șěvěřǻŀ pǿįňț ș: ěxěčųțǻbŀě fįŀě ŀǿčǻțįǿň, įmǻģě bǻ șě ǻđđřěșș, țħě Ųșěř-Ǻģěňț\nẅįțħįň țħě Ģ ĚȚ řěqųěșțș, ǻňđ țħě fǿřmǻț ǿf țħě ŲŘ İ. Țħě ŘİPȚİĐĚ ěxpŀǿįț đǿčųměňț đřǿpș įțș ěxěčųțǻbŀě fįŀě įňțǿ\nțħě Č:\\Đǿč ųměňțș ǻňđ Șěțțįňģ ș\\{ųșěř}\\Ǻppŀįčǻțįǿň Đǻțǻ\\Ŀǿčǻțįǿň fǿŀ đěř ẅħįŀě țħě ĦİĢĦȚİĐĚ ěxpŀǿįț đǿčųměňț\nđřǿpș įțș ěxěčųțǻbŀě fįŀě įňțǿ țħě Č:\\ĐǾČŲM ĚŇȚȘ ǻňđ ȘĚȚȚİŇĢȘ\\{ųșěř}\\ĿǾČǺĿ Ș ĚȚȚİŇĢȘ\\Țěmp\\ fǿŀ đěř. Ǻŀŀ bųț\nǿňě șǻmpŀě țħǻț ẅě įđěňțįfįěđ ẅěřě ẅřįțțěň țǿ țħį ș fǿŀđěř ǻș ẅǿřđ.ěxě. Țħě ǿňě ǿ ųțŀįěř ẅǻș ẅřįțțěň ǻș\nẅįňẅǿřđ.ěxě.\nŘěșěǻřčħ įňțǿ țħį ș ĦİĢĦȚİĐĚ čǻmpǻįģň řěvěǻŀěđ ǺPȚ12 țǻřģěțěđ mųŀțįpŀě Țǻį ẅǻňěșě Ģǿvě řňměňț ǿ řģǻňįżǻțįǿňș\nběțẅěěň Ǻųģųșț 22 ǻňđ 28.\nȚĦŘĚĚBỲȚĚ Mǻŀẅǻřě Fǻmįŀỳ\nǾň Mǿň đǻỳ Ǻųģųșț 25, 2014 ẅě ǿbșěřvěđ ǻ đįffěřěňț șpěǻř pħįșħ ěmǻįŀ șěňț fřǿm ŀįŀỳẅǻňģ823@ ģmǻįŀ.čǿm țǿ ǻ\nțěčħňǿŀǿģỳ čǿmpǻňỳ ŀǿčǻțě đ įň Țǻįẅǻň. Țħįș șpěǻř pħįșħ čǿňțǻįňě đ ǻ mǻŀįčįǿ ųș Ẅǿřđ đǿčųměňț țħǻț ěxpŀǿįțě đ\nČVĚ-2012 -0158 . Țħě MĐ 5 ǿf țħě ěxpŀǿįț đǿčųměňț ẅǻș ě009b95ff7b69čbběbč 538b2č5728b11.\nȘįmįŀǻř țǿ țħě ňě ẅŀỳ đįșčǿvěřěđ ĦİĢĦȚİĐĚ șǻmpŀěș đǿčųměňțěđ ǻbǿvě, țħį ș mǻŀįčįǿ ųș đǿčųměňț đřǿppěđ ǻ\nbǻčķđǿǿř țǿ Č:\\ĐǾČŲM ĚŇȚȘ ǻňđ ȘĚȚȚİŇĢȘ\\{ųșěř}\\ĿǾČǺĿ Ș ĚȚȚİŇĢȘ\\Țěmp\\ ẅǿřđ.ěxě. Țħį ș bǻčķđǿǿř ħǻđ țħě\nfǿŀŀǿẅįňģ přǿpěřțįěș:\n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nMD5 16e627dbe730488b1c3d448bfc9096e2\nSize 75776 bytes\nComplie\nTime2014-08-25 01:22:20\nImport\nHashdcfaa2650d29ec1bd88e262d11d3236f\n \nȚħįș bǻčķđǿǿř șěňț țħě fǿŀŀǿ ẅįňģ čǻŀŀbǻčķ ț řǻffįč țǿ vį đěǿ[.]čșmčpř[.]čǿm:\nFįģųřě 5:  ȚĦŘĚĚBỲȚĚ ĢĚȚ Řěqųěșț Běǻčǿň\nȚħě ȚĦŘĚĚBỲȚĚ șpěǻř pħįșħįňģ įňčį đěňț (ẅħįŀě ňǿț ỳěț ǻțț řįbųțěđ) șħǻřěđ țħě fǿŀŀǿ ẅįňģ čħǻ řǻčțěřįșțįčș ẅįțħ țħě\nǻbǿvě ĦİĢĦȚİĐĚ čǻmpǻįģň ǻțț řįbųțěđ țǿ ǺPȚ 12:\nȚħě ȚĦŘĚĚBỲȚĚ bǻčķđǿǿř ẅǻș čǿmpįŀě đ țẅǿ đǻỳș ǻfțěř țħě ĦİĢĦȚİĐĚ bǻčķđǿǿřș.\nBǿțħ țħě Ț ĦŘĚĚBỲȚĚ ǻňđ ĦİĢĦȚİĐĚ bǻčķđǿǿřș ẅěřě ųșěđ įň ǻțțǻčķ ș țǻřģěțįňģ ǿ řģǻňįżǻțįǿňș įň Țǻįẅǻň.\nBǿțħ țħě Ț ĦŘĚĚBỲȚĚ ǻňđ ĦİĢĦȚİĐĚ bǻčķđǿǿřș ẅěřě ẅřįțțěň țǿ țħě șǻmě fįŀěpǻțħ ǿf Č:\\ĐǾČŲM ĚŇȚȘ ǻňđ\nȘĚȚȚİŇĢȘ\\{ųșěř}\\ĿǾČǺĿ Ș ĚȚȚİŇĢȘ\\Țěmp\\ ẅǿřđ.ěxě.\nǺPȚ12 ħǻș přěvįǿųșŀỳ ųșěđ țħě ȚĦŘĚĚBỲȚĚ bǻčķđǿǿř.\nẄǺȚĚŘȘPǾŲȚ Mǻŀ ẅǻřě Fǻmįŀỳ\nǾň Ǻųģųșț 25, 2014, ẅě ǿbșěřvěđ ǻňǿțħě ř řǿųňđ ǿf șpěǻř pħįșħįňģ ěmǻįŀ ș țǻřģěțįňģ ǻ ħįģħ-țěčħňǿŀǿģỳ čǿmpǻňỳ\nįň Jǻpǻň. Ǻțțǻčħě đ țǿ țħįș ěmǻįŀ ẅǻș ǻňǿțħě ř mǻŀįčįǿ ųș đǿčųměňț țħǻț ẅǻș đěșįģňěđ țǿ ěxpŀǿįț ČV Ě-2012 -0158 .\nȚħįș mǻŀįčįǿ ųș Ẅǿřđ đǿčųměňț ħǻ đ ǻň MĐ 5 ǿf 499běč15ǻč83f2č8998 f0391 7b63652 ě ǻňđ đřǿppěđ ǻ bǻčķ đǿǿř\nțǿ Č:\\ĐǾČŲM ĚŇȚȘ ǻňđ ȘĚȚȚİŇĢȘ\\{ųșěř}\\ĿǾČǺĿ Ș ĚȚȚİŇĢȘ\\Țěmp\\ ẅǿřđ.ěxě. Țħě bǻčķ đǿǿř ħǻđ țħě fǿŀŀǿ ẅįňģ\npřǿpěřțįěș:\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \nMD5 f9cfda6062a8ac9e332186a7ec0e706a\nSize 49152 bytes\nComplie\nTime2014-08-25 02:10:11\nImport\nHash864cd776c24a3c653fd89899ca32fe0b\n \nȚħě bǻčķ đǿǿř čǿňňěčț ș țǿ ǻ čǿmmǻň đ ǻňđ čǿňțřǿŀ șěřvěř ǻț įčč[.]įģňǿ řěŀįșț[.]čǿm.\nȘįmįŀǻř țǿ ŘİPȚİĐĚ ǻňđ ĦİĢĦȚİĐĚ, țħě ẄǺȚ ĚŘȘPǾŲȚ bǻčķ đǿǿř įș ǻň ĦȚȚP-bǻ șěđ bǻčķđǿǿř țħǻț čǿmm ųňįčǻțěș\nẅįțħ įțș Č2 șěřvěř.\n \n \n \n \n \n \n \n \n \n \n \n \n \nGET /<string>/<5 digit number>/<4 character string>.php?<first 3\ncharacters of last string>_id=<43 character string>= HTTP/1.1\n \nǺččěpț: įmǻģě/jpěģ, ǻppŀįčǻțįǿň/x-m ș-ǻppŀįčǻțįǿň,\nįmǻģě/ģįf, ǻppŀįčǻțįǿň/xǻmŀ+xmŀ, įmǻģě/pjpěģ,\nǻppŀįčǻțįǿň/x-m ș-xbǻp, */*\nŲșěř-Ǻģěňț: Mǿ żįŀŀǻ/4.0 (čǿmpǻțįbŀě; MȘ İĚ 8.0; Ẅįňđǿẅș\nŇȚ 6.1; Țřįđěňț/4.0; ȘĿČČ2; .ŇĚȚ ČĿŘ 2.0.50727; .ŇĚȚ ČĿŘ\n3.5.30729; .ŇĚȚ ČĿŘ 3.0.30729; .ŇĚȚ4.0Č; .ŇĚȚ4.0Ě)\nĦǿșț: <Č2 Ŀǿčǻțįǿň>\nČǻčħě-Čǿňț řǿŀ: ňǿ-čǻčħě\n \nFįģųřě 6: Șǻmpŀě Ģ ĚȚ řěqųěșț fǿř ẄǺȚĚŘȘPǾŲȚ bǻčķ đǿǿř\nǺŀțħǿųģħ țħěřě ǻřě ňǿ čųřřěňț įňfřǻșțřųčțųřě țįěș țǿ ŀįňķ țħį ș bǻčķđǿǿř țǿ ǺPȚ 12, țħěřě ǻřě șěvěřǻŀ đǻțǻ pǿįňț ș\nțħǻț șħǿẅ ǻ pǿșșįbŀě țįě țǿ țħě șǻmě ǻčțǿ řș:\nȘǻmě įňįțįǻŀ đěŀįvěřỳ měțħǿ đ (șpěǻř pħįșħįňģ ěmǻįŀ) ẅįțħ ǻ Mįč řǿșǿfț Ẅǿřđ Đǿčųměňț ěxpŀǿįțįňģ ČV Ě-2012 -\n0158 .\n \nȚħě șǻmě “Țřǻň Đųỳ Ŀįňħ” Mįč řǿșǿfț Ẅǿřđ Ěxpŀǿįț Ķįț ẅǻș ųșěđ įň đěŀįvěřỳ ǿf țħįș bǻčķđǿǿř.\n \nȘįmįŀǻř Țǻřģěțș ẅěřě ǿbșěřvěđ ẅħěřě țħě țħ řěǻț ǻčțǿ řș ųțįŀįżěđ țħįș bǻčķđǿǿř.\n \nJǻpǻňě șě Țěčħ Čǿmpǻňỳ\nȚǻįẅǻňěșě Ģǿvě řňměňț Ǿ řģǻňįżǻțįǿňș\nǾřģǻňįżǻțįǿňș įň țħě Ǻ șįǻ-Pǻčįfįč Řěģįǿň țħǻț ǻ řě ǿf İňțěřěșț țǿ Čħįňǻ\n \nȚħě ẄǺȚ ĚŘȘPǾŲȚ bǻčķ đǿǿř ẅǻș ẅřįțțěň țǿ țħě șǻmě fįŀě pǻțħ ǻ ș țħě ĦİĢĦȚİĐĚ bǻčķđǿǿřș:\n \nČ:\\ĐǾČŲM ĚŇȚȘ ǻňđ ȘĚȚȚİŇĢȘ\\{ųșěř}\\ĿǾČǺĿ Ș ĚȚȚİŇĢȘ\\Țěmp\\ ẅǿřđ.ěxě\nČ:\\ĐǾČŲM ĚŇȚȘ ǻňđ ȘĚȚȚİŇĢȘ\\{ųșěř}\\ĿǾČǺĿ Ș ĚȚȚİŇĢȘ\\Țěmp\\ ẅįňẅǿřđ.ěxě\n \nẄǺȚĚŘȘPǾŲȚ ẅǻș čǿmpįŀě đ ẅįțħįň țẅǿ đǻỳș ǿf țħě ŀǻ șț ĦİĢĦȚİĐĚ bǻčķđǿǿř ǻňđ ǿň țħě șǻmě đǻỳ ǻș\nțħě ȚĦŘĚĚBỲȚĚ bǻčķđǿǿř.\nǺPȚ12 čŀǿșěŀỳ mǿňįțǿ řș ǿňŀįňě mě đįǻ řěŀǻțěđ țǿ įțș țǿǿŀș ǻňđ ǿpěřǻțįǿňș ǻňđ řěǻčțș ẅħěň įțș țǿǿŀș ǻřě\npųbŀįčŀỳ đįșčŀǿșěđ.\nǺPȚ12 ħǻș țħě ǻbįŀįțỳ țǿ ǻ đǻpț qųįčķŀỳ țǿ p ųbŀįč ěxpǿ șųřěș ẅįțħ ňěẅ țǿǿŀș, țǻčțįčș, ǻňđ přǿčěđųřěș\n(ȚȚPș).\nPųbŀįč đįșčŀǿșųřěș mǻỳ řěșųŀț įň ǻň įmmě đįǻțě čħǻňģě įň ǺPȚ 12’ș țǿǿŀș. Țħěșě čħǻňģě ș mǻỳ bě\nțěmpǿřǻřỳ ǻňđ FįřěĚỳě běŀįěvě ș țħěỳ ǻřě ǻįměđ ǻț đěčřěǻșįňģ đěțěčțįǿň ǿf țħěį ř țǿǿŀș ųňțįŀ ǻ mǿ řě\npěřmǻňěňț ǻň đ ěffěčțįvě ȚȚP čħǻňģě čǻň bě įmpŀěměňțě đ (ě.ģ., ẄǺȚ ĚŘȘPǾŲȚ).\nǺŀțħǿųģħ țħěșě pǿįňțș đǿ ňǿț đěfįňįțįvěŀỳ țįě ẄǺȚ ĚŘȘPǾŲȚ țǿ ǺPȚ 12, țħěỳ đǿ įňđįčǻțě ǻ pǿ șșįbŀě\nčǿňňěčțįǿň běț ẅěěň țħě ẄǺȚ ĚŘȘPǾŲȚ čǻmpǻįģň, țħě Ț ĦŘĚĚBỲȚĚ čǻmpǻįģň, ǻň đ țħě ĦİĢĦȚİĐĚ čǻmpǻįģň\nǻțțřįbųțěđ țǿ ǺPȚ 12.\nČǿňčŀųșįǿň\nFįřěĚỳě běŀįěvě ș țħě čħǻňģě f řǿm ŘİPȚİĐĚ țǿ ĦİĢĦȚİĐĚ řěpřěșěňțș ǻ țěmpǿ řǻřỳ țǿǿŀ șħįfț țǿ đěčřěǻșě\nmǻŀẅǻřě đěțěčțįǿň ẅħįŀě ǺPȚ 12 đěvěŀǿpě đ ǻ čǿmpŀěțěŀỳ ňě ẅ mǻŀẅǻřě țǿǿŀșěț. Țħěșě đěvěŀǿpměňț ěffǿ řțș\nmǻỳ ħǻvě řěșųŀțěđ įň țħě ěmě řģěňčě ǿf țħě ẄǺȚ ĚŘȘPǾŲȚ bǻčķ đǿǿř.\n  PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚ\nFįģųřě 7: Čǿmpįŀě đǻțěș fǿř ǻŀŀ țħřěě mǻŀẅǻřě fǻmįŀįě ș \nǺPȚ12’ș ǻđǻpțǻțįǿň ș țǿ pųbŀįč đįșčŀǿșųřěș ŀěǻđ FįřěĚỳě țǿ mǻķě șěvěřǻŀ čǿňčŀ ųșįǿňș ǻbǿųț țħįș țħřěǻț ģřǿųp:\nȚħǿųģħ pųbŀįč đįșčŀǿșųřěș řěșųŀțěđ įň ǺPȚ 12 ǻđǻpțǻțįǿň ș, FįřěĚỳě ǿbșěřvěđ ǿňŀỳ ǻ b řįěf pǻųșě įň ǺPȚ 12\nǻčțįvįțỳ běfǿ řě țħě țħ řěǻț ǻčțǿ řș řěțųřňěđ țǿ ňǿřmǻŀ ǻčțįvįțỳ ŀěvěŀ ș. Șįmįŀǻřŀỳ, țħě p ųbŀįč đįșčŀǿșųřě ǿf ǺPȚ 12’ș\nįňțřųșįǿň ǻț țħě Ňěẅ Ỳǿřķ Țįměș ǻŀșǿ ŀěđ țǿ ǿňŀỳ ǻ b řįěf pǻųșě įň țħě țħ řěǻț ģřǿųp’ș ǻčțįvįțỳ ǻň đ įmměđįǻțě\nčħǻňģě ș įň ȚȚPș. Țħě pǻ ųșě ǻňđ řěțǿǿŀįňģ bỳ ǺPȚ 12 ẅǻș čǿvěřěđ įň țħě Mǻňđįǻňț 2014 M-Țřěňđș řěpǿřț.\nČųřřěňțŀỳ, ǺPȚ 12 čǿňțįňųěș țǿ țǻřģěț ǿřģǻňįżǻțįǿňș ǻňđ čǿňđųčț čỳbě ř ǿpěřǻțįǿňș ųșįňģ įțș ňěẅ țǿǿŀș. Mǿșț\nřěčěňțŀỳ, Fį řěĚỳě ǿbșěřvěđ ĦİĢĦȚİĐĚ ǻț mųŀțįpŀě Țǻį ẅǻň-bǻșěđ ǿřģǻňįżǻțįǿňș ǻňđ țħě șųșpěčțěđ ǺPȚ12\nẄǺȚĚŘȘPǾŲȚ bǻčķ đǿǿř ǻț ǻ Jǻpǻň-bǻ șěđ ěŀěčțřǿňįčș čǿmpǻňỳ. Ẅě ěxpěčț țħǻț ǺPȚ 12 ẅįŀŀ čǿňțįň ųě țħěįř\nțřěňđ ǻňđ ěvǿŀvě ǻň đ čħǻňģě įț ș țǻčțįčș țǿ șțǻỳ ǻħěǻ đ ǿf ňěțẅǿřķ đěfěňđěřș.\nŇǿțě: İǾČș fǿř țħįș čǻmpǻįģň čǻň bě fǿ ųňđ ħěřě.\n \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě Ěňģŀįșħ\n "
}