{
    "title": "dragonfly_ western energy sector targeted by sophisticated attack group _ symantec blogs",
    "text": "Symantec's Enterprise Security business will now operate as the Symantec Enterprise division of Broadcom. Click for details.\n\nCritical Attack\nDiscovery and\nIntelligence Team\nSymantec\n\n\n SUBSCRIBE\nDragonfly: Western energy sector\ntargeted by sophisticated attack group\nResurgence in energy sector attacks, with the potential for sabotage, linked to re-\nemergence of Dragonfly cyber espionage group.\nThe energy sector in Europe and North America is being targeted by a new wave of cyber attacks  that could provide\nattackers with the means to severely disrupt affected operations. The group behind these attacks is known as Dragonfly.\nThe group has been in operation since at least 2011 but has re-emerged over the past two years from a quiet\nperiod following exposure by Symantec  and a number of other researchers in 2014. This “Dragonfly 2.0” campaign, which\nappears to have begun in late 2015, shares tactics and tools used in earlier campaigns by the group.\nThe energy sector has become an area of increased interest to cyber attackers over the past two years. Most\nnotably, disruptions to Ukraine’s power system  in 2015 and 2016 were attributed to a cyber attack and led to power\noutages affecting hundreds of thousands of people. In recent months, there have also been media reports of attempted\nattacks on the electricity grids  in some European countries, as well as reports of companies that manage nuclear\nfacilities in the U.S. being compromised  by hackers.\nThe Dragonfly group appears to be interested in both learning how energy facilities operate and also gaining access to\noperational systems themselves, to the extent that the group now potentially has the ability to sabotage or gain control\nof these systems should it decide to do so. Symantec customers are protected against the activities of the Dragonfly\ngroup.\nFigure 1. An outline of the Dragonfly group's activities in its most recent campaign\nDragonfly 2.0\nSymantec has evidence indicating that the Dragonfly 2.0 campaign has been underway since at least December 2015\nand has identified a distinct increase in activity in 2017.\nSymantec has strong indications of attacker activity in organizations in the U.S., Turkey, and Switzerland, with traces of\nactivity in organizations outside of these countries. The U.S. and Turkey were also among the countries targeted by\nDragonfly in its earlier campaign, though the focus on organizations in Turkey does appear to have increased\ndramatically in this more recent campaign.\nAs it did in its prior campaign between 2011 and 2014, Dragonfly 2.0 uses a variety of infection vectors in an effort to\ngain access to a victim’s network, including malicious emails, watering hole attacks, and Trojanized software.\nThe earliest activity identified by Symantec in this renewed campaign was a malicious email campaign that sent emails\ndisguised as an invitation to a New Year’s Eve party to targets in the energy sector in December 2015.\nThe group conducted further targeted malicious email campaigns during 2016 and into 2017. The emails contained very\nspecific content related to the energy sector, as well as some related to general business concerns. Once opened, the\nattached malicious document would attempt to leak victims’ network credentials to a server outside of the targeted\norganization.\nIn July, Cisco blogged about email-based attacks targeting the energy sector using a toolkit called Phishery.  Some of the\nemails sent in 2017 that were observed by Symantec were also using the Phishery toolkit ( Trojan.Phisherly ), to steal\nvictims’ credentials via a template injection attack. This toolkit became generally available on GitHub in late 2016,\nAs well as sending malicious emails, the attackers also used watering hole attacks to harvest network credentials, by\ncompromising websites that were likely to be visited by those involved in the energy sector.\nThe stolen credentials were then used in follow-up attacks against the target organizations. In one instance, after a\nvictim visited one of the compromised servers, Backdoor.Goodor  was installed on their machine via PowerShell 11 days\nlater. Backdoor.Goodor provides the attackers with remote access to the victim’s machine.\nIn 2014 , Symantec observed the Dragonfly group compromise legitimate software in order to deliver malware to victims,\na practice also employed in the earlier 2011 campaigns. In the 2016 and 2017 campaigns the group is using the evasion\nframework Shellter in order to develop Trojanized applications. In particular, Backdoor.Dorshel  was delivered as a\ntrojanized version of standard Windows applications.\nSymantec also has evidence to suggest that files masquerading as Flash updates may be used to install malicious\nbackdoors onto target networks—perhaps by using social engineering to convince a victim they needed to download an\nupdate for their Flash player. Shortly after visiting specific URLs, a file named “install_flash_player.exe” was seen on\nvictim computers, followed shortly by the Trojan.Karagany.B  backdoor.\nTypically, the attackers will install one or two backdoors onto victim computers to give them remote access and allow\nthem to install additional tools if necessary. Goodor, Karagany.B, and Dorshel are examples of backdoors used, along\nwith Trojan.Heriplor .\n\"Western energy sector at risk from ongoing cyber attacks, with potential for sabotage\n#dragonfly\"\nCLICK TO TWEET\nStrong links with earlier campaigns\nThere are a number of indicators linking recent activity with earlier Dragonfly campaigns. In particular, the Heriplor and\nKaragany Trojans used in Dragonfly 2.0 were both also used in the earlier Dragonfly campaigns between 2011 and 2014.\nTrojan.Heriplor is a backdoor that appears to be exclusively used by Dragonfly, and is one of the strongest indications\nthat the group that targeted the western energy sector between 2011 and 2014 is the same group that is behind the\nmore recent attacks. This custom malware is not available on the black market, and has not been observed being used\nby any other known attack groups. It has only ever been seen being used in attacks against targets in the energy sector.\nTrojan.Karagany.B is an evolution of Trojan.Karagany , which was previously used by Dragonfly, and there are similarities\nin the commands, encryption, and code routines used by the two Trojans. Trojan.Karagny.B doesn’t appear to be widely\navailable, and has been consistently observed being used in attacks against the energy sector. However, the earlier\nTrojan.Karagany was leaked on underground markets, so its use by Dragonfly is not necessarily exclusive.\nFigure 2. Links between current and earlier Dragonfly cyber attack campaigns\nPotential for sabotage\nSabotage attacks are typically preceded by an intelligence-gathering phase where attackers collect information about\ntarget networks and systems and acquire credentials that will be used in later campaigns. The most notable examples of\nthis are Stuxnet and Shamoon, where previously stolen credentials were subsequently used to administer their\ndestructive payloads.\nThe original Dragonfly campaigns now appear to have been a more exploratory phase where the attackers were simply\ntrying to gain access to the networks of targeted organizations. The Dragonfly 2.0 campaigns show how the attackers\nmay be entering into a new phase, with recent campaigns potentially providing them with access to operational systems,\naccess that could be used for more disruptive purposes in future.\nThe most concerning evidence of this is in their use of screen captures. In one particular instance the attackers used a\nclear format for naming the screen capture files, [machine description and location].[organization name]. The string\n“cntrl” (control) is used in many of the machine descriptions, possibly indicating that these machines have access to\noperational systems. \n\"Numerous organizations breached in six-year campaign against the energy sector\n#dragonfly\"\nCLICK TO TWEET\nClues or false flags?\nWhile Symantec cannot definitively determine Dragonfly’s origins, this is clearly an accomplished attack group. It is\ncapable of compromising targeted organizations through a variety of methods; can steal credentials to traverse targeted\nnetworks; and has a range of malware tools available to it, some of which appear to have been custom developed.\nDragonfly is a highly focused group, carrying out targeted attacks on energy sector targets since at least 2011, with a\nrenewed ramping up of activity observed in the last year.\nSome of the group’s activity appears to be aimed at making it more difficult to determine who precisely is behind it:\nThe attackers used more generally available malware and “living off the land” tools, such as administration tools like\nPowerShell, PsExec, and Bitsadmin, which may be part of a strategy to make attribution more difficult. The Phishery\ntoolkit became available on Github in 2016, and a tool used by the group—Screenutil—also appears to use some\ncode from CodeProject.\nThe attackers also did not use any zero days. As with the group’s use of publicly available tools, this could be an\nattempt to deliberately thwart attribution, or it could indicate a lack of resources.\nSome code strings in the malware were in Russian. However, some were also in French, which indicates that one of\nthese languages may be a false flag.\nConflicting evidence and what appear to be attempts at misattribution make it difficult to definitively state where this\nattack group is based or who is behind it.\nWhat is clear is that Dragonfly is a highly experienced threat actor, capable of compromising numerous organizations,\nstealing information, and gaining access to key systems. What it plans to do with all this intelligence has yet to become\nclear, but its capabilities do extend to materially disrupting targeted organizations should it choose to do so.\nProtection\nSymantec customers are protected against Dragonfly activity, Symantec has also made efforts to notify identified\ntargets of recent Dragonfly activity.\nSymantec has the following specific detections in place for the threats called out in this blog:\nTrojan.Phisherly\nBackdoor.Goodor\nTrojan.Karagany.B\nBackdoor.Dorshel\nTrojan.Heriplor\nTrojan.Listrix\nTrojan.Karagany\nSymantec has also developed a list of Indicators of Compromise to assist in identifying Dragonfly activity:\nFigure.3 Indicators of Compromise to assist in identifying Dragonfly activity\nCustomers of the DeepSight Intelligence Managed Adversary and Threat Intelligence (MATI) service have previously\nreceived reporting on the Dragonfly 2.0 group, which included methods of detecting and thwarting the activities of this\nadversary.\nBest Practices\nDragonfly relies heavily on stolen credentials to compromise a network. Important passwords, such as those with\nhigh privileges, should be at least 8-10 characters long (and preferably longer) and include a mixture of letters and\nnumbers. Encourage users to avoid reusing the same passwords on multiple websites and sharing passwords with\nothers should be forbidden. Delete unused credentials and profiles and limit the number of administrative-level\nprofiles created. Employ two-factor authentication (such as Symantec VIP ) to provide an additional layer of security,\npreventing any stolen credentials from being used by attackers.\nEmphasize multiple, overlapping, and mutually supportive defensive systems to guard against single point failures in\nany specific technology or protection method. This should include the deployment of regularly updated firewalls as\nwell as gateway antivirus, intrusion detection or protection systems (IPS), website vulnerability with malware\nprotection, and web security gateway solutions throughout the network.\nImplement and enforce a security policy whereby any sensitive data is encrypted at rest and in transit. Ensure that\ncustomer data is encrypted as well. This can help mitigate the damage of potential data leaks from within an\norganization.\nImplement SMB egress traffic filtering on perimeter devices to prevent SMB traffic leaving your network onto the\ninternet.\nEducate employees on the dangers posed by spear-phishing emails, including exercising caution around emails from\nunfamiliar sources and opening attachments that haven’t been solicited. A full protection stack helps to defend\nagainst emailed threats, including Symantec Email Security.cloud , which can block email-borne threats,\nand Symantec Endpoint Protection , which can block malware on the endpoint. Symantec Messaging\nGateway’s  Disarm technology can also protect computers from threats by removing malicious content from\nattached documents before they even reach the user.\nUnderstanding the tools, techniques, and procedures (TTP) of adversaries through services like  DeepSight\nAdversary Intelligence  fuels effective defense from advanced adversaries like Dragonfly 2.0. Beyond technical\nunderstanding of the group, strategic intelligence that informs the motivation, capability, and likely next moves of\nthe adversaries ensures more timely and effective decisions in proactively safeguarding your environment from\nthese threats.SHAREPOSTED: 20 OCT, 2017 8 MIN READ THREAT INTELLIGENCE\nAbout the Author\nBlogs Threat Intelligence/ Menu\n "
}