{
    "title": "duuzer_ data stealer trojan targets south korean organizationssecurity affairs",
    "text": "CERT France - Pysa ransomware is targeting local governments   MUST READ\nCopyright 2015 Security Affairs by Pierluigi Paganini All Right Reserved. Back to top \nSponsored Content\nDigging the Deep Web: Exploring the dark side of the\nweb\nYoroi Blog\nYoroi Blog\nSponsored Content\nSponsored Content\nSponsored Content\nSponsored ContentDuuzer, a data stealer Trojan targets South Korean\norganizations\nOctober 27, 2015  By Pierluigi Paganini\nSHARE ON             \nPierluigi Paganini\nPierluigi Paganini is member of the ENISA (European Union Agency for Network\nand Information Security) Threat Landscape Stakeholder Group and Cyber G7\nGroup, he is also a Security Evangelist, Security Analyst and Freelance Writer.\nEditor-in-Chief at \"Cyber Defense Magazine\", Pierluigi is a cyber security expert\nwith over 20 years experience in the field, he is Certified Ethical Hacker at EC\nCouncil in London. The passion for writing and a strong belief that security is\nfounded on sharing and awareness led Pierluigi to find the security blog\n\"Security Affairs\" recently named a Top National Security Resource for US.\nPierluigi is a member of the \"The Hacker News\" team and he is a writer for some\nmajor publications in the field such as Cyber War Zone, ICTTF, Infosec Island,\nInfosec Institute, The Hacker News Magazine and for many other Security\nmagazines. Author of the Books \"The Deep Dark Web\" and “Digital Virtual\nCurrency and Bitcoin”.\nIs APT27 Abusing COVID-19 To Attack\nPeople ?!\nMarch 19, 2020  By Pierluigi PaganiniCoronavirus news used by Emotet\nand Trickbot to evade detection\nMarch 19, 2020  By Pierluigi PaganiniResearchers at Symantec uncovered bad actors that have\nbeen using a backdoor Trojan dubbed Duuzer to target\norganizations in South Korea and elsewhere.\nAccording to Symantec, threat actors have been using a data stealer Trojan dubbed Duuzer to target\norganizations mainly located in South Korea. The bad actors conducted targeted attacks against\norganizations in the manufacturing industry, they served Duuzer backdoor to gain complete control\nover infected machines.\nDuuzer allows attackers to collect system information, access local file system, change the time\nattributes of files, upload and download files, and of course, execute commands.\nAccording to the experts at Symantec, the Backdoor.Duuzer  has been around since at least July 20\n2015, the attackers are relying on spear phishing  messages and watering hole attacks to spread it.\n“Duuzer  is an ongoing threat that is being delivered in targeted attacks. While the exact distribution method is\nunknown, it’s likely that the malware is spreading through spear-phishing emails or watering-hole attacks. ” states\na blog post  published by Symantec. \nThe malware researchers at Symantec collected evidence that bad actors behind the Duuzer campaign\nare also spreading two other malware, dubbed W32.Brambul  and Backdoor.Joanap . The two malware\nwere also used to target  organizations in South Korea and serve extra payloads on the compromised\nmachines.\nAccording to Symantec, Duuzer is linked to both malware, every computer infected by Brambul was\nalso infected by Duuzer and shared the same command and control (C&C) servers.\nDuuzer is able to infect both 32-bit and 64-bit systems, it implements several methods to avoid\ndetection, for example, it is able to checks for the presence of virtual machines and also rename the\nmalware after an existing legitimate software runs on startup.\n“The Duuzer  attackers have been observed trying to disguise their malware on an infected computer. They do\nthis by identifying what software is installed and runs on startup, then renaming their malware to a similar title of\nan existing, legitimate program.” continues the analysis.\nThe researchers speculate the threat actors behind the Duuzer campaign have a significant knowledge\nabout malware detection techniques.\n“The attackers appear to be manually running commands through the back door  on affected computers. In one\ncase, we observed the attackers creating a camouflaged version of their malware, and in another, we saw them\nattempting to, but failing to deactivate Symantec Endpoint Protection (SEP),” Symantec said in a blog post.\nThe experts provided further information on both Brambul and Joanap threats, Brambul is a worm\nthat spreads from one computer to another by relying on brute-force attacks aimed at the Server\nMessage Block (SMB) protocol, once infected the host it creates a network share to provide the\nattackers access to the system drive.\n“The Brambul worm uses brute-force attacks to propagate. The threat connects to random IP addresses through\nthe Server Message Block (SMB) protocol using a hardcoded list of user names and passwords. The passwords are\nquite common or easy to guess, such as “123123”, “abc123”, “computer,” “iloveyou,” ”login”, and “password”.\nstates the post. “After Brambul compromises a computer, it creates a net share to give attackers access to the\nsystem drive (usually the C: drive). It sends a message with the computer’s details and login credentials to a\nhardcoded email address. Brambul’s variants may be able to drop additional threats.”\nJoanap is a classic backdoor to gain control over the infected system.\nIn order to prevent Duuzer infections Symantec recommends the following best practices:\nChange default credentials\nUse string passwords.\nKeep the operating system and software updated\nDon’t open suspicious emails.\nKeep security software up-to-date with the latest definitions\nPierluigi Paganini\n(Security Affairs  – Duuzer , malware)\n Duuzer malware South Korea spear phishing Symantec Trojan watering hole\nYOU MIGHT ALSO LIKEShare this...\nPREVIOUS ARTICLE\nThe cyber labor market in Israel, the cyber\nguild\n NEXT ARTICLE\n15-Year-Old has been identified and\narrested for TalkTalk Attack\nHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  \nTerrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact meHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  Terrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\nAlways Enabled Necessary \n "
}