{
    "title": "emissary panda targets middle east governments with webshells on sharepoint servers",
    "text": "Search\nNewsletter\nSince August 28th 2018 all our\nNewsletters are\nactive. Subscribe!  Every Saturday you\nwill receive a weekly report of\neverything we have published.\nRecent Posts\nCyber Security, WordPress adds\nauto-update for themes and plugins\nSyria, Russia-Turkey patrols in Idlib\nblocked by population and militias\nCoronavirus, boom of Fake News\nvia instant messenger\nSyria: Kurds prepare for\nCoronavirus, which mainly damages\nIsis\nCyber Security, Microsoft patches\nthe Windows 10 “SMBGhost”\nSyria, Isis returns to its origins and target population: double attack in\nRaqqaIsis is hunted in Iraq and Syria with its own tactics \nThe Newsletter is sent on Saturday morning and contains news from the current\nweek. You can select the one with all the contents, or by category. To stay up to\ndate, however, we recommend that you follow the site every day or our pages on\nsocial networks.Iscriviti ora / Subscribe\nNowDefence and Security  info@difesaesicurezza.com \nEmissary Panda targets Middle East governments with webshells on Sharepoint servers\nHome  » Emissary Panda targets Middle East governments with webshells on Sharepoint servers\n3 June 2019 Francesco Bussoletti Cyber , Defence and Security\nSyria, an entire village in Deir\nEzzor reacts to the presence of\nIsis in the area\nThe inhabitants of al-Nimiliyah\nattacked al-Naitel, which housedCyber Espionage, Twitter\nconfirms attacks to match\nusernames to phone numbers\nThe social media platform: State-\nsponsored actors used a largeMandiant, How US Government\nAgencies are Facing Cyber\nSecurity Challenges\nThey use 4 strategies: Proactive\ncyber threat hunting, Increased useEmissary Panda targets Middle East governments with\nwebshells on Sharepoint servers\nPalo Alto’s Unit 42: Emissary Panda Chinese APT attacked Middle East\ngovernments with webshells on sharepoint servers to upload a variety of tools\nEmissary Panda Chinese APT is attacking Middle East government sharepoint servers. It has been\ndiscovered by Palo Alto’s Unit 42 cyber security experts . According to the researchers, the threat group\n(AKA APT27, TG-3390, Bronze Union, Lucky Mouse) is installing webshells on Sharepoint servers to\ncompromise Government Organizations of two different countries in the region. It exploits a recently\npatched vulnerability in Microsoft SharePoint, which is a remote code execution vulnerability used to\ncompromise the server and eventually install a webshell. The actors uploaded a variety of tools that\nthey used to perform additional activities on the compromised network, such as dumping credentials,\n as well as locating and pivoting to additional systems on the network. Of particular note is their use of\ntools to identify systems vulnerable to CVE-2017-0144, the same vulnerability exploited by EternalBlue\nthat is best known for its use in the WannaCry attacks of 2017.\nThe cyber security experts: The threat actor upload 24 unique executables,\nfrom Mimikatz to HyperBro, commonly associated to Emissary Panda\nEmissary Panda is active since 2010, targeting organizations worldwide, financial services firms, and\nnational data centers. The group is involved in cyber espionage aimed at new generation weapons and\nin surveillance activities on dissidents and other civilian groups. According to Palo Alto, the webshell\nactivity agains Middle East governments took place across three SharePoint servers hosted by two\ndifferent organizations between April 1 and 16, 2019, where actors uploaded a total of 24 unique\nexecutables. They range from legitimate applications such as cURL to post-exploitation tools such as\nMimikatz. Emissary Panda also uploaded tools to scan for and exploit potential vulnerabilities in the\nnetwork, such as the well-known SMB vulnerability patched in MS17-010 commonly exploited by\nEternalBlue to move laterally to other systems on the network. Cyber security expers also observed the\nchinese actors uploading custom backdoors such as HyperBro, commonly associated with the APT.\nAPT APT27 Bronze Union cyber espionage cyber security cyber warfare cybercrime\nEmissary Panda HyperBro infosec Lucky Mouse Middle East Mimikatz Palo Alto\nSharepoint Server state sponsored hackers TG-3390 Unit 42 webshells\naFacebook\n dTwitter\n kLinkedIn\n JWhatsApp\n \"Telegram\n *Facebook Messenger\nRelated Posts\nCookie and Privacy Policy Copyright Difesa e Sicurezza  - All Rights Reserved\nDefence Cyber Politics Who we are\n English Questo sito utilizza i cookie: Leggi di più. Va bene, grazie\n "
}