{
    "title": "emissary panda apt group hit government organizations in middle eastsecurity affairs",
    "text": "Adobe releases out-of-band patches for critical issues in Acrobat Reader,   MUST READ\nCopyright 2015 Security Affairs by Pierluigi Paganini All Right Reserved. Back to top \nHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  \nLaws and regulations  Malware  Mobile  Reports  Security  Social Networks  Terrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\nHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  \nTerrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\nSponsored Content\nDigging the Deep Web: Exploring the dark side of the\nweb\nYoroi Blog\nYoroi Blog\nSponsored Content\nSponsored Content\nSponsored Content\nSponsored ContentEmissary Panda APT group hit Government\nOrganizations in the Middle East\nMay 30, 2019  By Pierluigi Paganini\nSHARE ON             \nPierluigi Paganini\nPierluigi Paganini is member of the ENISA (European Union Agency for Network\nand Information Security) Threat Landscape Stakeholder Group and Cyber G7\nGroup, he is also a Security Evangelist, Security Analyst and Freelance Writer.\nEditor-in-Chief at \"Cyber Defense Magazine\", Pierluigi is a cyber security expert\nwith over 20 years experience in the field, he is Certified Ethical Hacker at EC\nCouncil in London. The passion for writing and a strong belief that security is\nfounded on sharing and awareness led Pierluigi to find the security blog\n\"Security Affairs\" recently named a Top National Security Resource for US.\nPierluigi is a member of the \"The Hacker News\" team and he is a writer for some\nmajor publications in the field such as Cyber War Zone, ICTTF, Infosec Island,\nInfosec Institute, The Hacker News Magazine and for many other Security\nmagazines. Author of the Books \"The Deep Dark Web\" and “Digital Virtual\nCurrency and Bitcoin”.\nThousands of Coronavirus-related\nmalicious domains are being created\nevery day\nMarch 18, 2020  By Pierluigi PaganiniVMware fixes high severity privilege\nescalation and DoS in its products\nMarch 18, 2020  By Pierluigi PaganiniChinese Cyber-Spies Target Government Organizations in\nMiddle East\nChinese APT group Emissary Panda has been targeting\ngovernment organizations in two different countries in\nthe Middle East.\nExperts at Palo Alto Networks reported that the Chinese APT group Emissary Panda  (aka APT27 , TG-\n3390 , Bronze Union , and Lucky Mouse ) has been targeting government organizations in two different\ncountries in the Middle East.\nThe Emissary Panda APT group has been active since 2010, targeted organizations worldwide,\nincluding U.S. defense contractors , financial services firms, and a national data center in Central Asia .\nThe group was involved in cyber espionage campaigns aimed at new generation weapons and in\nsurveillance activities on dissidents and other civilian groups. \nThe cyber espionage group leverage both readily available tools and custom malware in their\noperations, many tools are available for years, but in recent attacks, their code was updated.\nIn April 2019, the group targeted organizations of two different countries in the Middle East. Hackers\nhit webservers to install of webshells on SharePoint servers, threat actors leveraged the CVE-2019-\n0604  vulnerability to compromise SharePoint servers. \nOnce compromised the network, attackers will upload a variety of tools to perform additional\nactivities, including dumping credentials, and locating and pivoting to additional systems on the\nnetwork.\nExperts pointed out that attackers used tools to scan the network for systems vulnerable to CVE-\n2017-0144 , the flaw exploited by the NSA-linked EternalBlue  exploit.\nThe campaign appears related to attacks exploiting CVE-2019-0604  reported by the Saudi Arabian\nNational Cyber Security Center  and the Canadian Center for Cyber Security . The report  by the Saudi\nCyber Security Centre suggests threat actors are primarily targeting organizations within the\nkingdom. The Canadian Cyber Security Centre reported similar attacks  aimed at delivering the China\nChopper web-shell  to ensure persistence in the target networks.\n“the actors used these webshells to upload legitimate executables that they would use DLL sideloading to run a\nmalicious DLL that has code overlaps with known Emissary Panda attacks . We also found the China Chopper\nwebshell on the SharePoint servers, which has also been used by the Emissary Panda threat group.” states  the\nreport  published by PaloAlto Networks.a\nPaloAlto experts observed between April 1 and April 16, the threat actors-using webshells to upload\n24 unique executables on three SharePoint servers hosted by two different government organizations.\nExperts noticed that the same tools were uploaded across the three webshells, suggesting the\ninvolvement of the same attacker. \nThe longest activity involving one of the three webshells was observed on April 16, 2019.\nThe list of the tools uploaded by cyberspies included legitimate applications such as cURL, post-\nexploitation tools like Mimikatz , tools to scan for and exploit potential vulnerabilities in the target\nnetwork, and custom backdoors such as HyperBro , which was used by Emissary Panda in the past. \nOne of the webshells used by the attackers is a variant of the Antak webshell, other webshells appear\nrelated to the China Chopper webshell.\n“We were able to gather one of the webshells  with which we saw the actor interacting, specifically\nthe error2.aspx file listed above. The error2.aspx file\n(SHA256: 006569f0a7e501e58fe15a4323eedc08f9865239131b28dc5f95f750b4767b38) is a variant of\nthe Antak webshell , which is part of a tool created for red teaming called Nishang . ” continues  the report.\nCyber spies also uncovered the use of additional sideloaded DLLs in this campaign. \n“The Emissary Panda threat group loaded the China Chopper webshell onto SharePoint servers at two\nGovernment organizations in the Middle East, which we believe with high confidence involved exploiting a remote\ncode execution vulnerability in SharePoint tracked in CVE-2019-0604,” Palo Alto Networks concludes. \n“Once the adversary established a foothold on the targeted network, they used China Chopper and other\nwebshells to upload additional tools to the SharePoint server to dump credentials, perform network\nreconnaissance and pivot to other systems.  “\nIf you appreciate my effort in spreading cybersecurity awareness, please vote for Security Affairs in\nthe section “Your Vote for the Best EU Security Tweeter”\nThank you\nPierluigi Paganini\n(SecurityAffairs  – cyberespionage , Emissary Panda)\n APT Cyberespionage Emissary Panda Hacking information security news malware\nPierluigi Paganini Security Affairs Security News SharePoint\nYOU MIGHT ALSO LIKEShare this...\nPREVIOUS ARTICLE\nNansh0u campaign already infected\n50,000 MS-SQL and PHPMyAdmin\nServers\n NEXT ARTICLE\nVPNpro research: this Chinese-linked\ncompany secretly owns 10 VPNs with 86\nmillion installsAlways Enabled Necessary \n "
}