{
    "title": "energetic bear_crouching yeti_ attacks on servers _ securelist",
    "text": "Energetic Bear/Crouching Yeti  is a widely known APT group active since at least 2010. The group tends to attack different\ncompanies with a strong focus on the energy and industrial sectors. Companies attacked by Energetic Bear/Crouching Yeti\nare geographically distributed worldwide with a more obvious concentration in Europe and the US. In 2016-2017, the\nnumber of attacks on companies in Turkey increased significantly.\nThe main tactics of the group include sending phishing emails with malicious documents and infecting various servers. The\ngroup uses some of the infected servers for auxiliary purposes – to host tools and logs. Others are deliberately infected to\nuse them in waterhole attacks in order to reach the group’s main targets.\nRecent activity of the group against US organizations was discussed in a US-CERT  advisory, which linked the actor to the\nRussian government, as well as an advisory by the UK National Cyber Security Centre .\nThis report by Kaspersky Lab ICS CERT  presents information on identified servers that have been infected and used by the\ngroup. The report also includes the findings of an analysis of several webservers compromised by the Energetic Bear group\nduring 2016 and in early 2017 .\nAttack victims\nThe table below shows the distribution of compromised servers (based on the language of website content and/or the\norigins of the company renting the server at the time of compromise) by countries, attacked company types and the role of\neach server in the overall attack scheme. Victims of the threat actor’s attacks were not limited to industrial companies.\nTable 1. Compromised servers\nCountry Description Role in the attack\nRussiaOpposition political website Waterhole\nReal estate agencyAuxiliary (collecting user data in the waterhole\nattack)\nFootball club Waterhole\nDeveloper and integrator of secure automation\nsystems and IS consultantWaterhole\nDevelopers of software and equipmentAuxiliary (collecting user data in the waterhole\nattack, tool hosting)\nInvestment websiteAuxiliary (collecting user data in the waterhole\nattack)\nUkraineElectric power sector company Waterhole\nBank Waterhole\nUK Aerospace company Waterhole\nGermanySoftware developer and integrator Waterhole\nUnknownAuxiliary (collecting user data in the waterhole\nattack)\nTurkeyOil and gas sector enterprise Waterhole\nIndustrial group Waterhole\nInvestment group Waterhole\nGreece Server of a universityAuxiliary (collecting user data in the waterhole\nattack)\nUSA Oil and gas sector enterprise Waterhole\nUnknown Affiliate network siteAuxiliary (collecting user data in the waterhole\nattack)\nWaterhole\nAll waterhole servers are infected following the same pattern: injecting a link into a web page or JS file with the following\nfile scheme: file://IP/filename.png.\nInjected link with the file scheme\nThe link is used to initiate a request for an image, as a result of which the user connects to the remote server over the SMB\nprotocol. In this attack type, the attackers’ goal is to extract the following data from the session:\nuser IP,\nuser name,\ndomain name,\nNTLM hash of the user’s password.\nIt should be noted that the image requested using the link is not physically located on the remote server.\nScanned resources\nCompromised servers are in some cases used to conduct attacks on other resources. In the process of analyzing infected\nservers, numerous websites and servers were identified that the attackers had scanned with various tools, such as nmap,\ndirsearch, sqlmap, etc. (tool descriptions are provided below).\nTable 2. Resources that were scanned from one of the infected servers\nCountry\n(based on the content)Description\nRussiaNon-profit organization\nSale of drugs\nTravel/maps\nResources based on the Bump platform (platform for corporate social networks) –\nnon-profit organization, social network for college/university alumni,\ncommunication platform for NGOs, etc.\nBusiness – photographic studio\nIndustrial enterprise, construction company\nDoor manufacturing\nCryptocurrency exchange\nConstruction information and analysis portal\nPersonal website of a developer\nVainah Telecom IPs and Subnets (Chechen Republic)\nVarious Chechen resources (governmental organizations, universities, industrial\nenterprises, etc.)\nWeb server with numerous sites (alumni sites, sites of industrial and engineering\ncompanies, etc.)\nMuslim dating site\nBrazil Water treatment\nTurkeyHotels\nEmbassy in Turkey\nSoftware developer\nAirport website\nCity council website\nCosmetics manufacturer\nReligious website\nTurktelekom subnet with a large number of sites\nTelnet Telecom subnet with a large number of sites\nGeorgia Personal website of a journalist\nKazakhstan Unknown web server\nUkraineOffice supplies online store\nFloral business\nImage hosting service\nOnline course on sales\nDealer of farming equipment and spare parts\nUkrainian civil servant’s personal website\nOnline store of parts for household appliance repair\nTimber sales, construction\nTennis club website\nOnline store for farmers\nOnline store of massage equipment\nOnline clothes store\nWebsite development and promotion\nOnline air conditioner store\nSwitzerland Analytical company\nUS Web server with many domains\nFrance Web server with many domains\nVietnam Unknown server\nInternational Flight tracker\nThe sites and servers on this list do not seem to have anything in common. Even though the scanned servers do not\nnecessarily look like potential final victims, it is likely that the attackers scanned different resources to find a server that\ncould be used to establish a foothold for hosting the attackers’ tools and, subsequently, to develop the attack.\nPart of the sites scanned may have been of interest to the attackers as candidates for hosting waterhole resources.\nIn some cases, the domains scanned were hosted on the same server; sometimes the attackers went through the list of\npossible domains matching a given IP.\nIn most cases, multiple attempts to compromise a specific target were not identified – with the possible exception of sites\non the Bump platform, flight tracker servers and servers of a Turkish hotel chain.\nCuriously, the sites scanned included a web developer’s website, kashey.ru, and resources links to which were found on this\nsite. These may have been links to resources developed by the site’s owner: www.esodedi.ru, www.i-stroy.ru,\nwww.saledoor.ru\nToolset used\nUtilities\nUtilities found on compromised servers are open-source and publicly available on GitHub:\nNmap – an open-source utility for analyzing the network and verifying its security.\nDirsearch  — a simple command-line tool for brute forcing (performing exhaustive searches of) directories and files on\nwebsites.\nSqlmap  — an open-source penetration testing tool, which automates the process of identifying and exploiting SQL\ninjection vulnerabilities and taking over database servers.\nSublist3r  — a tool written in Python designed to enumerate website subdomains. The tool uses open-source intelligence\n(OSINT ). Sublist3r supports many different search engines, such as Google, Yahoo, Bing, Baidu and Ask, as well as such\nservices as Netcraft, Virustotal, ThreatCrowd, DNSdumpster and ReverseDNS. The tool helps penetration testers to\ncollect information on the subdomains of the domain they are researching.\nWpscan  — a WordPress vulnerability scanner that uses the blackbox principle, i.e., works without access to the source\ncode. It can be used to scan remote WordPress sites in search of security issues.\nImpacket  — a toolset for working with various network protocols, which is required by SMBTrap.\nSMBTrap  — a tool for logging data received over the SMB protocol (user IP address, user name, domain name, password\nNTLM hash).\nCommix  — a vulnerability search and command injection and exploitation tool written in Python.\nSubbrute  – a subdomain enumeration tool available for Python and Windows that uses an open name resolver as a proxy\nand does not send traffic to the target DNS server.\nPHPMailer  – a mail sending tool.\nIn addition, a custom Python script named ftpChecker.py was found on one of the servers. The script was designed to check\nFTP hosts from an incoming list.\nMalicious php ﬁles\nThe following malicious php files were found in different directories in the nginx folder and in a working directory created by\nthe attackers on an infected web servers:\nFile nameBrief\ndescriptionmd5sumTime of the latest file change\n(MSK)Size,\nbytes\nini.php wso shell+ mail f3e3e25a822012023c6e81b206711865 2016-07-01 15:57:38 28786\nmysql.php wso shell+ mail f3e3e25a822012023c6e81b206711865 2016-06-12 13:35:30 28786\nopts.php wso shell c76470e85b7f3da46539b40e5c552712 2016-06-12 12:23:28 36623\nerror_log.php wso shell 155385cc19e3092765bcfed034b82ccb 2016-06-12 10:59:39 36636\ncode29.php web shell 1644af9b6424e8f58f39c7fa5e76de51 2016-06-12 11:10:40 10724\nproxy87.php web shell 1644af9b6424e8f58f39c7fa5e76de51 2016-06-12 14:31:13 10724\ntheme.php wso shell 2292f5db385068e161ae277531b2e114 2017-05-16 17:33:02 133104\nsma.php PHPMailer 7ec514bbdc6dd8f606f803d39af8883f 2017-05-19 13:53:53 14696\nmedia.php wso shell 78c31eff38fdb72ea3b1800ea917940f 2017-04-17 15:58:41 1762986\nIn the table above:\nWeb shell is a script that allows remote administration of the machine.\nWSO is a popular web shell and file manager (it stands for “Web Shell by Orb”) that has the ability to masquerade as an\nerror page containing a hidden login form. It is available on GitHub:\nhttps://github.com/wso-shell/WSO\nTwo of the PHP scripts found, ini.php and mysql.php, contained a WSO shell concatenated with the following email\nspamming script:\nhttps://github.com/bediger4000/php-malware-analysis/tree/master/db-config.php\nAll the scripts found are obfuscated.\nwso shell – error_log.php\nDeobfuscated wso shell – error_log.php\nOne of the web shells was found on the server under two different names (proxy87.php and code29.php). It uses the eval\nfunction to execute a command sent via HTTP cookies or a POST request:\nWeb shell – proxy87.php\nDeobfuscated web shell – proxy87.php\nModiﬁed sshd\nA modified sshd with a preinstalled backdoor was found in the process of analyzing the server.\nPatches with some versions of backdoors for sshd that are similar to the backdoor found are available on GitHub, for\nexample:\nhttps://github.com/jivoi/openssh-backdoor-kit\nCompilation is possible on any OS with binary compatibility.\nAs a result of replacing the original sshd file with a modified one on the infected server, an attacker can use a ‘master\npassword’ to get authorized on the remote server, while leaving minimal traces (compared to an ordinary user connecting\nvia ssh).\nIn addition, the modified sshd logs all legitimate ssh connections (this does not apply to the connection that uses the\n‘master password’), including connection times, account names and passwords. The log is encrypted and is located at\n/var/tmp/.pipe.sock.\nDecrypted log at /var/tmp/.pipe.sock\nActivity of the attackers on compromised servers\nIn addition to using compromised servers to scan numerous resources, other attacker activity was also identified.\nAfter gaining access to the server, the attackers installed the tools they needed at different times. Specifically, the following\ncommands for third-party installations were identified on one of the servers:\napt install traceroute\napt-get install nmap\napt-get install screen\ngit clone https://github.com/sqlmapproject/sqlmap.git\nAdditionally, the attackers installed any packages and tools for Python they needed.\nThe diagram below shows times of illegitimate logons to one of the compromised servers during one month. The attackers\nchecked the smbtrap log file on working days. In most cases, they logged on to the server at roughly the same time of day,\nprobably in the morning hours:\nAPT REPORTS  INDUSTRIAL THREATS\nEnergetic Bear/Crouching Yeti: attacks\non servers\nBy Kaspersky Lab ICS CERT  on April 23, 2018. 10:00 am\nIN THE SAME CATEGORY\nCOMpfun successor Reductor infects\nﬁles on the ﬂy to compromise TLS traﬃc\nThreat landscape for smart buildings\nRecent Cloud Atlas activity\nAPT trends report Q2 2019\nTurla renews its arsenal with Topinambour\nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\n English\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPR GET IN TOUCH\n "
}