{
    "title": "evasive maneuvers by the wekby group with custom rop-packing and dns covert channels",
    "text": " \nEvasive Maneuvers by the Wekby group with custom\nROP-packing and DNS covert channels\nJuly 6, 2015 | Aaron Shelmire \nLEARN MORE\nSupport Blog Forum  EN\nCYBER THREAT INTELLIGENCE THREAT INTELLIGENCE PLATFORM\n\n\n\nThreatStream Labs recently became aware of a campaign beginning on 30 June 2015 by the omniprescent\nWekby threat actors (a/k/a TG-0416 , APT-18 , Dynamite Panda). The Wekby actors have recently been\nobserved compromising organizations in the Manufacturing, Technology and Utilities verticals, but have\nhad a long standing interest in the HealthCare industry.  This campaign uses obfuscated variants of the\nHTTPBrowser tool that use DNS as a control channel.\nThis recent campaign exhibits many of the groups key characteristics to deliver a more technically\nadvanced version of their toolkit than has previously been found. The Wekby group is keen on using\nphishes that purport to be from the IT helpdesk, often with links or attachments claiming to be vpn or citrix\nupgrades. This specific instance used a “cisco” vpnclient theme.\nThe Phishing links are: \nhXXp://it-desktop[.]com/vpn/cisco/vpnclient.exe\nhXXp://wangke99[.]tgk[.]delldns[.]com/tools.exe\nThese URIs result in the download of an installer, which creates a PE of the malware typically known as\nHTTPBrowser, but called Token Control by the Wekby group themselves (based upon the PDB strings\nfound within many of the samples).  The PEBuildDate of the installers range from 2015-06-30 11:57:13 to\n12:03:13 UTC. Two samples use subdomains of local.it-desktop.com and were submitted to VirusTotal at\n15:32:37 from users in Great Britain. At that time only 8 of 55 AntiVirus engines detected the same as\nmalware, mostly with generic and heuristic detections.  The third sample was first submitted on July 1st\n2015 from a user in South Korea.   \nThe samples install HTTPBrowser at %APPDATA%/wdm.exe . Persistence is established via the\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run  key value for wdm  set to the path of the executable.\nPrevious samples have set persistence via Run key values for 360v .\n \nThis tool has been used by a few groups since at least 2012 based upon PEBuildDates). However this\nsample is a bit more interesting. Normally HTTPBrowser sends traffic over HTTP using a user-agent of\nHTTPBrowser/1.0 .  This sample uses DNS as a covert channel for communications. Specifically this sample\nutilizes DNS TXT records with 9 uppercase letters followed by a number and 7 more uppercase letters, then\nthe C2 domain used. In this PCAP the C2 domain is glb.it-desktop.com. The “glb” label is believed to be a\ncampaign ID. The other samples use the C2 domains of local.it-desktop.com and hi.getgo2.com\nAdding to the intrigue of this sample is a novel form of obfuscation that greatly complicates analysis.\nSpecifically the sample uses Return Oriented Programming to control execution flow, and creates an\nextraordinary amount of functions filled with instructions that essentially evaluate to elaborate NOPs (no\noperation).  The way this works is each function modifies the stack to replace the return point with\nadditional functions including a function that includes the next bit of code that needs to be executed. Each\nsubroutine includes the bare minimum number of operations necessary to call another subroutine, or\nperform local control flow (looping, branching, and simple calculations), before modifying the stack to\nreturn to the next subroutine. While looking at a sample in OllyDbg, you would see the following, where\nexecution will continue with Subroutine 0x0040F62E . If that subroutine does not add any additional\nfunctions to the stack, execution will continue to Subroutine 0x0040F38A . \nRESOURCES\n PRODUCTS COMMUNITY APP STORE ISAC s COMPANY\n REQUEST DEMO\n You might also be interested in...\nWhile many of the Wekby threat actors campaigns may appear unsophisticated because they often rely\nupon stolen credentials or basic malware, this group of actors is extremely successful at obtaining their\nobjectives. If your organization does not use Two-Factor authentication, the group will typically rely upon\nstolen credentials for remote access. The Wekby group has exhibited a preference to use a tool named\nHcdLoader which often persists as a Windows Service on externally facing servers for remote access. The\ngroup is particularly skilled at living off the land by using the tools already present on computers for lateral\nmovement  and exfiltration.\n \nThe samples detailed here can be found on VirusTotal at:\nd0f79de7bd194c1843e7411c473e4288 \ne5414c5215c9305feeebbe0dbee43567  \n985eba97e12c3e5bce9221631fb66d68\n \nUPDATE: The original post noted a domain of hi.get2go.com in error. This domain should have been\nhi.getgo2.com\nAbout the Author\nAaron Shelmire\nAaron began work in the security field after machines he was responsible for\nwere compromised in the 2004 Stakkato Intrusions. At this point he went to\ngraduate school at Carnegie Mellon Universities Heinz College for Information\nAssurance, where he currently holds an adjunct position teaching Network\nSecurity Analysis. He has been a security researcher at the Software\nEngineering Institutes CERT/CC initiative and Dell SecureWorks, with a focus\non responding to and analyzing threat intelligence.\nBlog\nWolves Attack When the\nHerd Is Distracted\nBlog\nAPTs & Threat Actors That\nMay Increase Hostile Activity\nDue to Elimination of Iranian\nGeneral Quassem Suleimani\nBlog\nPhishing Campaign Targets\nLogin Credentials of Multiple\nUS, International\nGovernment Procurement\nServices\nBlog\nMalicious Activity Aligning\nwith Gamaredon TTPs\nTargets Ukraine\nGet the latest threat intelligence news in your email.\nCompany Email\n SUBSCRIBE\nCopyright 2020 ANOMALI. \nAll Rights Reserved.PRODUCTS\nCOMMUNITY\nAPP STOREISACS\nRESEARCH\nCOMPANYBLOG\nNEWS & EVENTS\nSUPPORT\nPrivacy Policy\nTerms of Use\n3rd Party Vendor Policy\n\nWe use cookies to enhance your experience while on our website, serve personalized content, provide social media features and to optimize our traffic. By continuing to browse\nthe site you are agreeing to our use of cookies. Find out more here .\nAccept\n "
}