{
    "title": "fin4_ stealing insider information for an advantage in stock trading_ _ fireeye inc",
    "text": " PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚȚħřěǻț Řěșěǻřčħ\nFİŇ4: Șțěǻŀįňģ İňșįđěř İňfǿřmǻțįǿň fǿ ř ǻň Ǻđvǻňțǻģě įň\nȘțǿčķ Ț řǻđįňģ?\nĐěčěmbě ř 01, 2014 | bỳ Ķřįșțěň Đěňňě șěň, Jǿřđǻň Běřřỳ, Bǻřřỳ Věňģě řįķ, Jǿňǻțħǻň Ẅ řǿŀșțǻđ | Țħřěǻț İňțěŀŀįģěňčě\nČỲBĚŘ ČŘİMĚ \nȚĦŘĚǺȚ İŇȚĚĿĿİĢĚŇČĚ \nČỲBĚŘȘĚČŲŘİȚỲ \nİȚ ȘĚČŲŘİȚỲ \nİŇFǾȘĚČŲŘİȚỲ \nĐǺȚǺ BŘ ĚǺČĦ \nĚMǺİĿ ȘĚČŲŘİȚỲ \nȚĦŘĚǺȚ ŘĚȘĚǺŘČĦ\nǺț FįřěĚỳě, ẅě įňvěșțįģǻțě čỳbě ř țħřěǻț ǻčțįvįțỳ țħǻț țỳpįčǻŀŀỳ ǻŀįģň ș ẅįțħ ǿňě ǿf ț ẅǿ ģǿǻŀș: țħě pųřșųįț ǿf\nșěňșįțįvě įňfǿ řmǻțįǿň țǿ f ųŀfįŀŀ ǻ ģǿvě řňměňț'ș ģǿǻŀș, ǿř țħě țħěfț ǿf đǻțǻ fǿř fįňǻňčįǻŀ ģǻįň. Țħě mě đįǻ ěčħǿě ș\nțħěșě țẅǿ ǿbjěčțįvě ș đǻįŀỳ įň ňě ẅș șțǿřįěș ǻbǿųț Ěǻșțěřň Ěųřǿpěǻň čỳbě řčřįmįňǻŀș șțěǻŀįňģ pǻỳměňț čǻ řđ đǻțǻ\nfřǿm řěțǻįŀěřș, ǿř Čħįňǻ-bǻ șěđ țħřěǻț ģřǿųpș țǻřģěțįňģ ħįģħ țěčħ fį řmș' ŀǻțěșț įňňǿvǻțįǿň ș. Ǻ řěǻđěř șķįmmįňģ țħě\nħěǻđŀįňě, \"Ħǻčķěřș Șțěǻŀ Đǻțǻ f řǿm Pħǻ řmǻčěųțįčǻŀ Fįřmș\" čǿųŀđ bě fǿřģįvěň fǿ ř ǻșșųmįňģ țħǻț țħě ǻ řțįčŀě țěŀŀ ș țħě\nșțǿřỳ ǿf ǻ ģǿvě řňměňț-bǻčķě đ ģřǿųp įň pųřșųįț ǿf ňěẅ đřųģ įňňǿvǻțįǿň ș. Ħǿẅěvěř, įň ǻ čǻmpǻįģň Fį řěĚỳě įș\nųňčǿvěřįňģ țǿđǻỳ, țħįș ħěǻđŀįňě țěŀŀș ǻňǿțħě ř șțǿřỳ.\n \nFįřěĚỳě țřǻčķș ǻ țħřěǻț ģřǿųp țħǻț ẅě čǻŀŀ \"F İŇ4,\" ẅħǿșě įňțřųșįǿňș șěěm țǿ ħǻvě ǻ đįffěřěňț ǿbjěčțįvě: țǿ ǿbțǻįň\nǻň ěđģě įň șțǿčķ țřǻđįňģ. FİŇ4 ǻppěǻ řș țǿ čǿň đųčț įňțřųșįǿňș țħǻț ǻřě fǿčųșěđ ǿň ǻ șįňģŀě ǿbjěčțįvě: ǿbțǻįňįňģ\nǻččěșș țǿ įňșįđěř įňfǿřmǻțįǿň čǻpǻbŀě ǿf mǻķįňģ ǿ ř břěǻķįňģ țħě șțǿčķ přįčěș ǿf pųbŀįč čǿmpǻňįě ș. Țħě ģřǿųp\nșpěčįfįčǻŀŀỳ țǻ řģěțș țħě ěmǻįŀ ș ǿf Č-ŀěvěŀ ěxěč ųțįvěș, ŀěģǻŀ čǿ ųňșěŀ, řěģųŀǻțǿřỳ, řįșķ, ǻňđ čǿmpŀįǻňčě pě řșǿňňěŀ, ǻň đ\nǿțħěř įňđįvįđųǻŀș ẅħǿ ẅǿųŀđ řěģųŀǻřŀỳ đįșčųșș čǿňfįđěňțįǻŀ, mǻ řķěț-mǿvįňģ įňfǿ řmǻțįǿň.\n \nFİŇ4 ħǻș țǻřģěțěđ ǿvěř 100 čǿmpǻňįě ș șįňčě ǻț ŀěǻ șț mįđ-2013 . Ǻŀŀ ǿf țħě țǻ řģěțěđ ǿřģǻňįżǻțįǿňș ǻřě ěįțħěř\npųbŀįč čǿmpǻňįě ș ǿř ǻđvįșǿřỳ fįřmș țħǻț přǿvįđě șěřvįčěș țǿ pųbŀįč čǿmpǻňįě ș (șųčħ ǻș įňvěșțǿř řěŀǻțįǿňș, ŀěģǻŀ,\nǻňđ įňvěșțměňț bǻňķįňģ fį řmș). Ǿvěř țẅǿ-țħįřđș ǿf țħě țǻ řģěțěđ ǿřģǻňįżǻțįǿňș ǻřě ħěǻŀțħčǻ řě ǻňđ pħǻřmǻčěųțįčǻŀ\nčǿmpǻňįě ș. FİŇ4 přǿbǻbŀỳ fǿč ųșěș ǿň țħě șě țỳpěș ǿf ǿřģǻňįżǻțįǿňș běčǻųșě țħěįř șțǿčķș čǻň mǿvě đřǻmǻțįčǻŀŀỳ\nįň řěșpǿňșě țǿ ňě ẅș ǿf čŀįňįčǻŀ ț řįǻŀ řěșųŀțș, řěģųŀǻțǿřỳ đěčįșįǿňș, ǿř șǻfěțỳ ǻň đ ŀěģǻŀ įșșųěș.\n \nẄě'vě běěň ǻbŀě țǿ čħǻ řǻčțěřįżě FİŇ4'ș ǻčțįvįțỳ vįǻ ǿ ųř įňčįđěňț řěșpǿňșě ěňģǻģěměňț ș, FİŇ4'ș ǻțțěmpț ș țǿ\nčǿmpřǿmįșě ǿųř mǻňǻģě đ șěřvįčě čŀįěňț ș, ǿųř přǿđųčț đěțěčțįǿň đǻțǻ, ǻňđ fųřțħěř įňđěpěňđěňț řěșěǻřčħ. Ǿųř\nvįșįbįŀįțỳ įňțǿ F İŇ4'ș ǻčțįvįțįě ș įș ŀįmįțěđ țǿ įțș ňěțẅǿřķ ǿpěřǻțįǿňș; ẅě čǻň ǿňŀỳ șųřmįșě ħǿẅ țħěỳ mǻỳ bě ųșįňģ\nǻňđ pǿțěňțįǻŀŀỳ běňěfįțțįňģ f řǿm țħě vǻŀ ųǻbŀě įňfǿ řmǻțįǿň țħěỳ ǻ řě ǻbŀě țǿ ǿbțǻįň. Ħǿẅěvěř, ǿňě fǻčț řěmǻįňș\nčŀěǻř: ǻččěșș țǿ įňșįđěř įňfǿřmǻțįǿň țħǻț čǿ ųŀđ șįģňįfįčǻňțŀỳ įmpǻčț șțǿčķ přįčěș fǿř đǿżěňș ǿf pųbŀįčŀỳ țřǻđěđ\nčǿmpǻňįě ș șųřěŀỳ pųțș FİŇ4 ǻț ǻ čǿň șįđěřǻbŀě țřǻđįňģ ǻđvǻňțǻģě.\n \nFįřěĚỳě įș řěŀěǻșįňģ įňđįčǻțǿřș țǿ ħěŀp ǿ řģǻňįżǻțįǿňș đěțěčț F İŇ4 ǻčțįvįțỳ. Țħǿ șě įňđįčǻțǿřș čǻň bě đǿẅňŀǿǻđěđ\nħěřě.\n \nȚħě čǿmpŀěțě řěpǿřț čǻň bě đǿẅňŀǿǻđěđ. \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n23 Mǻř 2020\n17 Mǻř 2020\n16 Mǻř 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐ Fįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nMǿňįțǿřįňģ İČȘ Čỳbě ř Ǿpěřǻțįǿň\nȚǿǿŀș ǻňđ Șǿfțẅǻřě Ěxpŀǿįț Mǿ đųŀěș\nȚǿ Ǻňțįčįpǻțě F ųțųřě Țħřěǻțș \nȘįx Fǻčț ș ǻbǿųț Ǻđđřěșș Șpǻčě\nĿǻỳǿųț Řǻňđǿmįżǻțįǿň ǿň\nẄįňđǿẅș \nȚħěỳ Čǿmě įň țħě Ňįģħț:\nŘǻňșǿmẅǻřě Đěpŀǿỳměňț Ț řěňđș \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  Ňǿvěmbě ř 2014 Țħřěǻț Řěșěǻřčħ Bŀǿģ Pǿ șțș  FİŇ4: Șțěǻŀįňģ İňșįđěř İňfǿřmǻțįǿň fǿ ř ǻň Ǻđvǻňțǻģ...    \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě Ěňģŀįșħ\nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n "
}