{
    "title": "fin7 not finished – morphisec spots new campaign",
    "text": "MOVING TARGET DEFENSE BLOG\nCYBERSECURITY TRENDS, EXPLORING MOVING TARGET DEFENSE\nAND PUTTING ENDPOINT THREAT PREVENTION FIRST\nTweetFIN7 NOT FINISHED – MORPHISEC SPOTS\nNEW CAMPAIGN\nPosted by  MICHAEL GORELIK  on November 21, 2018\nFind me on:  \n \nThis blog was co-authored by Alon Groisman.\nIt seems like the rumors of FIN7’s decline have been hasty. Just a few months after\nthe well-publicized indictment  of three high-ranking members in August,\nMorphisec has identified a new FIN7 campaign that appears to be targeting the\nrestaurant industry.\nFIN7 , also known as Carbanak, is one of the major threat groups tracked by\nMorphisec  and numerous other security entities, and among the top three\ncriminal computer intrusion cases that the FBI is currently working. FIN7 is\ncomposed of a very sophisticated network of developers and hackers and brings in\nan estimated $50 million a month . They target very specific industries, hospitality\n– hotels and restaurants – being one of them, and are behind a string of high-\nprofile breaches including Red Robin, Chili’s, Arby’s, Burgerville, Omni Hotels and\nSaks Fifth Avenue, among many others.\nFIN7 is known for its stealth techniques and ability to continuously evade security\nsystems. In the case of Burgerville, malware sat on the company’s network\ncollecting payment data for nearly a year before it was discovered. And that was\nonly due to an FBI investigation.\nIn this blog post, we present our findings on two campaigns, which occurred in the\nfirst and second weeks of November. These campaigns follow patterns similar to\nthose presented by FireEye  in August but with just enough variations to bypass\nmany security vendors.\nTECHNICAL DESCRIPTION\nThe initial document was probably sent within the Baltic region (or tested there). It\nwas submitted to VirusTotal from Latvia. The name of the document translated\nfrom Russian is “new questioner”. It is password-protected with the password:\n“goodmorning”.\nOprosnik_new.doc\n6e1230088a34678726102353c622445e1f8b8b8c9ce1f025d11bfffd5017ca82)\nIt uses social engineering to convince the recipient to enable macros through the\nuse of the images, logo and tagline of a newly launched, legitimate VPN tool\nInvinciBull by cybersecurity company Finjan.\nIf the “enable macro” button is activated, the following obfuscated Macro runs and\nthe next stage obfuscated JavaScript is extracted from the form caption, similar to\nthe last several FIN7 campaigns.\nExamining the metadata of the document, it clearly shows that the document was\ncreated on the 11.02.2018:\nFollowing deobfuscation of the macro, we notice known FIN7 patterns of executing\nJavaScript from VBScript with the slight modification of copying the wscript.exe file\nand renaming it to mses.exe. This may allow it to bypass some EDR solutions that\nare tracing WScript by name.\nBelow is the obfuscated JavaScript that is written to the temp directory as error.txt\nfile. The obfuscation pattern is similar to previously seen FIN7 patterns and most\nprobably is a derivation of the same obfuscation toolkit.\nDEOBFUSCATED JAVASCRIPT\nThe deobfuscated JavaScript is actually a backdoor component that directly\ncommunicates to the C2 server (in this case hxxps://bing-cdn[.]com). It executes\nthe response which is yet another JavaScript command, which can be evaluated by\neval. Although there have been slight modifications in the Macro delivery in the last\ncouple of campaigns, the JavaScript backdoor stays the same, including its\ncommunication protocol.\nDuring the first request, the MAC address and the computer domain are also\ndelivered to the target C2. We believe that the next stage is only delivered to\nspecific targets based on domains as the data that is delivered in the first request is\nvery limited.\nYARA RULES\nSome additional observations that can be used to create Yara-rules for this\ncampaign are the locations of the loaded VBControl files that are written in clear\ntext as part of the document files:\nADDITIONAL SAMPLES\nAfter this search, we identified more samples that were created just a couple of\ndays ago and point to a known C2 registered to the same entity (hxxps://googleapi-\ncdn[.]com)\nBelow is a summary of information for one of those documents:\nThe document was submitted from Ukraine (yet another former soviet union\ncountry) with the name “ dinners.doc”\n(f5f8ab9863dc12d04731b1932fc3609742de68252c706952f31894fc21746bb8).\nThe document again uses the social engineering technique of spoofing a known\nand trusted entity to convince the victim to enable macros.\nBased on the submission date and creation time, the document is sent to the\ntarget within 2-3 days.\nThe macro is nearly identical to that described above except that wscript->script,\nerrors->settings, has multiple captions instead of a single one.\nThe JavaScript backdoor is decrypted into a similar backdoor:\nCONCLUSION\nLike the Hydra, cutting off one, or even three, heads of FIN7 barely slows it down.\nWith the holiday rush nearly upon us, we expect the threat group to step up its\nactivities to take advantage of increased email traffic flow and seasonal staff that\nmay be less security conscious. Workers in any industry should stay vigilant against\nsocial engineering methods – although with today’s highly targeted campaigns this\ncan sometimes be tough to spot. And never enable macros unless you are 100\npercent certain that the file is safe.  SUBSCRIBE TO OUR BLOG\nStay in the loop with industry insight,\ncyber security trends, and cyber attack\ninformation and company updates.\nFIRST NAME\nLAST NAME\nEMAIL\nCOMPANY\nSUBSCRIBE\nSEARCH OUR SITE\nRECENT POSTS\nParallax: The New RAT on the Block\nRemote Employees O er Di erent\nSecurity Challenges\nWhy Client-Grade Technology\nDoesn't Cut It for Cloud Workload\nProtection\nTrickbot Delivery Method Gets a\nNew Upgrade Focusing on Windows\n10\nIntroducing the Morphisec Uni ed\nThreat Prevention Platform --\nVersion 4\nEndpoint Security Is Harder than\nEver\nTrickbot Trojan Leveraging a New\nWindows 10 UAC Bypass\nMorphisec Protects Customers\nAgainst Internet Explorer Scripting\nEndpoint Detection and Response Is\nNot the Next Step\nAre Guests Safe From a Hotel Data\nBreach?\nPOSTS BY TAG\nCyber Security (94)\nEndpoint Security (74)\nAttack Analysis (45)\nCyber Attacks (45)\nCompany News (38)\nSee all\nContact SalesABOUT US\nNews\nEvents\nCareers\nPARTNERS\nRESOURCESBLOG\nCONTACT\nUS\nSUPPORT\n© 2020 Morphisec Ltd. | All rights reserved | Privacy Policy    Share Like 5Share\nKeyword...\nPRODUCTS SOLUTIONS BY INDUSTRY SOLUTIONS BY USE CASE\nAdvanced Endpoint\nPrevention\nVirtual Desktop Protection\nCloud Workload Protection\nServer ProtectionSMB\nManufacturing\nFinance\nTechnology\nHealthcare\nLegalAntivirus Replacement\nRansomware Prevention\nVirtual Patching &\nCompliance\nPoint-Of-Sale Protection\nSupply Chain Attack\nProtection\nBrowser Attack Protection\nBLOGCONTACT US SUPPORT\nKeyword...\nREQUEST A DEMO PARTNERS RESOURCES PRODUCTS SOLUTIONS COMPANY\n "
}