{
    "title": "fin7.5_ the infamous cybercrime rig “fin7” continues its activities _ securelist",
    "text": "On August 1, 2018, the US Department of Justice announced that it had arrested several individuals suspected of having ties\nto the FIN7 cybercrime rig. FIN7 operations are linked to numerous intrusion attempts having targeted hundreds of\ncompanies since at least as early as 2015. Interestingly, this threat actor created fake companies in order to hire remote\npentesters, developers and interpreters to participate in their malicious business. The main goal behind its malicious activities\nwas to steal financial assets from companies, such as debit cards, or get access to financial data or computers of finance\ndepartment employees in order to conduct wire transfers to offshore accounts.\nIn 2018-2019, researchers of Kaspersky Lab’s Global Research and Analysis Team analyzed various campaigns that used the\nsame Tactics Tools and Procedures (TTPs) as the historic FIN7, leading the researchers to believe that this threat actor had\nremained active despite the 2018 arrests. In addition, during the investigation, we discovered certain similarities to other\nattacker groups that seemed to share or copy the FIN7 TTPs in their own operations.\nRecent FIN7 campaigns\nThe FIN7 intrusion set continued its tailored spear phishing campaigns throughout last year. Kaspersky Lab has been able to\nretrieve some of these exchanges from a FIN7 target. The spear phishing campaigns were remarkably sophisticated from a\nsocial engineering perspective. In various cases, the operators exchanged numerous messages with their victims for weeks\nbefore sending their malicious documents. The emails were efficient social-engineering attempts that appealed to a vast\nnumber of human emotions (fear, stress, anger, etc.) to elicit a response from their victims. One of the domains used by the\nattackers in their 2018 campaign of spear phishing contained more than 130 email aliases, leading us to think that more than\n130 companies had been targeted by the end of 2018.\nMalicious Documents\nWe have seen two types of documents sent to victims in these spear phishing campaigns. The first one exploits the\nINCLUDEPICTURE feature of Microsoft Word to get context information about the victim’s computer, and the availability\nand version number of Microsoft Word. The second one, which in many cases is an Office document protected with a trivial\npassword, such as “12345”, “1234”, etc., uses macros to execute a GRIFFON implant on the target’s computer. In various\ncases, the associated macro also scheduled tasks to make GRIFFON persistent.\nInterestingly, following some open-source publications about them, the FIN7 operators seems to have developed a\nhomemade builder of malicious Office document using ideas from ThreadKit, which they employed during the summer of\n2018. The new builder inserts random values in the Author and Company metadata fields. Moreover, the builder allows\nthese to modify different IOCs, such as the filenames of wscript.exe or sctasks.exe copies, etc.\nwscript.exe copy sctasks copy Task name C2\nbyzNne10.exe byzNne17.exe TaskbyzNne logitech-cdn.com\nc9FGG10.exe c9FGG17.exe Taskc9FGG logitech-cdn.com\nzEsb10.exe zEsb17.exe TaskzEsb servicebing-cdn.com\nIOCs extracted from docs which use sctasks for GRIFFON persistence\nAuthor Company wscript.exe copy C2\nmogjxjtvte mogjxjtvte mswmex44.exe logitech-cdn[.]com\nsoxvremvge soxvremvge c9FGG10.exe logitech-cdn[.]com\ngareljtjhvd gareljtjhvd zEsb10.exe servicebing-cdn[.]com\nIOCs extracted from regular documents associated to GRIFFON\nGRIFFON Implant\nGriffon Malware attack pattern\nThe GRIFFON implant is a lightweight JScript validator-style implant without any persistence mechanism. The malware is\ndesigned for receiving modules to be executed in-memory and sending the results to C2s. We were able to obtain four\ndifferent modules during the investigation.\nReconnaissance module\nThe first module downloaded by the GRIFFON malware to the victim’s computer is an information-gathering JScript, which\nallows the cybercriminals to understand the context of the infected workstation. This module mainly relies on WMI and\nWindows objects to deliver results, which will be sent back to the operators. Interestingly, more than 20 artifacts are\nretrieved from the system by this implant during the reconnaissance stage, from the date and time of operating system\ninstallation and membership in a Windows domain to a list of and the resolutions of the workstation’s monitors.\nMeterpreter downloader\nThe second module is used by the operators to execute an obfuscated PowerShell script, which contains a Meterpreter\ndownloader widely known as “ Tinymet “. This downloader, seen in past FIN7 campaigns, downloads a one-byte XOR-\nencrypted (eg. with the key equal to 0x50 or 0x51) piece of meterpreter shellcode to execute.\nScreenshot module\nThe third module allows the operators to take a screenshot of the remote system. To do that, it also drops a PowerShell\nscript on the workstation to execute. The script executes an open-source .NET class used for taking a screenshot. The\nresulting screenshot is saved at “%TMP%/image.png”, sent back to the attackers by the GRIFFON implant and then deleted.\nPersistence module\nThe last retrieved module is a persistence module. If the victim appears valuable to the attackers, a GRIFFON implant\ninstaller is pushed to the victim’s workstation. This module stores another instance of the GRIFFON implant inside the\nregistry to achieve persistence. Here is a PowerLinks-style method used by the attackers to achieve persistence and execute\nthe GRIFFON implant at each user logon. The new GRIFFON implant is written to the hard drive before each execution,\nlimiting the “file-less” aspect of this method.\nThrough its light weight and modular architecture, the GRIFFON implant is the perfect validator. Even though we have been\nable to retrieve four different modules, it is possible that the FIN7 operators have more modules in their toolsets for\nachieving their objectives on the victim’s workstation.\nOn the hunt for GRIFFON infrastructure\nAttackers make mistakes, and FIN7 are no exception. The major error made by its operators allowed us to follow the\ncommand and control server of the GRIFFON implant last year. In order to trick blue teams and other DFIR analysts, the\noperators created fake HTTP 302 redirection to various Google services on their C2s servers.\nReturned headers for most of the GRIFFON C2s servers on port 443\nThis error allowed us to follow the infrastructure week by week, until an individual pushed on Twitter the heuristic to track\ntheir C2 at the end of December 2018. A few days after the tweet, in January 2019, the operators changed their landing\npage in order to prevent this type of tracking against their infrastructure.\nFake pentest company\nDuring the investigation related to the GRIFFON infrastructure, we found a strange overlap between the WHOIS record of\nan old GRIFFON C2 and the website of a fake company.\nAccording to the website, that domain supposedly belongs to a legitimate security company “fully owned by the Russian\nGovernment” (sic.) and having offices in “Moscow, Saint Petersburg and Yekaterinburg”, but the address says the company is\nlocated in Trump Tower, in New York. Given FIN7’s previous use of false security companies, we decided to look deeper\ninto this one.\nAs we were looking at the content of the website, it became evident that almost all of the text used was lifted from\nlegitimate security-company websites. Phrases and sentences were borrowed from at least the following companies/sites:\nDKSec – www.dksec.com\nOKIOK – www.okiok.com/services/tailored-solutions\nMainNerve – www.mainnerve.com\nDatics – www.datatics.com/cyber-security\nPerspective Risk – www.perspectiverisk.com\nSynack – https://www.synack.com/company\nFireEye – https://www.fireeye.com/services/penetration-testing.html\nThis company seems to have been used by the FIN7 threat actor to hire new people as translators, developers and\npentesters. During our research, we found various job advertisements associated with the company on freelance and\nremote-work websites.\nIn addition to that, various individuals have mentioned the company in their resumes. We believe that some of these\nindividuals may not even be aware that they are working for a cybercrime business.\nLinks to other intrusion sets\nWhile tracking numerous threat actors on a daily basis during the final days of 2018 and at the beginning of 2019, we\ndiscovered various activity clusters sharing certain TTPs associated with the FIN7 intrusion set. The link between these threat\nactors and FIN7 is still weak, but we decided to disclose a few hints regarding these in this blog post.\nCobaltGoblin/EmpireMonkey\nIn his history, FIN7 has overlapped several times with Cobalt/EmpireMonkey in terms of TTPs. This activity cluster, which\nKaspersky Lab has followed for a few years, uses various implants for targeting mainly banks, and developers of banking and\nmoney processing software solutions. At the end of 2018, the cluster started to use not only CobaltStrike but also\nPowershell Empire in order to gain a foothold on the victims’ networks. After a successful penetration, it uses its own\nbackdoors and the CobaltStrike framework or Powershell Empire components to hop to interesting parts of the network,\nwhere it can monetize its access.\nFIN7’s last campaigns were targeting banks in Europe and Central America. This threat actor stole suspected of stealing  €13\nmillion from Bank of Valetta, Malta earlier this year.\nExample of malicious documents used in the end of 2018 to beginning of 2019\nA few interesting overlaps in recent FIN7 campaigns:\nBoth used macros to copy wscript.exe to another file, which began with “ms” (mses.exe – FIN7, msutil.exe –\nEmpireMonkey).\nBoth executed a JScript file named “error” in %TEMP% (Errors.txt in the case of FIN7, Errors.bat for EmpireMonkey).\nBoth used DocuSign decoy documents with different macros. The macros popped the same “Document decryption\nerror” error message—even if macro code remain totally different.\nWe have a high level of confidence in a historic association between FIN7 and Cobalt, even though we believe that these\ntwo clusters of activity are operated by different teams.\nAveMaria\nAveMaria is a new botnet, whose first version we found in September 2018, right after the arrests of the FIN7 members. We\nhave medium confidence that this botnet falls under the FIN7 umbrella. In fact, AveMaria is a classic infostealer bot that\ncollects all possible credentials from various types of software: browsers, email clients, messengers, etc., and can act as a\nkeylogger. Since the beginning of 2019, we have collected more than 1300 samples and extracted more than 130 C2s.\nTo deliver their malware, the cyber criminals use spearphishing emails with various types of attachments: MS Office\ndocuments or spreadsheet files exploiting some known vulnerability like CVE-2017-11882, or documents with Ole2Link and\nSCT. They also use AutoIT droppers, password-protected EXE files and even ISO images. What is interesting, in some emails,\nthey ask targets to phone them if they have any questions, like the FIN7 guys do.\nExample of AveMaria spearphing emails. Criminals suggest calling them.\nDuring the investigation into FIN7, our threat-hunting systems found an interesting overlap in between the infrastructure of\nFIN7 and AveMaria. Basically, two servers in the same IP range and AS14576 (autonomous system) share a non-standard SSH\nport, which is 222. One of the servers is a Griffon C2, and the other one, an AveMaria C2.\nDistribution of targets is another factor suggesting that these two malware families may be connected. We analyzed\nAveMaria targets during February and March of 2019. The spearphishing emails were sent to various kinds of businesses only\nand did not target individuals. Thirty percent of the targets were small and medium-sized companies that were suppliers or\nservice providers for bigger players and 21% were various types of manufacturing companies. We also spotted several typical\nFIN7 targets, such as retailers and hotels. Most AveMaria targets (72%) were in the EU.\nCopyPaste\nAt the end of 2018, while searching for new FIN7 campaigns via telemetry, we discovered a set of activity that we\ntemporarily called “CopyPaste” from a previously unknown APT. Interestingly, this actor targeted financial entities and\ncompanies in one African country, which lead us to think that CopyPaste was associated with cybermercenaries or a training\ncenter.\nThis set of activity relied on open-source tools, such as Powershell Empire, and well-documented red teaming techniques,\nin order to get a foothold within the victim’s networks and avoid detection.\nHere are the main similarities between CopyPaste and FIN7:\nBoth used the same Microsoft PowerShell argument obfuscation order: “powershell.exe -NoP -NonI -ExecutionPolicy\nBypass”. We have only seen FIN7 and CopyPaste use this argument list for executing their malicious Powershell Scripts.\nBoth used decoy 302 HTTP redirections and typosquatting on their C2s (reminiscent of Cobalt and FIN7). The Empire\nC2s associated with CopyPaste had decoy redirections to Digitcert and Microsoft websites and used decoy job\nemployment and tax websites with decoy redirections to host their payloads. FIN7 and Cobalt used decoy 302 HTTP\nredirections too, FIN7 on its GRIFFON C2s before January 2018, and Cobalt, on its staging servers, similar to CopyPaste.\nQuite recently, FIN7 threat actors typosquatted the brand “Digicert” using the domain name digicert-cdn[.]com, which is\nused as a command and control server for their GRIFFON implants. CopyPaste, in turn, also typosquatted this brand with\ntheir domains digicertweb[.]com and digi-cert[.]org, both used as a Powershell Empire C2 with decoy HTTP 302\nredirects to the legitimate Digicert website.\nThe links between CopyPaste and FIN7 are still very weak. It is possible that the CopyPaste operators were influenced by\nopen-source publications and do not have any ties with FIN7.\nConclusions\nDuring 2018, Europol and DoJ announced the arrest of the leader of the FIN7 and Carbanak/CobaltGoblin cybercrime\ngroups. It was believed that the arrest of the group leader will have an impact on the group’s operations. However, recent\ndata seems to indicate that the attacks have continued without significant drawbacks. One may say CobaltGoblin and FIN7\nhave even extended the number of groups operating under their umbrella. We observe, with various level of confidence,\nthat there are several interconnected groups using very similar toolkits and the same infrastructure to conduct their\ncyberattacks.\nThe first of them is the well-known FIN7, which specializes in attacking various companies to get access to financial data or\nPoS infrastructure. They rely on a Griffon JS backdoor and Cobalt/Meterpreter, and in recent attacks, Powershell Empire.\nThe second one is CobaltGoblin/Carbanak/EmpireMonkey, which uses the same toolkit, techniques and similar\ninfrastructure but targets only financial institutions and associated software/services providers.\nWe link the AveMaria botnet to these two groups with medium confidence: AveMaria’s targets are mostly suppliers for big\ncompanies, and the way AveMaria manages its infrastructure is very similar to FIN7. The last piece is the newly discovered\nCopyPaste group, who targeted financial entities and companies in one African country, which lead us to think that\nCopyPaste was associated with cybermercenaries or a training center. The links between CopyPaste and FIN7 are still very\nweak. It is possible that the operators of this cluster of activity were influenced by open-source publications and do not\nhave any ties with FIN7.\nAll of the aforementioned groups greatly benefit from unpatched systems in corporate environments. They thus continue to\nuse effective spearphishing campaigns in conjunction with well-known MS Office exploits generated by the framework. So\nfar, the groups have not used any zero-days.\nFIN7/Cobalt phishing documents may seem basic, but when combined with their extensive social engineering and focused\ntargeting, they are quite successful. As with their previous fake company “Combi Security”, we are confident that they\ncontinue to create new personas for use in either targeting or recruiting under a “new” brand, “IPC”.\nMore information about these and related attacks is available to customers of Kaspersky Intelligence Reports. Contact:\nintelreports@kaspersky.com\nIndicators of compromise\nAveMaria\n185.61.138.249\ntain.warzonedns[.]com\nnoreply377.ddns[.]net\n185.162.131.97\n91.192.100.62\nserver.mtcc[.]me\ndoddyfire.dyndns[.]org\n212.8.240.116\n168.167.45.162\ntoekie.ddns[.]net\nwarmaha.warzonedns[.]com\nCopyPaste\ndigi-cert[.]org\nsomtelnetworks[.]com\ngeotrusts[.]com\nsecureclientupdate[.]com\ndigicertweb[.]com\nsport-pesa[.]org\nitaxkenya[.]com\nbusinessdailyafrica[.]net\ninfotrak-research[.]com\nnairobiwired[.]com\nk-24tv[.]com\nFIN7/GRIFFON\nhpservice-cdn[.]com\nrealtek-cdn[.]com\nlogitech-cdn[.]com\npci-cdn[.]com\nappleservice-cdn[.]com\nservicebing-cdn[.]com\ncisco-cdn[.]com\nfacebook77-cdn[.]com\nyahooservices-cdn[.]com\nglobaltech-cdn[.]com\ninfosys-cdn[.]com\ngoogle-services-s5[.]com\ninstagram-cdn[.]com\nmse-cdn[.]com\nakamaiservice-cdn[.]com\nbooking-cdn[.]com\nlive-cdn2[.]com\ncloudflare-cdn-r5[.]com\ncdnj-cloudflare[.]com\nbing-cdn[.]com\nservicebing-cdn[.]com\ncdn-yahooapi[.]com\ncdn-googleapi[.]com\ngoogl-analytic[.]com\nmse-cdn[.]com\ntw32-cdn[.]com\ngmail-cdn3[.]com\ndigicert-cdn[.]com\nvmware-cdn[.]com\nexchange-cdn[.]com\ncdn-skype[.]com\nwindowsupdatemicrosoft[.]com\nmsdn-cdn[.]com\ntesting-cdn[.]com\nmsdn-update[.]com\nEmpireMonkey/CobaltGoblinAPT REPORTS\nFIN7.5: the infamous cybercrime rig\n“FIN7” continues its activities\nBy Yury Namestnikov , Félix Aime  on May 8, 2019. 10:00 am\nIN THE SAME CATEGORY\nTurla renews its arsenal with Topinambour\n‘Twas the night before\nViceLeaker Operation: mobile espionage\ntargeting Middle East\nPlatinum is back\nZebrocy’s Multilanguage Malware Salad\n1\n2\n3\n4\n5\n6\n7 \n HTTP/1.1 302 Found \n Server: nginx \n Date: [retracted ] \n Content -Type: text/html; charset =UTF-8 \n Content -Length: 0 \n Connection : keep-alive \n Location : https://cloud.google.com/cdn/  \n \nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\n English\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPR GET IN TOUCH\n "
}