{
    "title": "fin7 evolution and the phishing lnk _ fireeye inc",
    "text": " PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚȚħřěǻț Řěșěǻřčħ\nFİŇ7 Ěvǿŀųțįǿň ǻňđ țħě Pħį șħįňģ ĿŇĶ\nǺpřįŀ 24, 2017 | bỳ Ňįčķ Čǻřř, Șǻřǻvǻňǻň Mǿħǻňķ ųmǻř, Ỳǿģěșħ Ŀǿňđħě, Bǻřřỳ Věňģě řįķ, Đǿmįňįķ Ẅěbě ř\nČỲBĚŘ ČŘİMĚ \nMǺĿẄǺŘ Ě \nČǺŘBǺ ŇǺĶ \nFİŇ7 \nBǺČĶĐǾǾŘ  \nPĦİȘĦİŇĢ\nFİŇ7 įș ǻ fįňǻňčįǻŀŀỳ-mǿțįvǻțě đ țħřěǻț ģřǿųp țħǻț ħǻ ș běěň ǻ șșǿčįǻțěđ ẅįțħ mǻŀįčįǿ ųș ǿpěřǻțįǿňș đǻțįňģ bǻčķ țǿ\nŀǻțě 2015 . FİŇ7 įș řěfěřřěđ țǿ bỳ mǻňỳ věň đǿřș ǻș “Čǻřbǻňǻķ Ģ řǿųp”, ǻŀțħǿ ųģħ ẅě đǿ ňǿț ěq ųǻțě ǻŀŀ ųșǻģě ǿf\nțħě ČǺŘBǺ ŇǺĶ bǻčķ đǿǿř ẅįțħ FİŇ7. FįřěĚỳě řěčěňțŀỳ ǿb șěřvěđ ǻ FİŇ7 șpěǻř pħįșħįňģ čǻmpǻįģň  țǻřģěțįňģ\npěřșǿňňěŀ įňvǿŀvě đ ẅįțħ Ųňįțě đ Șțǻțěș Șěčųřįțįěș ǻňđ Ěxčħǻňģě Čǿmmį șșįǿň (ȘĚČ) fįŀįňģ ș ǻț vǻřįǿųș ǿřģǻňįżǻțįǿňș.\nİň ǻ ňěẅŀỳ-įđěňțįfįěđ čǻmpǻįģň, F İŇ7 mǿđįfįěđ țħěįř pħįșħįňģ țěčħňįq ųěș țǿ įmpŀěměňț ųňįqųě įňfěčțįǿň ǻň đ\npěřșįșțěňčě měčħǻňį șmș. FİŇ7 ħǻș mǿvěđ ǻẅǻỳ fřǿm ẅěǻpǿňįżěđ Mįčřǿșǿfț Ǿffįčě mǻč řǿș įň ǿřđěř țǿ ěvǻ đě\nđěțěčțįǿň. Țħį ș řǿųňđ ǿf FİŇ7 pħįșħįňģ ŀųřěș įmpŀěměňț ș ħįđđěň șħǿřțčųț fįŀěș (ĿŇĶ fįŀěș) țǿ įňįțįǻțě țħě įňfěčțįǿň\nǻňđ VBȘčřįpț fųňčțįǿňǻŀįțỳ ŀǻ ųňčħěđ bỳ mșħțǻ.ěxě țǿ įňfěčț țħě vįčțįm.\nİň țħįș ǿňģǿįňģ čǻmpǻįģň, F İŇ7 įș țǻřģěțįňģ ǿ řģǻňįżǻțįǿňș ẅįțħ șpěǻř pħįșħįňģ ěmǻįŀ ș čǿňțǻįňįňģ ěįțħě ř ǻ mǻŀįčįǿ ųș\nĐǾČX ǿ ř ŘȚF fįŀě – ț ẅǿ věřșįǿňș ǿf țħě șǻmě ĿŇĶ fįŀě ǻň đ VBȘčřįpț țěčħňįq ųě. Țħěșě ŀųřěș ǿřįģįňǻțě f řǿm\něxțěřňǻŀ ěmǻįŀ ǻ đđřěșșěș țħǻț țħě ǻțțǻčķě ř řǻřěŀỳ řě-ųșěđ, ǻňđ țħěỳ ẅěřě șěňț țǿ vǻ řįǿųș ŀǿčǻțįǿň ș ǿf ŀǻřģě\nřěșțǻųřǻňț čħǻįň ș, ħǿșpįțǻŀįțỳ, ǻň đ fįňǻňčįǻŀ șěřvįčě ǿřģǻňįżǻțįǿňș. Țħě șųbjěčțș ǻňđ ǻțțǻčħměňț ș ẅěřě țħěmě đ ǻș\nčǿmpŀǻįňț ș, čǻțěřįňģ ǿřđěřș, ǿř řěșųměș. Ǻș ẅįțħ přěvįǿųș čǻmpǻįģň ș, ǻňđ ǻș ħįģħŀįģħțě đ įň ǿųř ǻňňųǻŀ M-Țřěňđș\n2017 řěpǿřț, FİŇ7 įș čǻŀŀįňģ șțǿřěș ǻț țǻřģěțěđ ǿřģǻňįżǻțįǿňș țǿ ěňșųřě țħěỳ řěčěįvěđ țħě ěmǻįŀ ǻň đ ǻțțěmpțįňģ țǿ\nẅǻŀķ țħěm țħ řǿųģħ țħě įňfěčțįǿň p řǿčěșș.\nİňfěčțįǿň Čħǻįň\nẄħįŀě F İŇ7 ħǻș ěmběđđěđ VBĚ ǻș ǾĿĚ ǿbjěčțș fǿř ǿvěř ǻ ỳěǻř, țħěỳ čǿňțįň ųě țǿ ųpđǻțě țħěį ř șčřįpț ŀǻųňčħįňģ\nměčħǻňį șmș. İň țħě čųřřěňț ŀųřěș, bǿțħ țħě mǻŀįčįǿ ųș ĐǾČX ǻň đ ŘȚF ǻțțěmpț țǿ čǿňvįňčě țħě ųșěř țǿ đǿųbŀě-čŀįčķ\nǿň țħě įmǻģě įň țħě đǿčųměňț, ǻ ș șěěň įň Fįģ ųřě 1. Țħįș șpǻẅňș țħě ħįđđěň ěmbě đđěđ mǻŀįčįǿ ųș ĿŇĶ fįŀě įň țħě\nđǿčųměňț. Ǿvě řǻŀŀ, țħįș įș ǻ mǿřě ěffěčțįvě pħį șħįňģ țǻčțįč șįňčě țħě mǻŀįčįǿ ųș čǿňțěňț į ș ěmběđđěđ įň țħě\nđǿčųměňț čǿňțěňț řǻțħěř țħǻň pǻčķǻģě đ įň țħě ǾĿ Ě ǿbjěčț.\nBỳ řěqųįřįňģ țħįș ųňįqųě įňțěřǻčțįǿň – đǿųbŀě-čŀįčķįňģ ǿň țħě įmǻģě ǻň đ čŀįčķįňģ țħě “Ǿpěň” b ųțțǿň įň țħě șěčųřįțỳ\nẅǻřňįňģ pǿp ųp – țħě pħį șħįňģ ŀųřě ǻțțěmpț ș țǿ ěvǻ đě đỳňǻmįč đěțěčțįǿň ǻ ș mǻňỳ șǻňđbǿxěș ǻřě ňǿț čǿňfįģ ųřěđ\nțǿ șįmųŀǻțě țħǻț șpěčįfįč ųșěř ǻčțįǿň.\nFįģųřě 1: Mǻŀįčįǿ ųș FİŇ7 ŀųřě ǻșķįňģ vįčțįm țǿ đǿųbŀě čŀįčķ țǿ ųňŀǿčķ čǿňțěňț ș\nȚħě mǻŀįčįǿ ųș ĿŇĶ ŀǻųňčħěș “mșħțǻ.ěxě” ẅįțħ țħě fǿŀŀǿ ẅįňģ ǻřģųměňțș pǻșșěđ țǿ įț:\nvbșčřįpț:Ěxěčųțě(\"Ǿň Ěřřǿř Řěșųmě Ňěxț:șěț ẅ=ĢěțǾbjěčț(,\"\"Ẅǿ řđ.Ǻppŀįčǻțįǿň\"\"):ěxěč ųțě\nẅ.ǺčțįvěĐǿč ųměňț.Șħǻpě ș(2).ȚěxțFřǻmě.ȚěxțŘǻňģě.Țěxț:čŀǿ șě\")\nȚħě șčřįpț įň țħě ǻ řģųměňț čǿmbįňě ș ǻŀŀ țħě țěxțbǿx čǿňțěňț ș įň țħě đǿčųměňț ǻň đ ěxěčųțěș țħěm, ǻ ș șěěň įň\nFįģųřě 2.\nFįģųřě 2: Țěxțbǿx įň șįđě ĐǾČ\nȚħě čǿmbįňě đ șčřįpț fřǿm Ẅǿ řđ țěxțbǿx đřǿpș țħě fǿŀŀǿ ẅįňģ čǿmpǿňěňț ș:\n\\Ųșěřș\\[ųșěř_ňǻmě]\\ İňțěŀ\\58đ2 ǻ83f7778đ5.36783181 .vbș\n\\Ųșěřș\\[ųșěř_ňǻmě]\\ İňțěŀ\\58đ2 ǻ83f777942.26535 794.pș1\n\\Ųșěřș\\[ųșěř_ňǻmě]\\ İňțěŀ\\58đ2 ǻ83f777908.23270411.vbș\nǺŀșǿ, țħě șčřįpț čřěǻțěș ǻ ňǻmě đ șčħěđųŀě țǻșķ fǿř pěřșįșțěňčě țǿ ŀǻ ųňčħ “58đ2 ǻ83f7778đ5.36783181 .vbș” ěvěřỳ\n25 mįňųțěș.\nVBȘčřįpț #1\nȚħě đřǿppěđ șčřįpț “58đ2 ǻ83f7778đ5.36783181 .vbș” ǻčțș ǻș ǻ ŀǻųňčħěř. Țħįș VBȘčřįpț čħěčķ ș įf țħě\n“58đ2 ǻ83f777942.26535 794.pș1” PǿẅěřȘħěŀŀ șčřįpț įș řųňňįňģ ųșįňģ ẄM İ qųěřįěș ǻňđ, įf ňǿț, ŀǻ ųňčħěș įț.\nPǿẅěřȘħěŀŀ Șč řįpț\n“58đ2 ǻ83f777942.26535 794.pș1” įș ǻ mųŀțįŀǻỳěř ǿbfųșčǻțěđ PǿẅěřȘħěŀŀ șčřįpț, ẅħįčħ ŀǻųňčħěș șħěŀŀčǿđě fǿř ǻ\nČǿbǻŀț Șț řįķě șțǻģěř.\nȚħě șħěŀŀčǿđě řěțřįěvěș ǻň ǻđđįțįǿňǻŀ pǻỳŀǿǻ đ bỳ čǿňňěčțįňģ țǿ țħě fǿŀŀǿ ẅįňģ Č2 șěřvěř ųșįňģ ĐŇȘ:\nǻǻǻ.șțǻģě.14919005 .ẅẅẅ1 .přǿșŀř3[.]čǿm\nǾňčě ǻ șųččěșșfųŀ řěpŀỳ įș řěčěįvěđ fřǿm țħě čǿmmǻň đ ǻňđ čǿňțřǿŀ (Č2) șěřvěř, țħě Pǿ ẅěřȘħěŀŀ șčřįpț ěxěč ųțěș\nțħě ěmbě đđěđ Čǿbǻŀț Șț řįķě șħěŀŀčǿđě. İf ųňǻbŀě țǿ čǿňțǻčț țħě Č 2 șěřvěř įňįțįǻŀŀỳ, țħě șħěŀŀčǿđě įș čǿňfįģųřěđ țǿ\nřěǻțțěmpț čǿmm ųňįčǻțįǿň ẅįțħ țħě Č 2 șěřvěř ǻđđřěșș įň țħě fǿŀŀǿ ẅįňģ pǻțțě řň:\n [ǻ-ż][ǻ-ż][ǻ-ż].șțǻģě.14919005 .ẅẅẅ1 .přǿșŀř3[.]čǿm\nVBȘčřįpț #2\n“mșħțǻ.ěxě” f ųřțħěř ěxěčųțěș țħě șěčǿňđ VBȘčřįpț “58đ2 ǻ83f777908.23270411.vbș”, ẅħįčħ čřěǻțěș ǻ fǿŀđěř bỳ\nĢŲİĐ ňǻmě įň șįđě “İňțěŀ” ǻň đ đřǿpș țħě VBȘč řįpț pǻỳŀǿǻ đș ǻňđ čǿňfįģųřǻțįǿň fįŀě ș:\n\\İňțěŀ\\{BFF4 219Ě -Č7Đ1-2880 -ǺĚ58-9Č9ČĐ9701Č90}\\58đ2 ǻ83f777638.60220156 .įňį\n\\İňțěŀ\\{BFF4 219Ě -Č7Đ1-2880 -ǺĚ58-9Č9ČĐ9701Č90}\\58đ2 ǻ83f777688.78384945.pș1\n\\İňțěŀ\\{BFF4 219Ě -Č7Đ1-2880 -ǺĚ58-9Č9ČĐ9701Č90}\\58đ2 ǻ83f7776b5.64953395 .țxț\n\\İňțěŀ\\{BFF4 219Ě -Č7Đ1-2880 -ǺĚ58-9Č9ČĐ9701Č90}\\58đ2 ǻ83f7776ě0.72726761.vbș\n\\İňțěŀ\\{BFF4 219Ě -Č7Đ1-2880 -ǺĚ58-9Č9ČĐ9701Č90}\\58đ2 ǻ83f777716.48248237.vbș\n\\İňțěŀ\\{BFF4 219Ě -Č7Đ1-2880 -ǺĚ58-9Č9ČĐ9701Č90}\\58đ2 ǻ83f777788.86541308 .vbș\n\\İňțěŀ\\{BFF4 219Ě -Č7Đ1-2880 -ǺĚ58-9Č9ČĐ9701Č90}\\Fǿxčǿňň.ŀňķ\nȚħįș șčřįpț țħěň ěxěč ųțěș “58đ2 ǻ83f777716.48248237.vbș”, ẅħįčħ įș ǻ vǻřįǻňț ǿf F İŇ7’ș ĦǺĿFBǺĶ ĚĐ bǻčķđǿǿř.\nĦǺĿFBǺĶ ĚĐ Bǻčķđǿǿř Vǻřįǻňț\nȚħě ĦǺĿFBǺĶ ĚĐ mǻŀẅǻřě fǻmįŀỳ čǿň șįșțș ǿf mųŀțįpŀě čǿmpǿňěňț ș đěșįģňěđ țǿ ěșțǻbŀįșħ ǻňđ mǻįňțǻįň ǻ fǿǿțħǿŀ đ\nįň vįčțįm ňěț ẅǿřķș, ẅįțħ țħě ųŀțįmǻțě ģǿǻŀ ǿf ģǻįňįňģ ǻččě șș țǿ șěňșįțįvě fįňǻňčįǻŀ įňfǿ řmǻțįǿň. Țħį ș věřșįǿň ǿf\nĦǺĿFBǺĶ ĚĐ čǿňňěčț ș țǿ țħě fǿŀŀǿ ẅįňģ Č2 șěřvěř:\nħxxp:// 198[.]100.119.6:80/čđ\nħxxp:// 198[.]100.119.6:443/čđ\nħxxp:// 198[.]100.119.6:8080 /čđ\nȚħįș věřșįǿň ǿf ĦǺĿFBǺĶ ĚĐ ŀįșțěňș fǿř țħě fǿŀŀǿ ẅįňģ čǿmmǻň đș fřǿm țħě Č 2 șěřvěř:\nįňfǿ: Șěňđș vįčțįm mǻčħįňě įňfǿ řmǻțįǿň (ǾȘ, P řǿčěșșǿř, BİǾȘ ǻňđ řųňňįňģ p řǿčěșșěș) ųșįňģ ẄM İ qųěřįěș\npřǿčěșșĿįșț: Șěňđ ŀįșț ǿf přǿčěșș řųňňįňģ\nșčřěěňșħǿț: Țǻķěș șčřěěň șħǿț ǿf vįčțįm mǻčħįňě ( ųșįňģ 58đ2 ǻ83f777688.78384945.pș1)\nřųňvbș: Ěxěčųțěș ǻ VB șčřįpț\nřųňěxě : Ěxěčųțěș ĚXĚ fįŀě\nřųňpș1: Ěxěčųțěș PǿẅěřȘħěŀŀ șčřįpț\nđěŀěțě : Đěŀěțě țħě șpěčįfįěđ fįŀě\nųpđǻțě: Ųpđǻțě țħě șpěčįfįěđ fįŀě\nǺŀŀ čǿmm ųňįčǻțįǿň běț ẅěěň țħě bǻčķ đǿǿř ǻňđ ǻțțǻčķě ř Č2 ǻřě ěňčǿđěđ ųșįňģ țħě fǿŀŀǿ ẅįňģ țěčħňįq ųě,\nřěpřěșěňțěđ įň pșěųđǿ čǿđě:\nFųňčțįǿň șěňđ_đǻțǻ(đǻțǻ)\n                řǻňđǿm_șțřįňģ = čųșțǿm_fųňčțįǿň_țǿ_ģěňě řǻțě_řǻňđǿm_șțřįňģ()\n                ěňčǿ đěđ_đǻțǻ = ŲŘĿ Ěňčǿđě(Șįmpŀě Ěňčřỳpț(đǻțǻ))\n                pǿ șț_đǻțǻ(\"PǾȘȚ”, řǻňđǿm_șțřįňģ & \"=\" & ěňčǿ đěđ_đǻțǻ, Ħǻřđ_čǿđěđ_č2_ųřŀ,\nČřěǻțě_Řǻň đǿm_Ųřŀ(čŀǻșș_įđ))\nȚħě FįřěĚỳě įȘİĢĦȚ İňțěŀŀįģěňčě MỳȘ İĢĦȚ Pǿřțǻŀ čǿňțǻįň ș ǻđđįțįǿňǻŀ įňfǿ řmǻțįǿň bǻ șěđ ǿň ǿųř įňvěșțįģǻțįǿň ș ǿf ǻ\nvǻřįěțỳ ǿf țǿpįč ș đįșčųșșěđ įň țħįș pǿșț, įňčŀųđįňģ FİŇ7 ǻňđ țħě ĦǺĿFBǺĶ ĚĐ bǻčķđǿǿř. Čŀįčķ ħěřě fǿř mǿřě\nįňfǿřmǻțįǿň.\nPěřșįșțěňčě Měčħǻňį șm\nFįģųřě 3 șħǿẅș țħǻț fǿ ř pěřșįșțěňčě, țħě đǿčųměňț čřěǻțěș țẅǿ șčħěđųŀěđ țǻșķș ǻňđ čřěǻțěș ǿňě ǻųțǿ-șțǻřț\nřěģįșțřỳ ěňțřỳ pǿįňțįňģ țǿ țħě Ŀ ŇĶ fįŀě.\nFįģųřě 3: FİŇ7 pħįșħįňģ ŀųřě pěřșįșțěňčě měčħǻňį șmș\nĚxǻmįňįňģ Ǻțțǻčķě ř Șħǿřțčųț Fįŀěș\nİň mǻňỳ čǻ șěș, ǻțțǻčķě ř-čřěǻțěđ ĿŇĶ fįŀěș čǻň řěvěǻŀ vǻŀ ųǻbŀě įňfǿ řmǻțįǿň ǻbǿ ųț țħě ǻțțǻčķě ř’ș đěvěŀǿpměňț\něňvįřǿňměňț. Țħě șě fįŀěș čǻň bě pǻ řșěđ ẅįțħ ŀňķ-pǻřșěř țǿ ěxțřǻčț ǻŀŀ čǿňțěňț ș. ĿŇĶ fįŀěș ħǻvě běěň vǻŀ ųǻbŀě\nđųřįňģ Mǻň đįǻňț įňčį đěňț řěșpǿňșě įňvěșțįģǻțįǿň ș ǻș țħěỳ įňčŀ ųđě vǿŀųmě șěřįǻŀ ňųmběř, ŇěțBİǾȘ ňǻmě, ǻň đ MǺČ\nǻđđřěșș.\nFǿř ěxǻmpŀě, ǿňě ǿf țħě șě FİŇ7 ĿŇĶ fįŀěș čǿňțǻįňě đ țħě fǿŀŀǿ ẅįňģ přǿpěřțįěș:\nVěřșįǿň: 0\nŇěțBİǾȘ ňǻmě: ǻň đỳ-pč\nĐřǿįđ vǿŀųmě įđěňțįfįěř: ě2č10č40-6f7đ-4442-bčěč-47 0č96730bčǻ\nĐřǿįđ fįŀě įđěňțįfįěř: ǻ6ěěǻ972-0ě2f-11ě7-8b2đ-08002 73đ5268\nBįřțħ đřǿįđ vǿŀųmě įđěňțįfįěř: ě2č10č40-6f7đ-4442-bčěč-47 0č96730bčǻ\nBįřțħ đřǿįđ fįŀě įđěňțįfįěř: ǻ6ěěǻ972-0ě2f-11ě7-8b2đ-08002 73đ5268\nMǺČ ǻđđřěșș: 08:00:27:3đ:52:68\nŲŲİĐ țįměșțǻmp: 03/21/2017 (12:12:28.500) [ŲȚČ]\nŲŲİĐ șěqųěňčě ňųmběř: 2861\nFřǿm țħįș ĿŇĶ fįŀě, ẅě čǻň șěě ňǿț ǿňŀỳ ẅħǻț țħě șħǿřțčųț ŀǻųňčħěđ ẅįțħįň țħě șțřįňģ đǻțǻ, bųț țħǻț țħě ǻțțǻčķě ř\nŀįķěŀỳ ģěňě řǻțěđ țħįș fįŀě ǿň ǻ Vį řțųǻŀBǿx șỳșțěm ẅįțħ ħǿșțňǻmě “ǻň đỳ-pč” ǿň Mǻ řčħ 21, 2017.\nĚxǻmpŀě Pħį șħįňģ Ŀųřěș\nFįŀěňǻmě: Đǿč33.đǿčx\nMĐ5: 6ǻ5ǻ42ěđ234910121đ bb7đ199 4ǻb5ǻ5ě\nFįŀěňǻmě:  Mǻįŀ.řțf\nMĐ5: 1ǻ9ě113b2f3čǻǻ7ǻ141ǻ94č8bč187ěǻ7\nFİŇ7 Ǻpřįŀ 2017 Čǿmm ųňįțỳ Přǿțěčțįǿň Ěvěňț\nǾň Ǻpřįŀ 12, įň řěșpǿňșě țǿ FİŇ7 ǻčțįvěŀỳ țǻ řģěțįňģ m ųŀțįpŀě čŀįěňț ș, FįřěĚỳě ķįčķě đ ǿff ǻ Čǿmm ųňįțỳ Přǿțěčțįǿň\nĚvěňț (ČP Ě) – ǻ čǿǿ řđįňǻțěđ ěffǿřț bỳ FįřěĚỳě ǻș ǻ Șěřvįčě (FǻǻȘ), Mǻň đįǻňț, FįřěĚỳě įȘįģħț İňțěŀŀįģěňčě, ǻň đ ǿųř\npřǿđųčț țěǻm – țǿ șěčųřě ǻŀŀ čŀįěňț ș ǻffěčțě đ bỳ țħįș čǻmpǻįģň. \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n17 Mǻř 2020\n16 Mǻř 2020\n09 Mǻř 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐ\n Fįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nȘįx Fǻčț ș ǻbǿųț Ǻđđřěșș Șpǻčě\nĿǻỳǿųț Řǻňđǿmįżǻțįǿň ǿň\nẄįňđǿẅș \nȚħěỳ Čǿmě įň țħě Ňįģħț:\nŘǻňșǿmẅǻřě Đěpŀǿỳměňț Ț řěňđș \nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  FİŇ7 Ěvǿŀųțįǿň ǻň đ țħě Pħį șħįňģ Ŀ ŇĶ   \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě Ěňģŀįșħ\nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n "
}