{
    "title": "fin7 takes another bite at the restaurant industry",
    "text": "MOVING TARGET DEFENSE BLOG\nCYBERSECURITY TRENDS, EXPLORING MOVING TARGET DEFENSE\nAND PUTTING ENDPOINT THREAT PREVENTION FIRST\nTweetFIN7 TAKES ANOTHER BITE AT THE\nRESTAURANT INDUSTRY\nPosted by  MICHAEL GORELIK  on June 9, 2017\nFind me on:  \n \nINTRODUCTION\nOn June 7, 2017, Morphisec Lab identified a new, highly sophisticated fileless attack\ntargeting restaurants across the US. The ongoing campaign allows hackers to seize\nsystem control and install a backdoor to steal financial information at will. It\nincorporates some never before seen evasive techniques that allow it to bypass\nmost security solutions – signature and behavior based.\nAside from these updated techniques, Morphisec’s investigation revealed an almost\nperfect match to FIN7 attack methods. Past highly successful and damaging attacks\non banks, SEC personnel, large restaurant chains and hospitality organizations\nhave all been attributed to the financially-motivated FIN7 group . FIN7, which is also\nassociated with the Carbanak  gang, must be seen as one of the leading threat\nactor groups operating today.\nLike past attacks, the initial infection vector is a malicious Word document attached\nto a phishing email that is well-tailored to the targeted business and its day-to-day\noperations. The Word document executes a fileless attack that uses DNS queries to\ndeliver the next shellcode stage (Meterpreter). However, in this new variant, all the\nDNS activity is initiated and executed solely from memory – unlike previous attacks\nwhich used PowerShell commands.\nOpenDNS investigate data, shared in coordination with the Cisco Advanced Threat\nResearch & Efficacy Team, shows that this is a large-scale, currently active attack\nwith peaks of more than 10K DNS requests per hour.\nAlarmingly, the detection score on VirusTotal for all of the documents continues to\nbe 0/56 from the time the first documents were uploaded (1.6.2017) up until the\ndate of this publication. This means the attackers successfully bypass static analysis\nby most of the security solutions.\nBy contrast, Morphisec’s Moving Target Defense -based technology prevents the\nattack in its early stages, before any channel to the attacker is opened.\nTECHNICAL ANALYSIS\nBelow we describe the full technical details, beginning with the initial email through\nthe final Meterpreter session used to hijack the computer.\nPHISHING EMAIL:\nAs seen in the email below, FIN7’s attack campaign targets restaurants. The content\nof the email is well crafted to avoid suspicion. Some of the email attachments are\ncalled menu.rtf, others Olive Garden.rtf or Chick Fil A Order.rtf (all the identified\nhashes are listed at the end).\nWORD DELIVERY:\nThe attached .rtf file uses OLE and has many similarities to previous FIN7 attacks.\nBut this attack, instead of activating hta files (mshta.exe) from within the link,\nexecutes obfuscated JavaScript code. All the victim needs to do is double click on\nthe envelope and press OK.\nJAVASCRIPT CODE SNIPPETS:\nThe first stage JavaScript copies additional JavaScript code snippets in txt format\nfrom the RTF document into a random directory “C:\\Users\\<User Name>\\<Random\nguid>\\”. The same code snippets are combined into a second stage JavaScript in\n“C:\\Users\\<User Name>\\”. Additionally, the first stage JavaScript creates a scheduled\ntask that executes the second stage code within a minute – this delayed execution\nhelps to bypass behavior analysis since the second stage is not directly executed by\nthe first stage.\n \nPERSISTENCY:\nIn some cases, an additional scheduled task “AdobeFlashSync” is created for\npersistency. This task is executed every 25 minutes and will repeat the actions\ndescribed above – recreating the JavaScript code which later will create and\nexecute a PowerShell script (described below).\nSECOND STAGE JAVASCRIPT INTO POWERSHELL:\nThe second stage JavaScript creates a PowerShell file with the same name in the\nsame directory. Afterwards, it deletes its own JavaScript code traces .\n \n The PowerShell script executes a compressed first stage PowerShell child process,\nwhich then performs a second stage PowerShell process. The latter PowerShell\ninjects a shellcode into its own process using well-known CreateThread and\nVirtualAlloc techniques:\n \nSHELLCODE:\nThe shellcode phase of this attack is unique and demonstrates the\nconstantly advancing abilities of attackers. The shellcode is the primary\ndifferentiating technique between this campaign and past attacks by\nFIN7 and other threat actors .\nThis shellcode iterates over process environment block and looks immediately for\ndnsapi.dll name (xor 13) and its DnsQueryA function. Basically, FIN7 implemented a\nshellcode that gets the next stage shellcode using the DNS messaging technique\ndirectly from memory. This way they can successfully evade many of the behavior\nbased solutions.\nIn the DNS query pattern, it is very clear to see that alphabetical modification of the\nsubdomain prefix is used:\nEach such DNS query results in an additional snippet of shellcode being appended\nto a reallocated buffer. When, finally, the first stage shellcode receives a special “FF”\nsignal, it then executes the delivered shellcode. (It takes a few minutes for the DNS\nqueries to finish. The last query is to the subdomain\nihc[.]stage[.]12019683[.]ns2[.]true-deals[.]com):\n \nThe delivered second stage shellcode is encrypted:\nMETERPRETER:\nAfter decryption of the second stage shellcode, the shellcode deletes  the ‘MZ’\nprefix from within a very important part of the shellcode. This prefix indicates it may\nbe a dll, and its deletion helps the attack to evade memory scanning solutions .\nJust before this step executed, we extracted the dll from memory and uploaded it\nto VirusTotal. If this dll was saved on disk, many security solutions would\nimmediately identify it as a CobaltStrike Meterpreter, which is used by many\nattackers and pen testers. Having a Meterpreter session on a compromised\ncomputer allows for full control of the computer and exfiltration of any data, and in\nsome cases lateral movement inside the organization.\n \n \nCONCLUSIONS:\nFIN7 constantly upgrades their attacks and evasion techniques, thus becoming\neven more dangerous and unpredictable. The analysis of this attack shows, how\neasy it is for them to bypass static, dynamic and behavior based solutions. These\nattacks pose a severe risk to enterprises.\nFileless attacks are on the rise – Carbon Black reports  that researchers found a\n33% rise in severe non-malware attacks in Q4 2016 compared to Q1. Defenders will\nsee more attacks on their businesses by hacker groups utilizing memory for\nevasion while keeping executable artifacts far away from disk.\nIn this continuously evolving threat landscape, enterprises need to look for new\ndefenses that are resilient to such changes and are able to prevent fileless attacks.\nMorphisec Endpoint Threat Prevention  specializes in preventing in-memory\nattacks, using Moving Target Defense to make the target itself unpredictable.\n \nARTIFACTS:\nDocuments:\n2781526f6b302da00661b9a6a625a5a6ecf4ffccafa61202e9b0e9b61b657867\nc357396ca82fdcd6b6f46b748f2b6941051dbc81be5326cf9548e6e95507af7c\nffebcc4d2e851baecd89bf11103e3c9de86f428fdeaf0f8b33d9ea6f5ef56685\n \nDomains:\ntrue-deals[.]com; strikes-withlucky[.]com\nEmail account in registration is: isvarawski@yahoo.com\nAttacker email account: adrian.1987clark@yahoo.com\n \n \nSUBSCRIBE TO OUR BLOG\nStay in the loop with industry insight,\ncyber security trends, and cyber attack\ninformation and company updates.\nFIRST NAME\nLAST NAME\nEMAIL\nCOMPANY\nSUBSCRIBE\nSEARCH OUR SITE\nRECENT POSTS\nParallax: The New RAT on the Block\nRemote Employees O er Di erent\nSecurity Challenges\nWhy Client-Grade Technology\nDoesn't Cut It for Cloud Workload\nProtection\nTrickbot Delivery Method Gets a\nNew Upgrade Focusing on Windows\n10\nIntroducing the Morphisec Uni ed\nThreat Prevention Platform --\nVersion 4\nEndpoint Security Is Harder than\nEver\nTrickbot Trojan Leveraging a New\nWindows 10 UAC Bypass\nMorphisec Protects Customers\nAgainst Internet Explorer Scripting\nEndpoint Detection and Response Is\nNot the Next Step\nAre Guests Safe From a Hotel Data\nBreach?\nPOSTS BY TAG\nCyber Security (94)\nEndpoint Security (74)\nAttack Analysis (45)\nCyber Attacks (45)\nCompany News (38)\nSee all\nContact SalesABOUT US\nNews\nEvents\nCareers\nPARTNERS\nRESOURCESBLOG\nCONTACT\nUS\nSUPPORT\n© 2020 Morphisec Ltd. | All rights reserved | Privacy Policy    Share Like 0Share\nKeyword...\nPRODUCTS SOLUTIONS BY INDUSTRY SOLUTIONS BY USE CASE\nAdvanced Endpoint\nPrevention\nVirtual Desktop Protection\nCloud Workload Protection\nServer ProtectionSMB\nManufacturing\nFinance\nTechnology\nHealthcare\nLegalAntivirus Replacement\nRansomware Prevention\nVirtual Patching &\nCompliance\nPoint-Of-Sale Protection\nSupply Chain Attack\nProtection\nBrowser Attack Protection\nBLOGCONTACT US SUPPORT\nKeyword...\nREQUEST A DEMO PARTNERS RESOURCES PRODUCTS SOLUTIONS COMPANY\n "
}