{
    "title": "fin7 dissected_ hackers accelerate pace of innovation",
    "text": "MOVING TARGET DEFENSE BLOG\nCYBERSECURITY TRENDS, EXPLORING MOVING TARGET DEFENSE\nAND PUTTING ENDPOINT THREAT PREVENTION FIRST\nTweetFIN7 DISSECTED: HACKERS ACCELERATE\nPACE OF INNOVATION\nPosted by  MICHAEL GORELIK  on October 13, 2017\nFind me on:  \n \n \nPLEASE DOWNLOAD THE DETAILED ATTACK ANALYSIS IN PDF HERE\nLike clockwork, FIN7 again unleashed a new attack able to bypass almost every\nsecurity solution. The attack, which took place between October 8 to 10, 2017, is\nyet another demonstration of the high-paced innovation by threat actors.\nFIN7 is one of today’s most organized and sophisticated cybercrime groups,\nprimarily known for targeting US businesses to steal payment card data. They\ntypically use clever, customized spear-phishing lures with malicious attachments.\nOnce an organization is infected, they move laterally across the network, using\nvarious anti-forensic techniques to evade detection. The group is closely tied to the\nnotorious Carbanak Gang, responsible for a slew of attacks against financial\ninstitutions, although so far evidence falls short of directly equating the two.\nOver the past year, Morphisec has been closely monitoring FIN7 and their targets,\npublishing several analyses on methods used by this group. In June 2017\nMorphisec identified a highly sophisticated fileless attack targeting restaurants\nacross the US, as discussed on Morphisec’s blog  and in a post  co-authored with\nCisco Talos. The June campaign used a new stealer DLL variant injected into\nmalicious documents.\nIn this report we take a broader approach, describing in detail the rapid dynamic\nchanges over the course of the last four months, including the recent October\nattack, which was first documented by researchers at Icebrg . We examine each of\nthe component modifications in the attack chains, and show how those changes\nhelped FIN7 evade the dynamic behavior patterns and static patterns applied by\nmany security solutions.\nIn fact, a presentation on FIN7 by FireEye at this year’s InfoSecurity Europe  stated\nthat “In most environments, prevention is not possible.” The presenters, however,\ndid not take into account the effectiveness of Moving Target Defense solutions (e.g.\nMorphisec Endpoint Threat Prevention solution) against these types of attacks.\nThe technical analyses, available for download here , discusses:\nDOCUMENT STRUCTURE\nSTAGE 1: LNK FILE – OLE OBJECT\nLNK FILE – PROPERTIES CODE CONTENT\nLNK FILE – FILE DETAILS / BATCH FILE DETAILS\nSTAGE 2 – OLE AUTOMATION\nSHAPE.TEXTFRAME.TEXT\nSTAGE 3 – SCHEDULED TASKS\nSTAGE 4 – NETWORK BASED DETECTION EVASION\nSTAGE 5 - POWERSHELL – REFLECTIVE DLL INJECTION\nYOU CAN DOWNLOAD THE PDF OF THE DETAILED REPORT HERE.  SUBSCRIBE TO OUR BLOG\nStay in the loop with industry insight,\ncyber security trends, and cyber attack\ninformation and company updates.\nFIRST NAME\nLAST NAME\nEMAIL\nCOMPANY\nSUBSCRIBE\nSEARCH OUR SITE\nRECENT POSTS\nParallax: The New RAT on the Block\nRemote Employees O er Di erent\nSecurity Challenges\nWhy Client-Grade Technology\nDoesn't Cut It for Cloud Workload\nProtection\nTrickbot Delivery Method Gets a\nNew Upgrade Focusing on Windows\n10\nIntroducing the Morphisec Uni ed\nThreat Prevention Platform --\nVersion 4\nEndpoint Security Is Harder than\nEver\nTrickbot Trojan Leveraging a New\nWindows 10 UAC Bypass\nMorphisec Protects Customers\nAgainst Internet Explorer Scripting\nEndpoint Detection and Response Is\nNot the Next Step\nAre Guests Safe From a Hotel Data\nBreach?\nPOSTS BY TAG\nCyber Security (94)\nEndpoint Security (74)\nAttack Analysis (45)\nCyber Attacks (45)\nCompany News (38)\nSee all\nContact SalesABOUT US\nNews\nEvents\nCareers\nPARTNERS\nRESOURCESBLOG\nCONTACT\nUS\nSUPPORT\n© 2020 Morphisec Ltd. | All rights reserved | Privacy Policy    Share Like 0Share\nKeyword...\nPRODUCTS SOLUTIONS BY INDUSTRY SOLUTIONS BY USE CASE\nAdvanced Endpoint\nPrevention\nVirtual Desktop Protection\nCloud Workload Protection\nServer ProtectionSMB\nManufacturing\nFinance\nTechnology\nHealthcare\nLegalAntivirus Replacement\nRansomware Prevention\nVirtual Patching &\nCompliance\nPoint-Of-Sale Protection\nSupply Chain Attack\nProtection\nBrowser Attack ProtectionBLOGCONTACT US SUPPORT\nKeyword...\nREQUEST A DEMO PARTNERS RESOURCES PRODUCTS SOLUTIONS COMPANY\n "
}