{
    "title": "footprints of fin7_ pushing new techniques to evade detection - gigamon atr blog",
    "text": " \n  \n  \n Terms & Agreement Privacy Policy Cookie Policy ©Gigamon 2020Home  » Threat Research  » Footprints of Fin7: Pushing New Techniques to Evade Detection\nApplied Threat Research Team, Gigamon\n October 8, 2017Footprints of Fin7: Pushing New Techniques to Evade\nDetection\nThe Gigamon Applied Threat Research (ATR) team actively tracks threat activity associated with FIN7, a financially motivated actor targeting the\nretail industry. FIN7 has been constantly adapting their phishing documents in order to evade detection — their latest update has initial detections\non VirusTotal of 0/59 and 1/59 for the RTF and DOCX formats, respectively.\nFIN7 leverages a number of targeted phishing techniques to initially exploit victims in the retail sector. Once they have an initial foothold the actor\npivots to Point of Sale systems and steals large quantities of protected card data. In August, the Gigamon ATR team  released a large set of\nindicators of compromise (IOCs)  for infected document payloads that displayed similar infection characteristics and techniques to each other.\nRecently, the Gigamon ATR team  observed a shift in techniques including a modified payload that uses a new embedded file type. Additionally,\nFIN7 has modified the obfuscation utilized by their HALFBAKED backdoor — likely to avoid detection in new or ongoing campaigns.\nWhile the newly observed malicious documents do not represent a “new” attack methodology, the change of payload may cause detection issues\nfor legacy signatures and heuristic detections which utilize overly strict detection mechanisms, lacking in durability or layered coverage. This post\ndetails the newly observed methods and provides indicators associated with the identified infection documents. This will enable retail companies\nto validate their detections and leverage this intelligence to determine if they’ve been impacted by new campaigns.\nShifting Techniques\nInitial Payload\nIn past versions of infection documents, the Gigamon ATR team observed the actor primarily utilize malicious shortcut files (LNK) or visual basic\nscripts (VBS or VBE) to achieve code execution from within their lure. These malicious files are embedded into the infection documents using the\nObject Linking and Embedding (OLE) framework within Windows, which allows objects from one application to be included in another.\nIn the documents released today, FIN7 appears to have pivoted from using OLE embedded LNK files to using OLE embedded CMD files. When\nexecuted, the CMD file writes JScript to “tt.txt” under the current user’s home directory. The batch script then copies itself to “pp.txt”, also under the\ncurrent user’s home directory, before running WScript using the JScript engine on the file. This JScript code will read from the file “pp.txt”, skipping\nthe first four lines (the CMD code itself), but otherwise evaluating anything after the first character for each line in the file.\nAlthough different in implementation, this is a familiar technique, as FIN7 frequently runs commented out code that they read as a string through\nthe use of JScript’s “eval” function.\nBoth CMD and LNK file formats result in code execution, but the shift towards using CMD files may indicate a desire to stay ahead of detection\nauthors.\nHalfbaked Obfuscation Change\nOver the course of the past year, the actor’s unique backdoor, HALFBAKED, has continued to morph to improve capabilities and reduce detection\nsurface. In the newest observed version, the Gigamon ATR team  observed a slight tweak in the obfuscation strategy.\nPreviously, different stages of the HALFBAKED codebase utilized base64 encoding, stored in a string array variable called “srcTxt”. The attacker\nnow obfuscates that name and continues to break up the base64 string into multiple strings within an array as seen in Figure 1.\nFigure 1:\nBase64 encoded chunk of the new HALFBAKED functionality\nNew Halfbaked Feature\nAdditionally, the HALFBAKED backdoor now includes a built-in command called “getNK2”, seen here in HALFBAKED’s command list (Figure 2).\n“getNK2” is designed to retrieve the victim’s Microsoft Outlook email client auto-complete list. This may suggest the actor’s desire to obtain new\nphishing targets within a victim organization. If any of these new targets fell victim to the phishing lure, it would allow FIN7 to increase their\nfoothold within a victim organization’s network and potentially pivot to new areas.\nFigure 2:\nHALFBAKED commands including the recent getNK2 addition\nThe command “getNK2” is likely named after outlook’s NK2 file , which contains a list of auto-complete addresses for Microsoft Outlook 2007 and\n2010. Newer versions of outlook no longer use the NK2 file , so FIN7 has also written functionality to handle newer versions of Outlook within the\nsame “getNK2” command. The command will execute the JScript function in Figure 3 on the victim system.\nFigure 3:\ngetNK2 command functionality\nConclusion\nDetection authors must make trade-offs to optimize signature performance; narrow signatures lead to high fidelity detections, but risk missing\nchanges in actor behaviors, meanwhile broader detection patterns provide better coverage, at the risk of more false positives. Combatting a well-\nresourced and adaptive adversary requires a layered approach of both signature styles.\nFIN7 has demonstrated that they are highly adaptable, evading detection mechanisms while impacting a number of large US retail companies\nover an extended period of time. The Gigamon ATR team  will continue to remain vigilant, working to understand FIN7 and empower our customers\nand affected industries to defend themselves.\nThis article was written by ATR team members Alex Sirr  and Spencer Walden.\nGigamon Insight  is a network security analytics solution that offers a SaaS capability that enables customers to gain and utilize widespread\nnetwork visibility for security operations. As part of its research, the Gigamon ATR team coordinates disclosure of security threats and\nvulnerabilities with relevant parties in order to maximize both the response and victim remediation efforts as well as working to truly improve the\nsecurity of customers and other victims prior to publishing blog posts. To learn more about the Gigamon ATR team, please\nvisit www.gigamon.com/research/applied-threat-research-team.html .\nWeb Page\nApplied Threat Research Team\nWeb Page\nGigamon Insight\nE-Book\nA sampling of malicious email attachments\nPress Release\nGigamon Deploys Research Team\nPost comments, ask questions, join the discussion at the Gigamon Community's Network Detection & Response section . SEARCH\nLearn More\nGet to Know the Gigamon Applied Threat Research\nTeam\nAccelerate Network Response and Detection with\nGigamon Insight\nGain Insight Into Your Cloud Workloads with\nGigaSECURE Cloud\nWhy Gigamon Network Packet Broker Beats\nSoftware on Generic Hardware\nMost Popular Posts\nAdobe Flash Zero-Day Exploited In the Wild\nABADBABE 8BADF00D: Discovering BADHATCH and\na Detailed Look at FIN8’s Tooling\nThree Families in Three Days – Revisiting Prolific\nCrimeware To Improve Network Detection: Emotet\nMalicious Chrome Extensions Enable Criminals to\nImpact Half a Million Users and Global Businesses\nEmotet: Not your Run-of-the-mill Malware\nThree Families in Three Days – Revisiting Prolific\nCrimeware To Improve Network Detection: TrickBot\nTags\nAdobe  conference  DCOM  detection  detection engineer\ndetection maintenance  Detection Specificity Spectrum  emotet\nExploitation  File Analysis  FIN8 Flash malware\nmalware detection  network detection  network forensics\nthreat actors  threat detection\nthreat research  trickbot  TTPs zero-day\nCOMPANY\nAbout Us\nBlogs\nCareers HIRING!\nCustomers\nEvents\nLeadership Team\nNewsroom\nOfficesGET HELP\nCommunity\nContact Sales\nPartner Portal\nSupport & ServicesPRODUCTS & SOLUTIONS\nApplication Intelligence\nGigaSMART\nGigaVUE HC Series\nNetFlow Generation\nNetwork Taps\nSSL/TLS Decryption\nThreat Detection and Response\nVisibility Fabric Management and\nAutomationPOPULAR LINKS\n2019 Cyberthreat Defense Report\n2019 IHS Report\nCrimeware Trends Report\nFeatured Webinars\nFirst Step to Visibility\nFree Trials and Demos\nGigamon Product Comparison\nNetwork Visibility Guide\nSORT BY CATEGORY\n All | Case Study | Detection | Threat Research | Trend Reports\n EN       Products Solutions Partners Support Customers Resources CompanyFREE\nTRIALSCONTACT\nSALES\nThis site uses cookies for analytics, personalized content and ads. By continuing to browse this site, you agree to this use. Read Our Policy\n "
}