{
    "title": "freezer paper around free meat _ securelist",
    "text": "Share post on:BeEF Wrapped Up and Delivered in 2016\nIn late February 2016, a University website in Iran stood out for thoroughly vetting its current and potential students and\nstaff. The University’s web site served repackaged content from the Browser Exploitation Framework  (BeEF) with embedded\nJavaScript content maintaining the potential to hook visitors’ web browsers, identify visited websites and domains, explore\nfor vulnerabilities (we did not observe any auto-pwning), and provide tracking through evercookies. Even a partial listing of\nvisited sites can be sensitive and valuable information, and this sort of “sites visited” data gathering via other techniques, like\nscreengrabbing and keylogging, were observed in past APT incidents like the Madi  campaigns . Currently, it’s advisable\nto avoid the site .\nThe embedded BeEF content appears not to be fully configured, and only partially implemented. Perhaps a limited data set\nwas of interest for this attacker, or this was an early attempt at deploying BeEF.\nThis incident is interesting because at the same time and a bit earlier, another group was heavily relying on repackaging open\nsource offensive security product in their toolset by deploying both BeEF and Metasploit-produced components across a\nselect set of strategic web compromises. This particular APT has years of low-tech elaborate social engineering schemes\nand re-purposed open source efforts under its belt.\nWhile we call them the NewsBeef APT, they have been reported in the past as Charming Kitten or Newscaster in 2014,\nsocial engineering their way into sensitive circles of trust with spoofed LinkedIn profiles and phony news media\norganizations.\nThey continue to be highly active, but this time, they are using a slightly more technical toolset. On one hand, they have\ndeveloped skills or discovered tools to compromise select web applications and sites, supporting their watering hole\ncampaigns. On the other hand, they have repackaged leaked bot source code and repackaged open source Metasploit and\nPowerSploit components to produce and administer backdoors and downloaders.\nNewsbeef/Newscaster will find a way to compromise a web site, usually the vulnerability appears to be CMS related, in an\noutdated WordPress plugin, Joomla version, or Drupal version. Attackers usually perform one of two things, Newsbeef has\nbeen performing the first of the two:\ninject a src or iframe link into web pages or css sheets\ninject the content of an entire BeEF web page into one of the internally linked javascript helpers\nThe injected link will redirect visitors’ browsers to a BeEF server. Usually, the attackers deliver some of the tracking and\nsystem/browser identification and evercookie capabilities. Sometimes, it appears that they deliver the metasploit integration\nto exploit and deliver backdoors (we haven’t identified that exploitation activity in our ksn data related to this group just yet).\nSometimes, it is used to pop up spoofed login input fields to steal social networking site credentials. We also haven’t\ndetected that in ksn, but some partners have privately reported it about various incidents. But we have identified that\nattackers will redirect specific targets to laced Adobe Flash and other installers from websites that they operate.\nSo, the watering hole activity isn’t always and usually isn’t delivering backdoors. Most of the time, the watering hole\ninjections are used to identify and track visitors or steal their browser history. Then, they deliver the backdoors to the right\ntargets.\nIn addition to the University site and the NewsBeef APT, in the past couple of months, we identified a\nvariety of compromised sites around the world serving the BeEF. Most are cleaned up. Deployments to interesting and\nstrategic web sites and their true reach on a global scale appears to be on the increase:\nMiddle eastern embassy in the Russian Federation\nIndian military technology school\nHigh conflict regional presidency\nUkrainian ICS Scanner mirror\nEuropean Union education diversification support agency\nRussian foreign trade management organization\nProgressive Kazakh news and politics media\nTurkish news organization\nSpecialized German music school\nJapanese textile manufacturing inspection corporate division\nMiddle Eastern social responsibility and philanthropy\nsurprisingly popular British “lifestyle” blog\nAlgerian University’s online course platform\nChinese construction group\nRussian overseas business development and holding company\nRussian gaming developer forum\nRomanian Steam gaming developer\nChinese online gaming virtual gold seller\nBrazilian music instrument retailer\n \nBeEF Capabilities\nKey to these incidents are the development, distribution, and ease of use of toolkits like BeEF.\nBeEF itself is an open source collection of tools and tricks, some years old, that combined together can effectively hook a\nvisiting web browser for evaluation and full exploitation. Because of its capabilities, we have seen increased adoption of the\nframework for the past year or so.\nBrowser enumeration and reporting\nPlugin enumeration and reporting\nRetrieve visited domains (based on an old browser cache fetch timing trick)\nSocial engineering via live sessions and phishing within the browser\nNetwork exploration, discovery, and exfiltration tunneling\nMetasploit exploit integration and autopwning\nEvercookie deployment for persistent tracking – multiple platforms\nXSS evaluation and exploitation\nAt the same time, many of the techniques implemented are very old and public. The kit is extensible, customizable, and\nintegrates with metasploit for autopwnage. Some of the techniques were discussed during Jeremiah Grossman’s 2006\nBlack Hat conference presentation . The delay in deployment for techniques of this type indicates that some teams are\ndependent on open source tool packaging and ease of use. We have seen this sort of reliance on both open source\noffensive toolkits and legitimate software in the past from APT like Crouching Yeti , TeamSpy , and now the Newsbeef.\nFighting against the use of browser hooking frameworks for identification, tracking, live session social engineering, and\nprecision and auto-exploitation effectively requires a mix of technologies. When these JavaScript-based frameworks are\nused in a malicious manner, the combination of network and host based detection is required to fully handle more\nserious incidents.\nUnfortunately, these incidents are on the increase. You can disable JavaScript in your own browser with NoScript, but that’s\nmuch like just moving to Lynx or a text-based browser – people don’t want that because it kills functionality in the browser\nthey do want. A Chrome plugin that detects the BeEF cookie is easily evaded by serious players. And preventing the tracking\nmethods altogether is another whole ball of wax, because much of the functionality is tied into legitimate web pages by\nthird party marketers and retailers.\nPreventing the social engineering sessions for credential theft and Metasploit exploit integration makes immediate sense and\ncan be incorporated at the network and more effectively at the host level. AntiAPT can help wipe out most of an operation\non the network at scale, but these measures can be evaded as well. In other words, dealing with a determined attacker using\ntools like this one is difficult.\nReferences\nNEWSCASTER – An Iranian Threat Inside Social Media\nThe Browser Exploitation Framework Project\nMetasploit: Penetration Testing Software\nAPT CYBER ESPIONAGE  CYBERCRIME  TARGETED ATTACKS  VULNERABILITIES AND EXPLOITS  \nWEBSITE HACKS\nRelated Posts\nLEAVE A REPLY\nYour email address will not be published.  Required fields are marked *\nEnter your comment here\nName *\nEmail *\nSave my name, email, and website in this browser for the next time I comment.\n \nSUBMIT\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\n \nIN THE SAME CATEGORY\nAPT trends report Q3 2019\nCOMpfun successor Reductor infects\nﬁles on the ﬂy to compromise TLS traﬃc\nRecent Cloud Atlas activity\nAPT trends report Q2 2019\nTurla renews its arsenal with Topinambour\nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\nAPT REPORTS\nFreezer Paper around Free Meat\nRepackaging Open Source BeEF for Tracking and More\nBy GReAT  on April 27, 2016. 11:20 am\n \nNotify me when new comments are added.\n© 2020 AO Kaspersky Lab.  All Rights Reserved. \nRegistered trademarks and service marks are the property of their respective owners.\nContact us  | Privacy Policy  | License AgreementEmail\n I agree to provide my email address to “AO Kaspersky Lab” to\nreceive information about new posts on the site. I understand\nthat I can withdraw this consent at any time via e-mail by\nclicking the “unsubscribe” link that I find at the bottom of any e-\nmail sent to me for the purposes mentioned above.\nSUBSCRIBE\nHunting APTs with YARA\n Mokes and Buerak\ndistributed under the guise\nof security certificates\nOperation AppleJeus Sequel\nEnglish\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPRCompanyAccount GET IN TOUCHSolutions for: Home Products  Small Business 1-50 employees Medium Business 51-999 employees Enterprise 1000+ employees\n "
}