{
    "title": "grave vulnerabilità in microsoft office sfruttata dal gruppo cobalt - var group(1)",
    "text": "VAR NEWS COPERTURA TERRITORIALE JOB OPPORTUNITY CONTATTI AREA RISERVATA\nHOME IL GRUPPO SETTORI CASI DI SUCCESSO\nGrave vulnerabilità in Microsoft Ofﬁce sfruttata dal gruppo Cobalt\nUna campagna di malware , riconducibile al gruppo di cybercriminali Cobalt, sfrutta una storica vulnerabilità di Microsoft Office che permette di\navviare codice malevolo all’apertura di un documento , senza che sia necessaria alcuna interazione con l’utente.\nSi tratta di una vulnerabilità grave -  CVE-2017-11882  - perché può essere sfruttata per assumere il controllo completo su un sistema e riguarda le\nseguenti versioni:\nMicro Office 2007 SP3\nMicrosoft Office 2010 SP2 (32 bit)\nMicrosoft Office 2010 SP2 (64 bit)\nMicrosoft Office 2013 SP1 (32 bit)\nMicrosoft Office 2013 SP2 (64 bit)\nMicrosoft Office 2016 (32 bit)\nMicrosoft Office 2016 (64 bit)\nLa patch che corregge la vulnerabilità è già stata rilasciata da Microsoft lo scorso 14 novembre ma un numero significativo di  utenti\nha lasciato i loro sistemi senza patch, rendendoli vulnerabili a tali attacchi.\nCOME AVVIENE L'ATTACCO\nI cybercriminali hanno iniziato a diffondere il malware tramite  email di spam  dopo pochi giorni dalla scoperta della vulnerabilità. Il flusso può essere\nschematizzato nel seguente modo:\nApertura di email malevola creata ad arte e contenente un file con estensione RTF . Una volta aperto, il file contatta il server dove è ospitata la\nprima parte del payload.\nViene quindi eseguito il download della parte successiva, che provvede a scaricare la DLL corretta per l’architettura di sistema.\nCOME DIFENDERSI\nUna delle strategie possibili per mitigare il rischio di questa singola tipologia di attacco è quello di bloccare l’IP 104.254.99.77.\nÈ in ogni caso raccomandato applicare con urgenza le patch di sicurezza rilasciate di Microsoft per evitare che la stessa vulnerabilità\nvenga sfruttata anche in futuro.\n NEWSEventi\nNews\nRassegna Stampa\nComunicati Stampa\nVideo\nUltime News\nCertificati SSL: cosa acquistare\ne perché farlo\nCognitive Security Operation\nCenter\nConvention Var Group: tutto il\nmateriale dell'evento\nEventi in programma\nIntelligenza Artificiale: come\nusarla per far crescere il\nbusiness con Var Group e IBM\nVar Group S.p.A. - Via della Piovola, 138 - 50053 Empoli FI\nTel 0571 9988 - Fax 0571 998062 - Email: info@vargroup.it\nPart. IVA e Cod. Fisc. e n. Iscrizione al Registro Imprese di Firenze 03301640482\nCapitale sociale 3.800.000,00 € i.v - Numero Verde 800646543\nWEB & COOKIE POLICY CONDIZIONI GENERALI DI VENDITA CERTIFICAZIONI COPERTURA TERRITORIALE\n  \n "
}