{
    "title": "group of suckfly cyber-espionage targets indian private and government companies",
    "text": "PRODUCTS\nSPAMfighter\nSLOW-PCfighter\nFULL-DISKfighter\nDRIVERfighter\nVIRUSfighter\nSPYWAREfighter\nAnti spam / Anti virus business solutionsABOUT\nCompany\nContact us\nPress room\nSupport\nBlog\nSign up for newslettersPARTNERSHIPS\nBecome a partner\nBecome a reseller\nFind a reseller\nBecome an affiliate\nWhite Label SoftwareSOCIAL MEDIA\nFacebook\nTwitter\nYoutube\nLinkedIn\n© SPAMfighter 2003-2020    All rights reserved.    Privacy Statement     Sitemap\nPC Mac Business Solutions\nGroup of Suckfly Cyber-Espionage Targets\nIndian Private and Government Companies\nSymantec, a tech firm of cybersecurity, in recent times published the report\nmentioning Suckfly's activities. Suckfly is advanced cyber espionage group,\nwhich conducted various long-term campaigns of espionage against prominent\ntargets consisting commercial organisations and governments in India.\nSymantec identified several attacks happened during last two years, starting\nfrom April 2014. These attacks happened in many countries, however\nSymantec's investigation discovered that the main targets were organisations\nand individuals mainly located in India.\nSymantec identified many targets, which were very popular commercial\norganisations situated in India. The organizations include a big e-commerce\ncompany, one of the biggest financial organizations in India, two organizations\nof government and one of the top 5 IT firms in India. Suckfly devoted more\ntime in attacking government networks as compared to all barring one\ncommercial targets. Moreover, one of the 2 government organisations had the\nmaximum infection rate among the Indian targets.\nAll these targets are big corporations, which play a key role in the development\nof Indian economy. It would be very damaging for the organization if it receives\nattack. Thetechportal.com posted on May 18th, 2016, stating that Suckfly\ncould have had a much more effect on India and in its economy by targeting\neach and every of these organisations altogether.\nThe post also states that, an Indian organization (government) is connected\nwith central government departments of India, and is also accountable for\nimplementing software network in various departments and ministries. High\ninfection rate of the target is expected due to the organisation's access,\ninformation and technology, which it has on other government organisations in\nIndia.\nThe attacks by Suckfly on the government organizations, which provide\nservices regarding information technology to other branches of the\ngovernment, are not only confined to India.\nThe attacks by Suckfly begin with phishing emails, which deliver the booby-\ntrapped documents. These documents (files) exploit the CVE-2014-6332 to\ninfect target with Nidiran backdoor that the attackers use for installing\nHacktool, which is a password removal utility.\nCrooks then are using these passwords to search and scout the local network,\ncollect any possibly interesting data as well as use the backdoor another time\nto send it to the servers.\nSymantec observed that these attacks happened on weekdays only because\nthe group was definite to find various working people who will read spear-\nphishing emails.\n» SPAMfighter News - 5/25/2016\nDear Reader\nWe are happy to see you are reading our IT Security News.\nWe do believe, that the foundation for a good work environment starts with fast, secure and high performing\ncomputers. If you agree, then you should take a look at our Business Solutions to Spam Filter & Antivirus for even the\nlatest version of Exchange Servers - your colleagues will appreciate it!\nPress Releases  - IT Security News\nSPAMfighter\nSLOW-PCfighter\nFULL-DISKfighter\nDRIVERfighter\nVIRUSfighter\nSPYWAREfighter\nBusiness Solutions\nSupport\nPress room\nPartnership Programs\nBlog\nNewsletter Sign Up\nAbout us\nRecommend 65K-->\n Explore the latest news and trends\n "
}