{
    "title": "Group-IB_report_Cobalt",
    "text": " 11.2016COBALT   \nLogical attacks  \non ATMs\ngroup-ib.com\n 2Table of contents\nIntroduction 3\nKey findings 5\nInfection 9Provision of the malware survivability 13\nGaining privileges 15\nConsolidating control 20\nAttack on ATMs 22\nLinks to Buhtrap 28\nRecommendations 29IOС 31group-ib.com\n 3\nIn July 2016, a group of masked cyber-criminals cashed out 34 \nATMs operated by the First Bank, one of Taiwan’s largest banks. The \nperpetrators stole T$83.27 (over $2m USD). The criminals did not \nphysically damage the ATMs, nor did they use skimmers or bank cards. According to CCTV footage, the thieves used cellphones to \ntrigger the ATMs to automatically dispense money.  \nFollowing this, criminals used a similar scheme in August to steal \n12 million baht (around $350,000 USD) from the Government Savings Bank ATMs in Thailand. In September, the same kind of \nattacks were detected in Europe; however, this fact was not made \npublic. \nCybercriminals use a number of physical methods to conduct \nattacks on ATMs: skimming, shimming, card trapping, ATM thefts and physical access have become common. However, these \nmethods allow criminals to cash out only a single ATM and leave \nbehind a large amount of evidence. Introduction\nCriminals are actively seeking ways to \nreap ever-greater rewards and to lower risks: they have accordingly refocused \ntheir activity from physical threats to \nlogical attacks. group-ib.com\n 4Introduction\nTo perform a logical attack, hackers access a bank’s local network, \nwhich is further used to gain total control over ATMs in their system. \nCash machines are then remotely triggered to dispense money, \nallowing criminals to steal large amounts with relative ease.\nWith full control over ATMs, criminals can choose the exact attack \ntime to loot newly  filled ATMs. This results in millions of dollars \nlost, as in the case of the First Bank.  That said, such attacks do not \nrequire developing expensive advanced software – a significant amount of tools used by the hackers is widely available from public \nsources, as will be further covered later in this report.    \nThis report outlines how a currently active gang accesses cash \nmachines by infecting internal banking  infrastructure in Western and Eastern Europe, the CIS and the Asia-Pacific region. This summer’s wave of attacks appears \nto have been only a test to assess the potential of  logical attacks on ATMs.  \nThis is expected to become one of the  \nkey vectors of targeted attacks on banks. group-ib.com\n 5Key findings\nA criminal group, which Group-IB has dubbed Cobalt because \nof the framework they use, has been active since June 2016.  \nTheir key target are ATM control systems.  \nGeographical distribution\nAs of September 2016, Cobalt has attacked banks in Russia, the UK, the Netherlands, Spain, Romania, Belorussia, Poland, Estonia, \nBulgaria, Georgia, Moldova, Kyrgyzstan, Armenia, and Malaysia.  \n \nInfection vector\nTo get into the bank’s internal network, hackers use spear phishing emails with a malicious attachment. The emails purport to come \nfrom the European Central Bank, the ATM maker Wincor Nixdorf, \nor local banks.  \nCriminals send emails with attachments containing exploits and \npassword-protected archives with executable files. In the  attacks, \nphishing emails were sent from virtual servers, which had installed \nan anonymous mailing script “yaPosylalka v.2.0” (another name of the service is “alexusMailer v2.0”) developed by Russian-speaking \ncyber-criminals. \n \n Intrusion \nInstead of spending money to develop customized Trojans, \ncriminals use Cobalt Strike, a legitimate program designed to \nperform penetration testing. To compromise domain and local \naccounts, hackers use the Mimikatz tool or exploit a domain controller configuration error. group-ib.com\n 6\n \nThe methods criminals use to deliver phishing emails and to obtain \ncontrol over a domain controller are identical to those used by the \nBuhtrap group, which has conducted successful attacks against Russian banks, amounting to a total of 1.8 billion rubles ($25m), \nfrom August 2015 to January 2016 (their activity was covered in \nGroup-IB’s report published in March 2016).\n  Key findings\nAfter the group’s members were arrested in May 2016 while \nlaundering money, the Buhtrap botnet was sold to other hackers, \nwho are continuing attacks on Russian and Ukrainian companies.   \nPurportedly, at least a part of the Buhtrap group became Cobalt \nmembers, or more likely Buhtrap core members shifted their focus \nto attacks on ATMs.  \nAn ATM attack \nTo make ATMs give out cash, criminals launch malware using  Extensions  for Financial Services  (XFS)  standard. On \ncommand from the bank’s internal network, the program starts \ndispensing notes until machines are empty. It takes anywhere between 10 \nminutes and a week to obtain complete control over a domain controller. group-ib.com\n 7Key findings\nAfter each successful operation, the program records a specific \nlog (a file named disp.txt) with information on the number of \nbanknotes dispensed from the ATM cassette. The operator sends \nthis log file to the organizer, who uses this data to control the ‘jackpotting’ chain. \nOnce these actions are complete, hackers erase all malware traces \nusing SDelete, a legitimate free tool available on the Microsoft \nwebsite. The criminals also knock out internal bank servers using the MBRkiller malware capable of removing MBR (master boot \nrecord). Such a careful approach significantly complicates further \ninvestigation.\nThe program that makes ATMs spit out cash on demand is unique and \nis believed to be used by one hacker group only. \nThe criminals are known to have other malicious programs for \nattacks on cash machines; however, specialists have not managed \nto recover them. \nThe criminals are known to have other \nmalicious programs for attacks on cash machines; however, specialists have  \nnot managed to recover them. group-ib.com\n 8Key findings\nRecommendations\nLogical attacks can be detected and prevented at any stage by \nfollowing Group-IB’s recommendations:\nuse special systems designed to identify targeted attacks,\nsend suspicious emails for dynamic analysis in an isolated \nenvironment,\nmonitor new methods and attack tools using threat \nintelligence.\nIf you have detected trails of a targeted attack at any stage, you need to involve specialized companies for its analysis.  \n Incorrect responses to this type of attack will result in the bad actor activity remaining partly undetected allowing criminals achieve \ntheir goal – theft of cash.  \n group-ib.com\n 9Infection\nThe main infection vector in bank networks are phishing emails with \ndocuments attached containing exploits and password-protected archives \nwith executed files. \nCriminals send emails acting as the European Central Bank, the ATM maker \nWincor Nixdorf or local banks.  Although the sender’s address contains official \ndomains, in fact the messages are sent from a server with a specific script \nchanging the sender’s address, while real banks and ATM manufacturers are \nnot related to these mailouts. \nIn June phishing emails were sent from virtual servers with an installed \nanonymous mailing script “yaPosylalka v.2.0” (another name of the service is “alexusMailer v2.0”) developed by Russian-speaking cyber-criminals. \nThen perpetrators started using Cobalt Strike software, as will be covered  \nin this report.   \nPicture 1. \nPhishing email posing as the European Central Bank group-ib.com\n 10Infection\nPicture 2.   \nPhishing email posing as  \nWincor Nixdor fPicture 3. \nPhishing email posing as  \na Belarusian bank\nPicture 4. \nPhishing email posing as   \nа Russian bankgroup-ib.com\n 11Infection\nPerpetrators sent emails from two servers with IP addresses \n88.212.208.115 and 5.101.124.34. Both servers are located in Russia.\nThe methods used by criminals to deliver phishing emails are \nidentical to those used by the Buhtrap group, which conducted \nsuccessful attacks against Russian banks for a total amount of 1.8 \nbillion rubles ($25m) from August 2015 to January 2016. \n2016\nMARCH\nThe last conﬁrmed attack on a bank conducted \nby the Buhtrap group\nMAY\nArrest of the group laundering money for Buhtrap\nSEPTEMBER\nConﬁrmed thefts from ATMs outside Russia JUNE\nThe ﬁrst attack on a Russian bank using Cobalt Strike\nJULY\nAttacks on banks in Armenia, Belorussia, Poland, Germany \nAUGUST\nAttacks on banks in Georgia, Belorussia, Romania, Kyrgyzstan, Poland, Estonia, Spain, the Netherlands, the UK, Malaysia\nGet a free copy of \nthe report «Buhtrap. \nEvolution of trageted \nattacks on banks» on \ngroup-ib.com/reportsgroup-ib.com\n 12\nTo distribute malware in the Russian-speaking bank segment, \nthe criminals used attachments with the names “Договор_\nхранения2016.zip” (“Custodial_agreement2016.zip”) and “список \nдокументов.doc” (“document_list.doc”).  \nFor phishing attacks in other countries they used the \n“The rules for European banks.doc” and “Bitcoin ATM’s.\ndoc” files. The most widely-distributed file was a document \nsent acting as the European Central Bank in August 2016.  \nAn example of its upload to Virus Total is presented below.  Infection\nWe discovered a part of the emails sent from these servers and analyzed malicious attachments. Group-IB specialists also \nidentified related malware samples and checked from where \nmalicious files were being uploaded to Virus Total at the time of attack. That allowed us to identify the list of attack targets, which \nincludes banks in Russia, the UK, the Netherlands, Spain, Romania, \nPoland, Estonia, Bulgaria, Belorussia, Moldova, Georgia, Armenia, \nKyrgyzstan and Malaysia. \n group-ib.com\n 13\nThe email attachment contains malicious RTF files exploiting the CVE-\n2015-1641 vulnerability. That said, criminals use a standard shellcode \ngenerated by such penetration testing tools as Metasploit and Cobalt \nStrike.  \nIf the vulnerability is successfully exploited, the malicious module \nwill inject a payload named Beacon into memory. Beacon is a part of \nCobalt Strike, which is a multifunctional framework designed to perform penetration testing. The tool enables perpetrators to deliver the payload \nto the attacked machine and control it.  . \nTo stay undetected by standard IDS/IPS systems, Beacon creates covert \nchannels using DNS, HTTP, HTTPS protocols for communication with the \nC&C server over covert channels. \nPicture 6.  \nA list of commands for BeaconProvision of the malware \nsurvivability\nAfter the malicious attachment is launched, the malware starts providing for its \nsurvivability in the system, as outlined below: \n \n 11.\n2.group-ib.com\n 14\nIf an email with exploit fails to achieve its goals, the attackers send \nanother letter with a password-protected archive containing the same \nBeacon payload.\nThe payload is not saved as a file on disk but only exists in memory, which \nmeans it cannot run after the system is restarted.\n  \nTo keep permanent control over the infected system, a specific Beacon module automatically runs a scan for applications included in autorun to substitute them with executable files with the same names.  \nIn real attacks we observed that criminals replaced files named iusb3mon.\nexe (Intel(R) USB 3.0 eXtensible Host Controller) and jusched.exe (Sun \nJava Update Scheduler). As a result of such replacement, services \nautomatically launch malicious apps instead of legitimate programs.  \nHackers copy a library named crss.dll to the same directory where substituted .EXE files are located. Each time when the operating system \nstarts, the replaced applications download this library into memory. The \nmain goal of the library is to download the Beacon module into memory from the Internet. \n \n That is how the Trojan survivability is ensured. After each restart, the basic \nmodule of the operating system is removed. All the abovementioned steps are \nperformed automatically once a malicious attachment is launched. \nHowever, it is still necessary for bad actors to establish permanent access \nto the local network, should the victim shut down the infected computer or \nreinstall the operating system. This requires privilege escalation.Provision of the malware \nsurvivability\n3.\n4.group-ib.com\n 15Gaining privileges \nTo perform continuous reconnaissance of the bank’s local network and gain \naccess to isolated network segments and its information systems, the attacker \nneeds domain administrator privileges. The methods used by hackers to gain \nthese privileges are 100% identical to those used by the Buhtrap group. \nMethod №1 \nDomain controller configuration error\nStarting with Windows Server 2008 an addition functionality – Group Policy \nPreferences (GPP) – was added to group policies. GPP enables administrators \nto apply a variety of policies, such as to automatically assign a network drive \nwhen the user logs into his computer, update the default administrator account name, create new users, or change the registry, etc.\n \nActions such as adding a local user, connecting a network drive or printer \nmay require a specified password. When such policies are added on a single \ncomputer, they will be loaded with the specified password. The password that is encrypted using the AES-256 algorithm and further coded using Base64 \nencoding, is stored in the GPP Groups.xml configuration file. This XML-file is \ncreated in specific cases, for example, when the default administrator account is created or modified.\n \nThe file is stored on the domain controller in a subdirectory of the “SYSVOL” directory and, like the directory, it is available to any user in the domain.\n \nAttackers use Groups.xml to retrieve the domain administrator password  \nas follows:\nAfter obtaining access to the local network (the process is outlined in \nthe previous section), the attackers detect domain controllers, which are specified in the computer settings.\nWhen accessing the domain controllers, the hackers check the SYSVOL \ndirectory and the Groups.xml file, which is available via the following \npath: «\\\\[server_name]\\sysvol\\[domain_name]\\Policies\\[group_policy_\nname]\\Machine\\Preferences\\Groups\\Groups.xml»\n 1.\n2.group-ib.com\n 16\nThe perpetrators extract domain administrator credentials from the cpassword \nand userName fields in the Groups.xml file. The picture below shows how the encrypted password looks.\nPicture 7.  \nFragment of the \nGroups.xml filePicture 8. \nPassword encryption key published on \nMicrosoft MSDN website\nTo obtain an unencrypted password the attackers decode it using Base64. They receive the following string 4e9906e8fcb66cc9faf49310620ffee8f496e806cc057990209b09a433b66c1b —which is an AES-256 encrypted password.\nThis password is then decrypted using the key  \n4e9906e8fcb66cc9faf49310620ffee8f496e806cc057990209b09a433b66c1b, published on the official website Microsoft MSDN.Gaining privileges \n3.\n4.\n5.group-ib.com\n 17\nAfter the password is successfully decrypted, the hackers obtain access \nto the domain controller and using the method that is further covered in \nthis report, they can access a password for any account.\nMethod №2 \nMimikatz\n \nMimikatz is a well-known tool designed to extract unencrypted Windows \ncredentials for all client sessions through reading memory of the process \n“lsass.exe”, which requires local administrator privileges. The Mimikatz source \ncode is available on GitHub and built in to some penetration test tools, including Cobalt Strike. \nIf attackers have local administrator privileges and access to a domain \ncontroller  \nAfter attackers obtain access to a domain controller using method No.1, they launch Mimikatz on servers to collect unencrypted passwords for all \nadministrators of a specific server.  It was enough to run \nmimikatz sekurlsa::logonpasswords  \n \nfor all accounts and passwords to be displayed. Gaining privileges \n6.\nWith such configuration  \nof the domain controller, it takes 10 minutes to access it.group-ib.com\n 18Picture 9. \nResults of Mimikatz \noperation\nIf the attackers already have local root privileges without access to a domain \ncontroller\nWhen the attackers gets into the infected machine of an administrator, \nwho does not have access to the domain controller, they connect to other \nworkstations and servers with available account details and run Mimikatz until \nthey find a user with necessary rights.Gaining privileges \nWith local administrator \nprivileges, attackers can access a domain controller within 1 working day .group-ib.com\n 19\nIf the attackers do not have local administrator rights\nAs mentioned before, to run Mimikatz criminals need to access the lsass.exe process, \nwhich requires local administrator rights. If initial access is obtained by compromising an account without local administrator privileges, the hackers start exploits to improve \nlocal privileges. When necessary updates and patches are installed on the operating \nsystem, the attackers connect to other hosts with this domain account and check them for \nvulnerabilities that would allow them to escalate privileges to local administrator level.\n \nTo improve the rights and privileges in the local system attackers exploit the operating \nsystem vulnerabilities CVE-2014-4113, CVE-2015-1701, CVE-2015-2363 and CVE-2015-\n2426, which enables the criminal to gain SYSTEM level privileges in x32 and x64 operating \nsystems.\nMimikatz Golden TicketGroup-IB specialists did not discover the use of the following method by Cobalt, because \naccess to domain accounts solves all their problems, however they might use it in future attacks. The technique is to obtain a Golden Ticket, which gives maximum access to any \ndomain account with minimum privileges.\nActive Directory contains a system account krbtgt (Key Distribution Center Service \nAccount). The KRBTGT account is disabled by default and cannot be renamed, removed \nor used to enter a domain.\nWith access to a domain controller, the attackers can copy the entire Active Directory \ndatabase, for example, by running the command mimikatz.exe “privilege::debug” \n“lsadump::samrpc /patch” exit and extract NTLM hash of the krbtgt account.\nWith this hash and domain ID the criminals can use Mimikatz to create a file with a gold \nTGT ticket, which gives them access to any record in the domain.Gaining privileges \nIt takes from one day to one week \nto access a domain controller.group-ib.com\n 20Consolidating control over \nthe local network\n \nAfter the abovementioned steps, the criminals have remote access to the network and \nprivileges that allow them to perform any activity in the local network. The perpetrators \nthen look for a way to consolidate their control of the local system to collect data and establish redundant access channels should their activity be detected and the security \nservice take countermeasures.  \n \nConsolidating control over the infected machine/server \n \nThus, the attackers have at least one host with Beacon. They need to have access to \nmultiple computers, including those that do not have access to the Internet. To achieve \nthis goal, they build their own mini-network of infected computers inside the bank’s local network, which can be controlled through a single Cobalt Strike console installed on a \nremote server with the necessary functionality.\nThe process can be described as follows:\nHackers launch a Beacon version on hosts with access to the Internet, which \nestablishes a connection to the C&C server over a hidden channel. To prevent \ndetection of these communications by standard IDS/IPS systems, Beacon uses DNS, HTTP, HTTPS protocols. They allow for interaction with other hosts in the local \nnetwork. Let’s call them master-node. \nBanks usually have isolated hosts without access to the Internet, these are of most \ninterest to cybercriminals. Even if the host of a critical system has access to the web, \nany connections with a remote server will be suspicious for the security service. To \ncontrol these kind of hosts without detection the attackers use a specifically modified \nversion of Beacon, which can be controlled only over local network through SMB protocol via pipes. Let’s call them slave-node.\nCobalt Strike allows the attacker to connect the master-node and the slave-node \nthrough a dedicated channel over SMB protocol. Thus, the slave-node becomes \navailable in the remote central control console of Cobalt Strike, which means that \nisolated hosts gain access to the Internet through the master-node, which becomes a gateway for the slave-node.\nThis scheme enables the criminals to build a sustainable mechanism of continuous access \nto the attacked local system while remaining undetected. 1group-ib.com\n 21\nHTTP/HTTPS\nBeacon\nMaster-node\nHTTP/HTTPS\nBeacon\nMaster-nodeCentral \nCobalt Strike\nconsoleFirewallNetwork segment \nwith limited internet access\nSMB\nBeacon\nSlave-node\nSMB\nBeacon\nSlave-nodeSMB\nBeacon\nSlave-node\nSMB\nBeacon\nSlave-node\nCreating a redundant access channel\nAfter the local network and domain are successfully compromised, the attackers can use \nlegitimate channels to remotely access the bank, for example, by connecting to terminal servers or via VPN acting as an administrator or a standard user.\nDespite the fact that Cobalt Strike has a built-in VNC remote access module, the attackers \ntry to secure their position further and download a modified version of the TeamViewer \ninstaller, which is a legitimate remote access tool. Group-IB specialists have not managed to recover a complete version of the installer. We believe that its key difference from the \nofficial app is hiding notifications of implemented remote connection to the computer, as \nin attacks conducted by other criminal groups in Russia.Consolidating control over \nthe local network\nTo kick the attackers off the network, the security service should at least identify all hosts \nthat act as master-nodes, and remove them from the network simultaneously; otherwise, \nthe criminals have a chance to restart their activity within a few minutes. group-ib.com\n 22Attack on ATMs\nAccording to video footage recorded by security cameras, the attack on ATMs was \nperformed as follows: \nThe thieve came to ATMs with a mobile phone. \nHe made a telephone call and prepared a bag.\n \nIn a few minutes the ATM started to give out money in portions.\nWhen the ATM was empty, the criminal contacted partners and left the ATM.\nThe ATM was then rebooted.\nMoney withdrawals were performed by small groups of individuals, who moved \nbetween predetermined ATMs to cash out money within a timeframe of a few hours.  \n \nThis report will further outline the hacker activity performed beyond CCTV visibility.\n \nRoles of group members \nAccording to investigations of all incidents, hackers simultaneously attack several ATMs. It \ntakes at least a few days to get inside the bank’s system, compromise the entire network, \nunderstand from where ATMs can be accessed and evaluate how many cash mules are \nrequired to collect money. To support this process, the criminal group needs time and an organizational structure with roles and clear areas of responsibility.\nATTACK ORGANIZER\nAttack organizers are the core of any group. Usually they consist of one \nor two criminals who develop the scheme, hire people, assign roles, and \nprovide funding for the process. The most important task for the organizer is \nto control both operators and money mules, including the use of functional malware (see below).\nOPERATORS\nAre directly involved in breach of the bank’s internal networks of banks. \nThey send commands to ATMs to dispense money. Usually there are several \noperators, because they need to attack several banks simultaneously. \nOperators control the amount of dispensed money and report to the organizer.group-ib.com\n 23\nCASH-OUT ORGANIZER\n \nInteracts directly with the attack organizer without information about the \noperators. His task is to coordinate the actions of mules to withdraw money and control cashers. He is the person who money mules call to report \non money received from the ATM. He then informs the attack organizer \naccordingly.\nMONEY MULES (CASHERS)  \n \nHave with minimal technical skills and are not related to hacking banks. \nTheir main aim is to withdraw money from ATMs and report to the cash-out organizer, who remotely controls their activity. It is the mules, who are \narrested on evidence gathered from CCTV records.\nCASH -OUT ORGANIZERThe attack organizers communicate directly \nto coordinate the operation\nThe operators \nreport to theirorganizer only OPERATORSATTACK ORGANIZER\nThe mules \nreport to \nthe cash-out \norganizer only\n/bgAТМ /bgAТМ /bgAТМMULES\n$ $ $No contact \nbetween operators \nand mules $\nCentral Cobalt Strike\nconsole Attack on ATMs\n$\n$\nA few days after the attacks on First Bank’s ATMs, citizens of Latvia, Moldova and Romania \nwere arrested in Taipei. At least 13 suspects including several Russian citizens managed to \nleave the island. Mules often visit a country using tourist visas specifically to perform an \nattack and then leave it as soon as the operation is over.group-ib.com\n 24\nGaining access to ATMs\nAfter establishing control over the bank’s internal network and creating redun-\ndant access channels, the criminals search network segments, from which they \ncan gain access to ATMs, and workstations of bank employees who control ATMs. \nWith access to a necessary computer or server, the attackers use standard re-\nmote access tools applied in the bank. Usually, via Microsoft Remote Desktop \nProtocol. \nOnce access to ATMs is gained, they download a specific software to them, which \nallows criminals to control cash dispensers.\n \nSoftware for attacks on ATMs\nOnce criminals obtain remote access to the ATMs, they upload three files:\n \nThe del.bat script, which launches the SDelete program with required parameters.  \nContent of the del.bat scriptsdelete.exe -accepteula -p 32 d2.exe\nsdelete.exe -accepteula -p 32 xtl.exe\nsdelete.exe -accepteula -p 32 *.txtsdelete.exe -accepteula -p 32 d2s.exe\ndel sdelete.exe\ndel del.bat\nA legitimate program, SDelete (available on the Microsoft website). This is designed to delete files in a special manner making it impossible to recover them with a forensic investigation. \nA malicious program that uses standard functions for the XFS interface via \nthe XFS Manager (eXtensions for Financial Services). It is this program, which \non command from the bank’s internal network starts dispensing money.\nThe malware source code was not protected, which significantly simplifies its analysis and allows the criminal to adjust its operation. This means that the malware author did not plan its distribution and is likely a member of the attack \ngroup.Attack on ATMsgroup-ib.com\n 25\nCommand line arguments should be added in the following order:\nServiceLogicalName — a service name used as an argument for the WFSOpen function \n(for example, “Cash Dispenser Module”).\nCassettes Count — the total number of cassettes on the device. The value should be set \nin the interval from 1 to 15.\nCassette Number — the number of the cassette, which should dispense cash. The value \nshould be set in the interval from 1 to 15.\nBanknotes Count — the amount of banknotes to be dispensed from the cassette. The \nvalue should be set in the interval from 1 to 60.\nDispenses Count — the number of times cash dispenses should be repeated. The value \nshould be set in the interval from 1 to 60.The malicious program allows the hacker to use XFS API in order to connect to an ATM \ndispenser and send commands to deplete cash cassettes. It operates in accordance with \nthe arguments that are transmitted at startup. In total, there are five arguments, and the value for each of them should be specified.\nPicture 10. \nA piece of code designed for  \nparameter acceptance\nAttack on ATMsgroup-ib.com\n 26\nAll these values are indicated in the console by the operator, who is remotely \nconnected to the ATM. \nIf these arguments are correctly transferred, a message with parameters of \nfurther actions will be displayed. \nPicture 11. \nA piece of code designed for  \n log creationPicture 12. \nA piece of code designed for  \nfraud prevention\nThen an array is filled with each element corresponding to the cassette number on the device. The number of array elements should correspond to the total \namount of cassettes. The value in each massive element means the number of \nbanknotes that should be dispensed from a specific cassette. The counting of array elements starts from 1. \nDuring its operation, the program receives information about system time. In \nthe event it does not correspond to the time specified in the program code, the \nmalware stops its activity.\nFollowing this, the program produces a number of standard actions that should \nbe performed before cash dispenses, and if they are successful, the ATM gives out cash to the mule. This operation will be repeated as many times as specified in \nthe “Dispenses Count” argument.Attack on ATMsgroup-ib.com\n 27\nUpon successful completion of each operation, the program records the “Cassettes Count: \nBanknotes Count” text string in the file named “disp.txt” located in the same directory as the \nmalware, where “Cassettes Count” and “Banknotes Count” are values of the respective arguments.  \nSpecialists have detected two versions of this program. One version is named d2.exe, and another one is d2sleep.exe. The only difference between them is that \nthe second version makes ATMs dispense money with a small pause of 1 second. \nOnce an ATM is emptied, the operator launches the SDelete program, which removes files \nused with a special algorithm, which prevents information from being recovered. Thereafter, \nthe ATM restarts. In addition, operators disable the bank’s internal servers involved in the \nattack using the MBRkiller malware that removes MBR (master boot record). Such a careful approach significantly complicates further investigation. \n  \nEnsuring control over actors\n \nIn order to prevent operators from using the program to attack other ATMs without involvement \nof the organizer, its code contains built-in start time check. If the system time of the attacked \nATM does not correspond to the month indicated in the code, the commands will not be executed. The program will not generate errors, and the operators will not likely learn about \nsuch a built-in check.\nAfter each successful operation, the program records a specific log (a file named disp.txt) \nwith information on the number of banknotes dispensed from the ATM cassette. The operator sends this log file to the organizer, who uses this data to control the ‘jackpotting’ chain. Attack on ATMs\nPurportedly, hackers have other \nmalicious programs to attack ATMs.  The cellphones of arrested mules contained messages with six-digit codes. Normally, these \ncodes are sent by the organizer to activate the malware on a particular ATM. group-ib.com\n 28Links to Buhtrap\nIn May 2016, Buhtrap members were arrested while \nlaundering money. After that, thefts from accounts \nat banks using the Buhtrap Trojan stopped. However, \nthe Buhtrap botnet continued its malicious activity: in May, several companies that had been infected \nwith Buhtrap malware had money stolen.\nWhen investigating such incidents, we detected \ntwo versions of the Light Manager remote control in the infected networks: the first version had been \ninstalled for a long time (in some cases – more than \na year) together with the main malicious program, and the second version was installed in June 2016.\n \nGroup-IB specialists believe that just after the arrest of the Buhtrap group in May their botnet was sold to \nother criminals who are continuing its use to steal \nmoney from corporate accounts.\nThat said, according to our analysis of Cobalt attacks \non ATMs of Russian and European banks, the methods \nused by criminals to deliver phishing emails and \nobtain control over a domain controller are identical to those used by the Buhtrap group. \n \nPurportedly, at least a part of the Buhtrap group \nbecame Cobalt members, or more likely Buhtrap \ncore members shifted their focus to attacks on ATMs.    MARCH\nThe last conﬁrmed attack on \na bank conducted by the Buhtrap group \nMAY\nArrest of the group laundering money for Buhtrap\nSEPTEMBER\nConﬁrmed thefts from \nATMs outside Russia JUNE\nThe ﬁrst attack on a Russian \nbank using Cobalt Strike\nJULY\nAttacks on banks in Armenia, Belorussia, Poland, Germany \nAUGUST\nAttacks on banks in Georgia, Belorussia, Romania, Kyrgyzstan, Poland, Estonia, Spain, the Netherlands, the UK, MalaysiaRenewed attacks on companies using the Buhtrap botnet group-ib.com\n 29Recommendations\nAbsolutely all targeted attacks against banks could have been \ndetected and stopped at any stage. Below you will find simple \nrecommendations which enable you to prevent threats more \neffectively.\nPrevention at the intrusion stage\nThe key method of intrusion into the bank’s network is sending phishing emails with an attachment containing the exploit, or \nexecutable file in a password protected archive. To prevent infection \nresulting from this exploit’s operation it is enough to update Microsoft software regularly.\nThis group didn’t use zero day vulnerabilities; moreover, their exploits \nwere old. That’s why even standard software updates didn’t allow \nattackers to gain access to the corporate network. Some of the banks \nattacked are known not to have taken these security measures.\nIn cases when hackers were faced with updated software, they sent \nemails with documents attached containing password-protected \narchives with executed files. Such attacks can be blocked by \nquarantining suspicious emails for further dynamic analysis in isolated  \nenvironment.Generally, these recommendations can help \nyou prevent the attack, however, a bank can successfully minimize its financial risks only by tracking hacker group activity using threat intelligence and specialized solutions  designed to detect targeted attacks.group-ib.com\n 30\nPrevention at the implementation stage\nEven if the criminals have managed to obtain access to the bank’s \nnetwork, the attack can still be successfully prevented. It takes days \nand even months sometimes to implement all steps of the attack, \nand this time should be used to detect the malicious activity. \nCheck configuration of domain controller and presence of the Groups.xml file in the SYSVOL directory with an encrypted \npassword using a standard encryption key AES-256, as it is \ncovered in the “Gaining privileges” section.\nInstall integrity control software on ATMs.\n Check your systems by indicators of compromise presented in \nthe next section.\n \nIf you have detected trails of a targeted attack at any stage, you need \nto involve specialized companies for its analysis. Recommendations\nIncorrect responses to this type of \nattack may result in the attacker activity remaining partly undetected which \nenables criminals achieve their goals \n– theft of cash. group-ib.com\n 31\nIP addresses of the servers used to send phishing emails:\n88.212.208.115\n5.101.124.34\nNames of malicious attachments:The rules for European banks.doc\nBitcoin ATM’s.docДоговор_хранения2016.zip\nсписок документов.doc\nLinks to download Cobalt Strike’s Beacon:\nhxxp://korolev-okna.ru/beacon.exe\nhxxp://50.115.164.10/update.exe\nhxxp://176.31.79.123/~tolipresorts/nig.exe\nhxxp://durok.net/0x/1.exe\nhxxp://www.sport7boxe.com/METOO.exe\nhxxp://methninja.tk/private/hawkraw.exe hxxps://23.152.0.210/GizS\nIP addresses of the Cobalt Strike C&C servers:188.214.129.65\n94.130.120.17923.152.0.210\n95.215.45.221\n84.200.84.241\n95.183.51.24Indicators of compromisegroup-ib.com\n 32Indicators of compromise\n966cc404a4f6bf6d77565004a952b3e3 Cobalt Strike\ndb6a8169f55a20838c0ca6f383c11e23 Cobalt Strike\n7fa1af2adba39ef6efe0f870c057554d Cobalt Strike\n89889adb22c63186eb8c72323f34b1fd Cobalt Strike\n0d21832c171e817e947837bbfb67380e Cobalt Strike\n0c34ae326a8fd68d4a67ea3484b7cf81 Cobalt Strike\n555399c93b5f01fd9fad5f903da768d3 Cobalt Strike\n56487b799755f50c6e56c41870d43624 Cobalt Strike\nfe44c14403f36c6e451bda391a1d1ca7 Cobalt Strike\nd529218495f0318b99e60477368bb55e ATM malware program\nf5aea645966319c96d4dbcadce2a10e0 ATM malware program\n036faf1f7e39e44c0db25b9149b45786 MBRKiller\neb162cc34efae1cb621cc7157ef36514 Modified SDelete\nc91658349005a2f1c92a20132de38486 Cobalt Strike launcher from autorun\n3ea9ef46e89f07920d87255aef9261ba Cobalt Strike launcher from autorun\ncafab9cc40ad0bd1cbec2164e17c8216 Cobalt Strike beacon downloader\n35e0449cbe9fbe43e95b920c246828b2 Cobalt Strike beacon downloader\nbfb9688ac2747017c7975921ffe77be9 The rules for European banks.doc\nb175140a52aca83833a8203ac81e7475 The rules for European banks.doc\n712e11e5217ef06847ea96a83e952566 The rules for European banks.doc\n5d11c7b17633332b787992ee617d3552 The rules for European banks.doc\n9d443e225e21f160014e79b62c5aea3d Bitcoin ATM's.doc\n83dee40f12f67634c5da640f6d6f2efb Договор_хранения2016.zip\n1d07edbd16cbe529500c37245e613a47 Договор_хранения2016.exe\n3b2b116db9569f50c9e7a272c7530b18 список документов.docMD5 of malicious files:group-ib.com\n 33\nGIB Threat Intelligence subscribers are always on \nthe forefront and were made aware of the Cobalt activity in August 2016. Our reports included both \nphishing campaign details and payload analysis. The data we provided proved vital in preventing attacks against clients exposed to Cobalt risks.\n We help to prevent and investigate cyber attacks  \nat every stage, from reconnaissance or \npreparation to threat actors taking actions to achieve objectives. Furthermore, we prevent the spread of the attack and ensure that your infrastructure is clean of the presence of infection.\nThreat\nIntelligence\nLearn about threats, leakages, \nattacks, and hacking activity before \nthey can harm your business\nIncident  \nResponse\nCERT-GIB – 24/7 emergency \nresponse and effective incident \nmanagementTDS +  \nTDS Polygon\nDetect malicious incidents in your \ninternal network to prevent attacks, \nintrusions, data leaks, and espionage\nComputer Forensics  \nand Investigations\nThe largest computer forensics \nlaboratory in Eastern Europe,  \nwith an experienced investigation \nteam\nGroup-IB is one of the global leaders in preventing \nand investigating high-tech crimes and online fraud. Since 2003, the company has been active in the field of computer forensics and information security, protecting the largest international companies against financial losses and reputation risks.  We are recognized by Gartner as a threat intelligence vendor with strong focus on high-tech crime investigation and the ability to provide leading insight to the Eastern European region. Group-IB is recommended by the Organization for the Security and Co-operation in Europe (OSCE). \nLearn more on group-ib.com or get in touch now  \n+7 495 984 33 64.ABOUT GROUP-IB"
}