{
    "title": "gtic-monthly-threat-report-february-2018",
    "text": " \n  Page 1 of 8 \n ©2018 NTT Security  \nGlobal Threat Intelligence Center   \n \n  \n \n \n \n \n \nGTIC Monthly Threat  Report  \nFebruary 2018  \n \n \n \n \n \n \n \n \n \n \n \n  Page 2 of 8 \n ©2018 NTT Security  \nGlobal Threat Intelligence Center   \nContents  \nGTIC Observations  ................................ ................................ ................................ ................................ .........  3 \nHow does Agent Tesla work? ................................ ................................ ................................ .....................  3 \nTechnical Indicators  ................................ ................................ ................................ ................................ ... 4 \nCisco ASA Remote Code Execution Vulnerability  ................................ ................................ ..........................  5 \nOperation PZChao: Espionage Campaign with Cryptocurrency Mining Cap ability  ................................ .......  6 \nWhat does the group do?  ................................ ................................ ................................ ..........................  6 \nRansomware Refuses to Take a Backseat to Cryptocurrency Malware  ................................ ........................  7 \nTurla APT Updates Malware after  Public Advisories  ................................ ................................ .....................  7 \nAbout GTIC  ................................ ................................ ................................ ................................ .....................  8 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n  Page 3 of 8 \n ©2018 NTT Security  \nGlobal Threat Intelligence Center  GTIC Observations  \nIn February during an incident response case, responders provided GTIC researchers with a malware \nsample for analys is and reverse engineering. The sample turned out to be Agent Tesla  and contained \nthree stages, two droppers and a payload. After analysis, it was clear to GTIC  researchers that  keyloggers \nhave indeed come a long way and are now  fairly advanced, yet inexpensive.  \nHow does Agent Tesla work?  \nStage one  concatenates a series of st rings and decrypts them to become objects, finally decrypting the \nresource’s bytes into the second stage. During analysis, GTIC researchers  successfully step ped into the \nfinal object call , allowing for  the next stage to load for further analysis.  \nStage two  is named rp.dll  and facilitates dropping the Agent Tesla payload. Function and variable names \nare obfuscated by using Unicode characters. In this  case , all the function names were in Japanese. \nAdditionally, all strings were  obfuscated as byte arrays which  were  then deobfuscated via XOR. Google \ntranslates the function name as “To give up ”. \nSimilar to stage one , many of the grouped strings end ed up loading  as objects for decrypting  in the final \nstage.  The last object called the decryption function for  the fi nal payload which was then  dumped \ndirectly into a file for further analysis.  \nGTIC  researchers  determined s tage three  was the actual Agent Tesla malware. The malware puts the \ncurrent date in %APPDATA% \\des_date.txt  or, if that location is not available, depicts the  current date in  \n%TEMP% \\des_date.txt  if %APPDATA% . The functio n and variable names were heavily obfusc ated and \nessentially unreadable, requiring additional analysis . \nBy running the analyze d functions in Dot Net String Decoder (dnsd) , GTIC  resear chers  determine d the \ndecryption function.  Analysis indicated that the  decryptor  generates a password using the  PBKDF1 \nalgorithm  by passing the details shown in Figure 1 : \nPassword: amp4Z0wpKzJ5Cg0GDT5sJD0sMw0IDAsaGQ1Afik6NwXr6rrSEQE=  \nkey salt: aGQ1Afik6NampDT5sJEQE4Z0wpsMw0IDAD06rrSswXrKzJ5Cg0G=  \nhash name: SHA1  \nnumber of iterations: 2  \n \nFigure 1 . Credentials determined via Dot Net String Decoder (dnsd)  \n \nAfter this double pass of SHA 1 with the key and salt,  the first 32 bytes were  used as the key for AES -256 \nCBC, which allowed for  decryption of the encrypted string.  Rewriting the decryption routine for a  dnsd  \nplugin yielded quick results  by GTIC.  \n  \n  Page 4 of 8 \n ©2018 NTT Security  \nGlobal Threat Intelligence Center  The key, salt, h ash type, and initialization vector  are the first four  strings in the decrypted file. The \nlocation of the dropped malware is also listed as  \\nxp\\nxp.exe , all of which is in clear text. GTIC \nidentified r egistry changes for starting the malware at boot and  PowerShell (PS)  commands within the \nAgent Tesla malware itself during static analysis. Additionally, GTIC found  an email address and upload \ninformation for  Imgur.   \n \nUsing  dnsd  to replace all the strin gs in the original binary allowed for  deeper analysis with less \nobfuscation. Searching for the email address found in the strings yields the exfiltration mechanism.   \nOther exfiltration mechanisms were available for use but not configured  in this particular instance . \nAgent Te sla’s website states it supports exfiltration via  webpanel  (HTTP ), FTP upload, or  SMTP . All \nsamples received were analyzed by GTIC  and configured for exfiltration to the same  Gmail  \naccount.   Even though NTT Security researchers knew the username and password, the  email account \nwas set  up so only approved devices could log into the account.  Without knowing the backup account \nemail address, logging in was not possible.  The backup email address was listed \nasata••••••@pro•••••••.com, with the user needing  to fill in the  • values. As of 16 Feb 2018 , the \npassword to the original account has been changed from qwerty124 .  \n \nAgent Tesla shows that modern keyloggers are becoming increasingly complex  and more likely to be \nable to evade anti -virus (AV) software . Simple keyloggers will be immediately found by AV and \nprotection software. This malware contained several anti -analysis capabilities, including exiting if it \ndetermines it’s running in a virtual machine and searching running processes for unwanted applic ations.   \n \nAgent Tesla is also fairly inexpensive, costing $12 USD a month and up to $69 USD for an annual \nsubscription. Obtaining access to illegal software is growing simpler , especially now that \ncryptocurrencies are becoming more accessible to the genera l public.   \nTechnical Indicators  \n1.1.1 Email Addresses  \nariel[.]lee2000@gmail.com  \nata••••••@pro•••••••.com  \n \n1.1.2 SHA-256  \n0ebe6e46e01e2e368378c1966a6da262509fb469bf7e95be900e2827bd215202 (2018HC_Info.exe.txt ) \n61e8699ae6cab354502a1d0a557b7cf11eeb43c8101d6fc8dedb06160568 b565 (jri.exe ) \n66f979635aa9ac1ec8d0cf0c1add9b1e0572b91b1a979d13b189cc1d770064ed (Activity Survey.exe ) \n4981013848b272d53c3fc61a317f8896ba3f56c534db1e2363509423d6e044a3 (zmp.exe )  \n2279e2202d455baa0d1a8c2f43e36ba44d260d1c521d7b8af38389f051fbe61a  (Club Sponsor  Survey.exe  ) \n9245e2d83f6fb069ec3ea41d3c8bc5b0db09e2c175b480996a7b86948874a3bc (nxp.exe ) \n0b04b277485d364544aeb03d664eb68b48c97d381c7612aa05e7c3489be86401 (rp.dll )  \n  \n  Page 5 of 8 \n ©2018 NTT Security  \nGlobal Threat Intelligence Center  Cisco ASA Remote Code Execution Vulnerability  \nThreat Status:  Critical  \nCVE-2018 -0101  \n \nSeverity:  Critical (CVSS: 10)  \nDate:  16 Feb  2018  \nRemediation Details:  Cisco has released free software updates  that address the vulnerability  \nAffected Versions:   \n• 3000 Series Industrial Security Appliance (ISA)  \n• ASA 5500 Series Adaptive Security Appliances  \n• ASA 5500 -X Series Next -Generation F irewalls  \n• ASA Services Module for Cisco Catalyst 6500 Series Switches and Cisco 7600 Series Routers  \n• ASA 1000V Cloud Firewall  \n• Adaptive Security Virtual Appliance (ASAv)  \n• Firepower 2100 Series Security Appliance  \n• Firepower 4110 Security Appliance  \n• Firepower 4120  Security Appliance  \n• Firepower 4140 Security Appliance  \n• Firepower 4150 Security Appliance  \n• Firepower 9300 ASA Security Module  \n• Firepower Threat Defense Software (FTD)  \n• FTD Virtual (FTDv)  \nAnalyst Note: A vulnerability  in the XML parser of Cisco Adaptive Security Appliance (ASA) Software \ncould allow an unauthenticated, remote attacker to cause a reload of the affected system or to remotely \nexecute code. It is also possible that the ASA could stop processing incoming Virtual Private Network \n(VPN) authentication requests due to a low memory condition.  \nThe vulnerability is due to an issue with allocating and freeing memory when processing a malicious XML \npayload. An attacker could exploit this vulnerability by sending a crafted XML packet to a vulnerable \ninterface on an affected system. An exploit could allow the attacker to execute arbitrary code and obtain \nfull control of the system, cause a reload of the affected device or stop processing of incoming VPN \nauthentication requests.  \nTo be vulnerable the ASA must have Secure Socket Layer (SSL) services or IKEv2 Remote Access VPN \nservices enabled on an interface. The risk of the vulnerability being exploited als o depends on the \naccessibility of the interface to the attacker. For a comprehensive list of vulnerable ASA features please \nrefer to the table in the Vulnerable Products section.  \n \n  Page 6 of 8 \n ©2018 NTT Security  \nGlobal Threat Intelligence Center  Cisco has released software updates that address this vulnerability. There ar e no workarounds that \naddress all the features that are affected by this vulnerability.  \n \nOperation PZChao: Espionage Campaign with Cryptocurrency \nMining Capability  \nResearchers  recently reported on the possible return of an advanced persistent threat (APT) called Iron \nTiger (Emissary Panda/APT27/Threat Group  3390) . The group is  suspected to be linked to the People’s \nRepublic of China (PRC). The newest campaign, which began in July 2017, is nicknamed Operation \nPZChao, and researchers have observed  this campaign  targeting technology, educ ation, manufacturing, \ngovernment , and telecommunications organizations across APAC, Japan  and the United States.  \nThis APT has been active since at least 2010, originally focusing on dissident groups, particularly  those in \nHong Kong. Iron Tiger also targeted  other organizations in the APAC region, as well as government  \norganizations in the U nited States.  In 2013, the APT seemed to have shifted its focus, targeting primarily \nU.S. based techn ology and defense organizations.  \nThe newest campaign, which shows some  overlap in tools and command and control (C2) infrastructure \nused in previous operations, shows yet another shift in targeting – and, as mentioned above, focuses  \nprimarily on technology, education, manufacturing, government, and telecommunications organiz ations \nacross APAC, Japan, and the U.S.  \nThese shifts  appear to follow both the overall geopolitical interests of China  and generally align with  \neach new  Chinese  five-year plan.  \nWhat does the group do?  \nUsing custom malware, actors associated with Operation PZChao are capable of scraping  passwords , \nproviding e hackers with complete remote access and control of infected systems.  \nPZChao  attackers delivered  highly targeted spear -phishing emails containing a malicious VBS file, which \nretrieves second -stage payload s. \nCompromised targets are controlled with a network of malicious subdomains, each containing  the string \nPZChao . Of note, each of these subdomains is used for a specific task, such as malware delivery, upload \nor download, remote access control, etc.  \nThis c ampaign also leverages a Bitcoin miner, disguised as a java.exe  file. To avoid detection, the miner \nonly runs every three weeks early in the morning, with the Bitcoin  generated  likely used to fund the \ncampaign.   \n  Page 7 of 8 \n ©2018 NTT Security  \nGlobal Threat Intelligence Center  The primar y goal of Operation PZChao appears to be  cyber espionage, as suggested by the use of the \nGh0sT remote access Trojan (RAT), which can log keystrokes, listen remotely, scrape credentials, as well \nas modify  and exfiltrate files, and maintain  persistent access.  \nReferences  \nEspionage malware snoops for passwords, mines bitcoin on the side  \n \nRansomware Refuses to Take a Backseat to Cryptocurrency \nMalware  \nNearly every da y throughout February, the GTIC saw one or more stories trending across the globe \nconcerning the meteoric rise of cryptocurrency -mining malware.  \nThreat actors are propagating various types of this malware via a variety of channels – phishing, \nunpatched exp loits, plugin hijacking, and website code tainting, to name a few.  \nBut in all the hype surrounding this worrying trend, the very real threat of ransomware persists.  \nIn February, researchers identified a new CryptoMix variant which uses the .SYSTEM  extensio n and uses \ngenerally the same functionality as other CryptoMix varients.  \nSaturn ransomware burst onto the scene as well, and as of this writing, there is no known method (apart \nfrom paying the ransom) to decrypt the files. Researchers continue the hunt for  how Saturn \nransomware is being delivered.  \nAdditionally, there is a new strain of Gojdue ransomware dubbed ShurL0ckr which is incredibly difficult \nto detect, even for tools like VirusTotal, where only seven percent of anti -virus engines detected the \nnew ma lware.  \nReferences  \nCryptoMix Ransomware  \nSaturn Ransomware  \nGojdue Ransomware (ShurL0ckr)  \nTurla APT Updates Malware after Public Advisories  \nIn November 2017, the United Kingdom’s National Cyber Security Centre (NCSC) released an advisory  \nhighlighting suspected Russian Advance d Persistent Threat (APT) Turla Group’s use of the tools Neuron \nand Nautilus. The NCSC recently identified a new version of the Neuron malware, modified to evade \nprevious detection methods.   \n  Page 8 of 8 \n ©2018 NTT Security  \nGlobal Threat Intelligence Center  During its most recently identified campaign, which is designed to  embed Turla  into compromised \nnetworks and stealthily conduct espionage, Turla appears to have primarily set its sights on targets in \nthe UK, particularly Windows mail servers and web servers.  \nIt appears that the Neuron malware was updated five days after the NCSC published a public advisory  on \nTurla activity. This suggests a fast -moving threat actor who understands the slow reaction time for \nenterprise environments to patch or update def enses.  \nThe Neuron malware dropper mechanism was modified to avoid previous detection signatures \npublished by the NCSC. Analysts suspect that Turla is responding to public reporting on its indicators of \ncompromise (IoCs) and known tactics, techniques and p rocedures (TTPs). Alternatively, Turla may have \nhad limited success following the advisory, following the implantation of additional defensive measures.  \nThe sophisticated abilities of the group suggest that Turla is continually updating its attacks and \ndeveloping its TTPs. It may take some time to discover many of the Turla group’s newest IoCs.  \nIoCs and TTPs will continue to shift as mitigation efforts attempt to keep up. Until that time, although \nthe NCSC believes that it is likely that standard anti-virus software will detect an updated Turla payload, \nit is imperative for organizations to know what ‘normal’ network behavior looks like in their network \nenvironment, while continuing to monitor network logs and administrator -level accounts.  \nReferenc es \nNCSC Advisory: Turla group malware  \nTurla hacking group updated Neuron malware to attack UK organizations  \nAbout GTIC  \nThe NTT Security GTIC protects and informs NTT Security clients through security threat research, \nvulnerability analysis and the development of effective countermeasures. For more information, \nincluding vulner ability disclosures, threat reports and white papers, visit the resource  page on \nwww.nttsecurity.com  or our blog . \n \n "
}