{
    "title": "hackers plundered israeli defense firms that built ‘iron dome_u2019 missile defense system — krebs on security",
    "text": "ABOUT THE AUTHOR ADVERTISING/SPEAKING\nThe attackers\ninfiltrated and\ncopied the emails\nfor many of\nElisra’s top\nexecutives,\nincluding the CEO,\nthe chief\ntechnology officer\n(CTO) and multiple\nvice presidents\nwithin the\ncompany.\nMaybe a $100\nmillion security\nprogram can do all\nthese things well or\nmake progress\nagainst these types\nof attacks, but that\n80-person defense\ncontractor? Not so\nmuch.28\nJUL 14\n← Older CommentsThis entry was posted on Monday, July 28th, 2014 at 10:08 am and is filed under Data Breaches . You can\nfollow any comments to this entry through the RSS 2.0  feed. Both comments and pings are currently closed.Hackers Plundered Israeli Defense Firms that\nBuilt ‘Iron Dome’ Missile Defense System\nThree Israeli defense contractors responsible for building the “Iron Dome” missile shield\ncurrently protecting Israel from a barrage of rocket attacks were compromised by hackers and\nrobbed of huge quantities of sensitive documents pertaining to the shield technology,\nKrebsOnSecurity has learned.\nThe never-before publicized intrusions, which occurred between 2011 and 2012, illustrate the\ncontinued challenges that defense contractors and other companies face in deterring organized\ncyber adversaries and preventing the theft of proprietary information.\nA component of the ‘Iron Dome’ anti-missile system in operation, 2011.\nAccording to Columbia, Md.-based threat intelligence firm Cyber Engineering Services\nInc.  (CyberESI), between Oct. 10, 2011 and August 13, 2012, attackers thought to be\noperating out of China hacked into the corporate networks of three top Israeli defense\ntechnology companies, including Elisra Group , Israel Aerospace Industries,  and Rafael\nAdvanced Defense Systems .\nBy tapping into the secret communications infrastructure set up by the hackers, CyberESI\ndetermined that the attackers exfiltrated large amounts of data from the three companies.\nMost of the information was intellectual property pertaining to Arrow III missiles, Unmanned\nAerial Vehicles (UAVs), ballistic rockets, and other technical documents in the same fields of\nstudy.\nJoseph Drissel , CyberESI’s founder and chief executive, said the nature of the exfiltrated\ndata and the industry that these companies are involved in suggests that the Chinese hackers\nwere looking for information related to Israel’s all-weather air defense system called Iron\nDome.\nThe Israeli government has credited  Iron Dome with intercepting approximately one-fifth of\nthe more than 2,000 rockets that Palestinian militants have fired at Israel during the current\nconflict. The U.S. Congress is currently wrangling over legislation that would send more than\n$350 million to Israel to further development and deployment of the missile shield\ntechnology. If approved, that funding boost would make nearly $1 billion from the United\nStates over five years for Iron Dome production, according to The Washington Post .\nNeither Elisra nor Rafael responded to requests for comment about the apparent security\nbreaches. A spokesperson for Israel Aerospace Industries brushed off CyberESI’s finding,\ncalling it “old news.” When pressed to provide links to any media coverage of such a breach,\nIAI was unable to locate or point to specific stories. The company declined to say whether it\nhad alerted any of its U.S. industry partners about the breach, and it refused to answer any\ndirect questions regarding the incident.\n“At the time, the issue was treated as required by the\napplicable rules and procedures,” IAI\nSpokeswoman Eliana Fishler  wrote in an email to\nKrebsOnSecurity. “The information was reported to\nthe appropriate authorities. IAI undertook\ncorrective actions in order to prevent such\nincidents in the future.”\nDrissel said many of the documents that were stolen\nfrom the defense contractors are designated with\nmarkings indicating that their access and sharing is\nrestricted by International Traffic in Arms\nRegulations  (ITAR) — U.S. State Department\ncontrols that regulate the defense industry. For\nexample, Drissel said, among the data that hackers\nstole from IAI is a 900-page document that\nprovides detailed schematics and specifications for\nthe Arrow 3 missile .\n“Most of the technology in the Arrow 3 wasn’t\ndesigned by Israel, but by Boeing  and other U.S.\ndefense contractors,” Drissel said. “We transferred this technology to them, and they coughed\nit all up. In the process, they essentially gave up a bunch of stuff that’s probably being used in\nour systems as well.”\nWHAT WAS STOLEN, AND BY WHOM?\nAccording to CyberESI, IAI was initially breached on April 16, 2012 by a series of specially\ncrafted email phishing attacks. Drissel said the attacks bore all of the hallmarks of the\n“Comment Crew,” a prolific and state-sponsored hacking group associated with the Chinese\nPeople’s Liberation Army (PLA) and credited with stealing terabytes of data from defense\ncontractors and U.S. corporations.\nImage: FBI\nThe Comment Crew is the same hacking outfit profiled in a February 2013  report by\nAlexandria, Va. based incident response firm Mandiant , which referred to the group simply\nby it’s official designation — “ P.L.A. Unit 61398. ” In May 2014, the U.S. Justice\nDepartment  charged five prominent military members of the Comment Crew  with a raft of\ncriminal hacking and espionage offenses against U.S. firms.\nOnce inside the IAI’s network, Comment Crew members spent the next four months in\n2012 using their access to install various tools and trojan horse programs on systems\nthroughout company’s network and expanding their access to sensitive files, CyberESI said.\nThe actors compromised privileged credentials, dumped password hashes, and gathered\nsystem, file, and network information for several systems. The actors also successfully used\ntools to dump Active Directory data from domain controllers on at least two different domains\non the IAI’s network.\nAll told, CyberESI was able to identify and acquire more than 700 files — totaling 762 MB total\nsize — that were exfiltrated from IAI’s network during the compromise. The security firm said\nmost of the data acquired was intellectual property and likely represented only a small portion\nof the entire data loss by IAI.\n“The intellectual property was in the form of Word documents, PowerPoint presentations,\nspread sheets, email messages, files in portable document format (PDF), scripts, and binary\nexecutable files,” CyberESI wrote in a lengthy report produced about the breaches.\n“Once the actors established a foothold in the victim’s network, they are usually able to\ncompromise local and domain privileged accounts, which then allow them to move laterally on\nthe network and infect additional systems,” the report continues. “The actors acquire the\ncredentials of the local administrator accounts by using hash dumping tools. They can also use\ncommon local administrator account credentials to infect other systems with Trojans. They\nmay also run hash dumping tools on Domain Controllers, which compromises most if not all of\nthe password hashes being used in the network. The actors can also deploy keystroke loggers\non user systems, which captured passwords to other non-Windows devices on the network.”\nThe attackers followed a similar modus operandi in targeting\nElisra, a breach which CyberESI says began in October 2011\nand persisted intermittently until July 2012. The security\nfirm said the attackers infiltrated and copied the emails for\nmany of Elisra’s top executives, including the CEO, the chief\ntechnology officer (CTO) and multiple vice presidents within\nthe company.\nCyberESI notes it is likely that the attackers were going after\npersons of interest with access to sensitive information within\nElisra, and/or were gathering would be targets for future\nspear-phishing campaigns.\nDrissel said like many other such intellectual property\nbreaches the company has detected over the years, neither\nthe victim firms nor the U.S. government provided any\nresponse after CyberESI alerted them about the breaches at the time.\n“The reason that nobody wants to talk about this is people don’t want to re-victimze the\nvictim,” Drissel said. “But the real victims here are the people on the other end who are put in\nharm’s way because of poor posture on security and the lack of urgency coming from a lot of\nfolks on how to fix this problem. So many companies have become accustomed to low-budget\nIT costs. But the reality is that if you have certain sensitive information, you’ve got to spend a\ncertain amount of money to secure it.”\nANALYSIS\nWhile some of the world’s largest defense contractors have spent hundreds of millions of\ndollars and several years learning how to quickly detect and respond to such sophisticated\ncyber attacks, it’s debatable whether this approach can or should scale for smaller firms.\nMichael Assante , project lead for Industrial Control System (ICS) and Supervisory Control\nand Data Acquisition (SCADA) security at the SANS Institute , said although there is a great\ndeal of discussion in the security industry about increased information sharing as the answer to\ndetecting these types of intrusions more quickly, this is only a small part of the overall\nsolution.\n“We collectively talk about all of the things that we should be\ndoing better — that we need to have better security policies,\nbetter information sharing, better detection, and we’re laying\ndown the tome and saying ‘Do all of these things’,” Assante\nsaid. “And maybe a $100 million security program can do all\nthese things well or make progress against these types of\nattacks, but that 80-person defense contractor? Not so\nmuch. ”\nAssante said most companies in the intelligence and defense\nindustries have  gotten better at sharing information and at\nthe so-called “cyber counter-intelligence” aspect of these\nattacks: Namely, in identifying the threat actors, tactics and\ntechniques of the various state-sponsored organizations responsible. But he noted that most\norganizations still struggle with the front end of problem: Identifying the original intrusion and\npreventing the initial compromise from blossoming into a much bigger problem.\n“I don’t think we’ve improved much in that regard, where the core challenges are customized\nmalware, persistent activity, and a lot of noise,” Assante said. “Better and broader notification\n[by companies like CyberESI] would be great, but the problem is that typically these\nnotifications come after sensitive data has already been exfiltrated from the victim\norganization. Based on the nature of advanced persistent threats, you can’t beat that time\ncycle. Well, you might be able to, but the amount of investment needed to change that is\ntremendous.”\nUltimately, securing sensitive systems from advanced, nation-state level attacks may require a\ncompletely different approach. After all, as Einstein said, “We cannot solve our problems with\nthe same thinking we used when we created them.”\nIndeed, that appears to be the major thrust of a report released this month by Richard J.\nDanzig , a board member of the Center for New American Security . In “ Surviving on a\nDiet of Poison Fruit ,” (PDF) Danzig notes that defensive efforts in major mature systems have\ngrown more sophisticated and effective.\n“However, competition is continuous between attackers and defender,” he wrote. “Moreover,\nas new information technologies develop we are not making concomitant investments in their\nprotection. As a result, cyber insecurities are generally growing, and are likely to continue to\ngrow, faster than security measures.”\nIn his conclusion, Danzig offers a range of broad (and challenging) suggestions, including this\ngem, which emphasizes placing a premium on security over ease-of-use and convenience in\nmission-critical government systems:\n“For critical U.S. government systems, presume cyber vulnerability and design organizations,\noperations and acquisitions to compensate for this vulnerability. Do this by a four-part\nstrategy of abnegation, use of out-of-band architectures, diversification and graceful\ndegradation. Pursue the first path by stripping the ‘nice to have’ away from the essential,\nlimiting cyber capabilities in order to minimize cyber vulnerabilities. For the second, create\nnon-cyber interventions in cyber systems. For the third, encourage different cyber\ndependencies in different systems so single vulnerabilities are less likely to result in\nwidespread failure or compromise. And for the fourth, invest in discovery and recovery\ncapabilities. To implement these approaches, train key personnel in both operations and\nsecurity so as to facilitate self-conscious and well- informed tradeoffs between the security\ngains and the operational and economic costs from pursuing these strategies.”\nSource: Center for New American Security\nTags: Arrow III , Center for New American Security , Comment Crew , Cyber Engineering Services Inc. ,\nCyberESI , Eliana Fishler , Elisra Group , Iron Dome , Israel Aerospace Industries , Joseph Drissel , Rafael\nAdvanced Defense Systems , Richard J. Danzig\n138 comments \nMailing List\nSubscribe here\nRecent Posts\nCoronavirus Widens the Money\nMule Pool\nThe Web’s Bot Containment Unit\nNeeds Your Help\nLive Coronavirus Map Used to\nSpread Malware\nCrafty Web Skimming Domain\nSpoofs “https”\nMicrosoft Patch Tuesday, March\n2020 Edition\nAll About Skimmers\nClick image for my skimmer series.\nSpam Nation\nA New York Times Bestseller!\nThe Value of a Hacked PC\nBadguy uses for your PC\nTools for a Safer PC\nTools for a Safer PC\nThe Pharma Wars\nSpammers Duke it Out\nBadguy Uses for Your Email\nYour email account may be worth\nfar more than you imagine.\neBanking Best Practices\neBanking Best Practices for\nBusinesses\nMost Popular Posts\nSextortion Scam Uses Recipient's\nHacked Passwords  (1076)\nOnline Cheating Site\nAshleyMadison Hacked  (798)\nSources: Target Investigating Data\nBreach  (620)\nCards Stolen in Target Breach\nFlood Underground Markets  (445)\nReports: Liberty Reserve Founder\nArrested, Site Shuttered  (416)\nWas the Ashley Madison Database\nLeaked?  (376)\nTrue Goodbye: 'Using TrueCrypt\nIs Not Secure'  (363)\nWho Hacked Ashley Madison?\n(361)\nFollowing the Money, ePassporte\nEdition  (353)\nU.S. Government Seizes\nLibertyReserve.com  (315)\nCategory: Web Fraud 2.0\nInnovations from the Underground\nID Protection Services Examined\nIs Antivirus Dead?\nThe reasons for its decline\nThe Growing Tax Fraud\nMenace\nFile 'em Before the Bad Guys Can\nInside a Carding Shop\nA crash course in carding.\nBeware Social Security Fraud\nSign up, or Be Signed Up!\nHow Was Your Card Stolen?\nFinding out is not so easy.\nKrebs’s 3 Rules…\n...For Online Safety.\n© 2020 Krebs on Security.  Powered by WordPress .  Privacy Policy\n Subscribe to RSS\n Follow me on Twitter\n Join me on FacebookAdvertisement\njoni\nJuly 30, 2014 at 12:57 pm\ngod jobs brother china, u r the best, PRAY FOR GAZA….\nMr_bloke\nJuly 30, 2014 at 2:04 pm\n“Three Israeli defense contractors responsible for building the “Iron Dome” missile shield\ncurrently p ̶r̶o̶t̶e̶c̶t̶i̶n̶g̶ ̶I̶s̶r̶a̶e̶l̶ ̶f̶r̶o̶m̶ ̶a̶ ̶b̶a̶r̶r̶a̶g̶e̶ ̶o̶f̶ ̶r̶o̶c̶k̶e̶t̶ ̶a̶t̶t̶a̶c̶k̶s̶”\nI think you meant “murdering innocent civilians”.\nJCitizen\nJuly 30, 2014 at 2:37 pm\nCollateral damage has been greatly reducing as time goes on, and accuracy improves,\nbut I’m with anyone who wants to put pressure on any military to eliminate killing\n“innocent civilians” – whatever that term means.\nTommy\nJuly 30, 2014 at 2:58 pm\nThe Iron Dome is 100% defensive, built to protect the citizens of Israel from the\nterrorists next door who openly profess their goal of killing every Israeli and Jew.\nMaybe if Hamas had invested in similar defensive measures, or any defensive measures\nat all, they would not be suffering the casualties they are.\nMrDin\nAugust 1, 2014 at 12:41 pm\nUS should STOP supplying Israel, weapon and ammo\nJohn\nAugust 3, 2014 at 12:31 pm\nI’m pretty sure that stopping the illegal occupation of Palestinian land by Israel\nwould be the best solution.\nDavid Shields\nJuly 30, 2014 at 3:14 pm\nIron Dome is a purely defensive weapon, designed and manufactured by the U.S. The\nsystem is currently being used in Israel to protect Israeli Jews, Muslims, Christians, and\nDruze, from rockets being fired from Gaza. The success of Iron Dome augers well for\nthe possibility of sales of the system to other nations.\npaul\nAugust 2, 2014 at 8:14 pm\nit’s developed by Rafael Advanced Defense Systems from Israel.\nyeah read more. it’s free on the internet.\nSeymourB\nJuly 30, 2014 at 8:13 pm\nSomeone needs to work with Hamas to patent these ethnic-seeking missiles its created,\nwhich solely injure Jewish citizens of Israel and nobody else.\nOr you can admit that Hamas just fires rockets indiscriminately and don’t care who they\nkill, similar to their tunnel-based raids into surrounding territories.\nCommon Sense\nJuly 31, 2014 at 1:22 am\nMr. Bloke,\nThe innocent civilians are in Israel. Check your history and facts before you spew more\npropaganda. Clearly you represent the ignorant group who believe Israel wants to kill\ninnocents. Sadly, the terrorists use schools and mosques as bases of operations to\nlaunch their attacks. They also do not allow innocents to leave and were captured by\nGerman media beating and killing their own kind who were innocently trying to leave\nthe oppressive thumb of Hamas. Perhaps you should go there yourself and be educated\nfirst hand as clearly reading real reports is a challenge for people like you. When you\nget there, try escorting innocents out of Gaza in front of Hamas forces. I suspect you\nwill only then truly understand your ignorance of this terrible situation. Israel is forced\nto fight to protect itself. They have exercised far more restraint than they should.\nSadly, your ignorance is incapable of such restraint, so Shalom Mother Fucker to you\nand others who think like you.\nMrDin\nAugust 1, 2014 at 12:58 pm\n1. The educated adult do not call names on someone and using a profanity words.\n2. You hear the news, same others hear same news what you hear. Just depend on\nwhat side are you. NOTHING propaganda.\n3. Correct me if I’m wrong, Israel said “TO DEFENSE THEMSELVES”. if a man\npunch you on your face, so you defense yourself, by shooting him, and his family,\nand destroy his home.\nIsrael shoot more than 1300 civilians including hundreds of children in Gaza, and\ndestroy most building, and electric power. Is that you call “defense themselves”?\npaul\nAugust 2, 2014 at 8:24 pm\nso you think Hamas using Tunnels to enter Israel and killing civilians is okay?\nDon’t tell me you don’t watch that kind of random YouTube videos.\nNobody can justfy the innocents killed in any war. But only because they died\nmore in number doesn’t make thier side better. Also you can read everywhere on\nthe internet on different websites etc or even talk to people if you don’t believe\none source that they betrayed Israel many times and it’s not possible to make\npeace with people who just want to kill you and your family.\nI’m not Israeli and I’m not jewish, I’m not Muslim either but somebody starts a\nfight with our country then we’ll be the one to end it.\nFree Palastine from HAMAS.\nDigiDude\nAugust 3, 2014 at 7:14 am\nPaul, If IDF Puts Down It’s Weapons Tomorrow There’ll Be Peace n If\nPalestine Puts Down It’s Weapons Tomorrow There’ll Be No Palestine!\nAdam\nAugust 10, 2014 at 8:49 pm\nEnglish please?\nBruce\nJuly 31, 2014 at 1:41 pm\nMr_bloke you are quite misled by radical progressive propaganda. Israel is totally\nmoral and acting responsibly to protect its innocent citizens from the constant immoral\nattacks from those who have fled other Moslem countries and are not accepted back\nwhere they came from.\nPerhaps you should do yourself a favor and check out the real history instead of\npumping out nonsense.\nhttp://www.science.co.il/History-Palestine.php\nMargaret\nAugust 3, 2014 at 4:44 pm\nThe website you referenced is an Israeli science site. How about giving an unbiased\nwebsite?\njc\nAugust 12, 2014 at 10:59 am\nSimply because you dont go to a pally or arab site to get Israeli pov.\nHamas deserves what they are getting.By extension the civilians who voted for\nvoted to exterminate jews.\nNuff said.\nNevermind that most of you all are off topic.\nTim\nAugust 1, 2014 at 5:53 am\nHow ignorant can someone get…it’s an anti-missile system targeting rockets in the sky\nin Israel not towards Gaza.\nSome people develop rockets to kill people and some people develop rockets to protect\npeople but I guess logic is not the best expertise of the Ignorant\nNorman\nAugust 19, 2014 at 9:32 pm\nYou mean Hamas terrorists hiding behind “Palestinian civilians”?\nZiad K Abdelnour\nJuly 31, 2014 at 3:16 am\nWe believe the industry’s fate largely depends on Pentagon’s decisions on how it will\nmodernize U.S. forces to confront future threats. In its Cold War heyday, the Pentagon was\nthe leading developer of cutting-edge technology and still commands the world’s most\nadvanced military force. But at the same time, it has created self-defeating  mechanisms\nthat quash innovation and fail to capitalize on available opportunities. The United States is\nstill way ahead of competitors in areas such as fighter aircraft and submarines. But there\nare segments of the weapons market such as ballistic missiles and cruise missiles where\nother people are doing quite well compared to us.\nMario\nJuly 31, 2014 at 11:31 am\nCommon Sense, the innocent civilians are in Israel. True. Innocent civilians live in Gaza,\ntoo. Somehow 1200 of them who got killed in the last ten days used to live in former\nmentioned area, not Israel. And how many wounded on top?\nWhat kind of state is defending itself by obliterating and murdering civilian population? If\n“Iron Dome” is so effective, Israel doesn’t have to fear of few home made projectiles. Or,\nperhaps Chinese hackers infiltrated the rockets systems and are shooting Gaza on their own\naccord?\nMrDin\nAugust 1, 2014 at 1:18 pm\nMario, don’t you know that ” the innocent civilians” are ONLY live in Israel? LOL. The\ncivilian and children in Gaza were NOT the innocent civilian and not innocent children.\nThat’s why Israel kill all not innocent children and not innocent civilians in Gaza.\nIsrael has New High Tech of War, they sent text message to ALL not innocent\ncivilians/children in Gaza, to hide in school, so Israel can shoot missile on civilian and\nchildren and kill all of them at once.\nDigiDude\nAugust 2, 2014 at 3:22 pm\nMario I Totally Agree With You… Some Jews Infact Zionists Are Hit With Myopia So\nIt’s Actually Hard For Them To Swallow The Truth Or Even Hear It… I Don’t\nRemember If I Heard Of Any Of Hamas’s Rocket Killing a Israeli Citizen But At The\nSame Time I’ve Never Heard Of An Israeli Rocket/Shell Fire Missing Any Of It’s\nInnocent Civilian Targets… I’ve Friends In Gaza n When Is Ask Them Nicely “Hey,\nWhat’s Up? :)”\nThey Reply “Bombs Are Up! :'(”\nLook Brothers n Sisters(Doesn’t Matter If You Are Black Or Blue Or Even ET Or a Zion)\n… You Just Need To Be a Human To Care For Them… They(Innocent Palestinians) At\nTheir Most Desire Your Care Before They Are Bombed n Left Dead Right At Their Bed\nIn Their Own Home Where Their Parents Tell Them It’s Safe Here .. Goto Sleep Now..\nI”ll Kick Off Every Incoming Bomb, By The IDF!\nGenocide Has Hit It’s Climax In #Gaza n #Rafah .. We Need To Make a New Word For\nIt … Cause It Is Simply Not Genocide Its Not a War Crime .. We Need a Word Like\n“Holocaust” Here .. But Guess What?! Holocaust Lasted No More Than 4 Years But\nThis Ruthless n Merciless Killing Of Millions Of Innocent Palestinians Has Been\nContinuing Since 1948(That Makes About 66 Years Of Killings In Total Which Is More\nThan 16 Times Of The Deadly Holocaust) Here’s a Concise If Not Brief History Of The\nPast Muslim Holocaust http://www.rense.com/general21/pastzionist.htm\nn It Is a Collected By an American n I Don’t Think He’s Even Muslim But He’s Indeed\nProof He Is a Good, Caring n Just Human..\nI Cannot Say Anymore… Or I’ll Crook My Laptop’s KeyBoard With My Tears…\nMario(another one)\nAugust 3, 2014 at 1:00 pm\nsorry dude but your comment is really unreadable, with so many capital letters.\nIf you are not aware, please have a look to https://www.ietf.org/rfc/rfc1855.txt\n(Netiquette)\nMargaret\nAugust 3, 2014 at 5:05 pm\nThank you for the website. I looked up the 1948 Palestine exodus and the massacre\nat Dier Yassin in a search engine. What terrible tragedies. Many people want to\nmake one side the ‘bad guy’, but they don’t want to quit pointing fingers and\ndropping bombs long enough to work for Peace. Peace is possible – but it is so much\neasier to take sides and hate each other!!!\nSean\nJuly 31, 2014 at 5:58 pm\nIf only those pesky hackers had convinced a rich sugar daddy to build the children of Gazza\na rocket defence system. I hear the NSA are looking for new PR people, is this part of the\ninterview process Brian?\nkimsunam\nAugust 1, 2014 at 4:26 am\nIt seems that Countries always like to spy on each other, looks like they need more\nsecurity. Actually, there is no real security for today’s people all use the internet to do\nwhatever they want. But some software can be legal or also illegal to use, like Micro\nKeylogger, when you use it on your own PC, legal.\nnebular\nAugust 1, 2014 at 8:55 am\n“When Israel, in the occupied territories now, claim that they have to defend themselves,\nthey are defending themselves in the sense that any military occupier has to defend itself\nagainst the population that they’re crushing.” – Noam Chomsky\nVarera\nAugust 1, 2014 at 9:24 am\nRight. Take an outdated citation of a self-hating Jew leftist activist like it means\nanything. For your information, Israel has withdrawn its troops and settlers from Gaza\nin 2005.\nIs it time for you to get back in touch with the reality?\nMario\nAugust 1, 2014 at 9:40 am\nEven older quote:\n“Palestine belongs to the Arabs in the same sense that England belongs to the\nEnglish or France to the French. It is wrong and inhuman to impose the Jews on the\nArabs… Surely it would be a crime against humanity to reduce the proud Arabs so\nthat Palestine can be restored to the Jews partly or wholly as their national home”\n― Mahatma Gandhi\nMr Din\nAugust 1, 2014 at 1:24 pm\nand America belong to Africa – B Hussein Obama LOL\nMario\nAugust 3, 2014 at 12:50 pm\n——————\nCit. John (August 3, 2014 at 12:31 pm)\nI’m pretty sure that stopping the illegal occupation of Palestinian land by Israel would be\nthe best solution.\n—————–\nSorry John, I have to do it, your comment is brilliant!\nMario\nAugust 3, 2014 at 12:52 pm\noh my god, it was supposed to be a replay to “Common Sense” without sense and\ncommon.\nsorry for that.\nMario\nAugust 3, 2014 at 12:53 pm\noh, sorry. This was supposed to be a replay to “Common Sense” without commmon\nsense. Sorry for that\nBawlfungus\nAugust 6, 2014 at 11:21 am\n“Wang Dong” Tell me i’m not the only one that’s entertained by that guy’s name.Advertisement\n "
}