{
    "title": "hbo breach accomplished with hard work by hacker_ poor security practices by victim _ sc media",
    "text": "SUBSCRIBE\nHome  > Security News  > Cybercrime\nRansomPaymentHBO breach accomplished with hard work by hacker, poor security\npractices by victim\nDoug Olenick\n     \nCybersecurity executives are speculating the HBO hack by\n“Mr. Smith” was the result of the intruder putting in a\ntremendous amount of effort to infiltrate the\nentertainment giant that included many separate attacks,\nwhile said giant most likely was slayed by ignoring basic\nsecurity hygiene.\nOn August 7 a small treasure trove of HBO content was\nposted publicly to the web by a hacker who is now\ndemanding a $6 million payment to stop any further\nrelease of data. The hacker who goes by Mr. Smith posted\nfive scripts for Game of Thrones and a month’s worth of\nemail from HBO Vice President for Film Programming\nLeslie Cohen along with some other corporate\ninformation, according to the Associated Press .\nThe general consensus among cybersecurity insiders is the hacker was able to procure this information through a series of small attacks conducted over\nan extended period of time tied to poor security practices by either by HBO or perhaps a third-party vendor. Mr. Smith seemed to confirm the timeline\nsaying the $6 million ransom amount is tied to the length of time his crew spent on the hack, about six months.\n“Through a persistent effort of phishing, malware attacks and plain old social engineering, the attackers likely compromised many individual identities.\nOnce these identities are compromised, the attackers can inject malware onto systems that over time learn more passwords and allow them lateral\naccess into other systems on the network,” Corey Williams, Centrify’s senior director of products and Marketing, told SC Media.\nAnother strong possibility is HBO is simply another victim of partnering with a third-party vendor that either made an error or did not have its\ncybersecurity ducks lined up in a row. If this turns out to be true HBO will join a long list of companies, to include Verizon, Trump Hotels, Hard Rock and\nScottrade, which suffered a data breach due to one of these ancillary companies  proving to be a weak link.\n“They have to treat intellectual property (IP) with the same level of protection that banks treat regulated customer information – that is it should be\ngiven the highest level of IT security controls and data privacy protection.  Then in those instances where a studio has outsourced to a vendor (e.g.\nLarson Studios and the Netflix hack), they must insure that their vendors employ equally strong security,” Brad Keller, director 3rd Party Strategy for\nPrevalent, said in an email interview with SC Media.\n HBO launched an investigation into the initial attack that took place on August 1 when its CEO and Chairman Richard Plepler confirmed the cable\ncompany had been victimized. So far the company has not released any information.\nWhatever the company discovers during its investigation, along with its decision on whether or not is should pay the $6 million ransom will prove quite\neducational for other media firms who may find themselves victimized in a similar manner.\nAs with most ransomware situations, the consensus on whether or not the victim should pay up was split. If the data is deemed more valuable than the\nransom and it cannot be replicated than breaking out the corporate check book might be in order, but otherwise, if at all possible, the bad guys should\nnot be paid off.\n“It’s a business decision, plain and simple. If an attacker was threatening to release the new Star Wars movie early, I’d want to understand the business\nimpact of that. If it meant that there would be a decrease in people attending movies or buying merchandise in dollar amounts that exceeded the\namount of the ransom, I’d at least consider coming to the table and negotiating,” said James Carder, CISO of LogRhythm.\nHowever, everyone did agree that snatching IP was a smart move as it forces the company to quickly make a decision over what is essentially a product\nwith an expiration date. And they did not rule out that despite asking for money the hacker could have an ulterior motive, one similar to the Sony hack\nthat was focused on damaging the studio for the release of the anti-North Korea movie “The Interview.”\n“”Intellectual property is particularly well suited to ransomware attacks because there is little way to repair the damage after it has been released.  In\nthe case of movies and/or episodes, there is an immediate diminution in market value,” Keller said.\nWilliams agreed, adding the negative consequences of pre-releasing brand defining IP can be tremendous with the possibility of subscriptions being\nimpacted in HBO’s case.\nCarder did add that if a company manages to save a few dollars in negotiating to pay a lower ransom it would be smart to take that money and invest in\nboosting its cybersecurity. And he had a few suggestions on where to invest with the most important point made being the amount the company invests\nshould be near the equivalent to the value of what it is trying to protect.\n“Unfortunately, there isn’t a silver bullet or one thing these studios can do. It’s a combination of things that must happen. Studios must practice good IT\nand security hygiene (patching systems and applications, updating and modernizing systems/applications/infrastructure, controlling access to only\nthose that need access, validating identities, encrypting or applying other safeguards to critical business systems and data). They also must implement\nstringent monitoring and alerting mechanisms as compensating controls for when or if an attacker breaks through their defenses,” Carder said.\nWilliams noted that even improving some basic security protocols would be a huge help. The first change he suggested is to stop relying on passwords\nas a line of defense to protect intellectual property. Next is to implement multifactor authentication and utilize machine learning to halts attacks as\nthey happen.\nWhile there are many things companies must do to increase security, the one thing they cannot do is underestimate their enemies, said Matthew\nPascucci, Cybersecurity Practice Manager at CCSI.\n“The HBO hack should be taken seriously. Anytime a malicious actor has your sensitive data and is releasing it to the public they’ve earned the right to\nbe taken serious. How HBO responds to their demands and moves forward with the isolation of the incident will determine what needs to be done\nmoving forward from a hardening and process perspective,” he said.\nIn the end it may be hard to discern what will be the final result of this attack. HBO may determine how it was done, but unless it publicly states that it\npaid, or the hacker makes such a disclosure, the world may not know. Unlike the NotPetya attack, which has negatively impacted the financials of FedEx\nand Maersk, HBO may pass through this incident unscathed. Especially if it enters into a negotiation with Mr. Smith.\n“Just like with any business deal, there could be some level of negotiation and potentially some agreements made if HBO thinks that the stolen data has\nconsiderable value from a business perspective. By comparison, if you look at the effects of Sony’s breach, there was really no material impact on Sony’s\nfiscal results the year it was breached. Most of the cost incurred was associated with the investigation and the remediation necessary to bolster their\ncybersecurity program, which could be seen as an investment in the long run,” Carder said.\nTOPICS:  CYBER ATTACK  EMAIL SECURITY  PHISHING  RANSOMWARE\nCybersecurity asset management:\nWhere we are and how we got here\nWhy does asset management matter\nfor cybersecurity?\nLife as a CISO: How do CISOs make\nsense of all the cybersecurity tools?\nMOST POPULAR\nPopular  Emailed\nRecent\nSC Media’s complete coverage: Threat\nand Preparation\nFed report castigates U.S. ability to\nfend off a cyberattack, suggests major\nreforms\nCheckmarx sold for $1.15 billion\nZero day found in Zoho One Desktop\nCentral\nETSI OSM replaces live hackfest with\nvirtual event\nAbout Us\nSC Corporate News\nMeet the Team\nAdvisory Board\nContact Us\n   \nPRODUCT REVIEW\nAbout Product Review\nGroup Tests\nFAQ\nLicensing & Product Reviews\nUSER CENTER\nVideos\nExecutive Insight Guidelines\nSubscribe\nEditorial Calendar\nOTHER SC SITES\nRiskSec Conference\nSC Resource Library\nSC Online Events\nSC Awards\nCopyright © 2020 CyberRisk Alliance, LLC All Rights Reserved\nThis material may not be published, broadcast, rewritten or redistributed in any form without prior authorization.\nYour use of this website constitutes acceptance of CyberRisk Alliance Privacy Policy  and Terms & Conditions .Back to Top COMPANY INFONEWS  REVIEWS  IN DEPTH  EVENTS  RESOURCE LIBRARY  SC SECURITY OPS CENTER  SC UK\nSearch...\nNEXT POST IN CYBERCRIME  \nEngineer arrested for stealing data from Indian identity\nplatform OPEN\n "
}