{
    "title": "how a hacker_s typo helped stop a billion dollar bank heist - reuters",
    "text": "Apps Newsletters Advertise with Us Advertising Guidelines Cookies Terms of Use Privacy\nAll quotes delayed a minimum of 15 minutes. See here for a complete list  of exchanges and delays.\n© 2020  Reuters. All Rights Reserved.TECHNOLOGY NEWS MARCH 10, 2016 / 3:47 PM / 4 YEARS AGO\nHow a hacker's typo helped stop a billion\ndollar bank heist\nSerajul Quadir 7 MIN READ\nDHAKA (Reuters) - A spelling mistake in an online bank transfer instruction helped\nprevent a nearly $1 billion heist last month involving the Bangladesh central bank and\nthe New York Federal Reserve, banking officials said.\nUnknown hackers still managed to get away with about $80 million, one of the largest\nknown bank thefts in history.\nRECOMMENDED: South African teen finds suspected piece of missing MH370 plane\nThe hackers breached Bangladesh Bank’s systems and stole its credentials for payment\ntransfers, two senior officials at the bank said. They then bombarded the Federal\nReserve Bank of New York with nearly three dozen requests to move money from the\nBangladesh Bank’s account there to entities in the Philippines and Sri Lanka, the\nofficials said.\nFour requests to transfer a total of about $81 million to the Philippines went through,\nbut a fifth, for $20 million, to a Sri Lankan non-profit organization was held up because\nthe hackers misspelled the name of the NGO, Shalika Foundation.\nHackers misspelled “foundation” in the NGO’s name as “fandation”, prompting a\nrouting bank, Deutsche Bank, to seek clarification from the Bangladesh central bank,\nwhich stopped the transaction, one of the officials said.\nThere is no NGO under the name of Shalika Foundation in the list of registered Sri\nLankan non-profits. Reuters could not immediately find contact information for the\norganization.\nDeutsche Bank declined to comment.\nREAD MORE: Fukushima's ground zero is no place for man or robot\nRECOMMENDED: 'Hearts are in pieces' five years after tsunami hits Japan\nAt the same time, the unusually large number of payment instructions and the transfer\nrequests to private entities - as opposed to other banks - raised suspicions at the Fed,\nwhich also alerted the Bangladeshis, the officials said.\nThe details of how the hacking came to light and was stopped before it did more\ndamage have not been previously reported. Bangladesh Bank has billions of dollars in a\ncurrent account with the Fed, which it uses for international settlements.\nThe transactions that were stopped totaled $850-$870 million, one of the officials said.\nLast year, Russian computer security company Kaspersky Lab said a multinational gang\nof cyber criminals had stolen as much as $1 billion from as many as 100 financial\ninstitutions around the world in about two years.\nIraqi dictator Saddam Hussein’s son Qusay took $1 billion from Iraq’s central bank on\nthe orders of his father on the day before coalition forces began bombing the country\nin 2003, American and Iraqi officials have said. In 2007, guards at the Dar Es Salaam\nbank in Baghdad made off with $282 million.\nMONEY RECOVERED\nBangladesh Bank has said it has recovered some of the money that was stolen, and is\nworking with anti-money laundering authorities in the Philippines to try to recover the\nrest.\nA bank spokesman could not be reached for comment late on Thursday.\nThe recovered funds refer to the Sri Lanka transfer, which was stopped, one of the\nofficials said.\nInitially, the Sri Lankan transaction reached Pan Asia Banking Corp PABC.CM, which\nwent back to Deutsche Bank for more verification because of the unusually large size of\nthe payment, a Pan Asia official said. “The transaction was too large for a country like\nus,” the official said. “Then (Deutsche) came back and said it was a suspect\ntransaction.” A Pan Asia spokesman could not immediately be reached for comment.\nThe dizzying, global reach of the heist underscores the growing threat of cyber crime\nand how hackers can find weak links in even the most secure computer networks.\nMore than a month after the attack, Bangladeshi officials are scrambling to trace the\nmoney, shore up security and identify weaknesses in their systems. They said there is\nlittle hope of ever catching the hackers, and it could take months before the money is\nrecovered, if at all.\nFireEye Inc’s ( FEYE.O ) Mandiant forensics division is helping investigate the heist,\npeople familiar with the matter told Reuters on Thursday.\nThe sources said Silicon Valley-based FireEye, which has investigated some of the\nbiggest cyber thefts on record, was brought in by World Informatix, a smaller firm that\nis advising Bangladesh Bank on the investigation.\nSecurity experts said the perpetrators had deep knowledge of the Bangladeshi\ninstitution’s internal workings, likely gained by spying on bank workers.\nThe Bangladesh government, meanwhile, is blaming the Fed for not stopping the\ntransactions earlier. Finance Minister Abul Maal Abdul Muhith told reporters on\nTuesday that the country may resort to suing the Fed to recover the money. \n“The Fed must take responsibility,” he said.\nThe New York Fed has said its systems were not breached, and it has been working with\nthe Bangladesh central bank since the incident occurred.\nThe hacking of Bangladesh Bank happened sometime between Feb. 4-5, over the\nBangladeshi weekend, which falls on a Friday, the officials said. The bank’s offices were\nshut.\nInitially, the central bank was not sure if its system had been breached, but cyber\nsecurity experts brought in to investigate found hacker “footprints” that suggested the\nsystem had been compromised, the officials said.\nThese experts could also tell that the attack originated from outside Bangladesh, they\nsaid, adding the bank is looking into how they got into the system and an internal\ninvestigation is ongoing.\nThe bank suspects money sent to the Philippines was further diverted to casinos there,\nthe officials said. \nThe Philippine Amusement and Gaming Corp, which oversees the gaming industry,\nsaid it has launched an investigation. The country’s anti-money laundering authority is\nalso working on the case.\nAdditional reporting by Jim Finkle in BOSTON, Jonathan Spicer in NEW YORK, Farah Master in HONG KONG\nand Shihar Aneez in COLOMBO; Editing by Paritosh Bansal and Raju Gopalakrishnan\nOur Standards: The Thomson Reuters Trust Principles.\nPAID PROMOTIONAL LINKS\nAmerica's #1 Futurist Issues Warning\nInternet Reboot 2020\nMotley Fool Issues Rare “All In” Buy Alert\nThe Motley Fool\n10 Credit Cards That Can't Be\nBeat In 2020\nNerdWallet\nPay 0 Interest Until 2021\nCompareCards.com\nNYU’s Top-Ranked Executive\nMBA Program Is Offered In\nWashington, D.C.\nNYU Stern Executive MBAPromoted\nby  Dianomi\nMORE FROM REUTERS\nCoronavirus can persist in air for hours and on surfaces for\ndays:...\n18 Mar\nRussia deploying coronavirus disinformation to sow panic\nin West...\n18 Mar\nRattled world 'at war' with\ncoronavirus as deaths surge in Italy...\n19 Mar\nU.S. lawmakers pushing ahead with\nthird coronavirus aid package\n19 Mar\nMeet the Americans still going out\nand gathering in large groups\n19 Mar\nPAID PROMOTIONAL LINKS\nNYU’s Top-Ranked Executive MBA Program Is Offered In\nWashington, D.C.\nSponsored by NYU Stern Executive MBATop 3 Travel Cards of 2020 - All With No Annual Fee\nSponsored by CompareCards.com\nPay 0 interest until 2021. No annual fee.\nSponsored by The AscentPay 0 Interest Until 2021\nSponsored by CompareCards.com\nAmerica's #1 Futurist Issues Warning\nSponsored by Internet Reboot 2020How Can I Make My $1 Million Last In Retirement?\nSponsored by Fisher Investments\nTop 10 Card Offers For People With Excellent Credit\nSponsored by CompareCards.com\nThis Stock Picker’s Latest Video Just Went Viral\nSponsored by InvestorPlace\nGet 25X Points per $1 Spent at IHG®\nHotels & Resorts\nSponsored by Chase IHG® Premier Card\nDiscover why the Biotech sector is\nbooming during the COVID-19 Crisis\nSponsored by Angel Publishing\nSee How Much Life Insurance You\nNeed - Calculate Your Coverage\nAmount.\nSponsored by Northwestern MutualPromoted\nby  Dianomi\nMORE FROM REUTERS\nSpecial Report: How Korea trounced U.S. in race to test\npeople for...\n18 Mar\nTrue claim: Amazon temporarily disables shipment of non-\nessential...\n18 Mar\nThe White House wants to give you\n$1,000. Here's how it could work\n18 Mar\nTesla's Musk offers to make\nventilators amid shortage in...\n19 Mar\nDemocratic leader Schumer criticizes\nTrump's call for $1,000 checks\n18 Mar\nPAID PROMOTIONAL LINKS\n6 Credit Cards You Should Not Ignore If You\nHave Excellent Credit\nNerdWallet\nTop 3 Travel Cards of 2020 - All With No Annual\nFee\nCompareCards.com\nMotley Fool Issues Rare “All\nIn” Buy Alert\nThe Motley Fool\nAmerica's #1 Futurist Issues\nWarning\nInternet Reboot 2020\nNYU’s Top-Ranked Executive\nMBA Program Is Offered In\nWashington, D.C.\nNYU Stern Executive MBAPromoted\nby  Dianomi\nCommuters pass by the front of the Bangladesh central bank building in Dhaka March 8, 2016.\nREUTERS/Ashikur Rahman\nADVERTISEMENT\nMORE FROM REUTERS\n00:00\n01:28\nADVERTISEMENT\nTRENDING\nCoronavirus can persist in air for hours and\non surfaces for days: study\nSpecial Report: How Korea trounced U.S. in\nrace to test people for coronavirus\nRussia deploying coronavirus disinformation\nto sow panic in West, EU document says\nSenate scrambles to nail down $1 trillion-\nplus coronavirus plan\nThe White House wants to give you $1,000.\nHere's how it could work\nREUTERS NEWS NOW\nSubscribe to our daily curated newsletter to\nreceive the latest exclusive Reuters coverage\ndelivered to your inbox.\nEnter email address\nSubmitDirectory of sites Login Contact Support\nBusiness Markets World Politics TV More\nDiscover Thomson Reuters\n "
}