{
    "title": "ICIT-Brief-China-Espionage-Dynasty",
    "text": " \n1 \n \n \n \nAuthors:  \n James Scott, Sr. Fellow, ICIT  \n Drew Spaniel, Researcher, ICIT  \n \nExpert research  contributed by the following ICIT Fellows :  \n Ryan Brichant, ICIT Fellow & CTO, C ritical Infrastructure, FireEye  \n John Sabin, ICIT Fellow & Director, Network Securit y and Architecture, GRA \nQuantum  \n  ICIT Briefing: China’s Espionage Dynasty  \nJuly 28 , 2016  \nWashington D.C.  \n \nJoin ICIT experts as we discuss the findings of this publication and \nidentify solutions to protect our critical infrastructures and our way \nof life.  \n \nhttp://icitech.org/event/chinese -advanced -persistent -threat -groups/  2 \n \nContents  \nIntroduction  ................................ ................................ ................................ ................................ ..................  4 \nChina’s Thirteenth Five -Year Plan  ................................ ................................ ................................ .................  4 \nEconomic Impact of Intellectual Property Theft  ................................ ................................ ...........................  5 \nThe Str ucture of Chinese Espionage  ................................ ................................ ................................ .............  6 \nCovert Spy Structure  ................................ ................................ ................................ ................................ . 6 \nJoint Staff Department  ................................ ................................ ................................ ................................  7 \nSecond Department  ................................ ................................ ................................ ................................ ..... 7 \nThird Department  ................................ ................................ ................................ ................................ ....... 7 \nFourth Department  ................................ ................................ ................................ ................................ ..... 7 \nState -Sponsored APTs  ................................ ................................ ................................ ...............................  8 \nPLA Unit 61398/ APT 1/ Comment Panda/ Comment Crew/ TG -8223  ................................ .................  8 \nPLA Unit 61486/ APT2/ Putter Panda/ TG -6952  ................................ ................................ .....................  9 \nDeep Panda/ APT 19/ Shell Crew/ Black Vine/ Kung Fu Kitten  ................................ ...........................  10 \nPLA Unit 78020/ APT 30/ Naikon  ................................ ................................ ................................ ...........  11 \nAxiom/ Winnti Group  ................................ ................................ ................................ ...............................  12 \nHurricane Panda  ................................ ................................ ................................ ................................ ........  14 \nGothic Panda/ APT 3/ UPS/ Pirpi/ Clandestine Fox/ TG -0110  ................................ .............................  15 \nNetTraveler/ Travnet/ Netfile  ................................ ................................ ................................ .................  15 \nMirage/APT 15/ Vixen Panda/ Ke3Chang/ GREF/ Playful Dragon  ................................ ......................  16 \nHellsing/ Goblin Panda  ................................ ................................ ................................ .............................  16 \nStone Panda  ................................ ................................ ................................ ................................ ...............  17 \nNightshade Panda ................................ ................................ ................................ ................................ ...... 18 \nAnchor Panda  ................................ ................................ ................................ ................................ ............  19 \nNumbered Panda/ APT 12/ IXESHE/ DYNCALC/ JOY RAT/ Etumbot  ................................ ..................  19 \nHidden Lynx / Aurora  ................................ ................................ ................................ ...............................  20 \nOvert Spy Structure  ................................ ................................ ................................ ................................ . 21 \nUnited Front Department  ................................ ................................ ................................ .........................  21 \nOverseas Chinese Affairs Office  ................................ ................................ ................................ ................  21 \nConsulates and Embassies  ................................ ................................ ................................ ........................  21 \nTongs and Hometown Associations  ................................ ................................ ................................ .........  21 \nTriads and Street Gangs  ................................ ................................ ................................ ............................  22 \nChinese Student and Scholars Associations  ................................ ................................ ............................  22 3 \n \nAcademic So licitation  ................................ ................................ ................................ ................................  26 \nFront Companies  ................................ ................................ ................................ ................................ ....... 27 \nInsider Threats  ................................ ................................ ................................ ................................ ..........  27 \nMonitored Communities  ................................ ................................ ................................ ...........................  27 \nConclusion  ................................ ................................ ................................ ................................ ...................  29 \nSources:  ................................ ................................ ................................ ................................ .......................  32 \n 4 \n \nIntroduction  \nThe criminal culture of theft that has been injected into virtually every line of China’s 13th \nFive -Year Plan is unprecedented. From state sponsored smash and grab hackin g and \ntechno -pilfering, to corporate espionage and targeted theft of IP, the threat is real, the \neconomic implications are devastating and Western Nations are the primary target of \nChina’s desperate effort to steal in order to globally compete. Never befor e in recorded \nhistory has IP transfer occurred at such a rapid velocity.  \nThe all -encompassing, multifaceted onslaught of cyber -physical Chinese espionage targets \nindustry genres from satcom to defense and from academic research to regional factories \nmanuf acturing proprietary blends of industrial materials. China seeks to not only steal but \nto economically interrupt and cripple. Economic warfare is just as much a part of the \nstrategy as catching up to Western innovation and becoming less dependent on foreig n \ntechnology. Chinese student and scholar associations, trade organizations, legions of \nstrategically placed insider threats and yes, even criminal organizations such as the Triad, \nall play their key role in the purloining of intellectual property in contr ibution to the \nChinese agenda. This report covers the primary structure of Chinese espionage initiatives.  \nChina’s Thirteenth Five -Year Plan  \nChina’s Thirteenth Five -Year Plan (2016 -2020) focuses on cutting edge technology and \nsocio -economic reform. The plan calls for innovative technology to improve national \ninfrastructure and more environmentally friendly technology to alleviate China’s ecological \nfootprint. By 2025, China wants to improve its national technological core, reduce the \nglobal perception th at its products are of inferior quality (likely by improving their quality \nby modernizing the underlying manufacturing infrastructure), and diversify its domestic \nindustrial markets. While China will develop some of the technology necessary to aspire \ntowar ds these goals as the result of the intellectual endeavors of its people, the majority \nwill likely be obtained as stolen intellectual property from the United States and other \nnations. As ICIT Fellow John Sabin (GRA Quantum) observed “When you understand \nChina’s desire to be a global leader across markets, you can rationalize their preference to \nsimply steal intellectual property. Say, for example, they want to become the world leader \nin pharmaceuticals. Instead of investing billions of dollars supporting s cience education \nand the development of a robust and innovative biomedical industry, China can simply \nleverage what it already has a competitive advantage in – hacking – and steal an American \ncompany’s drug formula in a fraction of the time.”    The remaind er of the plan focuses on \nbalancing welfare gaps and bridging socio -economic differences. Since it is unlikely that the \nChinese Communist Party (CCP) will reform its structure to support a more inclusive \napproach to governance, attempts at improving the st andard of living of the Chinese people \nwill likely be gleaned from organizational, structural, and operational models created from \ndossiers and data exfiltrated from systems belonging to Western organizations. In short, \nlike its predecessors, a majority of  China’s Thirteenth Plan depends on sustained espionage \nagainst countries like the United States, Canada, and Australia.  5 \n \nEconomic Impact of Intellectual Property Theft  \nThe United States is built upon an intangible economy. Gone are the days when American  \ncurrency was backed by gold or silver; now, it is backed by ideas. The entire United States \neconomy relies on some form of intellectual property because every industry either \nproduces or uses it. In their March 2012 Intellectual Property and the U.S. Econ omy: \nIndustries in Focus  report, the Economics and Statistics Administration of the U.S. Patent \nand Trademark Office identified 75 out of 313 industries as IP -intensive. These accounted \nfor 27.1 million jobs, or 18.8% of all employment in 2010. 12.9 milli on more supply chain \njobs were indirectly supported by intellectual property. IP -intensive industries accounted \nfor $5.06 trillion in value added or roughly 34.8 % of the U.S. GDP in 2010. Some \nresearchers estimate that as much as an immediate $300 -500 bil lion and 1.2 million jobs \nare lost every year due to the theft of intellectual property.  These costs may be much \ngreater in consideration of the losses over the potential lifetime of the property.  \nIn September 2015, President Obama and President Xi Jinpi ng revealed in a joint media \nconference that the United States and China had reached a deal that neither government \nwould conduct cyberattacks to steal intellectual property for economic gain from the other. \nThe agreement recognized that neither Obama nor Xi could guarantee the actions of all \ntheir citizens. Many security researchers and legislators doubted that the agreement would \nalter the behavior of China in cyberspace.  In late June 2016, FireEye’s Ryan Brichant \ncommented, “Since mid -2014, we have seen  a notable decline in China -based groups' \noverall intrusion activity against entities in the U.S. and 25 other countries. We suspect that \nthis shift in operations reflects the influence of ongoing military reforms, widespread \nexposure of Chinese cyber oper ations and actions taken by the U.S. Government. In 2013, \nFireEye observed 70 active network compromises by China -based groups each month. In \n2015, we observed less than 10 active network compromises.  In 2014, the U.S. \nGovernment began to take unprecedent ed measures in response to claims of Beijing's \ncyber -enabled economic espionage. Although many in the U.S. initially doubted that these \nactions would have any effect, they may have prompted Beijing to reconsider the execution \nof its network operations.  We  have not seen evidence of a coordinated shift in the behavior \nof recently active China -based groups; tactical changes appear to be specific to each group’s \nmission and resources, and in response to public exposure of its cyber operations.” While it \nis pos sible that China has reduced its targeted attacks against American organizations, it \nseems more likely that it restructured its cyber operations to assert greater control over its \noperatives.  \nPrior to the agreement, the Chinese cyber army operated on seve ral tiers. The first tier \nconsists of the members of the Third Department, state -sponsored APT groups, and other \ncyber professionals, hired by the military to conduct offensive and defensive cyber \noperations. The second tier consists of specialists in civi lian organizations, such as the \nMinistry of State Security or Ministry of Public Security, who are authorized by the military \nto conduct cyber operations. The third tier consists of external groups that can be hired or \nmobilized to conduct cyber operations . This would include cyber criminals, mercenary 6 \n \ngroups, and script kiddies who occasionally work with the higher tiers. Finally, beneath all \nthe tiers are an estimated 500,000 paid propaganda proponents and other internet users \nwho promote the Chinese Comm unist Party and its leaders, while criticizing its enemies \nonline. The People’s Liberation Army (PLA) does not fully cover the operating expenses \nand modernization funds of the departments. Prior to the agreement, the departments \nsupplemented budgets with other activities, such as conducting cyberattacks. When Xi \nJinping announced at the beginning of September 2015, that he was cutting 300,000 troops, \nhis intent was multi -purposed. On one hand, he may have planned to purge the military of \nless loyal members  and on the other hand, he focused the departments and ordered them \nto cease extra ventures, such as sloppy cyberattacks, that could result in economic \nsanctions against China. This also could have resulted in less work for the lower tiers as \nChinese state  cyberattacks would be more professional, more difficult to detect, and more \nfocused on high priority targets. It is possible that the financially motivated attacks were \nsimply redirected. Kaspersky Lab alleges that in response to the agreement, Chinese AP T \nattacks against Russian targets increased 300 percent between December 2015 and \nFebruary 2016. In further support of the possibility that the agreement either spurred \nfiscal operations out of the government or incited outsourcing, evidence suggests that the \nearly 2016 increase in ransomware attacks may have been conducted by Chinese \noperatives. Four separate security firms concluded that tools and tactics previously \nassociated with Chinese government -supported cyber -intrusions were used in some \nattacks.  \nIt is important to recognize that the September agreement only pertains to attacks \nconducted for economic gain. Neither nation is barred from launching cyberattacks \nintended to steal intellectual property or data for any other purpose, such as the \ndevelopm ent of infrastructure, military, or technology capabilities. Traditional espionage \nattacks against government organizations, such as OPM, Anthem, or federal databases, are \nnot addressed by the agreement. Even if the agreement did holistically address \ncyber attacks, it would be difficult to prevent the first tier from outsourcing attacks to the \nlower tiers.   \nThe Structure of Chinese Espionage  \nThe Central Committee of the Chinese Communist Party (CCP) is the political body \nconsisting of the most powerful mem bers of the Communist Party of China. The Committee \nis the highest authority when the National Congress is not in session. The Central \nCommittee is comprised of 205 full members and 171 alternate members. The Central \nCommittee conducts intelligence operati ons through a covert and an overt spy structure.  \nCovert Spy Structure  \nThe CCP controls the People’s Liberation Army through a Central Military Commission \n(CMC). The Commission is the parallel national defense agency of the Communist Party of \nChina and th e People’s Republic of China. The CMC is an 11 -man commission and its 7 \n \nchairman is the commander -in-chief of the armed forces, Xi Jinping at the time of this \nwriting. The CMC sets military policies and issues directives relating to the PLA.  \nJoint Staff Depa rtment  \n The People’s Liberation Army (PLA) Joint Staff Department (JSD) replaced the General \nStaff Department on January 11, 2016 as part of Xi Jinping’s military reforms. It manages \nthe majority of military and covert operations. The JSD, as a division o f the PLA, is \ndedicated to warfare. The duties of the PLA JSD include PLA Operations Command, \nRecruitment, Mobilization, Formation, Training, and Administration. The JSD contains three \ndepartments, which cooperate to conduct intelligence operations. The fa ct that human \nintelligence, signal intelligence, and electronic intelligence are all housed under the same, \nmilitary department demonstrates that the Chinese view the modern threat landscape as a \ncyber -physical battlefield.  \nSecond Department  \nThe Second De partment handles conventional human intelligence (HUMINT), such as high -\nlevel spies and intelligence assets.  A common misconception is that agents of Chinese \ngovernment are “sloppy”; however, agents of the second department who serve as high -\nlevel spies o r handlers are rarely caught. Rather, low -level assets, often belonging to the \novert structure are more often detected by foreign intelligence agencies. It is believed that \nthe Second Department consists of 30,000 - 50,000 human spies who are operating as \ninsider threats within various foreign organizations.  \n Under the current Five Year Plan, much of the Second Department’s efforts are focused on \nthe aggregation of intellectual property and intelligence. In some cases, agents of the \nsecond department operat e in concert with hackers and APT groups in the Third \nDepartment, by acting as insider threats or otherwise facilitating the compromise of target \nsystems.  \nThird Department  \nThe Third Department is responsible for signals intelligence (SIGNIT). The Third \nDepartment is the largest intelligence agency in the Chinese government, consisting of an \nestimated 250,000 - 300,000 linguists, technical staff, and cyber soldiers. There are at least \nfour known Research Institutes (56, 57, 58, and 61) under the Third Depar tment. Within \nthe 61 Research Institute are approximately 20 bureaus that launch cyberattacks. The \nThird Department intercepts phone calls, launches cyberattacks, and monitors \ncommunications. Much of its efforts involve hacking devices and exfiltrating tar geted data. \nThe Third Department may launch obvious cyberattacks, such as DDoS or ransomware \nattacks, against target systems to mask the activity of Second Department operatives.  \nFourth Department  \nThe Fourth Department conducts electronic intelligence (ELINT) operations and is focused \non intercepting satellite and radar data. Fourth Department operations might involve 8 \n \naltering, jamming, or spoofing signals. It is believed that the Fourth Department researches \ndirect methods of disabling enemy communication networks.  \nState -Sponsored APTs  \nChinese state sponsored advanced persistent threats can be identified based on their \nchoice of targets, their proclivity for cyberespionage, and the language settings  on the \nkeyboards used to develop the malware, and their connections to other campaigns. Some \ngroups, such as APT 1 (Unit 61398), APT 2 (Unit 61486) and APT 30 (Unit 78020) can be \nlinked to specific units within the Third Department. Other APTs remain less  defined. \nBelow are some brief profiles of Chinese APTs. Despite the catalog below and those \nincluded in ICIT’s Know Your Enemies  reports, even more Chinese state -sponsored APTs \nremain undiscovered at the time of this writing.  \nPLA Unit 61398/ APT 1/ Commen t Panda/ Comment Crew/ TG -8223  \nIn 2013, Mandiant published their 60-page  report, APT 1: Exposing One of China’s Cyber \nEspionage Units , detailing the activities and location of a Chinese state -sponsored advanced \npersistent threat and associated organizatio ns that were conducting cyberattacks against \nAmerican organizations and government agencies from a 12 -story building on the outskirts \nof Shanghai. APT 1, or Unit 61398, is the Second Operational Bureau of the Third \nDepartment of the People’s Liberation Arm y (PLA) General Staff Department (GSD). It \noperates from four large networks in Shanghai, two of which serve the Pudong district of \nShanghai. Additionally, the Chinese government provides a direct fiber optic connection to \nthe facility in the name of natio nal defense. On May 19, 2014 a Federal grand jury indicted \nfive officers of Unit 61398 (Huang Zhenyu, Wen Xinyu, Sun Kailiang, Gu Chunhui, and Wang \nDong) on charges of compromising American systems and stealing intellectual property. \nFederal prosecutors li sted some suspected targets as Alcoa Inc., Allegheny Technologies \nInc., United States Steel Corp, the Toshiba Corp unit of Westinghouse Electric Co, the U.S. \nsubsidiaries of SolarWorld AG, and a steel workers' union. The indictment alleges that \nChinese sta te-owned companies hired Unit 61398 to provide information technology \nservices, including assembling a database of corporate intelligence, concerning the targets. \nThe use of a military signal intelligence division to aid state owned businesses \ndemonstrates  a clear difference between strategic cyber operations in the United States \nversus China. The United States relies on its cyber operations for defense and some military \nintelligence; meanwhile, China utilizes its cyber capabilities for business, socio -econ omic, \nand military purposes.  \nUnit 61398 targets sectors that are of interest to China’s current Five Year Plan. Primary \ntargets include intellectual property, trade secrets, financial data, organizational data or \nsystems in the Information Technology, Aer ospace, Defense, Energy, Manufacturing, Public \nAdministration, or other governmental or technical sectors. It is large enough and well -\nresourced enough that it can simultaneously compromise dozens of organizations. Attacks \nfrom the group may date back as e arly as 2002. At the very least, the group has attacked \nover a thousand corporations and government entities across the globe since 2006. At least 9 \n \nseveral hundred of those attacks have resulted in severe breaches. The majority of the \ntargets have been Amer ican; however, Dell Secure Works and other firms allege that the \ngroup has also targeted systems belonging to the United Nations, Canada, South Korea, \nTaiwan, and Vietnam.  \nAPT 1 received some of its names, such as Comment Crew, Comment Panda, and similar \ntitles, due to its tendency to infiltrate organizations by compromising the “comment” \nfeatures of legitimate web applications in order to laterally navigate to internal \napplications or systems. More recent attacks have used personalized spear phishing email s \nthat contain a malicious file or link. Attachments are usually ZIP files.  \nOnce the victim system is compromised, the attacker establishes a persistent presence by \ninstalling a backdoor from the dropper delivered from the email. The backdoor bypasses \ninternal security by contacting C2 infrastructure from inside the network. The actor \ntypically relies upon WEBC2 or BISCUIT backdoors. WEBC2 is a minimally featured \nbeachhead backdoor that can only communicate with a C2C server through comments. \nBISCUIT backd oors are used if more functionality is needed. BISCUIT uses the HTTP \nprotocol for communication and it features modules to capture screenshots, log keystrokes, \nrecord system information, modify processes, modify the registry, execute code, log off or \nshut down the session, and other features. Unit 61398 remains persistent on the \ncompromised system for months or years.  During this time, the group gathers login \ncredentials from publicly available tools built into the initial malware and escalates account \nprivileges, conducts network reconnaissance and laterally explores the network to infect \nnew systems. Unit 61398 compresses stolen data into multiple files with a RAR archiving \nutility and exfiltrates the data through their backdoor or through File Transfer P rotocol \n(FTP).  \nPLA Unit 61486/ APT2/ Putter Panda/ TG -6952  \nThe advanced persistent threat known as Putter Panda, or PLA Military Unit Cover \nDesignator (MUCD) 61486, is internally known as the People’s Liberation Army’s (PLA) \nThird Joint Staff Department ( JSD) Twelfth Bureau. The group has been active since at least \n2007 and it is based out of the Zhabai district of Shanghai. Unit 61486 shares some \ninfrastructure with Unit 61398. Analysts of Project 2049 Institute allege that Unit 61486 \nsupports China’s spa ce surveillance network and maintains close ties with the state -\nsponsored Beijing Remote Sensing Research Institute, whose mission is to explore “leading \ntechnologies in earth observation and the mechanisms for acquiring and distributing \nremote sensing inf ormation.” The cyber targets of Unit 61486 tend to be affiliated with \nsatellite, aerospace, or defense technologies.  \nMuch like Unit 61398, Putter Panda targets intellectual property, trade secrets, and other \ndata related to government entities, the Aerospa ce sector, the Defense sector, the \nCommunication sector, the Technologies sector, and research facilities.   According to \nCrowdStrike, the United States Defense industry, communication industries, and European \nsatellite and aerospace industries are particul arly targeted.  10 \n \nLike most APTs, Putter Panda relies on spear phishing emails containing malicious PDFs \nand Microsoft Word Documents to infect target systems. Its exploit kit includes two \ndroppers, two RATs, and two tools. One dropper delivers a payload, suc h as the 4H RAT, to \nthe victim system and installs it. The other dropper exclusively delivers the PNGDOWNER \ntool. Putter Panda uses the 4H RAT and the 3PARA RAT. The 4H RAT can initiate a remote \nshell, enumerate running processes, terminate processes, list  files and directories, modify \ntimestamps, upload files, download files, and delete files. The RAT communicates over \nHTTP and the communication is obfuscated by an operation, 1 -byte XOR with the key 0xBE. \nThe 3PARA RAT is a second stage, failsafe tool that  allows the attacker to regain control of \nthe system if their initial access vector is removed. The 3PARA RAT creates a file map at \nstartup to verify that there is not another instance of the RAT running. The RAT is capable \nof remaining dormant for prearra nged or commanded periods of time. The RAT only has \nlimited commands, which include retrieving file or disk metadata, changing the working \ndirectory of the current C2 session, executing a command, and listing the current working \ndirectory. The first tool, PNGDOWNER is a simple download and execute tool. The second \ntool, HTTPCLIENT is a backup tool. The 3PARA RAT communicates over HTTP and \nauthenticates with a 256 -byte hash and a hard -coded string.  \nDeep Panda/ APT 19/ Shell Crew/ Black Vine/ Kung Fu Kitten  \nAccording to Symantec, Crowd Strike, and other security firms Deep Panda is a Chinese \nstate -sponsored threat actor that began attacking the Healthcare, Aerospace, and Energy \nsectors around 2012.  \nDeep Panda attacks tend to have massive impacts and they accr ue proportional media \nattention. In order to conduct multiple sizable campaigns against United States Federal \ngovernment agencies and major western health care providers for extended time periods, \nDeep Panda must have considerable resources at their dispos al. In illustration, it is possible \nthat Deep Panda was concurrently engaged in cyber -attacks against the United States Office \nof Personnel Management, the Anthem healthcare network, United Airlines, and other \nentities. A vast majority, ~80%, of Deep Panda  targets are American.  \nPrior to 2012, there are indications that China did not target PII; however, Deep Panda and \naffiliated groups, such as Axiom, now regularly exfiltrate PII and healthcare data. The \ninformation is rarely, if ever, exploited for financi al gain. Instead, the shift in targeted \ninformation could indicate the likelihood that the information is valuable for the creation of \ndossiers, monitoring systems, or to leverage against individuals who concern the Chinese \ngovernment.   \nIn the United State s Healthcare sector, Deep Panda has attacked VAE, Anthem, Empire Blue \nCross Blue Shield, and Carefirst. In the recent 2014 -2015 Anthem breach, the group \nexfiltrated ~80 million patient records. Information exfiltrated from Anthem includes \nsocial security n umbers and other personal identifiable information or personal health \ninformation. It is believed that the Axiom group also attacked Anthem at the same time as \nDeep Panda, but with a different malware and along different vectors. The attack appears 11 \n \nto be a ffiliated. Further, enough similarities exist between the meticulous planning and \nmalware employed by the two groups that many security firms hypothesize that they are \nboth part of the same group. There is a strong possibility that the groups are parts of a \ncoordinated effort under the Chinese government.  \nDeep Panda is believed to be responsible for the two 2015 OPM breaches. Further, Deep \nPanda breached United Airlines in 2015 and stole departure and destination records. The \nhealth, OPM, and travel records  stolen by Deep Panda can be aggregated to catastrophically \nimpact the United States government over time. The adversary or their parent nation -state, \ncan use the stolen information to build a database of US employees for espionage purposes. \nThe informatio n can also be used to identify United States agents in the country or to \nidentify Chinese assets who assist United States intelligence efforts. Moreover, the \ninformation obtained in the OPM breach could be combined with the information stolen in \nDeep Panda ’s healthcare breaches or with information publically released in incidents, \nsuch as the Ashley Madison breach, to manipulate or leverage pressure against specific \nUnited States citizens to serve the Chinese agenda.  \nPLA Unit 78020/ APT 30/ Naikon  \nThe Nai kon group is allegedly a state sponsored hacking unit of the PLA, that has been \ncharged since 2010 with collecting intelligence from political and military targets to \nadvance China’s interest in the South China Sea. The threat actor is known for spear -\nphis hing campaigns against civilian, military, and government organizations in the \nPhilippines, Malaysia, Cambodia, Indonesia, Vietnam, Myanmar, Singapore, Nepal, Thailand, \nand Laos. Many of these countries have strong ties to the ASEAN Union or the United Sta tes. \nChina desires control of the South China Sea because it relies heavily on shipping routes \nthrough the region. The Unit 78020 campaign indicates a marriage of cyber intelligence \nwith physical strategic action. The connection of Naikon to the PLA is the  result of security \nresearchers identifying one of its members as a military researcher named Ge Xing.  \nSpear phishing campaigns begin with a lure email relevant to the victim that carries a \nmalicious Microsoft Word document, which, according to Kaspersky L ab, actually contains \n“a CVE -2012 -0158 exploit, an executable with a double extension, or an executable with an \nRTLO filename”. The vulnerability is a buffer overflow in the ActiveX controls of the \nMSCOMCTL.OCX Windows library. The exploit is used to insta ll a RAT which in turn plants \na backdoor on the system.  \nOne of Naikon’s most prolific spear phishing campaigns was the March 2014 attacks \nagainst organizations from countries affected by the MH370 tragedy. Upon opening/ \nexecution, the malicious payload, a n 8kb encrypted file and configuration data, was injected \ninto the browser memory where it decrypted the ports and paths to the C2C server, a user \nagent string, filenames and paths to relevant components, and hash sums of the user API \nfunctions. The malici ous code downloaded the main malware from the C2C server over an \nSSL connection and then it loaded it independently of the operating system functions 12 \n \nwithout saving it to the hard drive by assuming control of the XS02 function and then \nhandling the install ation in memory.  \nThe main component of the Naikon platform is a remote administration component. \nAccording to Trend Micro, the RARSTONE backdoor (BKDR_RARSTONE.A) can obfuscate \nitself by “decrypting and loading a backdoor ‘executable file’ directly into m emory without \nthe need to drop the actual ‘executable file.’” The backdoor installs like a Plug X backdoor, \ninjecting code into hidden instances of internet explorer. The module establishes a \nconnection to the C2C server to receive and execute any of an es timated 48 commands \nfrom the adversary on the host. These commands include profiling the system, uploading \nand downloading data, executing arbitrary code, installing other modules, or executing \ncommands via the command line. The backdoor routine also has t he ability to get installer \nproperties from Uninstall Registry key entries, which allow it to silently uninstall \napplications that interfere with the malware. The espionage malware collects email \nmessages, monitors victims keystrokes and screens in real ti me, and monitors network \ntraffic.  \nAxiom/ Winnti Group  \nThe Axiom group is a Chinese, state -sponsored, threat actor that has targeted information \nsystems that store information relevant to China’s Thirteenth Five Year Plan since 2009. \nUntil 2013, the APT p rimarily targeted intellectual property such as source code and \ninternal systems design belonging to gaming companies, as well as the digital certificates \nused by those companies. Targeting gaming companies, especially in the massive \nmultiplayer role -playi ng game (MMORPG) space, enables the threat actors to target \nmillions of users worldwide. Additionally, the theft of authentic digital certificates enables \nthe threat actor to sign and distribute malicious code as if it were legitimate. Afterward, it \nbegan to attack the pharmaceutical sector and now, Axiom targets law enforcement, \ngovernmental records and communication agencies, environmental policy agencies, \npersonnel management divisions, space and aerospace exploration and research entities, \nand governmen t auditing and internal affairs divisions. In the science and technology \nsectors, Axiom targets networks belonging to electronics and integrated circuitry \nmanufacturers, networking equipment manufacturers, internet based service companies, \nsoftware vendors , cloud computing companies, energy firms, meteorological service \ncompanies, telecommunications firms, and pharmaceutical companies. Additionally, Axiom \nhas targeted journalism and media outlets, Human Rights NGOs, international law firms, \ninternational co nsulting and analysis firms, and high -ranking United States academic \ninstitutions. Most of the target’s organizations have been located in the United States, South \nKorea, Taiwan, Japan, and the European Union, with a majority of the breaches along the \nEast ern seaboard of the United States and Western Europe.  \nAxiom campaigns share infrastructure, malware, or attack techniques with Operation \nAurora (2009), the Elderwood Project (2009 -2014), the VOHO campaign (2012), the \nShell_Crew attacks on ColdFusion server s (2013), Operation Ephemeral Hydra (2013), 13 \n \nOperation Snowman (2014), and 2014 attacks on American Middle Eastern Policy think \ntanks. Axiom could be connected to some of these other groups; however, it is more likely \nthat Axiom advantageously adopts zero -day exploits or malware that are effective in other \ncampaigns.  \nAxiom is likely Chinese state sponsored, but there is no indication whether it is operated by \na military unit or by mercenary attackers. Axiom is more sophisticated in its operations \nthan the a forementioned Third Department groups. It utilizes different resources, and it \nmay have a different mission than Third Department groups. Novetta hypothesizes that \nbased on Axiom’s domestic monitoring trends it might be charged with domestic \noperations and  targeting Chinese dissidents in other countries. Universities and research \ninstitutions in Hong Kong and mainland China have been targeted with Hikit malware for \npersistent operations. This could indicate state -sponsored concern over liberal academics \nand students.  \nAxiom targeting coincides with interests reflected in China’s Five -Year Plans, which push \nfor advanced technology and advanced R&D efforts. As China shifts away from foreign \ntechnology, more organizations may be targeted by Axiom. The actor may target \nsemiconductor and networking technology firms with offices in China because China wants \nto reduce its dependency on foreign technology. Western and Asian organizations may be \ntargeted in intelligence and counterintelligence operations. Axiom targets  NGOs concerned \nwith international politics, environmental policy, pro -democracy movements, or human \nrights movements. In some instances, Axiom will target a satellite office and move laterally \nthrough the compromised network to the main office. Novetta th eorizes that Axiom targets \nNGOs as a means of the Chinese ruling party keeping track of watchdog organizations and \nother groups who may publish claims that challenge the authority or “soft power” of the \nparty. Targeting NGOs may also enable the party to su ppress dissidents or intimidate \nwhistleblowers.  \nNovetta believes that Axiom has a six stage victim lifecycle that uses a different team for \neach stage of the attack. This indicates large scale organization and coordination. Initially, \nthe target is identif ied and the actor conducts reconnaissance. Then the system is \ncompromised, confirmed to be a valuable target, and surveyed. The actor laterally moves \nthrough the network and creates additional footholds. Compromised C2 infrastructure is \nconnected to the vi ctim network. Finally, valuable data is identified and exfiltrated.  \nAxiom initially compromises systems through web based attacks, targeted attacks against \npublic facing infrastructure, zero -day exploits, watering hole attacks, and phishing emails. \nOnce a system is compromised, Axiom spends a few days determining whether it is \nvaluable. If it is determined to contain useful information, then the group installs persistent \nmalware platforms. Otherwise, the group tries to move laterally through the network to \nlocate more valuable systems. Axiom has proven capable of compromising large pools of \nmachines and sifting through them in hours or days to find the valuable ones. This indicates \ndedicated resources, possibly a dedicated targeting team and a deterministic set of criteria. 14 \n \nAfter the initial compromise, Axiom begins reconnaissance to identify where they are in the \ntarget network and to identify any changes that have been made to the network. Axiom \nthen escalates privileges using previously compromised adminis trative accounts, local \nexploits, or remote exploits as demonstrated in ZoxRPC malware. Then, over the course of \nminutes or months, they try to dump the latest user credentials and exfiltrate the data. \nOnce inside the network, Axiom can also exploit Remote  Desktop Protocol or exploit \nvulnerabilities in the custom tools designed by the organization itself. This allows Axiom to \nobfuscate its presence from antivirus or IDS systems.  \nAs the campaign continues, Axiom may install additional families of malware as a \nmechanism of remaining in the system even if one malware is discovered by the target. \nCompromised systems have featured up to four layers of malware ranging from extremely \ncommon (Poison Ivy, Gh0st, ZXshell) to focused tools used by threat groups (Derusb i, \nFexel) to custom Axiom malware (ZoxPNG/ZoxRPC, Hikit). Axiom routes its activity \nthrough compromised proxy infrastructure in the United States, South Korea, Taiwan, Hong \nKong, and Japan to try to disguise its traffic as legitimate to casual observation.  \nNovetta observes that the Hikit malware is unique to Axiom and is only used on high value \ntargets at the height of the victim’s operational lifecycle. Of the 43,000 compromised \nsystems discovered in Operation SMN, only 180 systems were infected with the H ikit \nmalware. Hikit is a late stage persistence and data exfiltration tool that is capable of \nuploading and downloading files, generating a remote shell, tunneling into the network, \nand connecting to other infected machines to generate a secondary network.  \nHurricane Panda  \nThe Hurricane Panda group targets internet services, engineering, and aerospace \ncompanies in an attempt to steal confidential data and intellectual property.  \nHurricane Panda leverages zero -day vulnerabilities, a DNS resolution exploitati on \ntechnique, and a unique toolkit to access victim networks. The group also leverages SQL \ninjection vulnerabilities, at least three privilege escalation exploits and a remote code \nexecution exploit.  Once inside a network, it moves laterally onto a desire d system and \nestablishes an RDP session. On some victim systems, the attacker installed the remote \naccess trojan (RAT) kit or the Chopper webshell, which provides the functionality of a RAT \non webservers. The RATs employed by Hurricane Panda have been excl usively tied to other \nChinese threat actors. Notably, the Sakula malware is closely connected to the Deep Panda \ngroup, the Gh0st RAT has been tied to both Axiom and Hidden Lynx, the PlugX malware is \nconnected to the PlugX group, and the Hikit malware is us ed by Axiom. Additionally, \nindicators of compromise linked to Aurora have been found on some networks infected by \nHurricane Panda, suggesting some level of connections between the groups.  \nHurricane Panda extensively used the PlugX tool against the Califor nia based Hurricane \nElectric’s free DNS service to resolve their traffic to popular domains. This led incident \nresponders to see the traffic as originating from sites like Pintrest, Github, Adobe, and other 15 \n \nlegitimate sites. After the threat actor establis hed a persistent presence on a victim host, \nthey steal legitimate credentials using tools like Windows Credential Viewer, Windows \nCredential Editor, or Mimikatz. Afterward, the adversary reduces their footprint by using \nthe credentials to directly connect to the network and masquerade as VPN users instead of \nrelying on the RAT. If credentials cannot be obtained, then the group establishes an RDP \nconnection using a reverse RDP tunneling capability. Hurricane Panda follows the same \nexfiltration methodology as  most Chinese actors. Targeted files are compressed and \npassword protected using RAR. Then the files are moved to a convenient staging location \non the network. Finally, the files are exfiltrated via FTP.  \nGothic Panda/ APT 3/ UPS/ Pirpi/ Clandestine Fox/ TG -0110  \nIn early 2014, Gothic Panda began targeting victims in the financial sector, technology \nindustries, NGO/ International arena, aerospace and defense organizations, \ntelecommunication companies, transportation organizations, and the energy sector.  \nThe threat actor typically relies on spear phishing emails to direct targets to a landing page \nthat leverages a use -after -free vulnerability in Internet Explorer. In addition to targeted \ncampaigns, the adversary sent out phishing emails to specialized mailing  lists. Topics were \nrelated to high -performance computing, weather metadata software, and pre -medical \nprograms at universities. Victims were then infected with the Pirpi malware. The adversary \nhas also recently used zero -day Adobe flash exploits that it ob tained in the 2015 Hacking \nTeam breach. The Pirpi backdoor, which features strong detection evasion techniques, is \nsimilar to the Dreammon or Dreamclick malware. The two Pirpi variants (one for 2014 and \nanother for 2015) connect to an C2 server and parse r eturned HTML for commands. The \navailable commands include listing TCP connection status, listing all servers on the domain, \ngathering network adapter information, downloading files to memory, deleting files, listing \ndirectories, uploading files to the C2, executing processes, and other functionalities.  \nNetTraveler/ Travnet/ Netfile  \nThe NetTraveler APT was discovered in 2013 and is believed to have been active since \n2004. The group primarily targets organizations in Mongolia, India, and Russia, though a \ntotal of 350 -500 infections were detected in 40 countries. Targets are involved in space \nexploration, Academia, nanotechnology, energy production, nuclear power, lasers, \nmedicine, and communications. Government organizations (19%), private companies \n(11%), d iplomatic organizations and embassies (32%), and military organizations (9%) \nwere also heavily targeted. In recent years, the group has specifically targeted Tibetan and \nUyghur activists. The group focuses on cyberespionage and data theft. When Kaspersky L ab \ninvestigated the APT, they discovered over 22 gigabytes of stolen data on NetTraveler’s C2 \nservers. The group is believed to consist of around 50 native Chinese members who \npossess a working knowledge of the English language.  \nThe NetTraveler APT relies on social engineering, watering  hole attacks, and zero -day \nexploits to compromise victim hosts. The infection vectors leveraged Java and Microsoft 16 \n \nOffice exploits. After installation, the malware is designed for basic surveillance. It logs \nkeystrokes, cans  steal sensitive documents, and it retrieves files system listings.  \nMirage/APT 15/ Vixen Panda/ Ke3Chang/ GREF/ Playful Dragon  \nSince April 2012, the Mirage APT has targeted military and energy organizations in the \nPhilippines, Taiwan, Canada, Brazil, Israel, Egypt, and Nigeria. The most distinct \ncommonality between victims is their involvement in the contest for rights to survey \nnatural gas and oil in the South China Sea. It is believed that the intent of the campaign was \nto exfiltrate confidential information, steal intellectual property, or to construct a botnet for \nfurther infections.  \nMirage began attacks with whale -phishing em ails, targeting mid -level to senior -level \nexecutives with nefarious emails that contain malicious droppers, disguised as PDF \nattachments, that install the Mirage malware. The dropper executed and copied itself into \neither C: \\ Documents or C: \\ Windows direc tory. The dropper then executed the copy of the \nmalware and terminated the original process. The malware establishes persistence in the \nevent of reboot by creating registry keys and it obfuscates its presence through the \ncreation of one or more files named  svchost.exe, ernel32.dll, thumb.db, csrss.exe, \nReader_SL.exe, and MSN.exe. The malware profiles the system (MAC address, CPU speed, \nmemory size, system name, and user name) and sends the information back to the \ncommand and control infrastructure via an HT TP request over ports 80, 443, and 8080. In \nsome instances, SSL was used for added security. The first variant of Mirage communicated \nvia an HTTP POST request and transferred information that was lightly encrypted by \nadding each character’s ASCII value to its offset from the start of the payload. The second \nvariant of the malware communicated through HTTP GET requests and encrypted data the \nsame way as the former version except that the payload of the initial request is \nencapsulated in a Base64 -encoded stri ng. The Mirage toolkit consisted of a backdoor and a \nremote access trojan (RAT). At the time of its discovery in 2012, the command and control \nstructure consisted of over 100 domains. By the end of 2012, the Mirage campaign went \ndormant. However, some of i ts infrastructure reappeared in the 2015 Hellsing campaign.  \nHellsing/ Goblin Panda  \n The Hellsing group targets government and diplomatic organizations in the APAC \nregion, and nations near the South China Sea. Most targets are from Malaysia, the \nPhilippine s, Indonesia, and India. Hellsing was discovered when Kaspersky Lab was \ninvestigating the Naikon group and found that Hellsing had responded to a 2014 spear \nphishing email from Naikon with a custom backdoor. If both Naikon and Hellsing work for \nthe Chinese  government, this incident suggests that Hellsing is a mercenary or second tier \nhacking group; though the same could be said of Naikon. It is not clear whether Naikon \nintentionally targeted Hellsing or if the incident escalated. Hellsing responded to the s pear \nphishing request for information with a series of questions that pressed upon Naikon’s \nassumed identity (as an employee of the secretariat division of the government of the \nassumed target nation) and fake credentials. The dialogue and nuance of the ex change 17 \n \nindicates that the Hellsing members are more proficient in English than the Naikon group. \nFinally, Hellsing emailed back a “confidential” locked RAR and the accompanying password. \nThe archive contained two PDFs and a malicious SCR file. The latter f ile was a backdoor \nspecifically customized to target the Naikon group. Security researchers do not know \nwhether Hellsing infected Naikon.  \n Hellsing malware samples were primarily compiled in either UTC+6 or UTC+8. \nTypically, Hellsing infects targets throug h spear phishing emails containing password \nprotected RAR, ZIP, and 7ZIP archives. Locking the archives bypasses some security \nfeatures such as Gmail scans. Passwords are included in the emails to the target. \nCommands to the malware allow the user to uploa d files, download files, update the \nmalware, and uninstall the malware. After Hellsing establishes a variant of its backdoor, it \ndeploys information -gathering tools. One tool, test.exe, gathers system information and \ntests available proxies. Another tool, xkat.exe, operates from the Dbgv.sys driver to delete \nfiles and kill processes. In addition to operations against victims, the tools may be used to \ncleanse victim systems of the malware from other APT groups. Each instance of the \nmalware corresponds to a s pecific C2 server, a version number, and a campaign or victim \nidentifier. Some of the Hellsing infrastructure overlaps with the Mirage APT.  \nStone Panda  \nCrowdstrike identifies Stone Panda as a Chinese APT that has targeted healthcare, \naerospace, defense, a nd government organizations since May 2010. Stone Panda specializes \nin cyberespionage, network reconnaissance, data exfiltration, and lateral network \nexploration.  \nStone Panda uses spear -phishing to install the PoisonIvy RAT and IEChecker/ EvilGrab tool \nkit on victim machines. Poison Ivy is a remote administrative tool that is created and \ncontrolled by a management kit featuring a graphical user interface. The exploit kit is \nwidely available for purchase or download on the dark net; consequently, its use in high -\nlevel campaigns could indicate a lack of technical sophistication of the adversary, who \notherwise could have created a custom backdoor utility. Conversely, use of a publically \navailable tool could be an opportunistic or strategic choice as the decisio n reduces costs to \nthe campaign and complicates profiling attempts due to the ubiquity of the tool. The tool is \nalso used by Axiom and Nightshade Panda.  \nThe PoisonIvy backdoor is copied into the Windows/system32 folder and the filename and \ninstallation loc ation are defined by the attacker. Some variants of the malware are capable \nof copying themselves into an Alternate Data Stream. A registry entry is created to ensure \nthat the malware runs at startup. The malware connects to a server through encrypted and \ncompressed communication and the malware can be configured to inject itself into a \nbrowser process before establishing an outgoing connection in order to bypass some \nfirewalls. PoisonIvy gives the attacker complete control over the victim system. The most \ncommon operations include: renaming, deleting, uploading, downloading or executing files; \nviewing or editing registry keys; viewing, suspending, or killing running processes; viewing 18 \n \nor terminating network connections; viewing and controlling services; vie wing or disabling \ninstalled devices; enumerating, deleting, or uninstalling programs. PoisonIvy can steal \ninformation by taking screenshots, recording audio or webcam footage, and by capturing \nsaved passwords and hashes. Some variants feature a keylogger a nd addition functionality \nprovided by third -party plugins.  \nThe EvilGrab exploit kit is spyware that is capable of capturing audio, video, screenshots, \nand log keystrokes from infected Windows machines. It has three primary components: \none .EXE and two .DLL  files. The executable acts as the installer. One of the digital libraries \nis the loader for the other, which is the main backdoor component. Some variants delete \nthe executable after installation. Some variants, such as the IEChecker used by Stone Panda, \nare capable of stealing credentials stored in Internet Explorer and Outlook. Additionally, \nsome versions are designed to steal information from Tencent QQ, a Chinese instant \nmessaging application or to inject itself into certain security products, such as those \ndistributed by ESET, Kaspersky, and McAfee.  \nNightshade Panda  \nSince February 2008, Nightshade Panda has targeted systems belonging to media \ncorporations, NGOs and international relation organizations, and universities. It shares \nmany similarities to its sister campaign, Stone Panda. Nightshade Panda also specializes in \nnetwork reconnaissance, lateral network exploration, data exfiltration, and \ncyberespionage.  \nNightshade likely delivers malware through targeted spear -phishing emails. Nightshade \nPanda relies on the PoisonIvy malware, also used by Stone Panda and Axiom, and on the \nPlugX malware, used by Naikon. The PlugX malware performs many of the same functions \nas the PoisonIvy malware, though its more recent development, beginning in 2012 instead \nof 2008 for the former, may make it preferable for attackers. The malware consists of three \ncomponents: a legitimate file, a malicious .DLL that is loaded by the legitimate file, and a \nbinary file that contains the malicious code loaded by the .DLL.  \nPlugX als o has features that distinguish it from PoisonIvy. It can also be loaded with several \nbackdoor and other unique modules. XPlugDisk allows the malware to copy, move, rename, \nexecute and delete files. XPlugKeyLogger allows the malware to log keystrokes made on \ncurrent active windows. XPlugRegedit allows the malware to enumerate, create, delete and \nmodify registry entries and values. XPlugProcess allows the attacker to enumerates \nprocesses, collect process information, and terminates processes. XPlugNethood al lows the \nmalware to enumerate network resources and set TCP connection states. XPlugService \nallows the malware to delete, enumerate, modify and start services. XPlugShell allows the \nmalware to perform remote shell on the affected system. The malware also h as a debug log \nfile that allows attackers to monitor its performance and troubleshoot issues and errors.  19 \n \nAnchor Panda  \nCrowdstrike revealed the presence of Anchor Panda at the 2013 RSA conference. \nSupposedly the APT had launched 124 attacks in the first ha lf of 2013. Most of the attacks \nwere aimed at civilian and military maritime operations in the green/brown water regions \nin the area of operations of the South Sea Fleet of the PLA Navy. The group also targeted \ncompanies in the United States, Germany, Swed en, the UK, Australia, and other nations \ninvolved in maritime satellite systems, aerospace industries, and the defense sector. \nEmbassies, diplomatic organizations, foreign intelligence services, and foreign government \nspace programs may also have been targ eted. The target of organizations in the South \nChina Sea and in the aerospace sector distinctly align with China’s Twelfth Five -Year Plan, \nwhich was in place at the time of the attacks. It is believed that the focus of the group is \ncyberespionage and the t heft of confidential data and intellectual property.  \nAnchor Panda uses the Gh0st exploit kit, which is also employed by Axiom and Hidden \nLynx; the PoisonIvy malware, which is used by Axiom, Stone Panda, and Nightshade Panda; \nthe Torn RAT; or a custom backd oor detected by Symantec as the Anchor Panda Backdoor.  \nNumbered Panda/ APT 12/ IXESHE/ DYNCALC/ JOY RAT/ Etumbot  \nNumbered Panda targets are consistent with PRC strategic goals. In the past, it has target \nmedia outlets, high -tech companies, and government  organizations. The focus of the \ncampaign appears to be cyberespionage. It has also strategically targeted organizations \ninvolved in time -sensitive operations, such as the cleanup and containment of the \nFukushima Reactor in 2011.  \nNumbered Panda delivers i ts malware through spear -phishing emails that contain binary \nexecutables concealed as screen saver files and PDF attachments. Numbered Panda \nbypasses egress filtering implemented to prevent unauthorized communications by \ndynamically calculating the C2 port  by resolving a DNS. The malware uses two DNS names \nfor communication. One name is used for command and control, while the other is used to \nalgorithmically calculate which port it should use. One variant of the algorithm used to \ncalculate the C2 port is to  multiply the first two octets of the IP address and add the third \noctet to that value.  This is typically represented as: (A * B) + C. For example, common \nvalues might be 200.2.43.X, which would result in communication on port 443. The group \noften uses bl og and WordPress sites in its C2 infrastructure to make traffic seem legitimate.  \nThough its tools, tactics, and techniques evolve, especially after public exposure, Numbered \nPanda has been known to use the Etumbot exploit kit. The group has used the Etumb ot, \nRIPTIDE, HIGHTIDE, THREEBYTE, and WATERSPOUT backdoors. Backdoors were dropped \nfrom malicious documents that exploited CVE -2012 -0158 and relied on the “Tran Duy \nLinh” exploit kit. RIPTIDE was used from October 2012 to May 2014. The backdoor \ncommunicate s via HTTP to a hardcoded C2 server, and it is proxy -aware. Its first \ncommunication fetches an encryption RC4 key that is used to encrypt further \ncommunications.  20 \n \nHIGHTIDE is a similar backdoor that appeared in a malicious Microsoft Word document in \nan Aug ust 2014 email sent from a compromised account in a Taiwanese government \nministry to another official. The malware changes the user agent and the format and \nstructure of the HTTP Uniform Resource Identifier (URI) from the RIPTIDE variant.  \nThe THREEBYTE an d WATERSPOUT malwares also surfaced in August 2014 in a malicious \nWord document attached to a spear -phishing email to a technology company in Taiwan. \nThe backdoors appear  to be variants of HIGHTIDE.  \nHidden Lynx / Aurora  \nHidden Lynx is a 50 -100 member Chine se professional “hackers for hire” group that has \nconducted hundreds of attacks against government organizations, the financial sector, and \nthe education sector since 2009.Within the financial sector, investment banks and asset \nmanagement agencies are the primary targets. The group has also targeted stock trading \nfirms and conducted indirect attacks on organizations that supply hardware, secure \nnetwork communications, and specific services to the financial sector. Overall, the targets \nshare the characterist ics of possessing valuable information such as confidential financial \ndata, specific knowledge of potential mergers or acquisitions, or other information that \ncould give the client of the attacker a competitive advantage in the sector or specific \nknowledge  of ongoing negotiations or business deals. Microsoft claims that during \nOperation Aurora Hidden Lynx targeted databases containing court order emails. Over half \nof Hidden Lynx attacks target United States organizations, while another quarter of the \nattack s target organizations in Taiwan or China. The broad range of targets and specificity \nof the information targeted suggests the mercenary nature of the attacker. The information \nstolen is not used for direct financial gain, so it is possible that Hidden Lyn x steals \ninformation on behalf of a third party.  \nMost attacks begin as a watering hole attack or a spear phishing email; however, Hidden \nLynx has also been known to attack public facing infrastructure or hack the supply chain in \norder to distribute their malware. The majority of Hidden Lynx attacks originate from C2 \ninfrastructure located in China. Victim systems are infected with two Trojans, a mass \nexploitation Trojan (Trojan Moudoor) and a targeted Trojan (Trojan Naid). Each Trojan \nmay be managed by a d ifferent division of the team. Trojan Moudoor deploys the Moudoor \nbackdoor, which is a modified version of the “Gh0st RAT” malware. The remote access \nTrojan is used to control machines in significant campaigns against multiple large \ncompanies across severa l sectors. The Moudoor team must be sizable because the attack \nvector requires attackers to breach individual targets and to extract valuable and specific \ndata from compromised networks. Trojan Naid is used in limited attacks against valuable \ntargets. Give n its restricted use and the sophistication of its application, the team behind it \nis likely a specialized subgroup operations team within the adversarial organization. \nHidden Lynx has also used the Gresim backdoor, the Fexel backdoor, the Hikit backdoor, \nand the Derusbi malware in their exploit kit.  21 \n \nHidden Lynx adversary regularly exploits zero -day vulnerabilities, which are purchased, \ndiscovered, or reworked from other groups’ attacks. Ultimately, the adversary is \nmethodical and it tailors its exploit kit  in each attack to its victim. Hidden Lynx adapts and \nit develops custom tools or new techniques as necessary.  \n \nOvert Spy Structure  \nThe overt espionage directives of the CCP pass from the party through the Politburo \nStanding Committee (PSC) to the State C ouncil. The PSC consists of five to nine (currently \nseven) members who lead the CCP. It decides on major issues and policies when the \nPolitburo is not in session. Effectively, the PSC is the strongest decision making body in \nChina and its rulings de facto  have the force of law. The State Council, consisting of \n(currently) 35 members, including, the Premier and heads of each governmental \ndepartment, is the chief authority of the PRC. Depending on the situation, the PSC or State \nCouncil pass instructions to e ither the United Front Work Department, which exerts \ninfluence over Chinese nationals, or the Overseas Chinese Affairs Office, which exerts \ncontrol over Chinese nationals. The United Front Department or Overseas Chinese Affairs \nOffice further relays instru ctions to various communities within their respective domains.  \nUnited Front Department  \nThe United Front Department (UFD) manages relations with non -Communist Party elite \ninside and outside of China to ensure that they abide by the laws set by the Communi st \nParty.  The UFD expands the sphere of influence of the Communist Party by creating strong \nties with tongs and hometown associations in foreign nations, along with community \nleaders and, in some cases, triads and street gangs. Bonds are often formed thro ugh the \nexchange of position, informal trade agreements, or other incentives for influence.  \nOverseas Chinese Affairs Office  \nThe Overseas Chinese Affairs Office of the State Council is the division of the PRC tasked \nwith liaising with external Chinese comm unities and returning nationals. Essentially, the \nOverseas Chinese Affairs Office manages the circles of influence formed by the United Front \nDepartment.  \nConsulates and Embassies  \nCommunications between the United Front Department or Overseas Chinese Affa irs Office \nand external communities is facilitated by Chinese Consulates and Embassies.  \nTongs and Hometown Associations  \nA surprising number of influential Chinese community members as well as the leaders of \nTongs and homeowner associations act as local r epresentatives of the CCP. These members \npass directions, recruit members, and collect information within their area, of relevance to \nthe CCP. Tongs and homeowner associations can be leveraged to exert pressure or pass on 22 \n \nthreats to members of the local Ch inese communities to turn individuals into insider \nthreats in their workplace or research institution.  \nTriads and Street Gangs  \nAt the lowest level, triads and street gangs act as informants, muscle, and smugglers for the \nCCP and its operatives. The CCP ha s used triads and street gangs to disrupt protests, agitate \ndissidents, or disrupt the moral fabric of target regions by importing synthetic drugs and \nweapons.  \nChinese Student and Scholars Associations  \nAmerican universities accept a significant number of  international students for a vast \nmultitude of reasons. Some universities globally attract the most promising students, \nregardless of nationality. Other schools seek to diversify their student base in order to offer \na balanced and realistic worldview. Rea listically, many American universities target \ninternational audiences in anticipation of higher profits. For instance, in the 2013 -2014 \nacademic year, over sixty percent of Chinese students enrolled at American universities (or \norganizations sponsoring Chi nese students) paid the full tuition cost of enrollment. This \ncontributed an estimated $22 billion to the U.S. economy in 2014. Some schools even \ncaptured additional profit by charging international students additional fees. The overall \nmargin of profit ca n be significant when compared to the often -subsidized tuition rate \noffered to domestic students. The excess profits allow universities, especially private \ninstitutions that do not receive government funding, to afford their programs and to offer \nadditiona l scholarships to domestic students. In some cases, these short -term profits may \nhave long -term repercussions. Among other issues discussed later in this section, \nInternational students are less likely to remain in the area around the university to benefit  \nthe community or nation, and they are less likely to donate back to the institution after \ngraduation. Additionally, Chinese professionals trained in the United States, are returning \nto China with their accumulated knowledge and using it to improve China’s  infrastructure, \neconomy, and education system.  \n According to the Institute of International Education’s Project Atlas, approximately \n974,926 international students were enrolled in American Universities in the 2014 -2015 \nacademic year. Approximately 31.2% of the international student population (~304,040) \noriginated from China. This is a fivefold increase over the 62,523 Chinese students enrolled \nin American universities in 2004 -2005. In fact, 2015 was the sixth year in a row that China \nwas the leading plac e of origin for international students in the United States. U.S. Assistant \nSecretary of State for Educational and Cultural Affairs Evan Ryan attributes the trend to a \ngrowing middle class in China, the excellence of the American higher education system, a nd \nChina’s desire to be competitive in the 21st Century.  \nThe mutually symbiotic relationship between American Universities and Chinese students \nis not without problems. At even a basic level, the demand for overseas education caused a \n“cottage industry of  businesses” in China that assist in the preparation of students’ 23 \n \napplications. The poorly regulated industry is a hotbed for academic fraud and corruption. \nAccording to one educational consulting company, almost 90% of applicants submitted \nfake recommenda tions, 70% had others write their English entry essays, 50% forged high \nschool transcripts, and 10% listed academic awards and achievements that they did not \nreceive.  \nCurrently, the number of resident Chinese undergraduate and graduate student \npopulations  are roughly equal. This indicates that in recent years, Chinese students have \nbegun to enroll in American institutions directly after finishing high school, instead of \nobtaining an undergraduate degree from a domestic institution first. These students \ntypically attended an international high school in China to improve their English and to \nprepare for American tests, such as the SAT, rather than preparing for domestic \nexaminations. Due to culture differences and language barriers, Chinese students do not \nalways integrate well into U.S. campus and social life. College administrators and students \nrecognized a tendency for Chinese students, more than other international populations, to \nsocialize primarily within their cultural community rather than engaging wit h the broader \nacademic community. Consequently, Chinese Student and Scholar Associations (CSSAs) are \nincreasingly active at over 150 universities in the United States.  \nOfficially, CSSAs help native Chinese students balance their life, work, studies, and o ther \nissues while they are enrolled in foreign institutions such as overseas universities. CSSAs \nwere created to bridge the cultural gap between Chinese and foreign cultures at these \ninstitutions. CSSAs may also be a pivotal overt espionage platform for th e Chinese \ngovernment.  \nThe vast majority of CSSAs receive funding from the Chinese government or have an active \nliaison via the consulate back to the CCP. CSSA may be used to persuade students to act as \ntemporary or prolonged intelligence assets. It is spec ulated that for one of these reasons, \nColumbia University disbanded its CSSA in March 2015 after “ongoing violations of \nmultiple financial and student organizational policies.” Through CSSAs, students can be \nmanipulated into passing intellectual property o r research back to their home state or \nplanting malware on a university system. How many students, conditioned from birth not \nto question their government, would resist the order to plug a malicious USB into a \nresearch network if their liaison threatened t o revoke their funding or permission to study \nabroad? University networks are intentionally open and research machines are not \nconfigured with security as a priority. Compromise of a research network can enable \nChinese APTs, such as Unit 61398, to leapfrog  onto affiliated military or government \nnetworks.  \n Of the global international student population surveyed by the Institute of International \nEducation in 2014, over 65% were pursuing degrees in Business and Management, \nEngineering, Natural Sciences, or Ma thematics and Computer Sciences. Assuming that the \npercentage holds true for the Chinese population, then in 2015, over 195,000 Chinese 24 \n \nstudents may have had access to research materials that directly aligned with China’s Five -\nYear Plan.  \nAccording to a 20 11 FBI report, universities are the ideal place to “to find recruits, propose \nand nurture ideas, learn and even steal research data, or place trainees,” because young \nstudents’ minds are open to suggestion and young adults are still learning how to handle \nresponsibility, operate independently, and solve problems. While American intelligence \norganizations recruit using money, ideology, coercion or ego (MICE), Chinese intelligence \nrecruit using promises of fame, feelings of lust or anger, and short term profi ts (FLAP). In \none instance described in the report, a naïve researcher was invited to submit a paper to an \ninternational conference, after which the host requested a copy, and passed her a thumb \ndrive. The drive downloaded every file on her laptop. In anot her instance, a researcher \narranged for researchers in their home country to visit and allowed them to photograph lab \nequipment so that it could be reconstructed in their own lab. The utility of students as \nintelligence assets, while not flawless, should n ot be dismissed.  \nWhile students may not seem the best intelligence assets, China has the advantage of sheer \nnumbers. Though the approach may seem sloppy or unprofessional, relying on human \nresources to obfuscate malicious activity has the advantage of ove rwhelming American \nintelligence agencies’ attempts to track suspicious activities. The downside of this \nintelligence collection by numbers model is that assets are unreliable or untrained so \nagents may send multiple students after the same information and may receive the same \ndocument multiple times as a result. This increases operational risk and noise. America is \nnot alone in this threat. In April 2014, the Sydney Morning Herald revealed the presence of \na Chinese spy network in Australian education instit utions and reported that Australian \nlaw enforcement agencies could not properly monitor the number of potential Chinese \nspies.  \nChina collects intelligence through an application of the mosaic theory; the idea that \nthousands or millions of small pieces of information come together into a larger picture. \nThe “human machine” that generates the mosaic does not even have to be entirely \norganized or controlled by the Chinese government. China has developed its culture and \neconomy such that there are strong incen tives for spying. Operationally, the model treats \nstudents as grains of sand. Key individuals within the multitude complete small, often \nseemingly insignificant tasks at the behest of an intelligence official. Why have a single spy \nsteal 1000 documents whe n 1000 spies could each steal a single document? In the words of \nformer FBI official David Major, “If it wanted to steal a beach, Russia would send a forklift. \nChina would send a thousand people who would pick up a grain of sand at a time.” In many \ncases, the student may never realize the harm or their utility to their government. \nHolistically, only a fraction of the populace are ever active assets, yet their collective \nactions culminate in significant gains in intelligence and intellectual property.  \nUnlike  traditional intelligence organizations, China does not train its potential agents in any \nform of tradecraft. Instead, their strategy is to have the pawn lie if they are caught. The 25 \n \ntheory behind this approach is that each student’s actions are of minimal risk to the \nChinese government.  A minority of those chosen to gather intelligence abroad may be \ngroomed to fulfill their roles prior to leaving the country. This process ranges from \nreminders to remain loyal to China to regular reports of useful informati on to an active \naggressive insider threat. Those groomed and the unwitting assets can be further \ncompelled to pass more information to their handlers through threats, guilt, or a sense of \nnational pride. In addition to collecting information, student spies  may be used by CSSAs to \nwelcome visiting leaders at airports or to block protest groups from sight.  \nChinese students may also be used to coerce or recruit domestic students. University \nstudents rarely consider national security when they share notes and research materials. In \nApril 2015, the FBI warned U.S. students travelling abroad to guard themselves against \nattempts to influence their behavior or recruit them as spies. Chinese intelligence agents \ntarget students who study abroad because they are prime  candidates for positions in \ngovernments and large companies. These “seeding operations” attempt to grow study \nabroad students into potent insider threats. In a podcast, Mollie Halpern, at the FBI Office of \nPublic Affairs, noted: “To foster the relationshi p, foreign intelligence operatives will flatter \nand encourage students, show interest in their future success, and even promise to help \nthem obtain a government -issued visa or work permit —but it’s all disingenuous and empty \npromises. The truth is, the oper atives are just using the student as a pawn to achieve their \nown ends, without concern for the student’s welfare or future.”  \nThis warning was accompanied by a video featuring the story of Glenn Duffie Shriver. \nShriver was an American student who answered a  $120 ad in 2004 to write a paper on U.S. -\nChina relations. Through a series of connections, Shriver was financially coerced into \nspying on the United States for China. Over the next few years, the Chinese intelligence \nagents paid Shriver over $70,000 to at tempt to pass examinations to enter the United \nStates Foreign Service and the CIA.  In June 2010, Shriver was arrested and charged with \n“making false statements”, for failing to reveal his associations during his application to the \nCIA, and for “willingly conspiring to provide national defense information to intelligence \nofficers of the PRC.” In October 2010, as part of a plea bargain, Shriver pled guilty to one \ncount of conspiracy to commit unlawful conveyance of national defense information. In \nJanuary 20 11, he was sentenced to four years in prison, though he was released in late \n2013. According to the department of Justice, between March 2008 and October 2010, 45 \nindividuals were convicted in 26 cases involving espionage on behalf of China, though \nShriver  was the only student among them.  \nIn May 2016, growing concerns over the threat of espionage in critical research \nenvironments resulted in the State Department proposing a rule that would bar foreign \nstudents from certain research projects and classes inv olving information seen as vital to \nnational security. Of particular concern was research related to defense technologies, \nenergy engineering, and aerospace applications. The Association of American Universities, \nrepresenting 62 leading research institutio ns including Harvard, Duke University, and the \nUniversity of Chicago, as well as Stanford University, Massachusetts Institute of Technology 26 \n \n(MIT) and the University of Pennsylvania have criticized the rule, citing “disastrous \nconsequences.”  \nAcademic Solici tation  \nAs was the case with Glenn Duffie Shriver, some foreign powers attempt to solicit \nacademics through seemingly innocuous proposals or offers of collaboration. In some \ncases, such as with Shriver, these are active attempts to start a dialogue and bui ld a \nrelationship that will increase the leverage over a target asset until they are malleable. In \nother instances, academic solicitation is a covert attempt to obtain classified or proprietary \ninformation through requests to review academic papers or host  lectures. The innovation \nor insight contained in an un -vetted presentation or publication can be critical to military \nand strategic operations. For example, in 1998, Chen Dingchang, a head of a Chinese \nmilitary -sponsored research group on anti -satellite t echnology, viewed a presentation at \nthe University of Florida about diamond -coating manufacturing. The technology could also \nbe used in missile seekers and other systems. In 1999, Chen and other authors published a \nreport in a Chinese journal that credited  the Florida presentation in assisting them in \novercoming a technical bottleneck in China’s development of anti -satellite warheads.  \nAccording to a 2011 U.S. Defense Department report, “Placing academics at U.S. research \ninstitutions under the guise of legi timate research offers access to developing U.S. \ntechnologies and cutting -edge research” in such areas as information systems, lasers, \naeronautics and underwater robots. The report further stated that these attempts \nincreased eightfold between 2009 to 2010 . In other cases, professors may receive a request \nto collaborate, but they may not be fully aware of the allegiances of the requester. \nAcademia is an open, collaborative field that is built upon the nurturing of ideas amongst \ndistant and far -flung individ uals at universities around the globe. Researchers, especially in \nniche fields, may not suspect an interested party of malice; instead, they may revel in the \nsudden interest in their work. For example, several years ago, Professor Daniel J. Scheeres, \na fre quent host of visiting scholars, received a request from Yu Xiaohong to study with him \nat the University of Michigan. Xiaohong cited an affiliation to the civilian Chinese Academy \nof Sciences and she expressed “general interest” in Scheeres research into t he movement of \ncelestial bodies. When Yu arrived, her questions made Scheeres uncomfortable. Specifically, \nhe was disconcerted by her interest in military satellite -orbit applications of the field. He \ndid not deeply engage with Xiaohong and he later stoppe d accepting visiting scholars from \nChina altogether as a result of the experience.  He was unaware at the time that Xiaohong \nlisted her address as the same as the Academy of Equipment Command and Technology, \nwhere Chinese military cadets and officers are t rained, or that she had previously co -\nauthored an article on improving the precision of anti -satellite weapons. Yu Xiaohong later \nwrote a paper about the implications for space warfare of the NASA Deep Impact mission, \nwhich sent a spacecraft to collide wit h a comet.  27 \n \nFront Companies  \nAs of 2010, China had over 3200 front companies in the United States whose sole purpose \nwas to acquire American technology. That number has likely increased significantly within \nrecent years. In 2011, U.S. and Canadian universi ties earned $2.5 billion from licensing \ntechnology. Given that universities do not tend to investigate companies before licensing \nsoftware and inventions, some of the licenses may have been issued to front companies for \nChina and other foreign powers. Effo rts to detect front companies have improved through \nthe collaboration of some academic institutions with the FBI and other law enforcement; \nhowever, many universities resist such a connection out of fear that it will hamper research \nand intellectual freedo ms or establish an undesired precedent.  \nInsider Threats  \nChinese researchers trained at American universities can be leveraged by CSSAs, tongs, or \neven triads, to act as insider threats at the employment that they obtain through the \nUniversit y’s network. For example, Hanjua n Jin joined Motorola Solutions Inc. as a software \nengineer shortly after earning a master’s degree from University of Notre Dame in South \nBend, Indiana. While at Motorola, she received a second master’s degree in computer \nscience from t he Illinois Institute of Technology in Chicago. Despite the opportunities \noffered by a bountiful education, in February 2014, Hanjuan Jin, was found guilty of \nstealing trade secrets, although she was acquitted of charges that she did so to benefit \nChina’s military. Hanjaun Jin allowed the CCP to influence her life years after graduation, \ndespite living comfortably in the United States.  \nSome Chinese nationals were groomed to be international insider threats at foreign \norganizations. Others are threatened, b ribed, or otherwise coerced into passing \ninformation or compromising systems on behalf of the CCP. The insider’s contribution \ncould be as little as clicking on a spear phishing email, plugging in a USB, or distracting an \nemployee from their system.  \nMonito red Communities  \nThe Chinese university network of students or placed government officials are not limited \nto the theft of intellectual property and research. They also monitor those critical of the \nChinese regime. Students, professors, and others critical  of the Chinese Communist Party \nhave reported interrogations, and in some cases threats, when visiting China in response to \ncomments that they made thousands of miles away from Chinese shores. Tongs, triads, and \ngangs can also be used in a similar capacity  in Chinese communities. One Australian \nlecturer was interrogated four times in response to his criticisms. Joshua Philipp of Epoch \nTimes reported, “Chen Yonglin, a former Chinese diplomat at the Chinese Consulate in \nSydney, told Epoch Times when he defect ed in 2005 there were more than 1,000 Chinese \nsecret agents operating in Australia, alone.” Similarly, in an article for Business Insider, Jack \nMurphy recounts his awkward experience of naively asking a study group of himself and \nthree Chinese students at Columbia University about the practice of Falun Gong. He recalls \nthe palpable silence and fear imposed by what he thought was an innocent question and his 28 \n \nexperience discovering that he had unwittingly pitted his groupmates in a prisoner’s \ndilemma if they answered him. Jack learned that much as CSSAs, Tongs, and Triads can be \nleveraged to monitor Chinese nationals, so could communities of Chinese students be used \nto monitor each other for signs of subversion of the PRC. Within its borders, the CCP uses \nthe Great Firewall and signal intelligence to control and monitor the online activities of its \npeople. Outside of its territory, the CCP relies on overt spy organizations to monitor \npotential dissidents and there are actually allegations that the one of the de partments \ncollects covert and overt intelligence for the sole purpose of informing an application that \nmonitors the opinions and activities of every Chinese citizen, domestic and abroad. This \nconstant state of observation has induced a chilling effect in C hinese citizens, which \nprevents many from consciously subverting the CCP.  \nOne sophisticated monitoring system, referred to as the Social Credit System (SCS) will go \ninto full effect by 2020. The SCS will make Orwell’s Big Brother seem distant by \ncomparison . The SCS attributes a rating to each citizen based on constant appraisals of \ntheir physical and virtual activities, their dialogues, their patriotism, their purchase habits, \ntheir friends’ opinions of them, and numerous other characteristics. If ever a ci tizen acts \noutside predetermined parameters, then their score lowers in the system. Those with high \nscores receive tangible benefits, such as travel visas, access to business loans, and other \nincentives while those with low scores receive punishment from t he government as well as \nactive disincentives. Much like Orwell’s dystopia, the system rewards those who report \n“breaches of trust.” One example of a disincentive is that those who score low may become \nsocial pariahs because the SCS actively punishes those  with a higher score from associating \nwith those below them. Currently, methods of developing SCS scores are being tested at \neight companies under state -approved pilot programs. One such pilot focuses on 400 \nmillion users of the Alibaba network to develop scores based on financial information and \npurchasing habits. While the algorithm is fine -tuned, China is implementing the \ninfrastructure to make the Social Credit System feasible within the mainland. Moreover, \nexternal communities may not be exempt from mo nitoring.  \nIn September 2015, Joshua Philipp of Epoch Times reported that Lenovo, Huawei, Xiaomi, \nand other devices manufactured in China had preinstalled spyware that allowed Chinese \ncompanies to track users, listen to calls, and make online purchases. Worse yet, many of the \nproducts manufactured in China already feature language in the terms and conditions \nauthorizing the Chinese government to monitor the data that passes through the devices \n(even those located in the United States) for indicators of su bversion against the CCP. By \nusing the devices, the users unwittingly agree to abide by the laws and authority of the \nChinese Communist Party. Moreover, many companies that operate in China are already \nsubject to rigid compliance regulations, such as the i nclusion of a CCP liaison and in some \ncases, backdoors into hardware and software. Currently, every company operating within \nChinese borders with more than 50 employees are required to have at least one liaison to \nthe Communist Party on site. For example, Joshua Philip of Epoch Times explains, “At \nMitsubishi Electric (Guangzhou) Compressor Co., Ltd., the number of CPC members exceeds 29 \n \n100, and nearly half of the managers above the team leader level are CPC members at the \nJapanese company.\" He adds, \"Chen Kai long with the Party School of the CPC Central \nCommittee said foreign companies are increasingly supportive of establishing Party \nbranches because they help with the enforcement of Chinese laws and regulations and \nmediation in labor disputes.” These liaison s can internally influence the organization or act \nas insider threats.  \nChina’s new cybersecurity law proposes even greater censorship and control over \ncompanies. Under the guise of added security for its people, the CCP may require any \ncompany that operate s in China to allow the Chinese government unrestricted access to \ntheir systems and control over their internet access. In effect, the CCP could install \nbackdoors and spyware in every device that passes through China. Even if foreign citizens \nsomehow manag e to avoid purchasing devices manufactured in China, their lives may be \nmonitored through numerous public IoT devices of which China is the sole manufacturer.  \nThis global espionage platform can be combined with the dossiers and databases \nconstructed from the information exfiltrated in the incessant cyberattacks conducted by \nChinese APTs, to gain unparalleled advantage over the global population.  \nConclusion  \nICIT research rarely fills pages with artistically designed info graphics, charts or graphs. \nInstead  we compose our reports with raw, interlinking linguistic tiles with a 12 -point font \nand single spaces. Our research is meant to shed light and inform rather than impress and \noffer silver bullet solutions. For the past year, this particular report has been  heavily \nrequested by federal agencies, members of Congress, journalists and private sector \norganizations that have been profoundly affected by Chinese intellectual property theft. \nWith such a high stakes topic about a state adversary that has had such a d evastating \nimpact on industry, economy and National security, we found it necessary to pay less \nattention to softball language and zero in on the facts and realities of this particularly \ndevious antagonist.  \nThis report was not about China’s grotesque human  rights violations, their poor \nmanufacturing quality, fifty cent trolling army propaganda or continuous feuds between \ntheir military and government. And this report was not about the latest conversations of \nbyte for byte retaliation by industry against Chi nese actors with weaponized data and \ncyber -attack. This report is about the layers of espionage and theft and those malicious \nactors who carry out these overt and covert attacks on Western industry. Uncovering the \nlayers and pinpointing the contributors an d liberating this document into public discussion \nare the first steps in understanding a complicated adversary with the intent on combatting \nits initiatives.  \nCombatting the complicated layers of China’s multipronged attack means erecting \nprofound layers of  cyber and physical security composed of bleeding edge technology and \nthe latest in counter intelligence expertise. True multinational threat sharing between 30 \n \nindustry and law enforcement compounded by a judicial system that combats insider \nthreats and IP t heft with harsh penalties will pave the way for the legislative community to \nbring forth a new standard in international cooperation to combat the Chinese menace.  \n  31 \n \nContact Information  \n \nLegislative & Executive Branch Inquiries:   \n James Scott, Senior Fellow , ICIT (james@icitech.org, 202 -774 -0848)  \nFederal Agency Inquiries:   \n Parham Eftekhari, Senior Fellow, ICIT (parham@icitech.org, 773 -517 -8534)  \n \nLinks \n \nWebsite:           www.icitech.org  \n \n       https://twitter.com/ICITorg \n \nhttps://www .linkedin.com/company/institute-for-critical-infrastructure-\ntechnology-icit- \n \nhttps://www .facebook.com/ICITorg \n \n \n  \n32 \n \nSources:  \nThe Atlantic:  \nhttp://www.theatlantic.com/education/archive/2015/05/american -universities -\nare-addicted -to-chinese -students/394517/  \nAmerica En terprise Institute:  \nhttps://www.aei.org/publication/chinese -economic -espionage -mixed -signals -at-\nyears -end/  \nBBC:  \nhttp://www.bbc.com/news/world -asia -china -34592186  \nBloomberg:  \nhttp://www.bloomberg.com/news/articles/2012 -04-08/american -universities -\ninfected -by-foreign -spies -detected -by-fbi \nBusiness Insider:  \nhttp://mobile.businessinsider.com/chinese -student -spies -2015 -8 \nChinese in the U.S.:  \nhttp://www.chineseinus.com/cssa_list.htm  \nCNBC:  \nhttp://www.cnbc.com/2015/09/25/us -china -agree -to-not-conduct -cybertheft -of-\nintellectual -property -white -house.html  \nCrowdStrike:  \nhttp://go.crowdstrike.com/rs/281 -OBQ -\n266/images/ReportGlobalThreatIntelligence.pdf  \nhttp://www.slideshare.net/CrowdStrike/crowd -casts -monthly -you-have -an-\nadversary -problem  \nhttps://www.crowdstrike.com/blog/whois -anchor -panda/  \nhttps://www.crowdstrike.com/blog/whois -numbe red-panda/  \nDark Reading:  \nhttp://www.darkreading.com/endpoint/chinese -cyberspies -pivot -to-russia -in-\nwake -of-obama -xi-pact/d/d -id/1 324242 ? \nhttp://www.darkreading.com/attacks -and-breaches/crowdstrike -falcon -traces -\nattacks -back -to-hackers/d/d -id/1110402  33 \n \nData -Informed:  \nhttp://data -informed.com/china -social -credit -system -a-frightening -use-of-big-\ndata/  \nThe Diplomat:  \nhttp://thediplomat.com/2015/09/remember -chinas -announced -300000 -troop -\ncut-not-everyones -happy -about -it/ \nEpoch Times:  \nhttp://www.theepochtimes.com/n3/968736 -chinese -student -spies -overwhelm -us/ \nhttp://www.theepochtimes.com/n3/1094262 -chinas -silent -war -on-the-us/ \nhttp://www.theepochtimes.com/n3/1748900 -spy-software -found -pre-installed -\non-lenovo -huawei -and-xiaomi -smartphones/  \nF-Secure:  \nhttps://www.f -secure.com/v -descs/backdoor_w32_poisonivy.shtml  \nFBI:  \nhttps://www.fbi.gov/about -us/investigate/counterintelligence/higher -education -\nand-national -security#disablemobile  \nFireEye:  \nhttps://www.fireeye.com/blog/threat -\nresearch/2014/11/operation_doubletap.html  \nhttps://www.fireeye.com/blog/threat -research/2014/06/clandestine -fox-part -\ndeux.html  \nhttps://www.fireeye.com/blog/threa t-research/2015/06/operation -clandestine -\nwolf -adobe -flash -zero -day.html  \nForbes:  \nhttp://www.forbes.com/sites/jnylande r/2015/03/25/columbia -university -closes -\nchinese -student -organisation/#559748c24f4d  \nForeign Policy:  \nhttp://foreignpolicy.com/2015/11/16/china -us-colleges -education -chinese -\nstudents -university/  \nThe Hacker News:  \nhttp://thehackernews.com/2015/03/china -cyber -army.html  34 \n \nHomeland Security To day:  \nhttp://www.hstoday.us/single -article/china -based -adversaries -pose -major -cyber -\nthreat -in-2016/a9252680701 e315c9b06f1762be9b7a2.html  \nICIT:  \nhttp://icitech.org/know -your -enemies -2-0/ \n \nInstitute of International Education:  \nhttp://www.iie.org/Services/Project -Atlas/United -States/International -Students -\nIn-US#.V3sxoaKo0jc  \nhttp://www.iie.org/Who -We-Are/News -and-Events/Press -Center/Press -\nReleases/2014/2014 -11-17-Open -Doors -Data#.V3szrqKo0jc  \nKaspersky Labs:  \nhttps://securelist.com/blog/research/35936/nettraveler -is-running -red-star -apt-\nattacks -compromise -high -profile -victims/  \n \nLA Times:  \nhttp://www.latimes.com/world/asia/la -fg-china -us-student -spying -20140507 -\nstory.html  \nListverse:  \nhttp://listverse.com/2016/02/05/10 -ways -china -might -be-spying -on-you/ \nThe New York Times:  \nhttp://www.nytimes.com/2014/06/10/technology/private -report -further -details -\nchinese -cyberattacks.html?_r=0  \nPalo  Alto Networks:  \nhttp://researchcenter.paloaltonetworks.com/2015/07/ups -observations -on-cve-\n2015 -3113 -prior -zero -days -and-the-pirpi -payload/  \nReuters:  \nhttp://www.reuters.com/article/us -cybercrime -usa-china -\nidUSKCN0J42M520141120  \nhttp://mobile.reuters.com/article/idUSKCN0WG2L5  \nhttp://news.trust.org/item/20160520140331 -0ui5x/  \nhttp://www.reuters.com/article/us -college -cheating -iowa -special -report -\nidUSKCN0YG2T5  35 \n \nhttp://m obile.reuters.com/article/idUSKCN0YB1QT  \nhttp://www.reuters.com/article/us -china -cyber -lawmaking -idUSKCN0ZD1E4  \nSymantec:  \nhttps://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=2\n6611  \nThe Sydney Morning Herald:  \nhttp://www.smh.com.au/national/chinese -spies -keep -eye-on-leading -universities -\n20140420 -36yww.html  \nThreatpost:  \nhttps://threatpost.com/naikon -apt-group-tied -to-chinas -pla-unit -78020/114798/  \nTrend Micro:  \nhttp://blog.trendmicro.com/trendlabs -security -intelligence/evilgrab -malware -\nfamily -used -in-targeted -attacks -in-asia/  \nhttp://www.trendmicro.com/vinfo/us/threat -encyclopedia/web -\nattack/112/pulling -the-plug -on-plugx  \nThe United States Patent and Trademark Office:  \nhttp://www.uspto.gov/sites/default/files/news/publications/IP_Report_March_20\n12.pdf . \nThe Wall Street Journal:  \nhttp://www.wsj.com/articles/heavy -recruitment -of-chinese -students -sows -\ndiscord -on-u-s-campuses -1458224413  \nThe Washington Post:  \nhttp://voices.washingtonpost.com/spy -\ntalk/2010/07/cia_applicants_arrest_tops_wav.html  \n "
}