{
    "title": "iranian cyber espionage group copykittens",
    "text": "Search Dark Reading\nNetwork Computing Dark Reading\n Welcome Guest Login to your account Register Advertise About Us\nFollow DR:\n Authors Slideshows Video Tech Library University Radio Calendar Black Hat News\nTHE\nEDGEANALYTICS ATTACKS /\nBREACHESAPP SEC CAREERS &\nPEOPLECLOUD ENDPOINT IoT OPERATIONS PERIMETER RISK THREAT\nINTELLIGENCEVULNS /\nTHREATS\nSPONSORED CONTENT\nFormer Twitter CISO Details Strategies for\nCloud and Data Security.\nThough companies have readily embraced cloud and software-as-a-\nservice (SaaS), they're still struggling with cloud security, according to\nMichael Coates, CEO and co-Founder of Altitude Networks. Coates, a\nformer CISO for Twitter, also explains how companies can avoid the\nchallenge of balancing user productivity with securing sensitive\ncompany data.\nLEARN MORE\nBrought to you by PrevailionSponsored Content\nIndicators of Compromise are Dead. Now\nWhat?\nOrganizations must pivot toward a new and superior class of\nthreat intelligence known as \"evidence of compromise\" that\ndoesn't require human analysts and is instantly actionable.\nCOMMENT   | EMAIL THIS   | PRINT   | RSS\nWebcasts\nBuilding an Enterprise\nStrategy for Detection\nand Response (XDR)\nCyber Attack Evasion\nTechniques\nMORE WEBCASTS\nWhite Papers\n2020 IT Salary Survey\nResults Revealed\nNetFlow vs Packet\nData\nMORE WHITE PAPERS\nReports\n2020 IT Salary Survey\nResults Revealed\n[Report] DevSecOps &\nSecure App Delivery:\nWhat's Working &\nWhat's Not\nMORE REPORTS\n50%\n 50%\n0 COMMENTS\nCOMMENT NOW\nTweet\n7/25/2017\n07:00 PM\nJai Vijayan\nNews\nConnect Directly\nLogin\nNEWEST FIRST   |  OLDEST FIRST   |  THREADED VIEW\nIranian Cyber Espionage Group\nCopyKittens Successful, But Not\nSkilled\nDespite being only moderately skilled, CopyKittens has exfiltrated\nlarge volumes of data since at least 2013.\nIt doesn't always take a highly skilled adversary to create major problems for\norganizations. Sometimes, unsophisticated but persistent threat actors can be\njust as effective at it.\nOne example is CopyKittens, a cyber espionage group with links to Iran that\nhas been operating since at least 2013. The group, profiled  in a report this\nweek from Israel-based ClearSky Cyber Security and Trend Micro, so far has\ndisplayed little of the sophistication associated with many modern state-\nsponsored cyber espionage operations.\nYet, it has successfully managed to exfiltrate large volumes of data from\ntargeted military and government organizations, academic institutions,\nmunicipal authorities and IT companies in Israel, Turkey, Saudi Arabia,\nJordan, and the United States.\nIn the years it has been around, the group has used dozens of domains,\nmany of them impersonating companies such as Microsoft, Google, Amazon,\nFacebook, and Oracle, for malware delivery, hosting malicious sites, and for\ncommand-and-control.\nDespite its apparently limited resources, the group has also managed to\nbreach several online news media outlets and general websites, which were\nthen used in watering hole attacks.\n\"They are in the lower bar of cyber espionage groups,\" says Eyal Sela, head\nof threat intelligence at ClearSky. \"They don't use 0-days and their self-\ndeveloped tools are inferior in many aspects to those of others.\"\nThe group's tactics, techniques and procedures (TTPs) in general have been\nunremarkable and have included common approaches such as malicious\nemail attachments, phishing, web application attacks, and, starting only late\n2016, a few watering hole exploits.\nTheir continued success highlights how a persistent but\nrelatively unadvanced threat actor can still succeed and reach their\nobjectives, Sela says. \"Organizations in sectors and countries of interest to\nIran are at risk of being targeted,\" and should make it a point to understand\nthe group's TTPs he cautions.\nFor example, CopyKittens has a tendency to try and breach an organization's\nnetwork via weaknesses in the IT supply chain. It also has a tendency to do a\nlot of DNS-based data exfiltration and command-and-control so organizations\nthat believe they could be targets should monitor their DNS infrastructure.\nSimilarly, social media channels—such as fake Facebook profiles—have\noften been used to get close to and breach target organizations, Sela said.\nThis week's report on CopyKittens marks the third time that ClearSky has\npublished an analysis of the threat group. The new report includes some\nfresh details on the group's activities, details on newly developed malware\nand a list of tens of new domains that are currently up and running and being\nused by CopyKittens for malware delivery and attacks.\nAmong the newly developed malware samples described in the Clear Sky and\nTrend Micro report this week is a .NET backdoor that provides attackers with\na way to download and execute malware on a target system, and a tool that\nenables lateral movement in a compromised network using stolen credentials.\nAV tools in VirusTotal did not detect several of the new tools developed by the\ngroup.\nMany of the tools that the group has used to exploit networks have legitimate\npurposes. For example, CopyKittens often has used a trial version of a\ncommercial software tool called Cobalt Strike to search for and penetrate\nvulnerabilities in target networks. Other similar tools that it has used include\nMetasploit, Mimikatz, and software like Havij for detecting vulnerable web\nservers.\n\"It seems that their objective is to gather as much information and data from\ntarget organizations as possible,\" Sela says. \"They indiscriminately exfiltrate\nlarge amounts of documents, spreadsheets, files containing personal data,\nconfiguration files, and, databases.\"\nThe sheer scope and duration of the campaign suggests that CopyKittens is\na nation-state sponsored group, he says. The fact that the threat actor does\nnot appear motivated by financial gain, and its multiple ties to Iran and Iranian\ninterests suggest strong nation-state support, he added.\nRelated content:\nIranian Hackers Believed Behind Massive Attacks on Israeli\nTargets\nIran Intensifies Its Cyberattack Activity\nSaudi Arabia Issues Alert On Shamoon 2\n8 Hot Hacking Tools to Come out of Black Hat USA\n \nJai Vijayan is a seasoned technology reporter with over 20 years of\nexperience in IT trade journalism. He was most recently a Senior Editor at\nComputerworld, where he covered information security and data privacy\nissues for the publication. Over the course of his 20-year ... View Full Bio\nINSIGHTS\nMORE INSIGHTS\nCOMMENTS\nBe the first to post a comment  regarding this story.\n2 Many Ransomware Attacks Can be\nStopped Before They Begin\nJai Vijayan, Contributing Writer,  3/17/2020\n1 Why CSP Isn't Enough to Stop\nMagecart-Like Attacks\nHadar Blutrich, CTO & Co-founder, Source\nDefense,  3/11/2020\n1 How the Rise of IoT Is Changing the\nCISO Role\nPhil Neray, VP of IoT & Industrial Cybersecurity\nat CyberX,  3/11/2020\nSUBSCRIBE TO NEWSLETTERS\nWEBINAR ARCHIVESBuilding an Enterprise Strategy for Detection and\nResponse (XDR)\nThe ROI Story: Identifying & Justifying Disruptive\nTechnology\n5 Steps to Integrate SAST into the DevSecOps Pipeline\nMORE WHITE PAPERSWHITE PAPERS\n2020 IT Salary Survey Results Revealed\nNetFlow vs Packet Data\n2020 Trends to Watch: Cybersecurity\nNetwork Traffic Analysis Instrumentation Guide\n5 Ways to Get Better Data for Incident Response and\nThreat Hunting\nALL VIDEOSVIDEO\nCARTOON ARCHIVECARTOON\nLatest Comment: Unfortunately nobody wants to spend\nmoney on security. Usually they change their mind but\noften it is too late\nDOWNLOAD THIS ISSUE!\n6 Emerging Cyber Threats That\nEnterprises Face in 2020\nThis Tech Digest gives an in-depth look at six emerging\ncyber threats that enterprises could face in 2020.\nDownload your copy today!\nBACK ISSUES  | MUST READSCURRENT ISSUE\nALL POLLSFLASH POLL\nHas the U.S. political climate caused\nyou to make infosecurity-related\nchanges to your disaster\nrecovery/business continuity plans?\n Yes\n No\n No but we are considering it\n Still waiting for cybersecurity guidance from\nTrump admin EO\n Don't know\n Other (Please explain in the comments)\nSubmit\nDOWNLOAD NOW!\nState of Cybersecurity Incident\nResponse\nData breaches and regulations have forced\norganizations to pay closer attention to the security\nincident response function. However, security leaders\nmay be overestimating their ability to detect and respond\nto security incidents. Read this report to find out more.\nHow Enterprises Are Developing and\nMaintaining Secure Applications0 COMMENTS\nHow Enterprises are Attacking the\nCybersecurity Problem0 COMMENTS\nHow Data Breaches affect the Enterprise\n0 COMMENTS\nMORE REPORTS\nTWITTER FEED\nBUG REPORT\nENTERPRISE VULNERABILITIES\nFrom DHS/US-CERT's National Vulnerability Database\nCVE-2020-3922\nPUBLISHED: 2020-03-18\nLisoMail, by ArmorX, allows SQL Injections, attackers\ncan access the database without authentication via a\nURL parameter manipulation.\nCVE-2020-10659\nPUBLISHED: 2020-03-18\nEntrust Entelligence Security Provider (ESP) before\n10.0.60 on Windows mishandles errors during SSL\nCertificate Validation, leading to situations where (for\nexample) a user continues to interact with a web site\nthat has an invalid certificate chain.\nCVE-2020-8468\nPUBLISHED: 2020-03-18\nTrend Micro Apex One (2019), OfficeScan XG and\nWorry-Free Business Security (9.0, 9.5, 10.0) agents\nare affected by a content validation escape vulnerability\nwhich could allow an attacker to manipulate certain\nagent client components. An attempted attack requires\nuser authentication.\nCVE-2020-8470\nPUBLISHED: 2020-03-18\nTrend Micro Apex One (2019), OfficeScan XG and\nWorry-Free Business Security (9.0, 9.5, 10.0) server\ncontains a vulnerable service DLL file that could allow\nan attacker to delete any file on the server with SYSTEM\nlevel privileges. Authentication is not required to exploit\nthis vulnerability.\nCVE-2020-8598\nPUBLISHED: 2020-03-18\nTrend Micro Apex One (2019), OfficeScan XG and\nWorry-Free Business Security (9.0, 9.5, 10.0) server\ncontains a vulnerable service DLL file that could allow\na remote attacker to execute arbitrary code on affected\ninstallations with SYSTEM level privileges.\nAuthentication is not required to exploit th...VULNERABILITIES / THREATS\nLike\nShare\nADVERTISEMENT. CLICK FOR SOUND.\nAltitude Looks to Improve Security of C\n …\nHOT TOPICS EDITORS' CHOICE\n WEBINARS  \n REPORTS  \nDiscover More From Informa Tech\nInterop\nInformationWeek\nNetwork ComputingIT Pro Today\nData Center Knowledge\nBlack HatContact us\nAbout Us\nAdvertise\nReprintsWorking With Us Follow DarkReading On Social\nHome Cookies CCPA: Do not sell my personal info Privacy Terms\nCopyright © 2020 Informa PLC Informa UK Limited is a company registered in England and Wales with\ncompany number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.6 COMMENTS\nRansomware Trains Its\nSights on Cloud ...\n1 COMMENTS\nQualys Launches Free\nApp for IT Asset ...\n "
}