{
    "title": "iranian hackers said to use facebook to spy on israelis _ the times of israel",
    "text": "You Might Also like\nYou Might Also like\nSponsored Content\nYou Might Also like\nSponsored Content\nDemonstrators protest\nKnesset closure,\nscuffle with police in\nJerusalem\nBy TOI STAFF\nCops try to block convoy of cars from\nreaching capital, later arrest 5 outside\nparliament building; opposition leaders\ndecry law enforcement’s actions as\nundemocratic\nKnesset speaker, Netanyahu\npounded as ‘undemocratic’ after\nlawmakers locked out\nAnalysis /Why Israel’s\npoliticians shuttered the\nKnesset just when\nIsraelis needed it most\nKnesset legal adviser says\nspeaker can’t keep parliament\nclosed\nLIVE\nBlue and White\npetitions High Court\nagainst Edelstein’s\nclosure of Knesset\nBy MICHAEL BACHNER , JACOB MAGID  and JUDAH ARI\nGROSS\nCentrist party’s Avi Nissenkorn storms\nout of coronavirus brie ng, says such\nupdates should be provided to Knesset\ncommittees, which can’t happen until\nparliament reopened\n18min ago\nTrump: US approves anti-malarial\ndrug to treat coronavirus\n26min ago\nGantz to agree to unity\ngovernment with Netanyahu first\nas PM -- report\n32min ago\nIran furloughs imprisoned US Navy\nvet amid virus concerns\n37min ago\nIsraelis, including Netanyahu,\ncheer for medical staff battling\npandemic\nBy TOI STAFF\nJump of 96 sick people over day earlier,\npartially due to increase in number of\ntests given; most patients doing well, 6\nremain in serious condition\nNumber of confirmed\nvirus cases hits 529 as\ntesting ramps up\nSeriously ill virus patients had\nprior health issues; condition of 2\nworsens\nIsrael seals its borders to all\nforeigners amid coronavirus\noutbreak\nCoronavirus crisis /Total\nlockdown can be avoided if public\nobeys orders — top health official\nFROM THE BLOGS\nYOSSI KLEIN HALEVI\nCorona in Jerusalem:\nWhat story will we tell?\nThe morning after Israel’s  rst non-\nmilitary emergency, will we awake\neven more divided against ourselves\nor remember we were all in this\ntogether?\nBy TOI STAFF\nOf cials deny claim that equipment,\nbrought to Israel by the spy agency from\nan undisclosed country, did not answer\nthe needs of the medical system\nCORONAVIRUS CRISIS\nBrushing aside doubts,\nHealth Ministry,\nNetanyahu praise\nMossad test kit caper\nMossad said to bring in 100,000\nvirus tests, but usefulness of kits\ndoubted\nTo ease global virus test\nbottleneck, Israeli scientists\nsuggest pooling samples\nFirst quarantine-breaker charged\nas police seek to keep Israelis at\nhome\nBlue and White’s Lapid: Virus\nresponse shows Israel ‘no longer a\ndemocracy’\nIn age of coronavirus,\nbattered vacation\nrental market touts\nquarantine pads\nBy JESSICA STEINBERG\nWith high rate of Passover and\nsummer cancellations, short-term\nrental businesses try to salvage\npro ts through rentals to stranded\ntourists and returning Israelis\nTel Aviv, Jerusalem hotels begin\nhousing coronavirus patients\nNetanyahu: There may be  nes for\nviolating Health Ministry orders\nISRAEL MEDIA REVIEW\nWelcome to the\ncoronacracy: 6 things to\nknow for March 19\nBy TOI STAFF\nIsrael’s democracy could be the  rst\ncasualty of the pandemic, pundits warn,\nas parliament is shuttered by the Likud\nspeaker, preventing oversight of the\ngovernment\nFlight carrying Israelis stuck in\nPeru after border closure set to\ndepart\nAmid shortages, Defense Ministry\nto take over buying corona-related\nmedical gear\nAs virus keeps Israelis\nhome, internet is coping\nwith the higher loads… so\nfar\nBy SHOSHANNA SOLOMON\nIsrael has seen a 25% rise in internet use\nover the past 2 weeks as citizens log in for\nonline schooling, business\nvideoconferences, Pilates lessons\nOnline learning for elementary\nand middle school students to end\nThursday\nVirus keeps at least 500 million\npeople around the world at home\nCORONAVIRUS CRISIS\nICC prosecutor requests\nmore time to weigh\njurisdiction over Palestinian\nareas\nBy RAPHAEL AHREN\nAs The Hague shuts its doors due to\nCOVID-19, Fatou Bensouda requests\nadditional month to say if she still believes\nthe court has jurisdiction to open war\ncrimes investigation\nSettlement construction dips in\n2019 but building approvals soar\n— watchdog\nSwiss relief expert Philippe\nLazzarini appointed UNRWA chief\nVirus presents new\nmental health\nchallenges, even for\nbattle-hardened\nIsraelis\nBy NATHAN JEFFAY\nExperts warn that resilience\nlearned in times of terror may not\nbe enough to equip people\nemotionally for the new reality\nArab sellers in Jerusalem’s Old\nCity bemoan virus as ‘worse than\nwar’\nANALYSIS\nRON KAMPEAS\nWhy Arab Israeli parties\nbacking Gantz for prime\nminister is historic twist\nJoint List’s recommendation of the Blue\nand White leader, and his embrace of its\nsupport, is leap from unimaginable to\ninevitable for Arab Israeli voice at the\nnational table\nBlue and White said to\ndemand Justice, Foreign\nministries for unity\ngovernment\nBy TIM SULLIVAN  and ANITA SNOW\nWhite House presses for $1 trillion rescue\npackage as global economic crisis sparked\nby coronavirus continues to spiral, deaths\nshoot up in Italy\nCORONAVIRUS CRISIS\nTrump invokes wartime\nemergency authority; no\nnew cases in Wuhan\nTrump signs $100 billion\ncoronavirus relief package\nUS to close Canada border to ‘non-\nessential’ traffic, Trump declares\nTwo US congressmen test positive\nfor coronavirus\nGovernment offers NIS\n50 million to coronavirus-\nfighting startups\nBy LUKE TRESS\nProgram headed by Israel Innovation\nAuthority to provide grants to  rms with\npotential technological solutions for\ncombating pandemic\nRothschild Foundation donates\nNIS 50 million to boost hospitals’\nvirus battle\nUp to 5,000 Israelis filing for\nunemployment every hour after\nsurge in layoffs\nBank of Israel to loan banks up to\n$15b. as shekel slides against\ndollar\nINTERVIEW\nYiddish theater gives\nfans what to kvell\nover as stars\nbroadcast from home\nBy JORDAN HOFFMAN\nNational Yiddish Theatre\nFolksbiene reaches out to\nsequestered audiences with free\nonline programming, even as they\nfaithfully prepare for the opening\nof a new show in MayMARCH 19, 2020\nCURRENT TOP STORIES\nSCROLL TO VIEW MORE\nIn Israel and US, many refuse to let virus infect their\nPurim partying\nShin Bet says it nabbed Arab Israeli Hamas agent who\nposed as aid worker\nAs Israel rolls out virus rules, dozens rush to exit planes\nheading for Europe\nIsraeli defense firm Elbit wins US Air Force contract worth\nup to $476 million\nPowerful storm set to batter Israel with 100-kph winds,\nmassive flooding\n2 NFL players train with the Israeli army\n Israeli actress: I left Al Pacino because he’s old, plus he’s\nstingy\nPolice bid to convince rabbi to close yeshivas as his sect\ndefies virus rules\nUS Army scraps $1b. Iron Dome project, after Israel\nrefuses to provide key codes\nMom-and-pop cafes and shops in Jerusalem struggle with\nnew coronavirus reality\nIsraeli coronavirus patient back from Italy apologizes ‘for\nany harm’\nBank of Israel to loan banks up to $15b. as shekel slides\nagainst dollar\nHebrew ‘My Corona’ spoof of The Knacks classic proves\ncatching\nSmokers appear to be at higher risk from coronavirus –\nexpert\nThe 7 Jewish actresses who shaped Hollywood as we know\nit\nFearing the end is nigh, man returns stolen 2,000-year-old\nartifact to park\nIn blow to Gantz, Gesher’s Levy-Abekasis appears to doom\nminority coalition bid\nCoronavirus: What we know and what we don’t\n Government offers NIS 50 million to coronavirus-fighting\nstartups\nTop Iranian cleric okays buying future Israeli coronavirus\nvaccine\nMy family is among 80,000 Israelis living in quarantine. Here’s what\nit’s like\nReport: Pence pushed Israel to quarantine all arrivals rather than\nsingle out US\nAthletes take a knee in protest during playing of Israeli anthem at\nYeshiva U\nNetanyahu meets ultra-Orthodox leaders to persuade them to shutter\nyeshivas\nVirus is biological attack on China and Iran, Iranian civil defense\nchief claims\nRacing for a coronavirus vaccine, Boston scientist hopes someone\nbeats him to it\nGet The Start-Up Israel's Daily Start-Up by\nemail and never miss our top storiesFREE SIGN UPHackers, most likely in Iran, have been using fake profiles on Facebook,\nTwitter, and other social media networks to mine data from Israeli,\nAmerican, and British corporations and government bodies. An American\nsecurity group, iSIGHT Partners, on Thursday published details of the\nscam , describing how the hackers conducted “a coordinated, long-term\ncyber espionage campaign” to target more than 2,000 government and\nbusiness officials.\nIt was an elaborate, well-organized version of a classic “spear phishing”\ncampaign, in which users are either tricked into giving up personal\ninformation, like logins or passwords, or have their data hijacked by\nmalware that gets onto their systems when they click on links, iSIGHT said.\nAnd while there’s no direct proof that Iran is behind the scam, the\ncompany said, there was plenty of circumstantial evidence — including the\ntimes of day when the hackers connected with their victims, connecting at\nodd hours and taking breaks that corresponded, among other things, with\nmidday “siesta time” in Tehran.\nThe scam, called “Newscaster,” has been going on since at least 2011,\niSIGHT said, with hackers building online personalities using detailed,\nbelievable personal profiles on social networks like Facebook, Twitter,\nLinkedIn, Google+, YouTube, Blogger, and others. The profiles ostensibly\nbelonged to journalists, defense contractors, and government officials,\npositioning themselves as strong supporters of Israel and connecting with\nvictims who were also strong supporters of Israel.\nAt least 2,000 top-level politicians, diplomatic personnel, Congressional\naides, journalists, and others were victims of the scam, said iSIGHT.\nThe hackers would send out links to news stories on a phony journalism\nsite (a hotbed of plagiarism, iSIGHT said) called Newsonair.org. Once\nfriended, victims of the scam would be sent spear-phishing messages,\ndirecting them to links where they would be asked to provide personal\ninformation or enter a login and password (on the theory that most people\nuse the same login/password for multiple sites), which the hackers would\nuse to break into victims’ email and other personal accounts.\nIn addition, the hackers would attach malware to the links, surreptitiously\nloading a victim’s system with spyware that would stealthily collect\npassword information for accounts. The malware, said iSIGHT, was “not\nparticularly sophisticated, but it includes capability that can be used for\ndata exfiltration.”\nWhile phishing scams go on all the time and are conducted by all manner of\nInternet criminals, the level of sophistication and organization indicates\nthat the people behind the scam belonged to a large organization, and the\ntype of victims targeted indicates that it was conducted by a government\nseeking to get information about defense systems, strategies, and policies.\nThat the main targets were Israelis and supporters of Israel in the US and\nthe UK — and that the topic of discussion was usually Israeli defense —\nmakes it most likely that Iran is the culprit.\nThe scam, the company said, may have been Iran’s cyber-response to\nStuxnet, in which Israeli hackers allegedly unleashed malware that\nsignificantly retarded the progress of Iran’s nuclear development program.\nWith that, iSIGHT said, “we can’t be certain” that it was Iran. “We have no\ninformation implicating the ultimate sponsor. In the past we’ve seen cyber\nespionage operations carried out by government organizations, corporate\nintermediaries, and other third parties.”\nHowever, there was one damning piece of evidence linking Iran to the\nscam, said iSIGHT. The phony site the hackers used to disseminate\npoisoned links, Newsonair.org, was registered to a company located in\nTehran.\nIn addition, iSIGHT said, the hackers made contact with their victims at\n“irregular” hours, such as late at night in Europe and the US, or very early\nin the morning, often sending out constant streams of messages — but\ntaking a break in the middle.\n“Though the timing of the social network attack may seem irregular at first,\nover multiple years the schedule behind the activity becomes apparent,”\nthe group said. “They maintained a regular schedule, including what\nappears to be a lengthy lunch break followed by the remainder of the\nworkday. These hours conform to work hours in Tehran. Furthermore, the\noperators work half the day on Thursday and rarely work on Friday, the\nIranian weekend.”\nIt was mistakes like those, and others that iSIGHT did not elaborate on,\nthat enabled the company to figure out what was going on.\n“These actors did not go unnoticed by some targeted entities and they left\nsignificant evidence of their activity throughout the Internet,” said ISIGHT.\n“As with many other threats, iSIGHT Partners combined malware analysis,\nopen source research, and research from our global collection network to\ncreate our assessment of the Newscaster network.”\nIt also isn’t clear what valuable information, if any, the hackers got.\n“It remains possible that the actors could selectively reveal information\ngained through this campaign to embarrass those who were targeted, or\nalready have, but we have seen no evidence of this at this time. Ultimately,\nwe believe the sponsors of the activity are seeking information advantage\nover rival military forces, defense industries, diplomats, and others,”\niSIGHT said.\nAs usual, said the company, the lesson for the Internet consumer is caveat\nemptor — let the buyer, or in this case the surfer, beware.\n“Newscaster was a brazen, complex multi-year cyber-espionage that used a\nlow-tech approach to avoid traditional security defense-exploiting social\nmedia and people who are often the ‘weakest link’ in the security chain,”\nsaid iSIGHT.\n“Don’t be worried, but do be vigilant,” the firm advised. “Never provide\nlogin credentials with any site or person who contacts to you (rather than\nyou contacting it), use strong passwords and regularly change them.”\nJOIN US!\nA MSSAG FROM TH\nDITOR OF TIMS OF ISRAL\nDAVID HOROVITZ\nFor as little as $6 a month, you can help support our independent\njournalism — and enjoy an ADS-FREE  experience, as well as special\nbenefits and status as a Times of Israel Community member!\nRead more\nJOIN TH TIMS OF ISRAL COMMUNITY\nAlready a memer? Sign in to stop seeing this\nREAD MORE:\n·Israel & the Region  ·Israel Inside  ·Startup Israel  ·Iranian hackers  ·Newscaster  ·Facebook·Twitter  ·social media  ·cyber-defense  ·iSIGHT Technologies  ·Iran  ·phishing attacks·Newsonair.org  ·Stuxnet  ·cybersecurity\n\n\n\n\n\n1,357\nshares\nCOMMENTSIranian hackers said to use\nFacebook to spy on Israelis\nOver 2,000 executives and of cials fall victims to brazen, complex 3-year\n‘Newscaster’ scam run by social network ‘friends,’ report says\nBy DAVID SHAMAH\n29 May 2014, 9:56 am  | 2\n\n\n\n\n\n1,357\nshares\n(\ncyber security\nimage via Shutterstock)\n\n0 Comments Sort by  \nFacebook Comments PluginNewest\nAdd a comment...SPONSORED CONTENT\nSolo online fino al 25/3 Fibra a 25,90€ +\nSIM dati 15GB al giorno!\nEsclusiva Vodafone\nHai la P.IVA? Attiva online Fibra\nVodafone a 20€\nVodafone Business\nRecommended by\nIsrael starts\nsurveilling virus\ncarriers, sends 400\nwho were nearby to\nisolation\nBy JUDAH ARI GROSS  and TOI STAFF\nAs controversial tracking starts,\npeople who were in close contact\nwith those con rmed to have COVID-\n19 are informed by text message they\nmust home-quarantine\n          Iranian hackers said to use Facebook to spy on Israelis\n \n "
}