{
    "title": "JAR_16-20296A_GRIZZLY STEPPE-2016-1229",
    "text": "TLP:WHITE\n1 of 13 TLP:WHITE\nJOINT ANALYSIS REPORT  \nDISCLAIMER: This report is provided “as is” for informational purposes only. The Department of Homeland \nSecurity (DHS) does not provide any warranties of any kind regarding any information contained within. DHS \ndoes not endorse any commercial product or service referenced in this advisory or otherwise. This document is \ndistributed as TLP:WHITE: Subject to standard copyright rules, TLP:WHITE  information may be distributed \nwithout restriction. For more information on the Traffic Light Protocol, see https://www.us -cert.gov/tlp . \nReference Number: JAR-16-20 296A  December 29, 2016\nGRIZZLY ST\nEPPE – Russian Malicious Cyber Activity\nSummary \nThis Joint Analysis Report (JAR) is the result of analytic efforts between the Department of \nHom eland Security (DHS) and the Federal Bureau of Investigation (FBI). This document \nprovides technical details regarding the tools and infrastructure used by the Russian civilian and military intelligence Services (RIS) to compromise and exploit networks and  endpoints \nassociated with the U.S. election, as well as a range of U.S. G overnment, political, and private \nsector entities.  The U.S. Government is referring to this malicious cyber activity by RIS as \nGRIZZLY STEPPE.  \nPrevious JARs have not attributed malic ious cyber activity to specific countries or threat actors. \nHowever, public attribution of these activities to RIS is supported by technical indicators from the U.S. Intelligence Community, DHS, FBI, the private sector, and other entities. This determination expands upon the Joint Statement\n released October 7, 2016, from the Department \nof Homeland Security and the Director of National Intelligence on Election Security.  \nThis activity by  RIS is part of an ongoing campaign of cyber -enabled operations directed at the \nU.S. government and its citi zens. These cyber operations have included spearphishing campaigns \ntargeting government organizations, critical infrastructure entities , think tanks, universities, \npolitical organizations, and corporations leading to the theft of information. In foreign countries, RIS actors conducted  damaging and/or disruptive cyber-attacks, including attacks on critical \ninfrastructure  networks. In some cases , RIS actors masqueraded as third parties, hiding behind \nfalse online personas designed to cause the victim to misat tribute the source of the attack . This \nJAR provides technical indicators related to many of these operations, recommended mitigations, suggested actions to take in response to the indicators provided, and information on how to report such incidents to the U.S. Government.  TLP: WHITE\n2 of 13 TLP:WHITEDescription \nThe U.S. Government confirm s that two different RIS  actors participated in the intrusion into a \nU.S. political party. The first actor  group, known as Advanced Persistent Threat ( APT ) 29, \nentered into the party’s systems in summer 2015, while the second, known as APT28, entered in \nspring 2016.  \nFigure 1: The tactics and techniques used by APT29 and APT 28 to conduct cyber intrusions against target systems  \nBoth groups have historically targeted government organizations, think tanks, universities, and corporations around the world. APT29 has been observed crafting targeted spearphishing \ncampaigns leveraging web links to a malicious dropper; once executed, the code delivers Remote \nAccess Tools (RATs) an d evades detection using a range of techniques. APT28 is known for \nleveraging domains that closely mimic those of targeted organizations and tricking potential victims into entering legitimate credentials. APT28 actors relied heavily on shortened URLs in \ntheir spearphishing email campaigns. Once APT28 and APT29 have access to victims, both \ngroups exfiltrate and analyze information to gain intelligence value. These groups use this information to craft highly targeted spearphishing campaigns. These actors set up operational infrastructure to obfuscate their source infrastructure, host domains and malware for targeting \norganizations, establish command and control nodes, and harvest credentials and other valuable \ninformation from their targets.  \nIn summer 2015, an APT29 spearphishing campaign directed emails containing a malicious link \nto over 1,000 recipients, including multiple U.S. Government victims. APT29 used legitimate TLP:W HITE\n3 of 13 TLP:WHITEdomains, to include domains associated with U.S. organizations and educational institutions, to \nhost malware and send spearphishing emails. In the course of that campaign, APT29 successfully compromised a U.S. political party. At least one targeted individual activated links to malware \nhosted on operational infrastructure of opened attachments containing malware. APT29 \ndelivered malware to the political party’s systems, established persistence, escalated privileges, enumerated active directory accounts, and exfiltrated email from several accounts through encrypted connections back through opera tional infrastructure.   \nIn spring 2016, APT28 compromised the same political party, again via targeted spearphishing. This time, the spearphishing email tricked recipients into changing their passwords through a fake webmail domain hosted on APT28 operational infrastructure. Using the harvested \ncredentials, APT28 was able to gain access and steal content, likely leading to the exfiltration of \ninformation  from multiple senior party members. The U.S. Government assesses that information \nwas leaked to the pres s and publicly disclosed. \nFigure 2: APT28's Use of Spearphish ing and Stolen Credentials  \nActors  likely associated with RIS  are continuing to engage in spearphishing campaigns, \nincluding one launched as recently as November 2016, just days after the U.S. election. TLP:W HITE\n4 of 13 TLP:WHITEReported Russian Military and Civilian Intelligence Services (RIS)  \nAlternate Names  \nAPT28  \nAPT29  \nAgent.btz  \nBlackEnergy V3  \nBlackEnergy2 APT  \nCakeDuke  \nCarberp  \nCHOPSTICK  \nCloudDuke  \nCORESHELL \nCosmicDuke \nCOZYBEAR  \nCOZYCAR  \nCOZYDUKE  \nCrouchingYeti  \nDIONIS  \nDragonfly  \nEnergetic Bear  \nEVILTOSS  \nFancy Bear  \nGeminiDuke  \nGREY CLOUD  \nHammerDuke  \nHAMMERTOSS  \nHavex  \nMiniDionis  \nMiniDuke  \nOLDBAIT \nOnionDuke  \nOperation Pawn Storm  \nPinchDuke  \nPowershell backdoor  \nQuedagh  \nSandworm  \nSEADADDY  \nSeaduke  \nSEDKIT  \nSEDNIT  \nSkipper  \nSofacy \nSOURFACE  \nSYNful Knock  \nTiny Baron  \nTsar Team  \ntwain_64.dll (64 -bit X-Agent implant)  \nVmUpgradeHelper.exe (X -Tunnel implant)  \nWaterbug  \nX-Agent    TLP:WHITE   \n5 of 13  TLP:WHITE   Technical Details  \nIndicators of Compromise (IOC s) \nIOCs associated with RIS cyber actors are provided within the accompanying .csv and .stix files \nof JAR -16-20296. \nYara Signature  \nrule PAS_TOOL_PHP_WEB_KIT  \n{  meta:  description = \"PAS TOOL PHP WEB KIT FOUND\"  \nstrings:  \n$php = \"<?php\"  $base64decode = / \\='base' \\.\\(\\d+\\*\\d+\\)\\ .'_de' \\.'code'/  \n$strreplace = \"(str_replace(\"  \n$md5 = \".substr(md5(strrev(\"  $gzinflate = \"gzinflate\"  \n$cookie = \"_COOKIE\"  $isset = \"isset\"  \ncondition:  (filesize > 20KB and filesize < 22KB) and  #cookie == 2 and  #isset == 3 and  \nall of them  } \n \nActions to Take Using Indicators  \nDHS recommends that network administrators review the IP addresses, file hashes, and Yara \nsignature provided and add the IPs to their watchlist to determine whether malicious  activity has \nbeen observed within their organizations. The review of network perimeter netflow or firewall \nlogs will assist in determining whether your network  has experienced suspicious activity.  \n \nWhen reviewing network perimeter logs for the IP addresses, organizations may find numerous \ninstances of these IPs attempting to connect to their systems. Upon revie wing the traffic from \nthese IPs,  some traffic may correspond to malicious activity, and some may correspond to \nlegitimate activity. Some traffic that may appear legitimate is actually malicious, such as \nvulnerability scanning or browsing of legitimate public facing services (e.g., HTTP, HTTPS, FTP). Connections from these IPs may be performing vulnerability scans attempting to identify \nwebsites that are vulnerable to cross -site scripting (XSS) or Structured Query Language (SQL) \ninjection attacks. If scanning identified vulnerable sites, attempts to exploit the vulnerabilities may be experienced.    TLP:WHITE   \n6 of 13  TLP:WHITE   Network administrators are encouraged to check their public- facing websites for the malicious \nfile hashes.  System owners are also advised to run the Yara signature  on any system that is \nsuspected to have been targeted by RIS actors.  \nThreats from IOCs  \nMalicious actors may use a variety of methods to interfere with information systems. Some \nmethods of attack are listed below. Guidance provided is applicable to many other computer \nnetworks. \n• Injection Flaws  are broad web  application attack techniques that attempt to send \ncommands to a browser, database, or other system, allowing a regular user to control behavior. The most common example is SQL injection, which subverts the relationship between a webpage and its supporting database, typically to obtain information contained \ninside the database. Another form is command injection, where an untrusted user is able \nto send commands to operating systems supporting a web application or database. See the United States Computer Eme rgency Readiness Team (US -CERT) Publication on \nSQL \nInjection  for more information. \n• Cross- site scripting (XSS)  vulnerabilities  allow threat actors to insert and execute \nunauthorized code in web applications. Successful XSS attacks on websites can provide the attacker unauthorized access. For prevention and mitigation strategies against XSS, see US -CERT’s Alert on Compromised Web Servers and Web Shells\n. \n• Server vulnerabilities  may be exploited to allow unauthorized access to sensitive \ninformation. An attack against a poorly configured server may allow an adversary access to critical information including any websites or databases hosted on the server. See US-\nCERT’s Tip on Website Security\n for additional information. \nRecommended Mitigations  \nCommit to C ybersecurity Best Practices \nA commitment to good cybersecurity and best practices is critical to protecting networks and \nsystems. Here are some questions you may want to ask your organization to help prevent and mitigate against attacks.  \n1. Backups : Do we backup all critical information? Are the backups stored offline? Have \nwe tested our ability to revert to backups during an incident? \n2. Risk Analysis : Have we conducted a cybersecurity risk analysis of the organization?  \n3. Staff Training : Have we trained  staff on cybersecurity best practices?  \n4. Vulnerability Scanning & Patching : Have we implemented regular scans of our \nnetwork and systems and appropriate patching of known system vulnerabilities? \n5. Application Whitelisting : Do we allow only approved programs to run on our networks? \n6. Incident Response : Do we have an incident response plan and have we practiced it?    TLP:WHITE   \n7 of 13  TLP:WHITE   7. Business Continuity : Are we able to sustain business operations without access to \ncertain systems? For how long? Have we tested this?  \n8. Penetration Testi ng: Have we attempted to hack into our own systems to test the \nsecurity of our systems and our ability to defend against attacks? \nTop Seven Mitigation Strategies  \nDHS encourages network administrators to implement the recommendations below, which can \nprevent as many as 85 percent of targeted cyber- attacks. These strategies are common sense to \nmany, but DHS continues to see intrusions because organizations fail to use these basic measures.  \n1. Patch applications and operating systems – Vulnerable applications and operating \nsystems are the targets of most attacks. Ensuring these are patched with the latest updates \ngreatly reduces the number of exploitable entry points available to an attacker. Use best \npractices when updating software an d patches by only downloading updates from \nauthenticated vendor sites. \n2. Application whitelisting – Whitelisting is one of the best security strategies because it \nallows only specified programs to run while blocking all others, including malicious software.  \n3. Restrict administrative privileges – Threat actors are increasingly focused on gaining control of legitimate credentials, especially those associated with highly privileged \naccounts. Reduce privileges to only those needed for a user’s duties. Separate \nadmi nistrators into privilege tiers with limited access to other tiers.  \n4. Network Segmentation and Segregation into Security Zones  – Segment networks into \nlogical enclaves and restrict host -to-host communications paths. This helps protect \nsensitive information and critical services and limits damage from network perimeter breaches.  \n5. Input validation  – Input validation is a method of sanitizing untrusted user input \nprovided by users of a web application, and may prevent many types of web application \nsecurity flaws,  such as SQLi, XSS, and command injection. \n6. File Reputation  – Tune Anti- Virus file reputation systems to the most aggressive setting \npossible; some products can limit execution to only the highest reputation files, stopping \na wide range of untrustworthy cod e from gaining control. \n7. Understanding firewalls – When anyone or anything can access your network at any \ntime, your network is more susceptible to being attacked. Firewalls can be configured to block data from certain locations (IP whitelisting) or applications while allowing relevant and necessary data through. \n  TLP:W HITE\n8 of 13 TLP:WHITEResponding to Unauthorized Access to Networks  \nImplement your security incident response and business continuity plan. It may take time \nfor your organization’s IT professionals to isolate and remove threats to your systems and restore normal operations. Meanwhile, you should take steps to maintain your organization’s essential functions according to your business continuity plan. Organizations should maintain and regularly test backup plans, disaster recovery plans, and business continuity procedures. \nContact DHS or law enforcement immediately . We encourage you to contact DHS NCCIC \n(NCCICCustomerService@hq.dhs.gov\n or 888-282-0870), the FB I through a local field office or \nthe FBI’s Cyber Division ( CyWatch@ic.fbi.gov  or 855-292-3937) to report an intrusion and to \nrequest incident response resources or technical assistance.  \nDetailed Mitigation Strateg ies \nProtect Against SQL Injection and Other Attacks on Web Services  \nRoutinely evaluate known and published vulnerabilities, perform software updates and \ntechnology refreshes periodically, and audit external -facing systems for known Web application \nvulnerabilities. Take steps to harden both Web applications and the servers hosting them to \nreduce the risk of network intrusion via this vector.1 \n•Use and configure available firewalls to block attacks.\n•Take steps to further secure Windows systems such as installing and configuring\nMicrosoft’s Enhanced Mitigation Experience Toolkit (EMET) and Microsoft AppLocker.\n•Monitor and remove any unauthorized code present in any www directories.\n•Disable, discontinue, or disallow the use of Internet Control Message Protocol (ICMP)and Simple Network Management Protocol (SNMP) and response to these protocols asmuch as possible.\n•Remove non- required HTTP verbs from Web servers as typical Web servers and\napplications only require GET, POST, and HEAD.\n•Where possible, minimize server fingerprinting by configuring Web servers to avoid\nresponding with banners identifying the server software and version number.\n•Secure both the operating system and the application.\n•Update and patch production servers regularly.\n•Disable potentially harmful SQL -stored procedure calls.\n•Sanitize and validate input to ensure that it is properly typed and does not contain\nescaped code.\n•Consider using type- safe stored procedures and prepared statements.\n•Perform regular audits of transaction logs for sus picious activity.\n•Perform penetration testing against Web services.\n•Ensure error messages are generic and do not expose too much information.\n1 http://msdn.microsoft.com/en -us/library/ff648653.aspx . Web site last accessed April 11, 2016 . TLP: WHITE\n9 of 13 TLP:WHITEPhishing and Spear phishing  \n•Implement a Sender Policy Framework (SPF) record for your organization’s Domain\nName S ystem ( DNS) zone file to minimize risks relating to the receipt of spoofed \nmessages.  \n•Educate users to be suspicious of unsolicited phone calls, social media interactions, oremail messages from individuals asking about employees or other internal information. If\nan unknown individual claims to be from a legitimate organization, try to verify his or her\nidentity directly with the company.\n•Do not provide personal information or information about your organization, including itsstructure or networks, unless you are certain of a person’s authority to have theinformation.\n•Do not reveal personal or financial information in social media or email, and do notrespond to solicitations for this information. This includes following links sent in email.\n•Pay attention to the URL of a website. Malicious websites may look identical to alegitimate site, but the URL often includes a variation in spelling or a different domain\nthan the valid website (e.g., .com vs. .net).\n•If you are unsure whether an email request is legitimate, try to verify it by contacting the\ncompany directly. Do not use contact information provided on a website connected to therequest; instead, check previous statements for contact information. Information about\nknown phishing attacks is also available online from groups such as the Anti-Phishing\nWorking Group ( http://www.antiphishing.org).\n•Take advantage of anti -phishing features offered by your email client and web browser.\n•Patch all systems for critical vulnerabilities, prioritizing timely patching of software that\nproc\nesses Internet data, such as web browsers, browser plugins, and document readers.\nPermissions, Privileges, and Access Controls  \n•Reduce privileges to only those needed for a user’s dutie s.\n•Restrict users’ ability (permissions) to install and run unwanted software applications,and apply the principle of “Least Privilege” to all systems and services. Restricting these\nprivileges may prevent malware from running or limit its capability to s pread through the\nnetwork.\n•Carefully consider the risks before granting administrative rights to users on their own\nmachines.\n•Scrub and verify all administrator accounts regularly.\n•Configure Group Policy to restrict all users to only one login session, where possible.\n•Enforce secure network authentication where possible.\n•Instruct administrators to use non-privileged accounts for standard functions such as Webbrowsing or checking Web mail.TLP: WHITE\n10 of 13 TLP:WHITE•Segment networks into logical enclaves and restrict host -to-host communication paths.\nContainment provided by enclaving also makes incident cleanup significantly less costly.\n•Configure firewalls to disallow RDP traffic coming from outside of the network\nboundary, except for in specific configurations such as when tunneled through asecondary VPN with lower privileges.\n•Audit existing firewall rules and close all ports that are not explicitly needed for business.Specifically, carefully consider which ports should be connecting outbound versusinbound.\n•Enforce a strict lockou t policy for network users and closely monitor logs for failed login\nactivity. This can be indicative of failed intrusion activity.\n•If remote access between zones is an unavoidable business need, log and monitor these\nconnections closely.\n•In environments with a high risk of interception or intrusion, organizations should\nconsider supplementing password authentication with other forms of authentication suchas challenge/response or multifactor authentication using biometric or physical tokens.\nCredentials  \n•Enforce a tiered administrative model with dedicated administrator workstations andseparate administrative accounts that are used exclusively for each tier to prevent tools, such as Mimikatz, for credential theft from harvesting domain- level credentials.  \n•Implement multi-factor authentication (e.g., smart cards) or at minimum ensure users\nchoose complex passwords that change regularly.\n•Be aware that some services (e.g., FTP, telnet, and .rlogin) transmit user credentials in\nclear text. Minimize the use of th ese services where possible or consider more secure\nalternatives.\n•Properly secure password files by making hashed passwords more difficult to acquire.\nPassword hashes can be cracked within seconds using freely available tools. Consider\nrestricting access t o sensitive password hashes by using a shadow password file or\nequivalent on UNIX systems.\n•Replace or modify services so that all user credentials are passed through an encryptedchannel.\n•Avoid password policies that reduce the overall strength of credentials. Policies to avoid\ninclude lack of password expiration date, lack of lockout policy, low or disabledpassword complexity requirements, and password history set to zero.\n•Ensure that users are not re-using passwords between zones by setting policies andconducting regular audits.\n•Use unique passwords for local accounts for each device.TLP:W HITE\n11 of 13 TLP:WHITELogging Practices  \n•Ensure event logging (applications, events, login activities, security attributes, etc.) is\nturned on or monitored for identification of security issues. \n•Configure network logs to provide enough information to assist in quickly developing anaccurate determination of a security incident.\n•Upgrade PowerShell to new versions with enhanced logging features and monitor the\nlogs to detect usage of PowerShell commands, which are often malware- related.\n•Secure logs, potentially in a centralized location, and protect them from modification.\n•Prepare an incident response plan that can be rapidly implemented in case of a cyberintrusion.\nHow t\no Enhance Your Organizati on’s Cybersecurity Posture  \nDHS offers a variety of resources for organizations to help recognize and address their \ncybersecurity risks. Resources include discussion points, steps to start evaluating a cybersecurity program, and a list of hands-on resources available to organizations. For a list of services, visit \nhttps://www.us -cert.gov/ccubedvp\n. Other resources include:  \n•The Cyber Security Advisors (CSA)  program bolsters cybersecurity preparedness, risk\nmitigation, and incident response capabilities of critical infrastructure entities and more\nclosely aligns them with the Federal Government. CSAs are DHS personnel assigned todistricts throughout the country and territories, with at least one advisor in each of the 10CSA regions, which mirror the Federal Emergency Management Agency regions. For\nmore information, email cyberadvisor@hq.dhs.gov\n.\n•Cyber Resilience Review (CRR) is a no -cost, voluntary assessment to evaluate and\nenhance cybersecurity within critical infrastructure sectors, as well as state, local, tribal,\nand territorial governments. The goal of the CRR is to develop an understanding and\nmeasurement  of key cybersecurity capabilities to provide meaningful indicators of an\nentity’s operational resilience and ability to manage cyber risk to critical services during\nnormal operations and times of operational stress and crisis. Visithttps://www.cert.org/resilience/rmm.html\n to learn more about the CERT Resilience\nManagement Model.  \n•Enhanced Cybersecurity Services (ECS)  helps critical infrastructure owners and\noperators protect their systems by sharing  sensitive and classified cyber threat\ninformation with Commercial Service Providers (CSPs) and Operational Implementers(OIs). CSPs then use the cyber threat information to protect CI customers. OIs use thethreat information to protect internal networks. For more information, emailECS_Program@hq.dhs.gov\n.\n•The Cybersecurity Information Sharing and Collaboration Program (CISCP)  is a\nvoluntary information-sharing and collaboration program between and among critic alTLP:WH ITE\n12 of 13 TLP:WHITEinfrastructure partners and the Federal Government. For more information, email \nCISCP@us -cert.gov . \n•The Automated Indicator Sharing (AIS)  initiative is a DHS effort to create a system\nwhere as soon as a company or  federal agency observes an attempted compromise, the\nindicator will be shared in real time with all of our partners, protecting them from thatparticular threat. That means adversaries can only use an attack once, which increases\ntheir costs and ultimatel y reduces the prevalence of cyber -attacks. While AIS will not\neliminate sophisticated cyber threats, it will allow companies and federal agencies to\nconcentrate more on them by clearing away less sophisticated attacks.\nAIS part\nicipants connect to a DHS -managed system in the NCCIC that allows \nbidirectional sharing of cyber threat indicators. A server housed at each participant’s location allows each to exchange indicators with the NCCIC. Participants will not only receive DHS -developed indicators, but can share indicators they have observed in their \nown network defense efforts, which DHS will then share with all AIS participants. For more information, visit https://www.dhs.gov/ais\n. \n•The Cybersecurity Framework (Framework) , developed by the National Institute of\nStandards and Technology (NIST) in collaboration with the public and private sectors, is\na tool that can improve the cybersecurity readiness of entities. The Framework enables\nentities, regardless of size, degree of cyber risk, or cyber sophistication, to applyprinciples and best practices of risk management to improve the security and resiliency ofcritical infrastructure. The Framework provides standards, guidelines, and practices that\nare working effectively to day. It consists of three parts—the Framework Core, the\nFramework Profile, and Framework Implementation Tiers —and emphasizes five\nfunctions: Identify, Protect, Detect, Respond, and Recover. Use of the Framework is\nstrictly voluntary. For more information, visit https://www.nist.gov/cyberframework\n or\nemail cyberframework@nist.gov .TLP:WHITE\n13 of 13 TLP:WHITEContact Information  \nRecipients of this report are encouraged to contribute any additional information that they may \nhave related to this th reat. Include the JAR reference numb er (JAR-16-20296A) in the subject \nline of all email correspo ndence. For any questio ns related to this repor t, please contact NC CIC \nor the FBI. \nNCCIC: \nPhone: +1-888-282-0870  \nEmail: N\nCCICCustomerService@hq.dhs.gov \nFBI: \nPhone: +1-855-292-3937 \nEmail: cywatch@ic.fbi.gov  \nFeedback \nNCCIC continuously strives to improve its products and services. You can help by answering a few short questions about this product at the following URL:  https://www.us -cert.gov/forms/feedback\n. "
}