{
    "title": "keep calm and (don_u2019t) enable macros_ a new threat actor targets uae dissidents - the citizen lab",
    "text": " \n  RESEARCH NEWS ABOUT\nResearch Targeted Threats\nKeep Calm and (Don’t) Enable Macros\nA New Threat Actor Targets UAE Dissidents\nBy Bill Marczak  and John Scott-Railton  May 29, 2016\n1. Executive Summary\nThis report describes a campaign of targeted spyware attacks carried out by a sophisticated\noperator, which we call Stealth Falcon .  The attacks have been conducted from 2012 until\nthe present, against Emirati journalists, activists, and dissidents.  We discovered this\ncampaign when an individual purporting to be from an apparently fictitious organization\ncalled “The Right to Fight” contacted Rori Donaghy.  Donaghy, a UK-based journalist and\nfounder of the Emirates Center for Human Rights, received a spyware-laden email in\nNovember 2015, purporting to o er him a position on a human rights panel.  Donaghy has\nwritten critically of the United Arab Emirates (UAE) government in the past,  and had\nrecently published a series of articles based on leaked emails involving members of the UAE\ngovernment.\nCircumstantial evidence suggests a link between Stealth Falcon and the UAE government.\n We traced digital artifacts used in this campaign to links sent from an activist’s Twitter\naccount in December 2012, a period when it appears to have been under government\ncontrol.  We also identified other bait content employed by this threat actor.  We found 31\npublic tweets sent by Stealth Falcon, 30 of which were directly targeted at one of 27 victims.\n Of the 27 targets, 24 were obviously linked to the UAE, based on their profile information\n(e.g., photos, “UAE” in account name, location), and at least six targets appeared to be\noperated by people who were arrested, sought for arrest, or convicted in absentia by the\nUAE government, in relation to their Twitter activity.\nThe attack on Donaghy — and the Twitter attacks — involved a malicious URL shortening\nsite.  When a user clicks on a URL shortened by Stealth Falcon operators, the site profiles the\nso ware on a user’s computer, perhaps for future exploitation, before redirecting the user to\na benign website containing bait content.  We queried the URL shortener with every\npossible short URL, and identified 402 instances of bait content which we believe were sent\nby Stealth Falcon, 73% of which obviously referenced UAE issues.  Of these URLs, only the\none sent to Donaghy definitively contained spyware.  However, we were able to trace the\nspyware Donaghy received to a network of 67 active command and control (C2) servers,\nsuggesting broader use of the spyware, perhaps by the same or other operators.\nFigure 1: Tag cloud of bait content topics used by Stealth Falcon showing\na strong emphasis on political topics and narratives critical of the UAE\ngovernment\n \n2. Background\nRori Donaghy  is a London-based journalist who currently works for UK news organization\nMiddle East Eye , a website that covers news in the Middle East.   Middle East Eye  has recently\npublished a series of articles about UAE foreign policy, based on leaked emails involving\nmembers of the UAE government.   Previously, Donaghy led the Emirates Center for Human\nRights, an organization he founded to “promote the defence of human rights in the United\nArab Emirates … through building strong relationships with the media, parliaments and\nother relevant organisations outside the UAE ”.\n2.1. Political and Human Rights Situation in the UAE\nIn its most recent (2015) Freedom in the World ranking, Freedom House classified the UAE\nas “not free,” and noted that the UAE continues to “suppress dissent” .  Human Rights Watch\nstated in its most recent (2016) country report, that the UAE has “continued … to arbitrarily\ndetain and in some cases forcibly disappear individuals who criticized the authorities”.\n Amnesty International says that UAE courts have “accepted evidence allegedly obtained\nthrough torture”.\nSpecifically in the online realm, there is evidence that the UAE government has previously\nconducted malware attacks against civil society. At least three dissidents  including a\njournalist, and UAE human rights activist Ahmed Mansoor, were targeted in 2012 with\nHacking Team spyware  by a Hacking Team customer in the UAE, apparently operating\nunder the auspices of the o ice of Sheikh Tahnoon bin Zayed al-Nahyan,  a son of the\nfounder of the UAE, and now the UAE Deputy National Security Advisor.   The UAE client\nhad a license from Hacking Team to concurrently infect and monitor 1100 devices.\nFigure 2: Diagram of Stealth Falcon’s known Targets, Fake Personas, and campaign\nArtefacts, along with relevant sections of the report. The document paints a picture of a\nlarge-scale campaign with a focus on critics of the UAE Government\n \n3. The November 2015 Attack: An “Invitation”\nThis section describes an email attack against journalist Rori Donaghy. The operators used a\nMicroso  Word macro that installs a custom backdoor allowing operators to execute\narbitrary commands on a compromised machine.\n3.1 Initial Attack Email\nIn November 2015, the journalist Donaghy received the following email message,\npurportedly o ering him a position on a panel of human rights experts:\nFrom: the_right_to_fight@openmailbox.org\nSubject: Current Situation of Human Rights in the Middle East Mr. Donaghy, We are currently organizing a\npanel of experts on Human Rights in the Middle East.\nWe would like to formally invite you to apply to be a member of the panel by responding to this email.\nYou should include your thoughts and opinions in response to the following article about what more David\nCameron can be doing to help aid the Middle East.\nhttp://aax.me/d0dde\nThank you.\nWe look forward to hearing back from you,\nHuman Rights: The Right to Fight\nDonaghy was suspicious of the email, and forwarded it to us for analysis.  We found that the\nlink in the email ( http://aax.me/d0dde ) loaded a page containing a redirect to the website\nof Al Jazeera.  Before completing the redirect, it invoked JavaScript to profile the target’s\ncomputer.  We describe the profiling in detail in Section 3.1-3.3  below.\n3.2 Communication with the Operator\nOn our instruction, Donaghy responded to the email, asking for further information.  The\noperators responded with the following message:\nFrom: the_right_to_fight@openmailbox.org\nSubject: RE: Current Situation of Human Rights in the Middle East Mr. Donaghy, Thank you for getting back to\nus. We are very interested in you joining our panel.\nThe information you requested is in the attached document.\nIn order to protect the content of the attachment we had to add macro enabled security.\nPlease enable macros in order to read the provided information about our organization.\nWe hope you will consider joining us.\nThank you.\nWe look forward to hearing back from you,\nHuman Rights: The Right to Fight\nBy chance, the attachment was identified as malicious and blocked by a program running in\nDonaghy’s email account.  We instructed him to follow up and request that the operators\nforward the attachment via another method.  Donaghy received the following reply:\nFrom: the_right_to_fight@openmailbox.org\nSubject: RE: Current Situation of Human Rights in the Middle East Mr. Donaghy, We apologize for having\nproblems with our attachment.\nPlease follow this link to download our organizational information.\nhttp://aax.me/a6faa\nThe link has been password protected.  The password is: right2fight\nIn order to protect the content of the attachment we also had to add macro enabled security.\nPlease enable macros in order to read the provided information about our organization.\nWe hope you will consider joining us.\nThank you.\nWe look forward to hearing back from you,\nHuman Rights: The Right to Fight\nThis second link ( http://aax.me/a6faa)  redirects to the following URL using an HTTP 302\nredirect:\nhttps://cloud.openmailbox.org/index.php/s/ujDNWMmg8pdG3AL/authenticate\nThis is a password-protected link to a file shared on an ownCloud  instance.  We obtained\nthis file, and found it to be a Microso  Word document.\n3.3 The Malicious Document\nThe document is:\nFilename:   right2fight.docm\nMD5:       80e8ef78b9e28015cde4205aaa65da97\nSHA1:      f25466e4820404c817eaf75818b7177891735886\nSHA256:    5a372b45285fe6f3df3ba277ee2de55d4a30fc8ef05de729cf464103632db40f\nWhen opened, the target is greeted with the following image, purporting to be a message\nfrom “proofpoint,” a legitimate provider of security solutions for O ice 365.   The image\nclaims that “This Document Is Secured”  and requests that the user “Please enable macros to\ncontinue.”\nFigure 3: Fake Proofpoint image in the malicious document sent\nto Donaghy\nIf the target enables macros, they are presented with the following document:\nFigure 4: Document that Donaghy would have seen, had he enabled macros\nThe document purports to be from an organization called “The Right To Fight,” and asks the\ntarget Donaghy to open the link in the original email he received (the email containing the\nprofiling URL).  We believe that “The Right To Fight” is a fictitious organization, as their logo\nappears to be copied from an exhibition about “African American Experiences in WWII” .\n Further, “The Right to Fight” has no discernable web presence.\nFigure 5: Logo from exhibition about African American experiences in WWII.\n3.3.1 Profiling\nThe document attempts to execute code on the recipient’s computer, using a macro.  The\nmacro passes a Base64-encoded command to Windows PowerShell, which gathers system\ninformation via Windows Management Instrumentation (WMI), and attempts to determine\nthe installed version of .NET by querying the registry (full script available in Appendix A:\nStage One PowerShell Command ).\n3.3.2 Communication & Obtaining a Shell\nGathered information is returned to http://adhostingcache.com/ehhe/eh4g4/adcache.txt ,\nand the server’s response is executed as a PowerShell command.  At the time,\nadhostingcache.com  resolved to 95.215.44.37 .  The domain was apparently deleted on\nNovember 30th 2015 (Donaghy received the malicious Word Document on November 24th\n2015).  A new domain, adhostingcaches.com , was registered on December 3rd, which\npoints to the same IP address.  The deletion of adhostingcache.com  may reflect operator\nsuspicion that the file received by Donaghy had been sent to security researchers.\nThe server response is a PowerShell command that decodes and materializes an invocation\nof a Base64-encoded PowerShell command to disk as IEWebCache.vbs , and creates a\nscheduled task entitled “IE Web Cache”  that executes the file hourly (full script available in\nAppendix B: Stage Two PowerShell Command ).\nIEWebCache.vbs  runs a Base64-encoded PowerShell command, which periodically POSTs a\nunique identifier to https://incapsulawebcache.com/cache/cache.nfo  (via HTTPS without\nverifying the server certificate, and with a hardcoded user-agent header matching Internet\nExplorer 10.6).  The script executes server responses as PowerShell commands, responding\nback to the server with the exit status of, output of, or any exceptions generated by the\ncommands.  \nThis gives the operator control over the victim’s computer, and allows the operator to install\nadditional spyware or perform other activities.  All commands and responses are encrypted\nusing RC4 with a hardcoded key, and the encrypted message is prefixed with a hardcoded\nvalue.\nDespite some similarities in functionality to the Empire backdoor,  we were unable to\nidentify any shared code, and we suspect that the backdoor is custom-made.\n3.4. Technical Analysis: aax.me Browser Profiling\nWhile aax.me has a public interface where anyone may shorten a link, aax.me only conducts\nbrowser profiling of individuals who click on links that are specially shortened by Stealth\nFalcon operators.\nIn November 2015, when we accessed the link in the second email that Donaghy received,\nhttp://aax.me/a6faa , we found that it redirected directly to\nhttps://cloud.openmailbox.org/index.php/s/ujDNWMmg8pdG3AL/authenticate  via an\nHTTP 302 redirect.  When we accessed the link in the first email that Donaghy received,\nhttp://aax.me/d0dde , the server responded with the following page:\n<iframe src='redirect.php' height='1' width='1' border='0' scrolling='no' frameborder='0'  \nunselectable='yes' marginheight='0' marginwidth='0' onload='setTimeout(\"document.location  \n=\\\"http://www.aljazeera.com/indepth/opinion/2015/11/british-pm-middle-east-human-rights-\n151103070038237.html\\\"\", 20000)'></iframe><br><br><br><center><img src='loading.gif'>\n<br>Loading the website:<br><b>http://www.aljazeera.com/indepth/opinion/2015/11/british-pm-\nmiddle-east-human-rights-151103070038237.html</b>.<br>This may take a few seconds.</center>\nThe page is apparently designed to redirect to an Al Jazeera op-ed a er twenty seconds.\n However, the URL is incorrect: the last character of the filename should be a “1” instead of a\n“7”.  Therefore, an Al Jazeera 404 page is returned instead of the op-ed.  It is possible that\nthe use of “7” instead of “1” represents a transcription error on the part of the operators.\n When we accessed this same aax.me URL in March 2016, it redirected directly to the Al\nJazeera URL (with typo) via an HTTP 302 redirect.\nThe iframe, http://aax.me/redirect.php , reloads itself with a parameter “inFr” in its query\nstring, to indicate whether the page has been opened up inside a frame.\n<html><body><script type=\"text/javascript\">if(window!=window.top)\n{inFr=\"1\"}else{inFr=\"0\"}document.location=document.location+\"?inFr=\"+inFr;</script>\n<noscript><img src=\"?jSc=0\"/></noscript></body></html>\nIf the page has not been opened up inside a frame (inFr=0), then a blank page is returned.  If\nthe page is opened inside a frame (inFr=1), as is the case here, then the following page is\nreturned (we ommitted the PHPSESSID value):\n<html><head></head><body><div id='display' height='1' style='display:none;'></div><form  \nid='statsPost' action='?stats=1' method='POST'><input type=\"hidden\" name=\"PHPSESSID\"  \nvalue=\"\" /><input id='theData' name='theData' type='hidden' value='' /></form><script  \ntype='text/javascript' src='redirect.js'></script></body></html>\nWe examined the referenced JavaScript file, http://aax.me/redirect.js .  The file is designed\nto profile a user’s system, perhaps to gather intelligence about potentially exploitable\nvulnerabilities.  The file has apparently not been updated since 7 May 2013,  rendering\nsome of the probing obsolete.  We enclose the file’s full contents in Appendix C: JavaScript\nProfiling File .  The profiling performs the following actions:\nFor Internet Explorer, it attempts to create several instances of ActiveXObject  to get the\nversions of Flash, Shockwave, Java, RealPlayer, Windows Media Player, and Microso \nO ice (classified as either 2003, 2007, or 2010).\nFor non-Internet Explorer browsers, it attempts to get a list of enabled plugins from\nnavigator.mimeTypes .\nFor all browsers, it captures the user agent, whether cookies are enabled, the OS, the\nsize of the browser window, and the timezone.  It classifies browsers into di erent\nversions, denoted by letters, based on the existence and behavior of certain JavaScript\nmethods.\nThe script attempts to exploit an information leak in older versions of Tor Browser.  We\nexplore the technique used in Section 3.5 .\nFor Windows browsers (except Opera, and versions of Internet Explorer before IE9), it\nsends a series of XMLHttpRequests to 127.0.0.1, which we believe are designed to\ndeduce if the computer is running any one of several specific antivirus programs.  The\ncode for this appears to be borrowed from the JS-Recon port scanning tool.   The\ncreator of JS-Recon presented the tool at BlackHat Abu Dhabi in 2010.   We explore\nsuch techniques in more detail in Section 3.6 .\nWe were unfamiliar with the website aax.me, so we investigated it further.  We found that\nthe main page of aax.me purported to be a public URL shortening service, powered by\nYOURLS, an open source PHP framework allowing anyone to set up their own URL\nshortening service.  We are unable to ascertain whether the site actually uses any YOURLS\ncode.  We also noted that the homepage contains a typo (“Shortend [sic] URL”).\nFigure 6: Homepage of aax.me\nWe shortened a URL using the homepage, but found that clicking on the shortened URL did\nnot trigger the loading of the intermediate page, http://aax.me/redirect.php .  We also did\nnot find the code for redirect.php  or redirect.js  in the public code repository for YOURLS.\n Thus, we deduced that this code was likely specially written by the operators, and the link\nsent to Donaghy was likely created by someone with administrator access to aax.me.\n3.5. Technical Analysis: aax.me Tor Deanonymization Attempt\nThe aax.me site appears to attempt to deanonymize users of Tor Browser.  While the\ntechnique the operators used was out-of-date at the time we observed the attack, the\nattempted Tor deanonymization speaks to their motivations and potential targets.\nThe script first detects Tor Browsers by checking whether navigator.buildID  is set to zero\n(all testing was conducted on English, Windows builds of Tor Browser).  Versions of Tor\nBrowser  before 2.3.25-12 (released on 13 August 2013) had their buildID set to zero.  This\nbehavior was originally introduced in TorButton,  in support of the goal of making Tor users\nappear homogenous.   Current Tor Browser versions have navigator.buildID set to a\ndi erent distinctive value, 20000101000000.\nWhen the script detects a Tor Browser, it attempts to deduce the version of Tor Browser by\nchecking for the existence and behavior of certain JavaScript methods.  Once a browser is\ndetermined to be older than a certain version of Tor Browser, the script exploits a now-fixed\nbug to get the disk path of the browser installation.   The disk path may contain the target’s\nusername, which may include the target’s real name.\nThe bug in Tor Browser was first disclosed at Defcon 17, which took place in August 2009.\n The bug was first fixed on on 25 May 2012 in Tor Browser release 2.2.35-13.   The bug was,\nhowever, later reintroduced into Tor Browser on 18 December 2013 with the release of Tor\nBrowser 3.5, and subsequently fixed again in Tor Browser 3.6 on 29 April 2014.   However,\nunfortunately for the operators, they failed to update their profiling script to reflect Tor\nBrowser’s navigator.buildID  change (before the bug was reintroduced).  Thus, the profiling\nscript did not detect Tor Browsers with the reintroduced bug as Tor Browsers, so it did not\ntry to exploit them.  Even if it had been updated to reflect the navigator.buildID change, the\nversion check in the Tor Browser exploitation code would also have to be updated to select\nthe versions with the reintroduced bug for exploitation.\nThe version of Tor Browser (as determined by JavaScript checks) is submitted back to the\nserver, along with the value of navigator.oscpu  (which reveals the version of the OS on which\nTor Browser is running — e.g., the latest version of Tor Browser on OSX El Capitan reveals:\n“Intel Mac OS X 10.11” ) which is set to “Windows NT 6.1” in the latest Tor browser,\nnavigator.vendor  (which appears blank in the latest Tor Browser), and any data gathered\nabout the installation path.\n3.6. Technical Analysis: aax.me Antivirus Profiling\nInterestingly, aax.me also attempts to determine the presence of various antivirus products\non a target’s machine.\nWe expand on the probing of antivirus programs which we observed on aax.me, as we were\nunfamiliar with this technique.  The technique appears to work on any modern version of\nWindows, with the latest versions of Chrome, Firefox, and IE/Edge (though, the profiling\nscript excludes IE versions less than IE9 from the profiling, using the vertical tab test ).\n Specifically, the script conducts GET XMLHttpRequests (one at a time) to 127.0.0.1/ on the\nfollowing ports: 12993, 44080, 24961, 1110, 6646, 6999, 30606.  The script stops conducting\nthese requests if it finds one request whose readyState  is set to 4 less than 20ms a er the\nrequest was initiated (200ms for port 6646), and submits the number of this port to the\nserver.\nThe latest versions of Internet Explorer/Edge, Chrome, and Firefox (except Tor Browser) will\nall perform these XMLHttpRequests to 127.0.0.1 on behalf of any site.  Of course, the result\nof such a request will most likely not be available to the script, due to the same-origin\npolicy, and likely absence of a CORS  header in the response.  Indeed, the script does not\nattempt to read the results of its requests.  Rather, it leverages the fact that the web browser\nmakes the status of the request sent available, via the readyState  parameter of an\nXMLHttpRequest instance ( 1 approximately represents TCP SYN sent, and 4 represents\nHTTP response received or TCP connection terminated).  For a closed port, Windows will\nissue an RST/ACK for each SYN sent.  However, it appears that Windows’ TCP stack will not\nconsider an outgoing connection it is initiating to be terminated until it has sent 3 SYNs, and\nreceived three corresponding RST/ACKs (or timeouts).\nFigure 7: Three RST/ACKs required until Windows considers outgoing TCP connection\nterminated\nWhen testing with a TCP connection from Windows to a remote host, we can clearly see that\nWindows transmits the second SYN ~500ms a er the first RST/ACK, and the third SYN\n~500ms a er the second RST/ACK.\nFigure 8: Windows sends the next SYN 500ms a er the latest RST/ACK\nThus, the readyState  value for a request to a closed port on 127.0.0.1 will not be set equal to\n4 until approximately 1000ms a er the request is issued.  In summary, one can use this\ntechnique to distinguish between a closed port ( readyState  set to 4 at around 1000ms), an\nopen port ( readyState  set to 4 before 1000ms), and a filtered port ( readyState  set to 4 long\na er 1000ms).\nThis script was apparently designed to detect the presence of certain components of Avast,\nAvira, ESET, Kaspersky, and Trend Micro antivirus products.  We were not able to determine\nwhich program the probing of port 24961 was designed to detect.  We verified that the latest\nversion of Avast can be detected by this script, as it opens TCP port 12993, which is\nassociated with its Mail Shield  component for scanning email tra ic; port 6999 is opened by\nTrend Micro’s tmproxy which scans web and email tra ic; port 1110 is used by Kaspersky\nto scan web and email tra ic; it appears that Avira’s Web Protection  component for scanning\nweb tra ic used to open port 44080,  though we observed it opening 44081 instead; port\n30606 appears to have been used by ESET to scan web and email tra ic,  but we did not\nobserve this port open while testing the latest version of ESET; port 6646 may be used by\nMcAfee, though we did not test this.\nThe code for the port scanning appears to be adapted from the JS-Recon port scanning\ntool.  JS-Recon is a generic tool that enumerates all open ports on 127.0.0.1 in a range; it\ndoes not specifically target anti-virus programs.  The scan_xhr and check_ps_xhr  functions\nin the aax.me profiling script are similar to the scan_ports_xhr  and check_ps_xhr\nfunctions in JS-Recon.  The creator of JS-Recon seems to have first presented the tool at\nBlackHat Abu Dhabi in 2010.\nFigure 9: Image from the author of JS-Recon showing how long WebSocket and XMLHttpRequest\n(“COR”) connections remain in their initial readyState on Windows.\nNote that this technique can be generalized to any remote content timing side channel (e.g,\nthe onerror event for an Image).  Additionally, one can identify the presence of an open port\non 127.0.0.1 that speaks HTTP without using timing information, and thus without the\nWindows TCP behavior assumption (e.g., by handling the onerror and oncomplete  events of\ncertain types of  link elements).\nWe are unsure whether the purpose of the antivirus profiling is to identify potentially\nexploitable antivirus so ware running on a target’s computer, or for evasion of antivirus\nproducts.  In December 2015, Google Security discovered a critical vulnerability in Avast’s\nantivirus product, which involved a webpage sending HTTP requests to a port that Avast\nopens on 127.0.0.1.  Google Security demonstrated that the vulnerability allowed\nexfiltration of arbitrary files from a victim’s disk.   In January 2016, Google Security\ndiscovered a critical vulnerability in Trend Micro’s antivirus product, which similarly involved\na web page sending HTTP requests to a port that Trend Micro opens on 127.0.0.1.  Google\nSecurity demonstrated that the vulnerability allowed arbitrary command execution.\n \n4. The Case of the Fake Journalist\nIn the course of our investigation we scanned the e-mail of journalist Donaghy and found\nevidence that he had been contacted by a fictitious journalist, whom we linked to Stealth\nFalcon.\nWe scanned Donaghy’s GMail account for any previous messages featuring links that\nredirected through aax.me.  We identified the following message from December 2013,\npurporting to be from a UK journalist named Andrew Dwight:\nFrom: andrew.dwight389@outlook.com\nSubject: FW: Correspondence Request Greetings Mr. Donaghy, I have been trying to reach you for comment\nand I am hoping that this e-mail reaches the intended recipient. My name is Andrew Dwight and I am currently\nwriting a book about my experiences in the Middle East. My focus is on human factors and rights issues in\nseemingly non-authoritarian regimes (that are, in reality, anything but). I was hoping that I might correspond\nwith you and reference some of your work, specifically this piece ( http://goo.gl/60HAqJ ), for the book. I’m\nquite impressed with the way you articulate this complex issue for the masses, and hope to have a similar\nimpact with my book.\nHappy New Year,\nAndrew\nThe link in the email, http://goo.gl/60HAqJ , redirects to http://aax.me/0b152 , which, as of\nDecember 2015, redirected to a 2013 Hu ington Post blog post authored by Donaghy.   We\ndid not observe any redirect.php  behavior with this link; as of December 2015, the aax.me\nlink directly served an HTTP 302 redirect to the Hu ington Post (we omitted the date\nheader below).  However, it is possible that the link formerly exhibited redirect.php\nbehavior:\nHTTP/1.1 302 Moved Temporarily\nDate:\nServer: Apache/2.2.9 (Debian) mod_ssl/2.2.9 OpenSSL/0.9.8g\nX-Powered-By: PHP/5.2.6-1+lenny13\nLocation: http://www.huffingtonpost.co.uk/rori-donaghy/uae-94_b_3549671.html\nVary: Accept-Encoding\nContent-Type: text/html\nWe found that Donaghy had responded to this message shortly a er receiving it, o ering to\nmeet in-person with Andrew in the UK.  Andrew responded several weeks later with the\nfollowing:\nFrom: andrew.dwight389@outlook.com\nSubject: RE: Correspondence Request Hello Rori,Happy New Year! I apologize for the delay in getting back to\nyou. I was on a ski holiday in upstate New York for the New Year and just returned to my current\naccommodations in the city. I was due back sooner, but as you may know, the weather has not been agreeable\nhere in the Eastern United States!\nI am currently situated in the US. while I complete my book to be closer to my publisher and editor. The book\nfocuses on the various guises used by Middle Eastern countries to demonstrate that they are providing equal\nand fair treatment with concern to human rights. I am working with several organizations in identifying cases\nthat reveal their true lack of concern for liberty and personal freedoms. I’m using these cases as testimony\nabout this under reported issue. Have you heard of a Swedish organization named Al Karama?\nThere website: http://en.alkarama.org/index.php?\noption=com_content&view=article&id=1005&Itemid=74&slid=102\nI have spoken to one of their junior editors and I am hoping to obtain input from some of their sources as well.\nThis issue never gets any smaller does it? I hope that a few loud voices (and a well received book) can make a\ndi erence.\nCheers,\nAndrew\nWhile attempting to determine whether “Andrew Dwight” was a real person, we we found a\nTwitter profile, @Dwight389  for the same persona, and that mentions the same address\nfrom which Donaghy received the email.\nFigure 10: Andrew Dwight’s Twitter profile, @Dwight389,\nmentioning the email address that corresponded with Donaghy\nin 2013, andrew.dwight389@outlook.com\nWe found that this account messaged three UAE dissident accounts via Twitter mentions.\n While we were unable to establish if @Dwight389  successfully attacked any of these\nindividuals, we profile the targets below.\n4.1. Another Target: Obaid Yousef Al-Zaabi\nThis section describes how the fake journalist persona contacted Obaid Yousef Al-Zaabi, a\nblogger who was arrested for criticising the UAE.\nFigure 11: @Dwight389 contacted @bukhaledobaid on 24 April\n2013\nObaid Yousef Al-Zaabi was arrested on 2 July 2013  for Tweeting about the UAE94 detainees\n(94 defendants prosecuted in a mass trial on charges of attempting to overthrow the\ngovernment)  on his @bukhaledobaid  account, which displays his real name.   He was\nreleased due to health problems a month later, but was arrested again on 12 December\n2013, a day a er talking to CNN  about the condition of US citizen Shezanne Cassim,\nimprisoned for making a parody video  about “youth culture in Dubai” .  Al-Zaabi and\nCassim were imprisoned in the same cellblock.  Al-Zaabi was acquitted on 23 June 2014 of\nall charges including “slander concerning the rulers of the UAE using phrases that lower\ntheir status, and accusing them of oppression” and “disseminating ideas and news meant to\nmock and damage the reputation of a governmental institution,” but, according to\ninformation received from two UAE sources, Al-Zaabi is still imprisoned in the prisoners\nward of a hospital.  A coalition of 13 human rights organizations including Amnesty\nInternational consider Al-Zaabi’s ongoing detention to be arbitrary, and without legal\nbasis.  Amnesty International reported that “a senior State Security Prosecution o icial”\ntold Al-Zaabi he would continue to be detained even if acquitted.\nAl-Zaabi’s brother, Dr. Ahmed Al-Zaabi, is one of the UAE94 detainees and is currently serving\na 10 year prison sentence.  According to a report by the Gulf Center for Human Rights,\nAhmed was tortured in prison: his fingernails were pulled out, and he was “beaten to the\npoint he was le  swollen, covered in bruises all over his body and with large amounts of\nblood in his urine”.\n4.2. Another Target:Professor Abdullah Al-Shamsi\nThis section describes how the fake journalist persona contacted professor Abdullah Al-\nShamsi, Vice Chancellor of the British University in Dubai.\nFigure 12: @Dwight389 sent a message on 9 May 2013 suggesting\nhe had targeted @shamsiuae58\nProfessor Abdullah Al-Shamsi ( @shamsiuae58 ) is the Vice Chancellor of the British\nUniversity in Dubai.   He (Arabic name: (ﺍﻟﺷﺎﻣﺳﻲ ﺭﺣﻣﺔ ﻣﺣﻣﺩ ﻋﺑﺩﷲ.ﺩ.ﺃ is\nsignatory #79 (out of 133) to a March 2011 petition to the UAE government  for direct\nelections  (UAE activist Ahmed Mansoor was arrested a er signing the same petition ).  Al-\nShamsi’s father ( ﺍﻟﺷﺎﻣﺳﻲ ﺍﻟﻌﺎﻣﺭﻱ ﺭﺣﻣﺔ ﺑﻥ ﻣﺣﻣﺩ )was appointed to, and chaired the first sessions\nof, the Federal National Council (FNC), a legislative advisory council that is now an elected\nbody.  He called for more powers to be given to the FNC.\n4.3. Additional Targets: Qatari Citizens Sentenced to Prison\nFigure 13: @Dwight389 contacted @northsniper on 7 November\n2013\nIn May 2015, five Qataris were sentenced (one present in the UAE to 10 years in prison, and\nfour in absentia to life in prison), for posting allegedly o ensive pictures of the UAE Royal\nFamily on three Twitter accounts and two Instagram accounts,  including @northsniper .\n At trial, the prosecution accused the five of being agents of Qatar’s State Security, and\nposting the allegedly o ensive pictures as part of a “military mission” to “show that Emiratis\nhad o ended their own leaders”.   The @northsniper  account is currently suspended.  One\nInstagram account allegedly used by defendants in this case ( @9ip) is still active, and still\nappears to display unflattering photoshopped images of the President, Crown Prince, and\nFounder of the UAE.\n \n5. Stealth Falcon’s Widespread Targeting of UAE Figures\nThis section describes how we identified additional Stealth Falcon victims and bait content,\nand traced Stealth Falcon’s spyware to additional C2 servers.\nGiven Stealh Falcon’s use of public Twitter mentions to contact individuals, we searched\nGoogle and Twitter for instances of aax.me links.  The links we found indicated that we\ncould easily probe aax.me to get a comprehensive list of all currently active short URLs, and\ntheir corresponding long URLs.  Our findings point to a UAE-focused operator, whose bait\ncontent and targets are linked to the Emirates.  Furthermore, we were able to connect this\nattack to case from December 2012, where an anonymous UAE activist contacted us and\nclaimed to have received a suspicious link from a Twitter account that was purportedly\nunder government control.\n5.1. Public Targets and Links to Arrests\nThis section describes 24 Stealth Falcon Twitter targets we identified on the basis of them\nreceiving an aax.me link in a Twitter mention.\nWe found aax.me links targeting 24 accounts, each of whom was mentioned in a tweet that\nalso contained an aax.me shortened link.  We were unable to get details about 17 of the\naccounts.  Of the accounts we have been able to identify, several individuals were\nsubsequently arrested or convicted in absentia by the UAE Government in relation to\ntheir online activities .\nThe following table outlines these cases, and notes arrests.  For completeness, the table\nincludes the cases from Section 4.1-4.3:\nHandle TargetingRelated Arrests /\nConvictionsNote\n@omran83 14 January 201216 July 2012\n(arrested)UAE94 prisoner; serving 7 years in prison.\n@weldbudha\nbi5 August 2012;\n20 October 201214 December 2012\n(arrested)\n@intihakat 5 August 201225 December 2013\n(convicted)Qatari convicted in absentia; sentenced to 5\nyears in prison.\n@bukhaledob\naid\n(Sec 4.1)24 April 20132 July 2013;\n12 December 2013\n(arrested)Brother of UAE94 prisoner; acquitted of charges;\nindefinitely detained in prisoners ward of\nhospital.\n@northsniper\n(Sec 4.3)7 November 201318 May 2015\n(convicted)Five Qataris convicted; sentences ranged from 10\nyears to life in prison.\n@71UAE 9 January 2012Last tweeted 1 July 2013, a day before arrest of\n@bukhaledobaid.\n@kh_oz 10 January 2012 Likely son of @bukhaledobaid.\n@shamsiuae5\n8\n(Sec 4.2)9 May 2013Signed 2011 pro-democracy petition that Ahmed\nMansoor was arrested a er signing.\n@newbedon 9 January 2012Donaghy describes the account as “ensur[ing\nthat] details of mistreatment [by security forces]\nare readily available”.\n@bomsabih 9 January 2012Inactive since 8 October 2014.  Owner claimed\na iliation with State Security Apparatus.\nWe list additional details in Appendix D: Public Stealth Falcon Tweets .\n5.2. Ennumerating aax.me for Bait Content\nThis section describes how we probed every conceivable short URL on aax.me, and found 402\npieces of bait content that we believe were sent by Stealth Falcon.\nAll of the public aax.me links we found, as well as the links sent to Donaghy, matched the\nregular expression /aax\\.me\\/[0-9a-f]{5}/ .  Assuming all links shortened via aax.me match\nthis regular expression, there are only 16 5 (1,048,576) possible short URLs.  We sent a\nrequest to aax.me for each possible URL, and observed the returned page or redirect.  We\nfound 57 URLs that exhibited the redirect.php  profiling behavior, and 524 URLs that\nreturned an HTTP 302 redirect to an expanded URL.  The other 1,047,995 aax.me links\nreturned a HTTP 302 redirect to the aax.me homepage; we assume these short URLs were\nunassigned to an expanded URL, as of the time of our scan.\nWe coded the long URLs where the URLs were still active, or where we could find an\narchived copy of, or some information about, the URL.  We were able to code 535 URLs, and\nfailed to code 46 URLs as the corresponding websites were down, and we could not find\nreliable information about what content the URLs contained.  See Appendix E: Results of\naax.me Scan  for details.  We coded 133 URLs as “advertisement” (25% of all coded URLs), as\nthey appeared to represent an advertisement for a product.  The vast majority of these\nadvertisements seemed to be products typically marketed via spam (e.g., “dietary\nsupplement” or “green co ee”).  We suspect that these links may have been shortened by\nspammers, as the aax.me URL shortening page is pubilcly accessible and indexed by Google,\nand YOURLS advises that publicly accessible URL shorteners will receive spam.   All\n“advertisement” links were 302 redirects, and none were redirect.php  links.  This is\nconsistent with our observation that the aax.me public interface only permits visitors to\nshorten links using the 302 redirect method.\nWe filtered out the short URLs classified as “advertisement.”  There were 402 non-\nadvertisement short URLs that we tagged.  We display a summary of the top ten tags below:\nTag Number of Short URLs % of non-advertisement URLs\nUAE 292 73%\nTorture 57 14%\nSecurity Forces 49 12%\nDenaturalization 46 11%\nIsa bin Zayed 42 10%\nRule of Law 40 10%\nCriticism 40 10%\nABC News 40 10%\nViolations 33 8%\nIslam 29 7%\nWe noted that a number of long URLs had multiple corresponding short URLs.  We display\nthe top ten long URLs below.\nLong URL# Short\nURLsDescription\nhttp://www.youtube.com/watch?\nv=F6NU4pc378k40ABC News report featuring video of Abu Dhabi\nCrown Prince’s brother, Sheikh Isa bin Zayed al-\nNahyan, torturing an Afghani grain salesman.\nhttp://mohaamoon.com/uae/17.htm 40Personal website criticizing rule of law and\nhuman rights issues in the UAE, including\ntorture, slavery, and imprisonment for debts.\nhttps://r7aluae2.wordpress.com/2012/01/09\n/-ﺍﻟﻣﻧﻅﻣﺎﺕ-ﺍﺗﺣﺎﺩ\nﻳﺱ-ﺃﻭﺭﻭﺑﺎ-ﻓﻲ-ﺍﻹﺳﻼﻣﻳﺔ/19Copied statement from the Federation of Islamic\nOrganizations in Europe (FIOE), criticizing the\nUAE’s denaturalization of citizens.\nhttps://www.a7rarelemarat.com/vb 10Purported to be an opposition web forum for\ndiscussing Emirati issues, and providing proxy\ntools.  The site is now down, so we cannot\ninspect the specific forum posting.\nhttp://google.com 9 Google.\nhttps://www.a7rarelemarat.com/vb/showthrea\nd.php?p=3423#post34236 (see a7rarelemarat above)\nhttp://www.youtube.com/watch?\nv=Xcc9Tdc_Hxg&feature=player_embedded#!5Video montage talking about torture by UAE\nsecurity forces.\nhttp://www.youtube.com/watch?\nv=izeSn9Am6us&list=UU2wwG6r1J_GRgXuMGi9\nm8FQ&index=1&feature=plcp5 Video unavailable.\nhttps://www.youtube.com/watch?\nfeature=player_embedded&v=Q3aQpfyXSrg5Video published by Al Islah, which appears to be\na montage of UAE political detainees.\nhttps://www.a7rarelemarat.com/vb/forumdispl\nay.php?f=35 (see a7rarelemarat above)\n5.3. A Connection to an Account Potentially Under UAE Government\nControl\nThis section describes a case from December 2012 where an Emirati activist said he received\nlinks connected to aax.me from an account that may have been  under UAE government\ncontrol.\nIn December 2012, an author of this report was contacted by an Emirati activist, who\nreported that an account, @WeldBudhabi , had sent him a link on 14 December 2012 via\nTwitter direct message that took him to a page on a7rarelemarat.com .  A report by BBC\nnotes that UAE authorities on 14 December 2012 arrested an individual who they believed to\nbe associated with @WeldBudhabi , and that the account was “reportedly hacked by the\nauthorities”  on the same day.   The Emirati activist told us that he later contacted\n@WeldBudhabi , who reported that he did not send the link.\nThis link provides the strongest connection between Stealth Falcon and the UAE Authorities\nthat we are aware of.\na7rarelemarat.com  is a now-defunct website that purported to be an opposition web\nforum for discussing Emirati issues, and providing proxy tools for “hiding from the thugs”\n(presumably a reference to the UAE State Security Apparatus).  We found four links involving\naax.me posted by the site’s Twitter account, @a7rarelemarat .  We display two Tweets\nbelow, as the rest of the Tweets had the same links:\nFigure 14: @a7rarelemarat targeted @WeldBudhabi with a\nmalicious link on 20 October 2012\nTwitter’s API records the date of the tweet’s creation:\nSun Oct 21 05:05:41 +0000 2012\nWe also accessed the goo.gl link statistics, and found that the goo.gl link in the tweet was\ncreated less than two minutes prior to the tweet:\n2012-10-21T05:03:45.585+00:00\nThe second tweet exhibited a similar pattern:\nFigure 15: @a7rarelemarat publicly sent a malicious link on\n2 October 2012\nTwitter’s API records the date of the tweet’s creation:\nWed Oct 03 06:54:33 +0000 2012\nWe again accessed the goo.gl link statistics, and found that the goo.gl link in the tweet was\ncreated less than one minute prior to the tweet:\n2012-10-03T06:53:45.151+00:00\nThe link redirects to https://www.a7rarelemarat.com/vb/showthread.php?\np=3423#post3423  via http://aax.me/d910a .\nThe use of both goo.gl and aax.me in these cases suggests that the goo.gl link may have\nbeen designed to conceal the aax.me domain.  Also, the proximity in creation time between\nthe Tweet and the goo.gl link suggests that the person who posted the Tweet through\n@a7rarelemarat  was likely the same person who created the goo.gl link.\nWe suspect that the aax.me operator had some control over @a7rarelemarat  at the time,\nand may have had control of a7rarelemarat.com  as well.\n5.4. Infrastructure Analysis of Stealth Falcon Command & Control\nThis section describes how we traced Stealth Falcon’s spyware to live C2 servers and domain\nnames.\nWe fingerprinted the behavior of adhostingcache.com  (the C2 server for the Stage One\nspyware that Donaghy received) and traced it to a series of 14 active IP adresses and 11\ndomains (using PassiveTotal ).  Nine domains are named like generic Internet backend\nservers (e.g., simpleadbanners.com , clickstatistic.com ), whereas two appear to be\nthematically related to travel ( bestairlinepricetags.com , fasttravelclearance.com ),\nperhaps indicative of travel-themed targeting or targets.\nWe fingerprinted the behavior of incapsulawebcache.com  (the C2 server for the Stage Two\nspyware that Donaghy receied) and scanned the Internet (including historical scanning\nresults) for servers that matched our fingerprint.  We also used Passive DNS to correlate IP\naddresses to domains.  In total, we associated 67 active (and 30 historical) IP addresses with\nthe Stage Two spyware.  Using PassiveTotal, we linked 69 domain names to these IP\naddresses, the earliest registered on 28 January 2013, and the most recent registered on 19\nApril 2016.  The vast majority of the domains are named like generic Internet backend\nservers.  One domain name appears to be travel-themed ( airlineadverts.com ), and two\nappear to be news and/or government themed ( ministrynewschannel.com ,\nministrynewsinfo.com ).\nThe earliest date we found an IP addresses matching our Stage Two fingerprint was 21 July\n2014, as recorded by sonar-ssl scans.  It is possible that the operator used a di erent\nconfiguration of spyware between January 2013 and July 2014.\nWe traced several additional domains to Stealth Falcon using WHOIS information, or Passive\nDNS.  Of these, one was designed to impersonate a China-based provider of VoIP solutions\n(yeastarr.com ), and two appeared to perhaps contain the Arabic word for security, “amn,”\n(amnkeysvc.com , amnkeysvcs.com ).  Full scan results and other indicators of targeting can\nbe found in Appendix F: Indicators of Targeting .\nThe domain names we found were typically registered with WHOIS privacy providers.\n Although, in some cases, we were able to obtain the true registration email through\nhistorical WHOIS.  Typically, the operators practiced disciplined operational security: we\nrarely found an email address that was used to register two domains, and we rarely found\ntwo domains linked to the same IP address.\n5.5. May 2016: New Stealth Falcon Document\nIn May 2016, the following document was submitted to VirusTotal:\nFilename:   message_032456944343.docm\nMD5:       87e1df6f36b96b56186444e37e2a1ef5\nSHA1:      1c3757006f972ca957d925accf8bbb3023550d1b\nSHA256:    4320204d577ef8b939115d16110e97ff04cb4f7d1e77ba5ce011d43f74abc7be\nThe document was similar to the one sent to Donaghy, except that it purported to be\nencrypted with WordSecure, “a simple, HIPAA .. business-grade so ware for sharing\nencrypted files and secure messages with anyone” .  The bait content was a single line of\ntext reading:\nMESSAGE_ERROR: 0E684AD042_(LANGUAGE NOT SUPPORTED)\nThe document’s macro was identical to the one sent to Donaghy, except it reported back to,\nand downloaded Stage Two from a di erent URL:\nhttp://optimizedimghosting.com/wddf/hrrw/ggrr.txt .  The server\noptimizedimghosting.com  matched our Stage One fingerprint for adhostingcache.com .\nWe obtained Stage Two, which appeared to be a newer version of the Stage Two than in\nDonaghy’s case.  The Stage Two in this case reported back to\nhttps://edgecacheimagehosting.com/images/image.nfo .  The server\nedgecacheimagehosting.com  matched our Stage Two fingerprint for\nincapsulawebcache.com .\nWhen we connected, the Stage Two server sent us additional commands (which we were\nunable to obtain in Donaghy’s case).  The Stage Two C2 sent us a bundle of 7 commands,\nthat did the following:\n1. Gathered system info from WMI\n2. Gathered the ARP table\n3. Gathered a list of running processes\n4. Materialized a file “OracleJavaUpdater.ps1” to disk.  This file gathers passwords and\nweb browser data from a variety of sources: Windows Credential Vault, Internet\nExplorer, Firefox, Chrome, Outlook.  In general, the file appears to be bespoke attacker\ncode, though some routines are copied from other sources (e.g., some Internet\nExplorer password gathering code appears to be li ed from the GPLv3-licensed\nQuasarRAT )\n5. Executed “OracleJavaUpdater.ps1”\n6. Deleted “OracleJavaUpdater.ps1”\n7. Gathered a list of running processes again\nA er command execution, results were returned to the Stage Two C2.\n \n6. Tip of the Iceberg: Possibly Related Attacks\nWe suspect that the activity we have observed is simply the tip of the iceberg in ongoing\nattacks against dissidents in the UAE.  Reuse of tactics, techniques and procedures and\ngeneral carelessness by operators can o en lead to discovery of links between campaigns.\n We briefly discuss some instances of potentially related attacks below.\n6.1. An Instagram attack?\nWe noticed that one of the Twitter accounts that sent out aax.me links, @um_zainab123 ,\nsolicited followers for an Instagram account @al7ruae2014 .\nFigure 16: @um_zainab123 soliciting followers for Instagram\naccount @al7ruae2014 on 26 April 2014\nFigure 17: The @al7ruae2014 Instagram account\nWe contacted an activist with knowledge of the UAE94 case, who told us that the\n@al7ruae2014 Instagram account got in touch with several family members of detainees\ninvolved in  the case, and was soliciting information from them via Instagram private\nmessage.  The domain name al7ruae2014.com  has the same name as the Instagram\naccount, so we suspect it may also be related to the operator.\n6.2. A fake file sharing site?\nWe identified one aax.me link ( http://aax.me/4b708 ) that points to\nhttp://velocityfiles.com/download.php?id=a81abdd8a0c0cd1d5d3b6baadcc9eb18 .  We\nvisited this link in February 2016, and were served a blank page.  VelocityFiles appears to\nhave been disabled in March 2016.\nWe found that the site purported to be a file hosting site, where users could register and\nupload files.  However, the registration and signup pages are currently blank, and were blank\nas of the Internet Archive’s oldest capture of the pages in December 2013.   We were unable\nto identify any links to velocityfiles.com from Twitter, or any pages indexed by Google.\nThe design of VelocityFiles appeared to be a loosely modified version of a public website\ndesign template.   Given that the site appears to be designed to pose as a public file sharing\nservice, has no obvious public functionality, and was linked to through aax.me, we suspect\nthat it may have been an attack site.\nFigure 18: Comparison between web design template image (le ) and VelocityFiles website (right).\nGiven VelocityFiles’ reference to “ FREE MD5 HASHING” (their emphasis), it is possible that\nthe value of the id parameter in the URL, a81abdd8a0c0cd1d5d3b6baadcc9eb18, represents\nthe MD5 hash of a file.  We were, however, unable to locate any file with this MD5 hash.\n6.3. Fake web forums?\nWe found an aax.me link that pointed to https://call4uaefreedom.com/vb .  The domain\nwas registered on 5/15/2013 and expired on 5/15/2015.  We were unable to find any\nwebpages or tweets linking to this website.  A Google search for “call4uaefreedom” reveals a\nblog, containing five posts, all within a 30 minute span on 4 June 2013, and an empty\nTwitter account @call4uaefreedom, created in May 2013.  Given the suspicious activity\nassociated with the alias “call4uaefreedom,” this may have been created by operators.\nWhile searching for domains with similar domain names, we came across uaefreedom.com .\n The domain name was first registered on 11 June 2010 by the administrators of UAE\nHewar, an online discussion forum founded in 2009 that was a frequent government\ntarget.  The domain name expired on 11 June 2011, but was re-registered by a di erent\nregistrant on 7 October 2012.\nOn 16 October 2012, we find the only tweet linking to uaefreedom.com .  A Google search\nyields no links to the site and we found no passive DNS data available for this domain.  The\ntweet was sent from account @FreeUAE2012 , directed at @uaemot.  An individual based in\nQatar was convicted in absentia on 25 December 2013 for running @uaemot.\nFigure 19: @FreeUAE2012 contacts @uaemot with a suspicious\nlink on 16 October 2012\nOther public tweets involving @FreeUAE2012 included two responses  from Ahmed\nMansoor to @FreeUAE2012  on 10 October 2012, regarding the 10 October 2012 Citizen Lab\nreport about how Ahmed Mansoor was targeted with Hacking Team spyware.  The tweets\nfrom @FreeUAE2012 to which Ahmed Mansoor was responding appear to have been\ndeleted.\nThree days later, @FreeUAE2012  attempted to convince Ahmed Mansoor that Tor Browser\nlogged private information of its users, posting a screenshot of the Tor Metrics page, which\nprovides non-sensitive data for researchers.\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33 34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44 45\n46 47\n48 49\n50\n51\n52\n53 54\n55\n56 57\n58\n59 60\n61\n62\n6364\n65\n66\n6768\n6970\n7172\n73\n7475\n76\n77 78\n79\n80\n81\n82\n83\n84\n85\n86\n87\n88\n89\n90\n91\n92\n93\n94\n95\nPrivacy Policy Unless otherwise noted this site and its contents are licensed under a Creative Commons Attribution 2.5 Canada  license.\nFigure 20: @FreeUAE2012 attempts to convince Ahmed Mansoor\nthat Tor logs private information of its users\n \n7. Attribution\nIn this section, we analyze two competing hypotheses about the identity of Stealth Falcon,\nand conclude that the balance of evidence suggests Stealth Falcon may be linked to the UAE\ngovernment.\nHypothesis 1: Stealth Falcon is State Sponsored\nStealth Falcon is a sophisticated threat actor, capable of deploying a wide range of technical\nand social engineering techniques against a potential target. The operations targeting\nDonaghy are linked to a series of primarily UAE-focused campaigns against UAE dissidents,\nstarting in January 2012.  While there is no “smoking gun,” several pieces of evidence\nsuggest a connection between Stealth Falcon and the UAE Government.  \nUAE Focused Targeting, Links to Arrests\nThe majority (73%) of bait content on aax.me was focused on UAE-related political issues\n(Section 5.2 ). Furthermore, of the 27 victim Twitter accounts we linked to public Stealth\nFalcon targeting, 24 primarily engaged in political activities, or were otherwise critical\nof the UAE government (Section 5.1 ).  Of these 24, we were able to find a subsequent arrest\nor a conviction in absentia by the UAE government.\nTweets During a Period of Government Control\nA reported case in which a Twitter account apparently under UAE Government control\nshared a Stealth Falcon link also suggests a connection.\nIn December 2012, an activist contacted us and asserted that an a7rarelemarat.com  link\nwas sent to him in a private message from the @WeldBudhabi  account the same day that\nan individual accused of operating the account was arrested, and while the account was\n“reportedly hacked by authorities” . The activist asserted that he contacted an owner of the\naccount, who claimed he did not send that link.  The Twitter account associated with\na7rarelemarat.com , @a7rarelemarat , appears to have been under the control of Stealth\nFalcon at some point during October 2012 (and possibly before and a er), as the account\nsent several aax.me links in October 2012.\nSophisticated Target Knowledge and Operational Security\nStealth Falcon demonstrates some familiarity with the patterns of behavior, interests, and\nactivities of its targets, suggesting that the operators may have been working with other\nsources of information about their targets’ behaviors.  In addition, Stealth Falcon displayed\nabove-average operational security throughout the campaign.  Some of the social\nengineering was highly intricate, particularly the email from Andrew Dwight about his ski\nholiday.  Stealth Falcon also shows familiarity with creating and maintaining a range of\nfictitious personas, and registering and managing a significant amount of attack and C2\ninfrastructure with concern for operational security.\nThe infrastructure behind the malware attacks showed good compartmentalization of\nidentities. We rarely found the same (fake) registration information used for more than one\nC2 domain. Stealth Falcon operators also appear to have deleted one of their attack\ndomains, adhostingcache.com  when they realized their attempt to target Donaghy had\nfailed.  We also noted that the (self-signed) SSL certificates on the C2 domains were changed\nseveral times as we monitored the infrastructure, perhaps in an attempt to thwart\nfingerprinting of their infrastructure via SSL certificates.\nThis level of sophistication is consistent with a state sponsored attacker.  Importantly, we\nfound little evidence that indicate criminal or other motivation for the attack, with no\nevidence of financial or industry targeting.\nWe also note that while some Stealth Falcon domains were registered on\nanonymousbitcoindomains.com, which is linked to APT28 activities, we found no evidence\nto support such a connection.  See Appendix G: No Evidence of APT28 Connection  for more\ndetails.\nHypothesis 2: Stealth Falcon is Not State Sponsored\nWe have considered the possibility that Stealth Falcon’s operators are not state sponsored,\nbut ultimately find little evidence to support this possibility.\nStealth Falcon’s attacks show no evidence of cyber criminal motivations, like financial the \nor fraud, nor is there any evidence of attempts to steal intellectual property or conduct\nother forms of economic espionage. Instead, the targets are politically engaged individuals\nand public figures. Furthermore, the activity of targets we have been able to identify o en\nconcerns domestic UAE issues.  Therefore, we would need to posit an operator with an\ninterest in individuals known for their engagement in domestic UAE issues.\nOther potential motivations might include blackmail or extortion. If this were the case,\nhowever, we might expect follow-up interactions between attackers and successful victims,\nand we would also expect attackers to use o -the-shelf Remote Access Tools (RATs), rather\nthan apparently coding a general-purpose RAT from scratch. This would save them the\ntrouble of needing to load additional malware to exfiltrate files or other material.  We are\naware of no evidence of follow-up interactions between the operators and successful victims\nas part of any extortion attempts.  Furthermore, Stealth Falcon’s use of JavaScript to profile\nand de-anonymize victims seems inconsistent with a primary motivation of collecting\ninformation that could be used for blackmail.\nThe strongest scenario for a non-state sponsored attacker is thus a politically motivated\ngroup.  Stealth Falcon targets are primarily individuals known for their criticism of the UAE\ngovernment. It is perhaps conceivable that a group of pro-government hackers might,\nwithout coordination, target these individuals.\nThere are, however, several features of Stealth Falcon’s activities that tell against this\npossibility. First, there is limited existing evidence that such autonomous groups exist and\nare active in the UAE.  Given what is known about this kind of group, we might expect such a\ngroup to have engaged in defacements, public boasting, or other public-facing activities\nrelated to Stealth Falcon’s campaign.  Furthermore, it seems unlikely that a previously\nunknown political group would have the resources to develop and maintain Stealth Falcon’s\nfictitious personas and compartmentalized infrastructure.\nEvaluation of Hypotheses\nWe evaluated both hypotheses and found Hypothesis 1: Stealth Falcon is State Sponsored\nto be the best at explaining the many elements that we have observed. Stealth Falcon’s\ntactics, resources, and targets all fit with the profile of a state sponsored attacker.\n Furthermore, the circumstantial evidence we have presented in this report is suggestive of a\nlink between Stealth Falcon and an entity within the UAE Government.\n \n8. Conclusion: The Big Picture\nStealth Falcon appears to be a new, state sponsored threat actor.  As an operator, Stealth\nFalcon is distinguished by well informed and sophisticated social engineering, combined\nwith moderately sophisticated  technical attempts to deanonymize and monitor political\ntargets working on the UAE, and relatively simple malcode.\nSocial Engineering and the Achilles Heel of Civil Society\nStealth Falcon’s technical approach may not be cutting edge, but the operators are neither\nunsophisticated or ine ective. Analyzed holistically as an operation, Stealth Falcon is a\nlogical and multi-pronged approach to compromising and unmasking a class of targets.\n Stealth Falcon’s campaign highlights the power of social engineering, once a technical bar\nhas been met, in conducting a large scale campaign.\nContemporary social movements and civil society groups rely heavily on the internet for\nboth their core operations, as well as advocacy activities.  Yet these groups are o en\noperating outside a centrally managed IT environment.  The constant sharing of links and\nmaterials, as well as regular communications with journalists makes them especially\nvulnerable to targeting with social engineering.\nHowever, the emphasis on social engineering can also cut in the other direction. Many\nmodern attack techniques require an attacker to interact with a target.  When operators like\nStealth Falcon send malicious e-mails and tweets, there are a range of opportunities for\nretrospective investigation.  As this report shows, the inboxes of targets, for example, are\no en a more e icient object of investigation than computers themselves, especially once\nfeatures of a particular campaign are recognized.\nThe Growing Trend of Impersonating Journalists\nStealth Falcon is only the latest example of civil society-focused threat actors impersonating\nNGOs and journalists to conduct espionage operations. The tactic has been used by a wide\nrange of actors, including Bahrain’s government,  Packrat in Latin America,  Iranian\ngroups, and China related groups,  among others. Threat actors seem to gravitate\ntowards this tactic because interacting with journalists is an essential part of civil society\nactivity. It is common for journalists to send unsolicited messages to activists and civil\nsociety organizations asking for information, and there is typically a strong incentive for the\norganization to engage. Indeed, even Western law enforcement agencies have occasionally\nadopted the approach.   The reporter-source relationship is protected in many\njurisdictions, based on the understanding that protecting this trust is important to a healthy\nand vibrant civil society.  Tactics that play on this trust are risky, and can quickly contribute\nto eroding the trust on which civil society is based.\nFinal Note: A Plea for More Research\nImportantly, while we were unable to identify evidence of a conclusive link between Stealth\nFalcon and a particular sponsor, we have assembled a body of circumstantial evidence that\npoints to an alignment of interests between Stealth Falcon and the UAE Security Forces.  We\nhope that other researchers will draw from our findings and work to identify additional\ncases.  Finally, we urge anyone who recalls receiving a link to “aax.me,” or an email from\n“Andrew Dwight” to contact the authors of this report for further investigation.\n \nAcknowledgements\nSpecial thanks to PassiveTotal and Rori Donaghy.  Thanks to Je rey Knockel, Sarah McKune,\nChris Doman, Mansoureh Mills.\n \nFootnotes\nhttp://www.youthdiplomaticservice.com/zzold-business-blog/category/business\n See for example: http://www.middleeasteye.net/news/leaks-show-uae-shipped-weapons-\nlibya-violated-un-resolution-1712843977 ; http://www.middleeasteye.net/news/uae-paid-pr-\nfirm-millions-brief-uk-journalists-qatar-muslim-brotherhood-attacks-1058875159 ;\nhttp://www.middleeasteye.net/news/leaks-show-uae-shipped-weapons-libya-violated-un-\nresolution-1712843977 ; http://www.middleeasteye.net/news/exclusive-emirati-plan-ruling-\negypt-2084590756\nhttp://www.middleeasteye.net/users/rori-donaghy\nhttp://www.middleeasteye.net/about-middle-east-eye-1798743352\nhttp://www.echr.org.uk/\nhttp://www.echr.org.uk/?page_id=25\nhttps://freedomhouse.org/report/freedom-world/2015/united-arab-emirates\nhttps://www.hrw.org/world-report/2016/country-chapters/united-arab-emirates\nhttps://www.amnesty.org/en/countries/middle-east-and-north-africa/united-arab-\nemirates/\nhttps://www.usenix.org/system/files/conference/usenixsecurity14/sec14-paper-\nmarczak.pdf\nhttps://citizenlab.ca/2012/10/backdoors-are-forever-hacking-team-and-the-targeting-of-\ndissent/\nhttps://wikileaks.org/hackingteam/emails/emailid/585453\nhttp://www.uae-embassy.org/news-media/sheikh-mohamed-bin-zayed-al-nahyan-meets-\ncongressional-leaders-and-senior-us-government\nhttps://ht.transparencytoolkit.org/rcs-\ndev%5Cshare/HOME/cristian/9.4%20lic/UAEAF/LICENSE-1262004202-v9.4.lic\nhttps://owncloud.org/\nhttps://www.proofpoint.com/us/o ice365\nhttp://righttofightexhibit.org/home/\nhttp://www.powershellempire.com/\nhttp://www.aljazeera.com/indepth/opinion/2015/11/british-pm-middle-east-human-\nrights-151103070038231.html\n Based on last-modified  header\nhttp://www.andlabs.org/tools/jsrecon.html\nhttps://media.blackhat.com/bh-ad-10/Kuppan/Blackhat-AD-2010-Kuppan-Attacking-with-\nHTML5-slides.pdf\nhttps://yourls.org/\nhttps://github.com/YOURLS/YOURLS\n A Firefox extension to be used in conjunction with Tor, before the introduction of Tor\nBrowser\n Importantly, making Tor users appear similar to non-Tor users was a not a goal\nhttps://trac.torproject.org/projects/tor/ticket/5922\nhttps://www.defcon.org/images/defcon-17/dc-17-presentations/defcon-17-\ngregory_fleischer-attacking_tor.pdf\nhttps://blog.torproject.org/blog/new-tor-browser-bundles-windows\nhttps://blog.torproject.org/blog/tor-browser-36-released\nhttps://msdn.microso .com/en-us/library/2yfce773(v=vs.94).aspx#s-\ne6f6a65cf14f462597b64ac058dbe1d0-system-media-system-caps-note\nhttps://en.wikipedia.org/wiki/Cross-origin_resource_sharing\nhttps://esupport.trendmicro.com/en-us/home/pages/technical-support/1057722.aspx\nhttp://support.kaspersky.com/us/11255\nhttp://ssj100.fullsubject.com/t446-avira-antivir-premium-allows-all-outbound\nhttp://www.wilderssecurity.com/threads/port-80-is-redirected-to-30606-and-no-webpage-\nis-opened.212599/\nhttps://community.mcafee.com/thread/21790?tstart=0\n The tool is available at: http://www.andlabs.org/tools/jsrecon.html . The JavaScript\nsource code may be viewed by viewing the source of jsrecon.html\nhttps://media.blackhat.com/bh-ad-10/Kuppan/Blackhat-AD-2010-Kuppan-Attacking-with-\nHTML5-slides.pdf\nhttp://www.andlabs.org/tools/jsrecon/jsrecon.html\nhttps://code.google.com/p/google-security-research/issues/detail?id=679\nhttp://www.hu ingtonpost.co.uk/rori-donaghy/uae-94-verdict_b_3549671.html\nhttp://en.rsf.org/emirats-arabes-unis-journalist-held-incommunicado-02-08-\n2013,45013.html\nhttps://www.indexoncensorship.org/2015/03/united-arab-emirates-stop-the-charade-and-\nrelease-activists-convicted-at-the-mass-uae-94-trial/\nhttp://blogs.voanews.com/repressed/2014/01/14/update-shez-cassim-back-home-a er-\nmonths-in-uae-jail/\nhttp://www.al-monitor.com/pulse/originals/2014/07/uae-twitter-imprisoned-not-guilty-\nactivist-cyber-crime.html\nhttp://newday.blogs.cnn.com/2013/12/11/u-s-man-in-jail-in-dubai-over-parody-video/\nhttps://www.youtube.com/watch?v=IUk5CB9kaBY\nhttp://www.nydailynews.com/news/national/shezanne-cassim-sentenced-year-united-\narab-emirates-parody-video-article-1.1556327\nhttps://www.article19.org/resources.php/resource/37279/en/united-arab-emirates:-stop-\nthe-charade-and-release-activists-convicted-at-the-mass-uae-94-trial\nhttps://www.amnesty.org/en/documents/mde25/015/2014/en/\nhttp://www.gc4hr.org/report/view/33\nhttp://www.buid.ac.ae/vc\nhttp://www.wam.ae/ar/news/emirates/1395239973989.html\nhttp://emarati.katib.org/2011/03/09/%D8%A5%D9%85%D8%A7%D8%B1%D8%A7%D8%A\nA%D9%8A%D9%88%D9%86-%D9%8A%D8%B1%D9%81%D8%B9%D9%88%D9%86-\n%D8%B1%D8%B3%D8%A7%D9%84%D8%A9-%D9%84%D8%AD%D9%83%D8%A7%D9%85-\n%D8%A7%D9%84%D8%A5%D9%85%D8%A7%D8%B1%D8%A7/\nhttp://www.cnn.com/2011/WORLD/meast/03/09/uae.petition/\nhttp://www.bbc.com/news/world-middle-east-13043270\nhttp://www.alittihad.ae/details.php?id=8416&y=2005\nhttp://www.thenational.ae/uae/courts/defendant-denies-insulting-leaders-of-uae-on-\nsocial-media\nhttp://dohanews.co/uae-court-convicts-qataris-for-insulting-royals-on-social-media/\nhttp://www.thenational.ae/uae/foreign-agent-ordered-to-spread-false-information-about-\nuae\nhttps://www.instagram.com/9ip/\nhttps://twitter.com/Bu_saeed2/status/158267593269063680\nhttp://www.gc4hr.org/news/view/198\nhttp://www.echr.org.uk/?page_id=207\nhttps://twitter.com/islam_way_2030/status/232392466760863744\nhttps://twitter.com/a7rarelemarat/status/259883131807621120\nhttp://www.bbc.com/news/world-middle-east-20768205\nhttps://twitter.com/islam_way_2030/status/232393358243401728\nhttp://www.echr.org.uk/?p=1104\nhttps://twitter.com/Dwight389/status/327033672979079168\nhttp://en.rsf.org/emirats-arabes-unis-journalist-held-incommunicado-02-08-\n2013,45013.html\nhttp://www.al-monitor.com/pulse/originals/2014/07/uae-twitter-imprisoned-not-guilty-\nactivist-cyber-crime.html\nhttps://twitter.com/Dwight389/status/398413653315031041\nhttp://www.thenational.ae/uae/courts/20150518/five-qataris-found-guilty-of-insulting-\nuae-royals\nhttps://twitter.com/MiriamKhaled/status/156625204280434688\nhttps://twitter.com/Bu_saeed2/status/156781983983349760\nhttps://twitter.com/kh_oz/status/351828658371039233\nhttps://twitter.com/Dwight389/status/332452681325088768\nhttps://twitter.com/r7aluae2/status/156418043424157696\nhttp://www.hu ingtonpost.co.uk/rori-donaghy/uae-94-verdict_b_3549671.html\nhttps://twitter.com/Bu_saeed2/status/156406670866653184\nhttps://github.com/YOURLS/YOURLS/wiki/Spam\nhttp://www.bbc.com/news/world-middle-east-20768205\nhttps://www.passivetotal.org/\nsonar-ssl\nhttps://wordsecure.com/\nhttps://github.com/quasar/QuasarRAT/blob/master/Client/Core/Recovery/Browsers/Inter\nnetExplorer.cs\n See https://web.archive.org/web/20131207060523/https://velocityfiles.com/login.php\nand https://web.archive.org/web/20131207054158/https://velocityfiles.com/register.php\nhttp://templates.entheosweb.com/template_number/live_demo.asp?TemplateID=54257\n http://aax.me/1a732\nhttps://en.wikipedia.org/wiki/Emirates_Discussion_Forum\nhttp://www.echr.org.uk/?p=1104\nhttps://twitter.com/Ahmed_Mansoor/status/256142870896054273  and\nhttps://twitter.com/Ahmed_Mansoor/status/256144504116109312\nhttps://metrics.torproject.org/\nhttp://www.bbc.com/news/world-middle-east-20768205\n e.g., local portscanning from webpages with JS-Recon, determining web browser versions\nby testing JavaScript functionality, Tor Browser profiling bug, macro infection.\n e.g., Powershell remote shell.\nhttps://citizenlab.ca/2012/07/from-bahrain-with-love-finfishers-spy-kit-exposed/\nhttps://citizenlab.ca/2015/12/packrat-report/\nhttps://citizenlab.ca/2015/08/iran_two_factor_phishing/\nhttps://targetedthreats.net/\nhttp://www.latimes.com/nation/la-na-associated-press-lawsuit-20150827-story.html\nMedia Mentions\nNew York Times , Foreign Policy , International Business Times , Chicago Tribune , VICE\nMotherboard , Taipei Times , Forbes, Techworm, Sputnik News , Network World , BoingBoing .96\n97\n98\n99 100\n101 102\n103\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n64\n65\n66\n67\n68\n69\n70\n71\n72\n73\n74\n75\n76\n77\n78\n79\n80\n81\n82\n83\n84\n85\n86\n87\n88\n89\n90\n91\n92\n93\n94\n95\n96\n97\n98\n99\n100\n101\n102\n103\nBitter Sweet: Supporters of Mexico’s Soda Tax Targeted With NSO Exploit Links\nKeep Calm and (Don’t) Enable Macros: AppendicesTags:\nHuman Rights , Malware, Surveillance , UAERelated: Share:\nRESEARCH\nTargeted Threats\nFree Expression Online\nTransparency and Accountability\nApp Privacy and Controls\nGlobal Research Network\nTools & Resources\nAll PublicationsNEWS\nIn the Media\nEvents\nOpportunities\nNewsletter ArchivesABOUT\nAbout the Citizen Lab\nPeople\nMedia Resources\nTeaching\nDonate\nCONNECT\nNEWSLETTER\nYour email address Sign up\n "
}