{
    "title": "keypoint network breach could affect thousands of federal workers - the washington post",
    "text": "Business\nKeyPoint network breach could affect thousands of federal\nworkers\nDecember 18, 2014\nKeyPoint Government Solutions, which took over the bulk of federal background checks after one of its competitors was\nhacked, also recently suffered a computer network breach, officials said Thursday.\nWhile there was “no conclusive evidence to confirm sensitive information was removed from the system,” Office of\nPersonnel Management spokeswoman Nathaly Arriola said the agency would notify 48,439 federal workers that their\npersonal information may have been exposed.\nThe breach comes just a few months after OPM decided not to renew  a background investigations contract with USIS,\nwhich suffered a breach earlier this year.\nUSIS had been the largest provider of background checks used in security clearances for the federal government for\nyears. After OPM decided not to renew USIS’s contract, Colorado-based KeyPoint quickly picked up the bulk of the work\nfor the federal government.\nKeyPoint and USIS declined to comment.\nEarlier this month, USIS pushed back against criticism  that it didn’t do enough to prevent a massive cyberattack and\naccused the OPM of neglecting to share information that might have helped it detect the intrusion earlier.\nUSIS, based in Falls Church, Va., said it sought to work closely with OPM after the breach. But the company wrote that\n“no meaningful partnership will ever exist if the U.S. government response to cooperation is to punish and shut down\norganizations that, like so many government agencies, happen to fall victim to a cyber attack.”\nKeyPoint’s breach was yet another in a series of problems that have plagued the background-check process. Before it was\nhacked, USIS was accused in a whistleblower lawsuit, joined by the Justice Department, of “flushing” hundreds of\nthousands of checks — meaning they were submitted as complete even though they were not.\nAnd members of Congress repeatedly urged OPM to end its contract with USIS.\nThe termination of the contracts on Sept. 30 had a devastating effect on USIS, which at one point employed about 3,000\nworkers in its investigations division.\nKeyPoint moved quickly to fill the void, looking to double the size of its investigative workforce.\nBut USIS’s caseload was significant  — 21,000 background checks a month, and once its contract was not renewed, some\nwondered who would be able to handle the task on short notice.\nThat amount of work requires significant managerial oversight, which is usually developed over time, said Nicole Smith,\na former USIS senior investigator who now is an attorney at Tully Rinckey working on security clearance issues.\nOnce KeyPoint took over, she said one of the questions that concerned her was: “Can they even handle the influx of\nthese new employees and all the work that gets dumped on them from OPM?”\nIn an e-mail to OPM colleagues, Donna Seymour, the agency’s chief information officer, said that “following the\ndiscovery of the problem, KeyPoint implemented numerous controls to strengthen the security of its network. The\nimmediacy with which KeyPoint was able to remediate vulnerabilities has allowed us to continue to conduct business\nwith the company without interruption.”\nIn the e-mail, a copy of which was obtained by The Washington Post, she said that the “security of our network and the\ndata entrusted to us remains our top priority. This incident serves as yet another reminder that we all must be ever-\nvigilant in our efforts to understand, anticipate and guard against the threat of cyber-attacks.”\nArriola, the OPM spokeswoman, declined to comment on the sophistication of the attack or who might have been behind\nit, saying the investigation was ongoing. OPM will offer the employees free credit monitoring.By Christian Davenport\n 8 Comment s\nEconomy & business email alerts\nImportant breaking news emails on the issues around the economy and business.\nE-mail address  Sign up\nBy signing up you agree to our Terms of Use  and Privacy Policy\nChristian Davenport  Christian Davenport covers the defense and space industries for The Washington Post's Financial desk. He joined The Post in 2000\nand has served as an editor on the Metro desk and as a reporter covering military affairs. He is the author of \"The Space Barons: Elon Musk, Jeff Bezos and\nthe Quest to Colonize the Cosmos\" (PublicAffairs, 2018). Follow \nGet a year of access for $29. Cancel at any time.\nGet this offer now\nSend me this offer\nAlready a subscriber? Sign in1\n2\n3\n4\n5\nMost Read Business\nSenate Republicans release\nmassive economic stimulus bill for\ncoronavirus response\nAmericans are very likely to get\n$1,000 (or more) checks. Here’s\nwhat you need to know.\nNegotiations intensify on Capitol Hill\nover massive stimulus legislation as\ncoronavirus fallout worsens\nPaid sick leave: Who gets it during\nthe coronavirus outbreak\nChange in U.S. law will make\nmillions more masks available to\ndoctors and nurses, White House\nsays\nLatest episode\nRepublicans’ radical about-face on\nbailouts\nListen 24:34\nUnparalleled reporting. Expert insight. Clear\nanalysis. Everything you’ve come to expect\nfrom the newsroom of The Post -- for your\nears.\nGet a year of access\nfor $29.\nCancel at any time.\nGet this offer now\nSend me this offer\nAlready a subscriber? Sign in\nEconomy & business email alerts\nImportant breaking news emails on the issues\naround the economy and business.\nE-mail address  Add\nMarket Watch\nLast Updated:03/19/2020Dow 20,087.19 Today  0.95%\nS&P 2,409.39 Today  0.47%\nNASDAQ 7,150.58 Today  2.3%\nwashingtonpost.com\n© 1996-2020 The Washington Post\n \nHelp\nPolicies and Standards\nTerms of Service\nPrivacy Policy\nPrint Products Terms of Sale\nDigital Products Terms of Sale\nSubmissions and Discussion Policy\nRSS Terms of Service\nAd Choices\nContact Us\n  Sections \nSign In  Democracy Dies in Darkness \nGet 1 year for $29\n "
}