{
    "title": "know your enemy_ tracking a rapidly evolving apt actor _ fireeye inc",
    "text": "Țħřěǻț Řěșěǻřčħ\nĶňǿẅ Ỳǿųř Ěňěmỳ: Ț řǻčķįňģ Ǻ Řǻpį đŀỳ Ěvǿŀvįňģ ǺPȚ\nǺčțǿř\nǾčțǿbě ř 31, 2013  | bỳ Ňěđ Mǿřǻň, Țħǿųfįqųě Ħǻq\nBěțẅěěň Ǿčț. 24–25 FįřěĚỳě đěțěčțěđ țẅǿ șpěǻř-pħįșħįňģ ǻțțǻčķ ș ǻțțřįbųțěđ țǿ ǻ țħ řěǻț ǻčțǿ ř ẅě ħǻvě\npřěvįǿųșŀỳ đųbběđ ǻđmįň@338 .[1] Țħě ňě ẅŀỳ đįșčǿvěřěđ ǻțțǻčķș țǻřģěțěđ ǻ ňųmběř ǿf ǿřģǻňįżǻțįǿňș ǻňđ ẅěřě\nǻppǻřěňțŀỳ fǿč ųșěđ ǿň ģǻțħě řįňģ đǻțǻ řěŀǻțěđ țǿ įňțě řňǻțįǿňǻŀ ț řǻđě, fįňǻňčě, ǻň đ ěčǿňǿmįč pǿŀįčỳ. Țħě șě țẅǿ\nǻțțǻčķș ųțįŀįżěđ đįffěřěňț mǻŀ ẅǻřě fǻmįŀįě ș ǻňđ đěmǿňșțřǻțě ǻň ǻbįŀįțỳ țǿ q ųįčķŀỳ ǻđǻpț țěčħňįq ųěș, țǻčțįčș, ǻňđ\npřǿčěđųřěș (ȚȚPș).\nİňvěșțǿř Ģųįđě ǻňđ Čǿňțǻčț Ŀį șț Ŀųřě\nǾň Fřįđǻỳ Ǿčț. 25, 2013 , FįřěĚỳě đěțěčțěđ ǻň ǻțțěmpțě đ țǻřģěțěđ čǻmpǻįģň ǻģǻįň șț țħě fǿŀŀǿ ẅįňģ:\nȚħě Čěňț řǻŀ Bǻňķ ǿf ǻ Ẅě șțěřň Ěųřǿpěǻň ģǿvě řňměňț\nǺň İňțěřňǻțįǿňǻŀ ǿ řģǻňįżǻțįǿň įňvǿŀvě đ įň țřǻđě, ěčǿňǿmįč, ǻň đ fįňǻňčįǻŀ pǿŀįčỳ\nǺ Ų.Ș.-bǻ șěđ țħįňķ țǻňķ\nǺ ħįģħ- řǻňķįňģ ģǿvě řňměňț ǿffįčįǻŀ fǿ ř ǻ čǿųňțřỳ įň țħě Fǻ ř Ěǻșț\nȚħįș șpěǻř-pħįșħ ěmǻįŀ, șħǿẅň įň Fįģ ųřě 1, čǿňțǻįňě đ ǻ mǻŀįčįǿ ųș Ẅǿřđ đǿčųměňț ǻțțǻčħměňț țħǻț ěxpŀǿįțě đ țħě\nČVĚ-2012 -0158  vųŀňěřǻbįŀįțỳ.\nFįģųřě 1: Șpěǻř-pħįșħ ěmǻįŀ ųșěđ įň ǻ řěčěňț ǻ đmįň@338  ǻțțǻčķ\nȚħě mǻŀįčįǿ ųș Ẅǿřđ đǿčųměňț ħǻ đ țħě fǿŀŀǿ ẅįňģ přǿpěřțįěș:\nFįŀě: İňvěșțǿř Řěŀǻțįǿň ș Čǿňțǻčț ș.đǿč\nMĐ5: 87576708689 7ě90fb47ǻ021b45ě161b2\nŲpǿň ǿpěňįňģ țħě fįŀě, ǻ mǻŀįčįǿ ųș ěxěčųțǻbŀě ẅįțħ țħě MĐ 5 ħǻșħ vǻŀųě ǿf č5đ8b7č8ě2f50b171840ě071f8ǻ079b6\nįș țħěň ẅřįțțěň țǿ Č:\\Ẅįň đǿẅș\\ẅmįșěřvěř.ěxě ǻň đ șųbșěqųěňțŀỳ ěxěč ųțěđ. Țħįș ěxěčųțǻbŀě įș ǻ vǻřįǻňț ǿf țħě\nBǿżǿķ ŘǺȚ, ẅħįčħ ẅǻș čǿňfįģųřěđ țǿ čǿňňěčț țǿ įț ș čǿmmǻň đ–ǻňđ-čǿňțřǿŀ (ČňČ) șěřvěř ǻț microsoft.mrbasic.com and\nwww.microsoft.mrbasic.com with the Bozok connection password of “wwwst@Admin”. We observed the domain microsoft.mrbasic.com resolving\nto 58.64.153.157 on Oct. 26, 2013.\nBǿżǿķ ŘǺȚ Čǻpǻbįŀįțįě ș ǻňđ Běħǻvįǿ ř\nBǿżǿķ, ŀįķě mǻňỳ ǿțħě ř pǿpųŀǻř ŘǺȚș, įș fřěěŀỳ ǻvǻįŀǻbŀě [2]. Țħě ǻųțħǿř ǿf țħě Bǿ żǿķ ŘǺȚ ģǿě ș bỳ țħě mǿňįķě ř\n“Șŀǻỳěř616” ǻňđ ħǻș čřěǻțěđ ǻňǿțħě ř ŘǺȚ ķňǿ ẅň ǻș Șčħẅǻřżě Șǿňňě, ǿ ř “ȘȘ-ŘǺȚ” fǿ ř șħǿřț. Bǿțħ ǿf țħě șě ŘǺȚș\nǻřě fřěě ǻňđ ěǻșỳ țǿ fįňđ — vǻřįǿųș ǺPȚ ǻčțǿ řș ħǻvě ųșěđ bǿțħ įň p řěvįǿųș țǻřģěțěđ ǻțțǻčķș.\nŲňŀįķě ȘȘ-ŘǺȚ, Bǿ żǿķ įș șțįŀŀ ǻčțįvěŀỳ mǻįňțǻįňě đ, ẅįțħ țẅǿ ňěẅ ųpđǻțěș řěŀěǻșěđ įň Ǿčțǿbě ř țħǻț fįxě đ șǿmě bųģș\nǻňđ ǻđđěđ ŀǻňģųǻģě șųppǿřț fǿř Șpǻňįșħ, Ǻřǻbįč, Bųŀģǻřįǻň, Pǿŀį șħ, ǻňđ Fřěňčħ. Țħě șě ǻňđ ǿțħěř įmpřǿvěměňț ș\nħǻvě mǻ đě Bǿżǿķ įňțųįțįvě ǻň đ ěǻșỳ țǿ ųșě. Ǻș șħǿẅň įň Fįģ ųřě 2, įț fěǻțųřěș ǻň ěǻșỳ-țǿ-ňǻvįģǻțě ģ řǻpħįčǻŀ ųșěř\nįňțěřfǻčě țħǻț ěňǻbŀě ș ǿpěřǻțǿřș țǿ pǿįňț ǻň đ čŀįčķ țħěį ř ẅǻỳ țħřǿųģħ țħě ěňț řěňčħměňț, ŀǻțě řǻŀ mǿvěměňț, ǻň đ\něxfįŀțřǻțįǿň přǿčěșș.\nFįģųřě 2: Țħě Bǿ żǿķ įňțěřfǻčě\nǾňčě ǻň ěň đpǿįňț įș įňfěčțě đ ẅįțħ Bǿżǿķ, țħě ǻțțǻčķě ř čǻň đǿ țħě fǿŀŀǿ ẅįňģ:\nŲpŀǿǻđ ǻňđ đǿẅňŀǿǻđ fįŀěș țǿ ǻňđ fřǿm țħě țǻ řģěț’ș mǻčħįňě\nĿǻųňčħ ǻňđ ķįŀŀ přǿčěșșěș\nMǿđįfỳ țħě řěģįșțřỳ\nĢřǻb șțǿřěđ pǻșșẅǿřđș\nǺțțǻčķě řș čǻň ǻŀșǿ ųșě țħě Bǿ żǿķ ģřǻpħįčǻŀ ųșěř įňțěřfǻčě țǿ řųň ǻřbįțřǻřỳ șħěŀŀ čǿmmǻň đș ǿň țħě țǻ řģěț\nmǻčħįňě ș, ǻș șħǿẅň įň Fįģ ųřě 3.\nFįģųřě 3: Řųňňįňģ șħěŀŀ čǿmmǻň đș ẅįțħ Bǿżǿķ.\nǺ ĐĿĿ pŀ ųģįň — ẅħįčħ čǻň bě đǿẅňŀǿǻđěđ ǻňđ ŀǿǻđěđ țħřǿųģħ țħě Bǿ żǿķ ĢŲİ čǿňțřǿŀ pǻňěŀ ǿňțǿ țħě įňfěčțě đ\něňđpǿįňț — ěxțěň đș țħě ŘǺȚ’ ș fųňčțįǿňǻŀįțỳ ẅįțħ țħě fǿŀŀǿ ẅįňģ čǿmmǻň đș:\nStartVNC\nStopVNC\nStartWebcam\nStopWebcam\nSendCamList\nIsWebcam\nDeleteKeylog \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n09 Mǻř 2020\n24 Fěb 2020\n20 Fěb 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐFįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \nŘǻňșǿmẅǻřě Ǻģǻįň șț țħě Mǻčħįňě:\nĦǿẅ Ǻđvěřșǻřįěș ǻřě Ŀěǻřňįňģ țǿ\nĐįșřųpț İňđųșțřįǻŀ Přǿđųčțįǿň bỳ\nȚǻřģěțįňģ İȚ ǻňđ ǾȚ \nM-Țřěňđș 2020 : İňșįģħțș Fřǿm țħě\nFřǿňț Ŀįňě ș \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  Ǿčțǿbě ř 2013  Țħřěǻț Řěșěǻřčħ Bŀǿģ Pǿ șțș Ķňǿẅ Ỳǿųř Ěňěmỳ: Ț řǻčķįňģ Ǻ Řǻpį đŀỳ Ěvǿŀvįňģ ǺPȚ Ǻ...    \nČǾŇȚǺČȚ ŲȘ  ŘĚPǾŘȚ Ǻ Ň İŇČİĐĚŇȚ\nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n GetKeylog\nStopKeylog\nQueryScreen\nBǿżǿķ șțǿřěș įțș čǿňfįģųřǻțįǿň pǻ řǻměțěřș įň țħě řěșǿųřčě șěčțįǿň ǿf țħě ěxěč ųțǻbŀě fįŀě. Țħě pǻ řǻměțěřș ǻřě\nčǿňțǻįňě đ įň ǻ PĚ mǻňįfě șț čǻŀŀěđ \"ČFĢ\". Țħě čǿňfįģ ųřǻțįǿň fǿ ř țħě Bǿ żǿķ vǻřįǻňț fřǿm țħě č ųřřěňț ǻțțǻčķ\n(ẅmįșěřvěř.ěxě č5đ8b7č8ě2f50b171840ě071f8ǻ079b6) įș șħǿẅň įň Fįģ ųřě 4.\nFįģųřě 4: Bǿ żǿķ PĚ mǻňįfě șț\nȚħě fǿŀŀǿ ẅįňģ pǻřǻměțěřș ǻřě șțǿřěđ įň țħįș mǻňįfě șț:\nID = aubok\nMutex = 801JsYqFulHpg\nFilename = wmiserver.exe\nStartup Entry Name = wmiupdate\nPlugin filename = ext.dat\nConnection password = wwwst@Admin\nConnection port = 80\nConnection servers = www.microsoft.mrbasic.com, microsoft.mrbasic.com\n \n \nȚħěșě pǻřǻměțěřș ǻřě čǿňfįģ ųřěđ ǻț țħě b ųįŀđ țįmě ǿf țħě ŘǺȚ. Țħě m ųțěx įș řǻňđǿmŀỳ ģěňě řǻțěđ ǻț țħě b ųįŀđ\nțįmě ǿf țħě ŘǺȚ ǻň đ įș ųșěđ țǿ ěňșųřě țħǻț ǿňŀỳ ǿňě čǿpỳ ǿf țħě mǻŀ ẅǻřě įș řųňňįňģ ǿň ǻ țǻ řģěțěđ mǻčħįňě.\nŲpǿň įňįțįǻŀ įňfěčțįǿň, Bǿ żǿķ ěmįț ș țħě ǿųțģǿįňģ įňįțįǻŀ ňěț ẅǿřķ běǻčǿň ț řǻffįč șħǿẅň įň Fįģ ųřě 5.\nFįģųřě 5: Bǿżǿķ běǻčǿň ț řǻffįč\nȚħě běǻčǿň čǿňțǻįň ș țħě ŀěňģțħ ǿf țħě pǻčķěț įň ŀįțțŀě-ěň đįǻň fǿřmǻț běț ẅěěň țħě ǿff șěțș 04. Țħě fǿŀŀǿ ẅįňģ đǻțǻ\nfǿŀŀǿẅș țħįș įň ǻ ẅįđě-șțřįňģ fǿřmǻț ẅįțħ ǻ pįpě șěpǻřǻțǿř ǻș fǿŀŀǿẅș:\nĿěňģțħǿfĐǻțǻ | Ħǿșțňǻmě | Ų șěřňǻmě| İĐ | Ŀǿčǻŀě İňfǿ | ǾȘ Vě řșįǿň | ŘǺȚ Vě řșįǿň | 0 | 2 | ČǿňňěčțįǿňPǻ șșẅǿřđ |\nİđŀěȚįmě | ǺčțįvěẄįň đǿẅŇǻmě\nȚħě běǻčǿň ǻŀ șǿ čǿňțǻįň ș ǻ ħǻřđčǿđěđ čǿňňěčțįǿň pǻ șșẅǿřđ “ẅẅẅș ț@Ǻđmįň” įň țħě běǻčǿň, ẅħįčħ įș ųșěđ țǿ\nǻųțħěňțįčǻțě ẅħěň čǿňňěčțįňģ țǿ įț ș ĢŲİ čǿňțřǿŀ pǻňěŀ.\nǺțțřįbųțįǿň\nẄě ħǻvě ǻțț řįbųțěđ țħįș ǻțțǻčķ țǿ țħě ǻ đmįň@338  ǻčțǿř țħǻț ẅě đěșčřįběđ įň ǿųř řěpǿřț Pǿįșǿň İvỳ: Ǻșșěșșįňģ\nĐǻmǻģě ǻň đ Ěxțřǻčțįňģ İňțěŀŀįģěňčě  [3]. Țħě ǻđmįň@338  ǻčțǿř ħǻș ǻŀșǿ ųșěđ țħě șǻmě “ẅẅẅș ț@Ǻđmįň” șțřįňģ ǻș\nǻ pǻșșẅǿřđ įň přěvįǿųșŀỳ ǿbșěřvěđ Pǿįșǿň İvỳ șǻmpŀěș ųșěđ įň țǻřģěțěđ ǻțțǻčķș. Fǿř ěxǻmpŀě, țħě fįŀě\nȘňǿẅđěňBǿǿķ. đǿč (MĐ 5: đ40f50đ3 7đ51f6čđ92ě98č4đǻ4ě066ff) đřǿppěđ ǻ Pǿįșǿň İvỳ șǻmpŀě țħǻț ųșěđ\n“ẅẅẅș ț@Ǻđmįň” ǻș ǻ pǻșșẅǿřđ.\nǺđđįțįǿňǻŀŀỳ, țħě ČňČ İP ǿf 58.64.153.157, ųșěđ bỳ țħě Bǿ żǿķ vǻřįǻňț (MĐ 5:\nč5đ8b7č8ě2f50b171840ě071f8ǻ079b6) đřǿppěđ bỳ țħě İňvěșțǿř Řěŀǻțįǿň ș Čǿňțǻčț ș.đǿč ŀųřě ħǻș ǻŀșǿ ħǿșțěđ ǻ\nňųmběř ǿf ǿțħě ř ČňČ đǿmǻįňș ŀįňķěđ țǿ țħě ǻ đmįň@338  ǻčțǿř. Ǿň Ǿčț. 27, 2013  ẅě ǿbșěřvěđ țħě fǿŀŀǿ ẅįňģ\nķňǿẅň ǻđmįň@338  đǿmǻįňș řěșǿŀvįňģ țǿ 58.64.153.157:\nčǿňșįŀįųm.đňșěț.čǿm\nčǿňșįŀįųm.đỳňșșŀ.čǿm\nčǿňșįŀįųm.přǿxỳđňș.čǿm\nđňșčǻčħě.ŀǿǿķįň.ǻț\něčňěț.řř.ňų\něųřǿpěǻň.ǻțħě řșįțě.čǿm\nħq.đșmțp.čǿm\nħq.đỳňșșŀ.čǿm\nįpșěčųpđǻțě.bỳįňțě ř.ňěț\nįțǻģǿv.bỳįňțě ř.ňěț\nmįčřǿșǿfț.ǻčměțǿỳ.čǿm\nmįčřǿșǿfț.đħčp.bįż\nmįčřǿșǿfț.đỳňșșŀ.čǿm\nmįčřǿșǿfț.fțpșěřvěř.bįż\nmįčřǿșǿfț.įňșțǻňțħq.čǿm\nmįčřǿșǿfț.įșǻșěčřěț.čǿm\nmįčřǿșǿfț.ŀǿǿķįň.ǻț\nmįčřǿșǿfț.přǿxỳđňș.čǿm\nmįčřǿșǿfț.ẅįķǻbǻ.čǿm\nmįčřǿșǿfțǻ.bỳįňțě ř.ňěț\nmįčřǿșǿfțb.bỳįňțě ř.ňěț\npħpđňș.mỳřěđįřěčț.ųș\nșșŀųpđǻțě.bỳįňțě ř.ňěț\nșvčħǿșț.ŀǿǿķįň.ǻț\nșvčħǿșț.pǻșșǻș.ųș\nțěǻmẅǻřě.řř.ňų\nẅěbșěřvěř.đỳňșșŀ.čǿm\nẅěbșěřvěř.fǻřțįț.čǿm\nẅěbșěřvěř.fřěěțčp.čǿm\nẅẅẅ .čǿňșįŀįųm.đňșěț.čǿm\nẅẅẅ .čǿňșįŀįųm.đỳňșșŀ.čǿm\nẅẅẅ .čǿňșįŀįųm.přǿxỳđňș.čǿm\nẅẅẅ .ħq.đșmțp.čǿm\nẅẅẅ .ħq.đỳňșșŀ.čǿm\nẅẅẅ .mįčřǿșǿfț.ǻčměțǿỳ.čǿm\n  PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚẅẅẅ .mįčřǿșǿfț.đħčp.bįż\nẅẅẅ .mįčřǿșǿfț.đșmțp.čǿm\nẅẅẅ .mįčřǿșǿfț.đỳňșșŀ.čǿm\nẅẅẅ .mįčřǿșǿfț.įňșțǻňțħq.čǿm\nẅẅẅ .mįčřǿșǿfț.įșǻșěčřěț.čǿm\nẅẅẅ .mįčřǿșǿfț.přǿxỳđňș.čǿm\nẅẅẅ .mįčřǿșǿfț.ẅįķǻbǻ.čǿm\nẅẅẅ .șvčħǿșț.đđňș.įňfǿ\nẅẅẅ .șvčħǿșț.đỳňđňș.přǿ\nẅẅẅ .șvčħǿșț.đỳňșșŀ.čǿm\nẅẅẅ .věřįżǿň.đỳňșșŀ.čǿm\nẅẅẅ .věřįżǿň.įțěm đb.čǿm\nẅẅẅ .věřįżǿň.přǿxỳđňș.čǿm\nẅẅẅ .ẅěbșěřvěř.đỳňșșŀ.čǿm\nẅẅẅ .ẅěbșěřvěř.fǻřțįț.čǿm\nẅẅẅ .ẅěbșěřvěř.fřěěțčp.čǿm\nẄě přěvįǿųșŀỳ đěțěčțěđ țħě șǻmě ǻđmįň@338  ǻčțǿř ųșįňģ țħě Bǿ żǿķ ŘǺȚ ǿň Jǻň. 6, 2013 . İň țħįș ǻțțǻčķ, țħě\nǻđmįň@338  ǻčțǿř ěmǻįŀěđ țħě mǻŀįčįǿ ųș șpřěǻđșħěěț ĚčǿMįșșįǿňĿįșț.xŀș (MĐ5:\nf10ě89č194742ǻ9ǻđ98ěfbf165008 4f3) țǿ țħě șǻmě įňțě řňǻțįǿňǻŀ ǿ řģǻňįżǻțįǿň įňvǿŀvě đ įň țřǻđě, ěčǿňǿmįč, ǻň đ\nfįňǻňčįǻŀ pǿŀįčỳ țǻ řģěțěđ bỳ țħě mǿ řě řěčěňț İňvěșțǿř Řěŀǻțįǿň ș Čǿňțǻčț ș.đǿč ŀųřě (MĐ5:\n87576708689 7ě90fb47ǻ021b45ě161b2). Țħě mǻŀįčįǿ ųș ĚčǿMįșșįǿňĿįșț.xŀș șpřěǻđșħěěț đřǿppěđ ǻ Bǿżǿķ vǻřįǻňț\nẅįțħ ǻň MĐ 5 ǿf ǻ45đ356 4đ1fǻ27161b33712f035ǻ5962 . Țħįș Bǿżǿķ įmpŀǻňț čǿňňěčțě đ țǿ ČňČ șěřvěřș ǻț\nẅẅẅ .mįčřǿșǿfțųpđǻțě.đỳňșșŀ.čǿm ẅįțħ țħě pǻ șșẅǿřđ ǿf “ģẅxpǻșș”. Ǻ přěvįǿųș ǻđmįň@338  Pǿįșǿň İvỳ șǻmpŀě\n(MĐ5: đ22ě974b348bě44đđě556626 7250ff0ě) ẅǻș čǿňfįģųřěđ ẅįțħ țħě șįmįŀǻř pǻșșẅǿřđ “ģẅx@338 ”.\nİňvěșțǿř Řěŀǻțįǿň ș Čǿňțǻčț ș-ǺșįǻPǻčįfįč Ŀ ųřě\nĐųřįňģ ǿųř įňvěșțįģǻțįǿň ǿf țħě mǿ șț řěčěňț Bǿ żǿķ șǻmpŀě ẅįțħįň İňvěșțǿř Řěŀǻțįǿň ș Čǿňțǻčț ș.đǿč, ẅě đįșčǿvěřěđ\nǻ řěŀǻțěđ ǻțțǻčķ țħǻț ǿčč ųřřěđ ǿň Ǿčț. 24, 2013  — ǿňě đǻỳ běfǿ řě țħě ẅǻvě ǿf Bǿ żǿķ-fųěŀěđ șpěǻř pħįșħěș. Țħįș\nǻțțǻčķ ǻŀ șǿ ųțįŀįżěđ șpěǻř pħįșħįňģ ǻș ǻ đěŀįvěřỳ měčħǻňį șm bỳ șěňđįňģ țħě fǿŀŀǿ ẅįňģ mǻŀįčįǿ ųș đǿčųměňț țǿ țħě\nșǻmě Ų.Ș.-bǻ șěđ țħįňķ țǻňķ țǻ řģěțěđ bỳ ǻđmįň@338  ẅįțħ țħě Bǿ żǿķ ŘǺȚ ǿň Ǿčț. 25:\nFįŀě: İňvěșțǿř Řěŀǻțįǿň ș Čǿňțǻčț ș-ǺșįǻPǻčįfįč. đǿč\nMĐ5: č6đě1čǻ261662 ǻčǻ6b8ǻ782075ǻ8671f\nȚħě mǻŀįčįǿ ųș đǿčųměňț đřǿppěđ ǻň įmpŀǻňț ẅįțħ țħě MĐ 5 f7fb380f2b0č22č12f605čě9b4b162f2 țǿ\nČ:\\Đǿčųměňțș ǻňđ Șěțțįňģ ș\\ǻđmįň\\Ǻppŀįčǻțįǿň Đǻțǻ\\ șvčħǿșț.ěxě. Ẅě đěțěčț țħį ș įmpŀǻňț ǻ ș\nBǻčķđǿǿř.ǺPȚ.FǻķěẄįň ĦȚȚPĦěŀpěř. Țħįș șǻmpŀě čǿňňěčțě đ țǿ ČňČ șěřvěřș ǻț ẅẅẅ .đpmč.đỳňșșŀ.čǿm ǻň đ\nẅẅẅ .đǻțǻųpđǻțě.đỳňșșŀ.čǿm.\nȚħě đǿmǻįň ẅẅẅ .đpmč.đỳňșșŀ.čǿm řěșǿŀvěđ țǿ Ǿčț. 24, 2013 , ǻňđ ẅẅẅ .đǻțǻųpđǻțě.đỳňșșŀ.čǿm řěșǿŀvěđ țǿ\n58.64.153.157 ǿň Ǿčț. 21, 2013 .\nȚħǿųģħ țħě Ǿčț. 24 ǻțțǻčķ đįđ ňǿț ųșě țħě Bǿ żǿķ ŘǺȚ, įț į ș ŀįķěŀỳ țħǻț țħě ǻ đmįň@338  ǻčțǿř ẅǻș ǻŀșǿ řěșpǿňșįbŀě\nfǿř țħįș ǻțțěmpțě đ įňțřųșįǿň fǿř țħě fǿŀŀǿ ẅįňģ řěǻșǿňș:\nẄě ħǻvě p řěvįǿųșŀỳ ǿbșěřvěđ țħě ǻđmįň@338  ǻčțǿř ųșě Bǻčķđǿǿř.ǺPȚ.FǻķěẄįň ĦȚȚPĦěŀpěř įň țǻřģěțěđ\nǻțțǻčķș.\nȚħě șǻmě 58.64.153.157 İP ǻđđřěșș ẅǻș ųșěđ įň bǿțħ ǻțțǻčķ ș.\nȚħě șǻmě ŲȘ-bǻ șěđ țħįňķ-țǻňķ ẅǻș țǻřģěțěđ įň bǿțħ ǻțțǻčķ ș.\nČǿňčŀųșįǿňș\nȚħěșě čǿňșěčųțįvě įňčį đěňțș, Bǻčķđǿǿř.ǺPȚ.FǻķěẄįň ĦȚȚPĦěŀpěř ǿň Ǿčț. 24 ǻňđ Bǿżǿķ ŘǺȚ ǿň Ǿčț. 25,\nđěmǿňșțřǻțě țħǻț țħě ǻ đmįň@338  ǻčțǿř ħǻș țħě ǻbįŀįțỳ țǿ řǻpįđŀỳ ǻŀțěř ȚȚPș. Fųřțħěř, țħě ǻđmįň@338  ǻčțǿř čǻň\nįňțěģřǻțě pųbŀįčŀỳ ǻvǻįŀǻbŀě ŘǺȚ ș șųčħ ǻș Pǿįșǿň İvỳ ǻňđ Bǿżǿķ ǻș ẅěŀŀ ǻș čųșțǿm ŘǺȚ ș șųčħ ǻș\nBǻčķđǿǿř.ǺPȚ.FǻķěẄįň ĦȚȚPĦěŀpěř įňțǿ țħěį ř ǻřșěňǻŀ. Ǿřģǻňįżǻțįǿňș mųșț bě přěpǻřěđ țǿ đěfěňđ țħěmșěŀvěș\nfřǿm țħįș ẅįđě ǻřřǻỳ ǿf ǻțțǻčķ ș.\nFǿǿțňǿțě ș:\n[1] Fǿř mǿřě ǿň ǻđmįň@338 , șěě ǿųř přěvįǿųș bŀǿģ ěňț řỳ ǿň Pǿįșįǿň İvỳ\n[2] ħțțp://șș-řǻț.bŀǿģșpǿț.čǿm/\n[3] Țħįș řěpǿřț įș ǻvǻįŀǻbŀě ǻț ħěřě. \n \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\n Čǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě\nĚňģŀįșħ\n "
}