{
    "title": "lazarus hacking group expand their attack horizon by targeting an israeli defense company _ cyware hacker news",
    "text": "\n\n\n\n\n\nThreat Actors \n  March 27, 2019  \n Cyware News\nLazarus hacking group expand their attack horizon by targeting an\nIsraeli defense company\nThe campaign is carried out with an intention to steal military and commercial secrets.\nThe Israeli defense company discovered the campaign on March 7, 2019.\nThe infamous Lazarus threat actor group has been found targeting an Israeli defense company, according to new research outlined by a\ncybersecurity firm ClearSky. The campaign is carried out with an intention to steal military and commercial secrets.\nWhat’s the matter - According to Clearsky, the unnamed company manufactures products used in the military and aerospace industries. It is\nbelieved that the hackers could have been after commercial secrets or traditional espionage.\n“We cannot be sure what the objective of the attackers [was]. [It] could be industrial/commercial espionage but could be military espionage,\nfor example,” said Eyal Sela, head of threat intelligence at Clearsky, Cyberscoop reported .\nWhen was it discovered - The Israeli defense company discovered the campaign on March 7, 2019 after an employee received an email in\nbroken Hebrew from a colleague whose account was likely breached.\nResearchers believe that the hackers had implanted the malicious Rising Sun backdoor malware to launch the attack. For this, the Lazarus\ngroup leverages a vulnerability - CVE-2018-20250 - in outdated WinRAR file-archiving software. The analysis of the source code shows that the\nmalware is capable of bypassing email-filtering protections.\nRising Sun Cyberespionage Actor Lazarus Apt Group commercial secrets Cyberespionage Campaigns\nREAD PREVIOUS\nUrsnif trojan’s latest campaign affects several organiz ...\nMalware and VulnerabilitiesREAD NEXT\nOver 110,000 Australians affected by cyberattack on Fac ...\nBreaches and Incidents\nNews and Updates, Hacker News -\ndiscussWrite to us at \ncontact@cyware.comFollow us on \n  \nVisit Us \nCyware Labs, 1460 Broadway, New York, NY 10036\n \nAlerts Events DCR Explore Cyware Products   \n\n "
}