{
    "title": "lightsout ek targets energy sector _ zscaler",
    "text": " Support  Blogs   \n Request Demo Sign In Contact Us\nBlogs  > Security Research\nLightsOut EK Targets\nEnergy Sector\nPublished on:\nMarch 12, 2014\nAuthored by:\nChris Mannon\nCategory:\nExploit Kit\n \n \n \n \nSuggested Blogs\nMar\n19\n2020\nNew Android App Offers Coronavirus\nSafety Mask But Delivers SMS Trojan\nBy: Shivang Desai\nRead This Post\nMar\n18\n2020\nWhy Proxies and Firewalls Are Essential in\nthe Modern Threat Landscape\nBy: Scott Bullock\nRead This Post\nTake the first steps on your transformation journey\nContact Us  Request Demo\nProducts\nSolutions\nResources\nCompany\nCareers\nBlogs\nZenith Community\nPrivacy\nPrivacy Policy\nGDPR and Privacy Shield Policy\nCalifornia Privacy Policy\nCookies Policy\nLegal / Security\nAcceptable Use Policy\nPatents\nVulnerability Disclosure Program\nLanguage\nEnglish\nFrançais\nDeutsch\n日本語\nKeep in touch with us!\nSubmit\nBy clicking the submit button, \nyou are agreeing to our privacy policy .Email\n    ©2008-2020 Zscaler, Inc. All rights reserved.LightsOut EK Targets Energy Sector\nLate last year, the story broke that threat actors were targeting the energy sector with Remote Access\nTools and Intelligence gathering malware.  It would seem that the attackers responsible for this threat\nare back for more.  This particular APT struck late February between 2/24-2/26.  The attack began as\na compromise of a third party law firm which includes an energy law practice known as Thirty Nine\nEssex Street LLP (www[.]39essex[.]com).  The victim site is no longer compromised, but viewers\nshould show restraint and better browsing practices  when visiting.\n \n39essex.com shown as a referral URL to suspicious site.\nThe compromise leads the victim to another site which provides the attacker with a specific user-agent\nin the URL field.  The purpose of this is to pass along diagnostics to the attacker so that the proper\nmalicious package is sent to the victim.  This should be taken as a point of identification in\nadministrator logs as this may indicate an attack on your network.\n \nAt the time of research, the Java Class file was returning 404.\n \nThere are several other locations which show similar activity that are also related to this threat. \nMalicious redirects come from IP address 174[.]129[.]210[.]212 should also be taken as suspicious as\nwell as some sites hosted on this domain (aptguide[.]3dtour[.]com).\nThe URLquery  and VirusTotal  entries for this IP corroborates the notion that this location played a part\nin using LightsOut Exploit Kit.  \nLightsOut performs several diagnostic checks on the victim's machine to make sure that it can be\nexploited.  This includes checking the browser and plugin versions.\n \nThe deobfuscated Javascript sheds some light on the iframe injection.\n \nMore JS Deobfuscation\n \nChecking to see what version of Adobe is installed.\n \nChecking to see if you are IE7.\n \nChecking to see if Java is enabled in the browser.\nUltimately, a payload is delivered from the LightsOut Exploit kit , which attempts to drop a malicious\nJAR file exploiting CVE-2013-2465 . At the time of research, the binary file was no longer available,\nwhich suggests that the attack window has now closed for this particular watering hole.  However,\nother security sources  tell us that the site used in the attack is also a known HAVEX RAT CnC.\nThe recent activity of this threat originating from a site in the energy sector should serve as a warning\nto those in the targeted industry.  Prior research from other sources tells us that the threat actors\ninvolved are highly motivated and agile.  Their motive is to gather intelligence for further attacks, so be\non your guard and monitor transaction logs for suspicious activity!\nProducts  Solutions  Resources  Company   \n "
}