{
    "title": "luckymouse hits national data center to organize country-level waterholing campaign _ securelist",
    "text": "Share post on:What happened?\nIn March 2018 we detected an ongoing campaign targeting a national data center in the Central Asia that we believe has\nbeen active since autumn 2017. The choice of target made this campaign especially significant – it meant the attackers\ngained access to a wide range of government resources at one fell swoop. We believe this access was abused, for example,\nby inserting malicious scripts in the country’s official websites in order to conduct watering hole attacks.\nThe operators used the HyperBro Trojan as their last-stage in-memory remote administration tool (RAT). The timestamps\nfor these modules are from December 2017 until January 2018. The anti-detection launcher and decompressor make\nextensive use of Metasploit’s shikata_ga_nai encoder as well as LZNT1 compression.\nKaspersky Lab products detect the different artifacts used in this campaign with the following verdicts:\nTrojan.Win32.Generic, Trojan-Downloader.Win32.Upatre and Backdoor.Win32.HyperBro. A full technical report, IoCs and\nYARA rules are available from our intelligence reporting service (contact us intelligence@kaspersky.com).\nWho’s behind it?\nDue to tools and tactics in use we attribute the campaign to LuckyMouse Chinese-speaking actor (also known as\nEmissaryPanda and APT27). Also the C2 domain update.iaacstudio[.]com was previously used in their campaigns. The tools\nfound in this campaign, such as the HyperBro Trojan, are regularly used by a variety of Chinese-speaking actors. Regarding\nMetasploit’s shikata_ga_nai encoder – although it’s available for everyone and couldn’t be the basis for attribution, we know\nthis encoder has been used by LuckyMouse previously.\nGovernment entities, including the Central Asian ones also were a target for this actor before. Due to LuckyMouse’s\nongoing waterholing of government websites and the corresponding dates, we suspect that one of the aims of this\ncampaign is to access web pages via the data center and inject JavaScripts into them.\nHow did the malware spread?\nThe initial infection vector used in the attack against the data center is unclear. Even when we observed LuckyMouse using\nweaponized documents with CVE-2017-11882 (Microsoft Office Equation Editor, widely used by Chinese-speaking actors\nsince December 2017), we can´t prove they were related to this particular attack. It’s possible the actor used a waterhole to\ninfect data center employees.\nThe main C2 used in this campaign is bbs.sonypsps[.]com, which resolved to IP-address, that belongs to the Ukrainian ISP\nnetwork, held by a Mikrotik router using firmware version 6.34.4 (from March 2016) with SMBv1 on board. We suspect this\nrouter was hacked as part of the campaign in order to process the malware’s HTTP requests. The Sonypsps[.]com domain\nwas last updated using GoDaddy on 2017-05-05 until 2019-03-13.\nFMikrotik router with two-year-old firmware and SMBv1 on board used in this campaign\nIn March 2017, Wikileaks published details about an exploit affecting Mikrotik called ChimayRed. According to the\ndocumentation, however, it doesn’t work for firmware versions higher than 6.30. This router uses version 6.34.\nThere were traces of HyperBro in the infected data center from mid-November 2017. Shortly after that different users in\nthe country started being redirected to the malicious domain update.iaacstudio[.]com as a result of the waterholing of\ngovernment websites. These events suggest that the data center infected with HyperBro and the waterholing campaign are\nconnected.\nWhat did the malware do in the data center?\nAnti-detection stages. Different colors show the three dropped modules: legit app (blue), launcher (green),\nand decompressor with the Trojan embedded (red)\nThe initial module drops three files that are typical for Chinese-speaking actors: a legit Symantec pcAnywhere (IntgStat.exe)\nfor DLL side loading, a .dll launcher (pcalocalresloader.dll) and the last-stage decompressor (thumb.db). As a result of all\nthese steps, the last-stage Trojan is injected into svchost.exe’s process memory.\nThe launcher module, obfuscated with the notorious Metasploit’s shikata_ga_nai encoder, is the same for all the droppers.\nThe resulting deobfuscated code performs typical side loading: it patches pcAnywhere’s image in memory at its entry point.\nThe patched code jumps back to the decryptor’s second shikata_ga_nai iteration, but this time as part of the whitelisted\napplication.\nThis Metasploit’s encoder obfuscates the last part of the launcher’s code, which in turn resolves the necessary API and maps\nthumb.db into the same process’s (pcAnywhere) memory. The first instructions in the mapped thumb.db are for a new\nshikata_ga_nai iteration. The decrypted code resolves the necessary API functions, decompresses the embedded PE file\nwith RtlCompressBuffer() using LZNT1 and maps it into memory.\nWhat does the resulting watering hole look like?\nThe websites were compromised to redirect visitors to instances of both ScanBox and BEeF. These redirects were\nimplemented by adding two malicious scripts obfuscated by a tool similar to the Dean Edwards packer.\nResulting script on the compromised government websites\nUsers were redirected to https://google-updata[.]tk:443/hook.js, a BEeF instance, and https://windows-\nupdata[.]tk:443/scanv1.8/i/?1, an empty ScanBox instance that answered a small piece of JavaScript code.\nConclusions\nLuckyMouse appears to have been very active recently. The TTPs for this campaign are quite common for Chinese-speaking\nactors, where they typically provide new solid wrappers (launcher and decompressor protected with shikata_ga_nai in this\ncase) around their RATs (HyperBro).\nThe most unusual and interesting point here is the target. A national data center is a valuable source of data that can also be\nabused to compromise official websites. Another interesting point is the Mikrotik router, which we believe was hacked\nspecifically for the campaign. The reasons for this are not very clear: typically, Chinese-speaking actors don’t bother\ndisguising their campaigns. Maybe these are the first steps in a new stealthier approach.\nSome indicators of compromise\nDroppers\n22CBE2B0F1EF3F2B18B4C5AED6D7BB79\n0D0320878946A73749111E6C94BF1525\nLauncher\nac337bd5f6f18b8fe009e45d65a2b09b\nHyperBro in-memory Trojan\n04dece2662f648f619d9c0377a7ba7c0\nDomains and IPs\nbbs.sonypsps[.]com\nupdate.iaacstudio[.]com\nwh0am1.itbaydns[.]com\ngoogle-updata[.]tk\nwindows-updata[.]tk\nJAVASCRIPT  TARGETED ATTACKS  TROJAN  VULNERABILITIES AND EXPLOITS  WATERING HOLE ATTACKS\nRelated Posts\nLEAVE A REPLY\nYour email address will not be published.  Required fields are marked *\nEnter your comment here\nName *\nEmail *\nSave my name, email, and website in this browser for the next time I comment.\n \nSUBMIT\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\n \nIN THE SAME CATEGORY\nAPT trends report Q3 2019\nCOMpfun successor Reductor infects\nﬁles on the ﬂy to compromise TLS traﬃc\nRecent Cloud Atlas activity\nAPT trends report Q2 2019\nTurla renews its arsenal with Topinambour\nAPT REPORTS\nLuckyMouse hits national data center\nto organize country-level waterholing\ncampaign\nBy Denis Legezo  on June 13, 2018. 10:00 am\n \nNotify me when new comments are added.\n© 2020 AO Kaspersky Lab.  All Rights Reserved. \nRegistered trademarks and service marks are the property of their respective owners.\nContact us  | Privacy Policy  | License AgreementEmail\n I agree to provide my email address to “AO Kaspersky\nLab” to receive information about new posts on the\nsite. I understand that I can withdraw this consent at\nany time via e-mail by clicking the “unsubscribe” link\nthat I find at the bottom of any e-mail sent to me for\nthe purposes mentioned above.SUBSCRIBE\nCookiethief: a cookie-\nstealing Trojan for Android\nMokes and Buerak\ndistributed under the guise\nof security certificates\nSmartphone shopaholic\nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\n English\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPRCompanyAccount GET IN TOUCHSolutions for: Home Products  Small Business 1-50 employees Medium Business 51-999 employees Enterprise 1000+ employees\n "
}