{
    "title": "McAfee_NightDragon_wp_draft_to_customersv1-1",
    "text": "Global Energy Cyberattacks:\n“Night Dragon”\nBy McAfee® Foundstone® Professional Services and McAfee Labs™\nFebruary 10, 2011White Paper DRAFTWhite Paper  Global Energy Cyberattacks: “Night Dragon”\nTable of Contents\nExecutive Summary 3\nAnatomy of a Hack  3\nDetails of the Attack 4\nUse of remote administration tools 7\nDetection  7\nHost Files and Registry Keys  8\nAnti-virus Alerts  9\nNetwork Communications  9\nAdditional Detection Techniques  11\nMcAfee Early Detection  11\nMcAfee Detection  12\nMcAfee Prevention  12\nConclusion  13\nCredits and Acknowledgements  13\nAppendix A: zwShell — the RAT  13\nAppendix B: Attribution  18\nVersion 1.1  |  Feb 10, 2011 09:28 AMDRAFT3\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nExecutive Summary\nIn 2010, we entered a new decade in the world of cybersecurity. The prior decade was stained with \nimmaturity, reactive technical solutions, and a lack of security sophistication that promoted critical \noutbreaks, such as Code Red, Nimda, Blaster, Sasser, SQL Slammer, Conficker, and myDoom—to name a \nfew. The security community has evolved and grown smarter about security, safe computing, and system \nhardening but so have our adversaries. This decade is setting up to be the exponential jumping off point. \nThe adversaries are rapidly leveraging productized malware toolkits that let them develop more malware \nthan in all prior years combined, and they have matured from the prior decade to release the most \ninsidious and persistent cyberthreats ever known. \nThe Google hacks (“ Operation Aurora ”), named by McAfee and announced in January 2010, and the \nWikiLeaks  document disclosures of 2010 have highlighted the fact that external and internal threats \nare nearly impossible to prevent. Miscreants continue to infiltrate networks and exfiltrate sensitive and \nproprietary data upon which the world’s economies depend every day. When a new attack emerges, \nsecurity vendors cannot stand by idly and watch. We are obligated to share our findings to protect those \nnot yet impacted and to repair those who have been. As such, McAfee Foundstone Professional Services  \nand McAfee Labs  decided to release the following discovery.\nStarting in November 2009, coordinated covert and targeted cyberattacks have been conducted against \nglobal oil, energy, and petrochemical companies. These attacks have involved social engineering, spear-\nphishing attacks, exploitation of Microsoft Windows operating systems vulnerabilities, Microsoft Active \nDirectory compromises, and the use of remote administration tools (RATs) in targeting and harvesting \nsensitive competitive proprietary operations and project-financing information with regard to oil and gas \nfield bids and operations. We have identified the tools, techniques, and network activities used in these \ncontinuing attacks — which we have dubbed Night Dragon — as originating primarily in China. Through \ncoordinated analysis of the related events and tools used, McAfee has determined identifying features \nto assist companies with detection and investigation. While we believe many actors have participated \nin these attacks, we have been able to identify one individual who has provided the crucial C&C \ninfrastructure to the attackers. (See Appendix B for more detail on attribution.)  \nAnatomy of a Hack \nNIGHT\nDRAGON\nExtranet web\nservers \ncompromised Gained access \nto sensitive \ninternal \ndesktops and \nservers Accessed \nadditional \nusernames and \npasswords Enabled direct \ncommunication \nfrom infected \nmachines to the \nInternetEx/f_iltrated email \narchives and \nother sensitive \ndocuments1 2 3 4 5\nRemote\ncommand\nexecutionHacker tools \nuploaded to \nserversFurther access \nto sensitive\ndocuments Disabled IE \nproxy settingsExecutives’\ncomputers\ncompromised \nFigure 1. Anatomy of a hack.4\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nThe Night Dragon attacks work by methodical and progressive intrusions into the targeted infrastructure. \nThe following basic activities were performed by the Night Dragon operation:\n• Company extranet web servers compromised through SQL-injection techniques, allowing remote \ncommand execution\n• Commonly available hacker tools are uploaded on compromised web servers, allowing attackers to \npivot into the company’s intranet and giving them access to sensitive desktops and servers internally\n• Using password cracking and pass-the-hash tools, attackers gain additional usernames and passwords, \nallowing them to obtain further authenticated access to sensitive internal desktops and servers\n• Initially using the company’s compromised web servers as command and control (C&C) servers, the \nattackers discovered that they needed only to disable Microsoft Internet Explorer (IE) proxy settings  \nto allow direct communication from infected machines to the Internet \n• Using the RAT malware, they proceeded to connect to other machines (targeting executives)  \nand exfiltrating email archives and other sensitive documents\nDetails of the Attack\nAttackers using several locations in China have leveraged C&C servers on purchased hosted services in \nthe United States and compromised servers in the Netherlands to wage attacks against global oil, gas, \nand petrochemical companies, as well as individuals and executives in Kazakhstan, Taiwan, Greece, and \nthe United States to acquire proprietary and highly confidential information. The primary operational \ntechnique used by the attackers comprised a variety of hacker tools, including privately developed and \ncustomized RAT tools that provided complete remote administration capabilities to the attacker. RATs \nprovide functions similar to Citrix or Microsoft Windows Terminal Services, allowing a remote individual  \nto completely control the affected system. \nTo deploy these tools, attackers first compromised perimeter security controls, through SQL-injection \nexploits of extranet web servers, as well as targeted spear-phishing attacks of mobile worker laptops, \nand compromising corporate VPN accounts to penetrate the targeted company’s defensive architectures \n(DMZs and firewalls) and conduct reconnaissance of targeted companies’ networked computers.\n(1) Attacker crafts a HTTP GET \nrequest to inject commands to SQL server to gain system-level access(2) Malware is placed on server and used to harvest the local and Active Directory account credentials\n(4) Attacker uses RA T malware to \nconduct additional reconnaissance \nand systems compromises and to \nharvest con/f_idential data(3) Active Directory accounts are used to access network computers and plant RA T malware that connects \nwith remote C&C addresses.InternetWeb\nC&CSQL\nAD\nFigure 2. SQL-injection attacks.SQL Injection Attacks5\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nMany Chinese hacker websites offer these tools for download, including links to reduh, WebShell, \nASPXSpy, and many others, plus exploits and zero-day malware.\n(1) Attacker sends a spear -phishing \nemail containing a link to a \ncompromised web server\n(4) Attacker uses RA T malware to \nconduct additional reconnaissance \nand systems compromises and to harvest con/f_idential data(3) User account information and host con/f_iguration information is sent to a C&C server(2) User opens infected email and the compromised website is accessed; a RA T is downloaded\nInternetWeb\nC&CEmail\nFigure 3. Spear-phishing attacks.\nFigure 4. Rootkin.net.cn offers access to an endless list of hacker tools and exploits.Spear-Phishing Attacks6\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nFigure 5. WebShell and ASPXSpy tools allow an attacker to bypass many firewall \nrules to funnel all control through a company’s web server.7\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nOnce the initial system was compromised, the attackers compromised local administrator accounts and \nActive Directory administrator (and administrative users) accounts. The attackers often used common \nWindows utilities, such as SysInternals tools (acquired by Microsoft in 2006)  — and other publicly available \nsoftware, including hacking tools developed in China and widely available on Chinese underground \nhacker websites  — to establish “backdoors” through reverse proxies and planted Trojans that allowed the \nattackers to bypass network and host security policies and settings. Desktop anti-virus and anti-spyware \ntools were also disabled in some instances  — a common technique of targeted attacks.  \nUse of remote administration tools\nRemote administration tools (RATs) are commonly used administrative tools that allow hackers (and \nadministrators) to manage victims’ computers (or managed systems) and completely control their use \nand function. A commonly used RAT in the hacker community is Gh0st and its many variants. RAT \nfeatures often include screen and webcam spying, keystroke logging, mouse control, file/registry,  \nand process management, and, of course, remote command shell capability.\nMcAfee has identified several RATs that have been used to establish a persistent infiltration channel into \ncompromised companies. One of the most prevalent RATs is zwShell, which McAfee has seen in the wild \nsince the spring of 2010 (compiled on 2010-03-17 08:47:00). Written in the Delphi language, zwShell \nwas used by attackers to both build custom variants of the Trojan that they deployed on dozens of \nmachines within each victim company, as well as to control compromised machines that would initiate \nbeacon connections to it on a custom protocol. \nAttackers used zwShell extensively to generate dozens of unique Trojan variants and to control the \ninfected machines and exfiltrate sensitive data directly from them. (See Appendix A for a breakdown  \nof the zwShell.)\nOnce the attackers had complete control of the targeted internal system, they dumped account hashes \nwith gsecdump and used the Cain & Abel tool to crack the hashes to leverage them in targeting ever \nmore sensitive infrastructures.\nFiles of interest focused on operational oil and gas field production systems and financial documents \nrelated to field exploration and bidding that were later copied from the compromised hosts or via \nextranet servers. In some cases, the files were copied to and downloaded from company web servers  \nby the attackers. In certain cases, the attackers collected data from SCADA systems.\nDetection\nThe methods and tools used in these attacks are relatively unsophisticated, as they simply appear to \nbe standard host administration techniques, using standard administrative credentials. This is largely \nwhy they are able to evade detection by standard security software and network policies. Since the \ninitial compromises, however, many individual unique signatures have been identified for the Trojan \nand associated tools by security vendors, including McAfee; yet only through recent analysis and \nthe discovery of common artifacts and evidence correlation have we been able to determine that a \ndedicated effort has been ongoing for at least two years, and likely as many as four. We can now \nassociate the various signatures to these events.\nThe following artifacts can help to determine whether a company has been compromised:\n• Host files and/or registry keys \n• Anti-virus alerts \n• Network communications8\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nHost Files and Registry Keys  \nUtility Description\nCommand & \ncontrol applicationzwShell.exe  093640a69c8eafbc60343bf9cd1d3ad3\nzwShell.exe  85df6b3e2c1a4c6ce20fc8080e0b53e9\nTrojan dropper A packaged executable customized to each victim that includes the DLL file and configuration settings \nfor installing the backdoor on the remote system.\nThe dropper can be run from any directory and is usually executed with PSEXEC or an RDP session. \nThus, related Windows Security Event logs provide useful information concerning compromised Active \nDirectory accounts. These logs can be reviewed with Windows Event Log Manager or programs, such  \nas “Event Log Explorer” or EnCase, which support search capabilities.\nWhen executed, the dropper creates a temporary file that is reflected in Windows update logs  \n(KB*.log files in c:\\Windows folder). \nThis is because the Windows Registry is modified by the dropper to create a “netsvcs” key. Accordingly, \nthe date of the backdoor installation can be determined from a search of the KB log files. This temporary \nfile is also identified in the backdoor DLL itself. The temporary file is usually some alphanumeric \ncombination that includes “gzg” (for example, xgt0gzg); however, it has been seen with generic file \nnames (for example, server.exe) as well.\nThe dropper is deleted when the backdoor is installed, and the temporary file is removed when the \ncomputer is restarted. If a backdoor has already been configured on the system, the dropper installation \nwill fail unless it uses a different configuration.\nTrojan backdoor Dynamic link libraries (DLLs), also appearing under many other names. \nThese files have a correlated Windows Registry key that is determined by the dropper when the backdoor \nis installed. The dropper iterates through the Windows netsvcs registry keys and uses the first available \nkey, indicating the path and filename of the backdoor in a ServiceDLL register. The backdoor operates as \na service through a “svchost.exe netsvcs –k” registry setting. The service key can be found under:\nHKLM\\system\\<controlset>\\services\\\nThe DLL is a system or hidden file, 19 KB to 23 KB in size and includes an XOR-encoded data section that \nis defined by the C&C application when the dropper is created. It includes the network service identifier, \nregistry service key, service description, mutex name, C&C server address, port, and dropper temporary \nfile name. The backdoor may operate from any configured TCP port.\nThis DLL is specified in the ServiceDLL key in the related Windows netsvcs registry entry. The DLL is usually \nfound in the %System%\\System32 or %System%\\SysWow64 directory.\nTrojan backdoor 2* startup.dll A6CBA73405C77FEDEAF4722AD7D35D60\nInitially configured with the following:\nconnect.dll 6E31CCA77255F9CDE228A2DB9E2A3855\nConnect.dll creates the temporary file “HostID.DAT,” which is sent to the C&C server, then downloads \nand configures related DLLs including:\n• PluginFile.dll\n• PluginScreen.dll \n• PluginCmd.dll \n• PluginKeyboard.dll \n• PluginProcess.dll \n• PluginService.dll \n• PluginRegedit.dll\nThereafter “Startup.dll” operates the service under a Windows Registry key. All communications seen  \nso far with this version have been on ports 25 and 80 over TCP but can operate on any determined port. \nThe service key is identified in the DLL (which does not include any encrypted data) as:\nHKLM\\Software\\RAT\nThis DLL is usually found in the %System%\\System32 directory; however, it has also been found in other \nlocations. The path to the backdoor DLL is indicated in the Windows Registry ServiceDLL key. \n* This DLL uses a different C&C application that may be an earlier version  \n of zwShell, analysis continues.9\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nThe Trojan components are manually copied or delivered through administrative utilities to remote systems. \nThey do not include any worm or self-replicating features, nor can the Trojan “infect” other computers. \nRemoving the Trojan components is simply a matter of deleting the related files and registry settings.\nThe Trojan backdoor communicates with the C&C server at the address hard-coded in each DLL. The C&C \nserver cannot modify the backdoor once it is installed; related systems must have the Trojan file removed \nbefore a new backdoor DLL can be installed on the system. Thus, if the C&C server address is changed, \nthose servers that have the DLL with previous addresses must be remotely administered by the attacker.\nAnti-virus Alerts\nAnti-virus patterns are defined according to samples submitted by clients or analysts as they are \ndiscovered. Some Trojans exhibit characteristics of other types of malware, such as worms or viruses, \nthat have the ability to infect other systems. RATs do not typically include such features, and, because \nthey are defined with unique configurations for custom purposes, they commonly change faster than \nunique samples can be identified.\nOnly when an entire RAT toolkit is found can we define an anti-virus pattern that is generic enough \nto detect the RAT regardless of configuration changes. The package necessarily includes the C&C \napplication server, the generator utility for creating droppers, related droppers, and backdoors  —  \nand a sufficient number of each to correlate the toolkit.\nAs mentioned previously, there have been several unique patterns developed from samples submitted  \nto McAfee (as well as to other anti-virus vendors).  \nNetwork Communications\nNetwork communications are relatively easy to detect because the malware uses a unique host beacon \nand server response protocol. Each communication packet between the compromised host and the C&C \nserver is signed with a plain text signature of “hW$.” (or “\\x68\\x57\\x24\\x13”) at the byte offset 0x42 \nwithin the TCP packet. \nThe backdoor begins its beacon at approximately five-second intervals with an initial packet that may  \nbe detected with the pattern: “\\x01\\x50[\\x00-\\xff]+\\x68\\x57\\x24\\x13.” McAfee recommends that companies review McAfee ePolicy Orchestrator® \n(McAfee ePO™) software and anti-virus logs for “NightDragon” signature \ndetections to identify related alerts since 2007 and then recover and resubmit \nthese samples for analysis to investigate the related incidents. McAfee can \nassist with the analysis or provide instructions and tools for internal review.\n10\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nThe server acknowledges the beacon with an initial response of “\\x01\\x60[\\x00-\\xff]+\\x68\\x57\\x24\\x13.”  \nThe backdoor sends the password to the server in clear text after the server acknowledges the connection. \nWhile the backdoor and the server have an active connection, the backdoor will send “keep-alive” \nmessages that can be detected with: “\\x03\\x50[\\x00-\\xff]+\\x68\\x57\\x24\\x13.”\n11\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nThe attackers use “dynamic DNS” Internet name services accounts to relay C&C communications or \ntemporarily associate DNS addresses with remote servers. Primary domains that have been used for  \nC&C traffic include (all of these have been used frequently by other malware):\n• is-a-chef.com\n• thruhere.net\n• office-on-the.net\n• selfip.com\nCompany extranet servers have also been used as either unique or secondary/redundant C&C servers. In \nsome instances, the attackers have (probably mistakenly) used droppers configured to compromise one \ncompany’s computers — in another company’s computers.\nAdditional Detection Techniques\nThe backdoor beacons with its corresponding C&C server as long as the related address is active. If the \naddress is abandoned or unreachable, the backdoor stops beaconing after some undetermined interval. \nWhen a compromised computer is restarted, however, the beaconing begins again because it is registered \nas a service in the Windows Registry. Anti-virus may or may not detect the Trojan unless it is beaconing or  \na full file system scan is performed.\nMcAfee Early Detection\nCustomers can deploy a number of McAfee products to help protect information systems from the Night \nDragon attack:\n• McAfee Vulnerability Manager: Using agentless discovery and vulnerability checking to assess systems \non your network, McAfee Vulnerability Manager is an enterprise-class vulnerability management  \nsystem that will detect infected Night Dragon systems as well as the security weaknesses in systems \nthat have been compromised. The “wham-apt-nightdragon-detected-v7.fasl3” script will detect this \nthreat remotely on systems. \n• McAfee Policy Auditor: Using agent-based configuration audit checks to determine the most secure \nconfiguration of a system, McAfee Policy Auditor software detects the security weaknesses in the \nsystems that have been compromised\n• McAfee Risk Advisory (MRA): Properly deployed, McAfee Risk Advisor would have allowed administrators \nto see the misconfigurations and gap in security coverage that facilitated Night Dragon’s exploitationMcAfee recommends that companies configure intrusion detection system \n(IDS) rules to detect the noted signatures (or employ the user-defined signature \n[UDS] “BACKDOOR: NightDragon Communication Detected” in McAfee \nNetwork Security Platform) and monitor DNS for outbound communications to \ndynamic DNS addresses resolving to or pathed back as suballocated to servers \nin China, where the company’s name or common abbreviation forms the first \npart of the address. This may be difficult. However, if samples of the backdoor \nDLLs are found, DNS monitoring can help to identify other compromised hosts \nin the company network. McAfee also recommends that companies review \nweb or IDS logs for file transfers to addresses registered in China. McAfee can \nassist with the analysis or provide instructions and tools for internal review.12\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nMcAfee Detection\nNight Dragon also displays a pattern of correlated activities with an assortment of other software tools \nthat McAfee can assist companies to identify.   \n• McAfee VirusScan Enterprise: Update your anti-virus .DATs to at least version 6232 and ensure that \non-demand scans are working properly and perform a full file system virus scan. Review McAfee ePO \nsoftware or anti-virus alerts and network logs for “NightDragon” signature detections to identify \ncompromised systems. Please submit any related samples to virus_research@mcafee.com  or submit \non the web at https://www.webimmune.net/default.asp. \n• McAfee Network Threat Response: McAfee Network Threat Response technology would have detected \nthe malicious C&C traffic and would have alerted administrators to the attack early, giving them time \nto react and prevent future damage\nAdministrators can also download the following free tools from McAfee:\n• McAfee “ Night Dragon Vulnerability Scanner ” based on McAfee Vulnerability Manager  technology to \nscan their networks for the presence of malware\n• McAfee Labs Stinger\nMcAfee Prevention\nFor complete prevention of this and most other attacks involving advanced persistent threats (APTs), \ncustomers can deploy application whitelisting and change/configuration control software on their critical \nservers. These technologies completely prevent the unauthorized running of DLLs/EXEs as well as the \nmodification of registry keys, services, and more involved in all of today’s APT and zero-day attacks.\n• McAfee Application Control: McAfee Application Control software stops Night Dragon by not allowing \nthe dropper files from executing (even as administrator on Windows), thereby preventing downloads of \nadditional malware and the setup of C&C channels that allowing RAT control and theft of sensitive files \n• McAfee Configuration Control: McAfee Configuration Control software allows you to disallow \nany configuration changes to your systems, protecting them from being modified without explicit \npermission (even with administrative access)\n• McAfee Database Activity Monitoring:  delivers complete database protection including 0-day attacks \nand web born attacks such as those seen with SQL injection in Night Dragon.\n• McAfee Network Security Manager: With the correct UDS signature set installed, the McAfee Network \nSecurity Platform appliances provide protection against network-based attacks, such as Night Dragon, \nby detecting malicious traffic on the network and alerting administrators to give them time to respond \nand prevent future attacks\n• McAfee Enterprise Firewall: Properly installed and configured at the border and inside your organization, \nMcAfee Firewall would have prevented the Night Dragon operation from penetrating so deeply into \nthe affected organizations and would have blocked C&C communication from the RAT\n• McAfee Web Gateway: Properly installed and configured, McAfee Web Gateway would have prevented \nthe Night Dragon operation from using their RATs, requiring them to proxy-enable their RATs or use \nalternative proxy-enabled RATs\n• McAfee Endpoint Encryption: Properly installed and configured, McAfee Endpoint Encryption software \nreduces the impact of the Night Dragon attack by restricting access to the core targeted assets\n• McAfee Data Loss Protection:  Properly installed and configured, McAfee Network DLP and/or McAfee \nHost DLP solutions allow you to prevent and detect the extraction of sensitive information from outside \nthe company13\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\n• McAfee Host Intrusion Prevention 8.0: McAfee Host Intrusion Prevention 8.0 software has introduced \na new “TrustedSource” APT detection feature that allows enterprises to correlate endpoint executable \nactivity with the network C&C communication to detect and prevent RAT communications and data \nexfiltration activity\n• McAfee VirusScan® Enterprise:  In addition to detecting associated malware and RATs on the endpoint, \ncustomers can also leverage access protection features in McAfee VirusScan Enterprise to prevent \n(and alert on) the creation of Night Dragon-related files and folder structures. Other built-in features \nsuch infection tracing and McAfee Global Threat Intelligence™ can assist with the identification and \nquarantining or removal of new and unknown associated malware and RATs.\nIf you have discovered the presence of Night Dragon in your environment and would like incident-response  \nor forensics assistance to respond and repair, please contact Foundstone Professional Services on \nincidentresponse@foundstone.com  or submit any related samples to Virus_Research@avertlabs.com  \nor on the web at McAfee Labs WebImmune.\nConclusion\nWell-coordinated, targeted attacks such as Night Dragon, orchestrated by a growing group of malicious \nattackers committed to their targets, are rapidly on the rise. These targets have now moved beyond the \ndefense industrial base, government, and military computers to include global corporate and commercial \ntargets. While Night Dragon attacks focused specifically on the energy sector, the tools and techniques  \nof this kind can be highly successful when targeting any industry. Our experience has shown that many \nother industries are currently vulnerable and are under continuous and persistent cyberespionage \nattacks of this type. More and more, these attacks focus not on using and abusing machines within the \norganizations being compromised, but rather on the theft of specific data and intellectual property. It is  \nvital that organizations work proactively toward protecting the heart of their value: intellectual property. \nEnterprises need to take action to discover these assets in their environments, assess their configurations \nfor vulnerabilities, and protect them from misuse and attack.\nFor additional research and information, review Hacking Exposed: Network Secret and Solutions — 6th \nEdition  (Osborne McGraw-Hill). You can also visit http://www.hackingexposed.com  for information on \nadvanced hacker techniques and to sign up for “Hacking Exposed” monthly webinars. \nCredits and Acknowledgements\nThe preceding white paper was a collaborative effort among numerous people and entities including \nMcAfee Foundstone Professional Services consultants, McAfee Labs, McAfee employees, executives, and \nresearchers, HBGary and National Cyber-Forensics & Training Alliance (NCFTA). Significant contributors \ninclude Shane Shook, Dmitri Alperovitch, Stuart McClure, Georg Wicherski, Greg Hoglund, Shawn Bracken,  \nRyan Permeh, Vitaly Zaytsev, Mark Gilbert, Mike Spohn, George Kurtz, and Adam Meyers.14\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nAppendix A: zwShell — the RAT\nBelow is a walk-through of the capabilities of zwShell and a demonstration of how the attackers used \nzwShell as a command and control server to exfiltrate data from within the targeted companies.\n1. When zwShell is launched, it presents a fake crash error to the user and contains a hidden text entry \nfield below the “Write of address 00000000. Process stopped” line. By entering the password in \nthe hidden dialog box above the “ok” button to launch the application requires typing a special \npassword, “zw.china.” Without that password, the tool will not start. This obfuscation method is \nlikely used to confuse investigators about the true purpose of this executable. \n2. Once the error is bypassed, and zwShell is launched, it allows the attacker to create a custom Trojan by \nselecting the Server menu or to launch the C&C server by clicking Start and entering the port to listen for \ntraffic with the password used by the backdoor DLLs. Once started, the application will begin listening \nfor incoming compromised client connections and display them inside the grid. The attacker can launch \nas many instances of the zwShell application as required  — as long as each listens to a different port or \npassword. In this manner, multiple “networks” of compromised computers can be monitored.\n3. The attacker can also click on the Options menu to configure the C&C server settings. Those settings \ninclude selection of the listening port, the password that will encrypt the C&C traffic (which must \nmatch the password selected at the time of the Trojan generation), the ability to specify custom sound  \nnotifications for when infected machines connect and disconnect from the C&C server, and the ability  \nto increase the color depth used for remote access to the machine, as well as an optional capability \nto allow resumes of interrupted file transfers from the client machine. The attacker can stop the \nlistener and start with new options to monitor or connect with other compromised computers. \n15\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\n5. The dropper will be copied over network shares to the compromised computer and remotely execute \nwith psexec or via Windows Terminal Services (RDP). In some cases, an “AT.job” or “SchTasks” entry  \nwill be used to execute the dropper over the network on the compromised computer. When \nexecuted, the dropper will create a temporary file and extract a RAT DLL that will be launched as a \npersistent Windows service. The RAT will then immediately send a beacon on the configured port to \nthe designated C&C server and wait for instructions. The dropper will automatically delete itself after \nthe backdoor service is created, and the temporary file will be deleted when the system is rebooted. \nAn entry will be created in the Windows Update logs (KB****.log) in the C:\\Windows directory with \nthe date and time and path+name of the temporary file.4. The attacker can specify the password (which must match the password set up for the server in Step 3),  \nthe name and path to the RAT DLL that will be injected into the svchost.exe Windows services process,  \nthe service and mutex names, and service displayed name and description. The attacker can also specify  \nup to two C&C hostnames or IP address, port address, and dropper EXE process icon. Once the  \nCreate button is clicked, zwShell will generate a custom EXE dropper process which, when executed, \nwill delete itself and extract a RAT DLL that will be launched as a persistent Windows service. The \nRAT will then immediately send a beacon on the configured port to the designated C&C server and \nwait for instructions. \n16\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\n6. When a client is executed, it connects to the attacker’s zwShell interface, along with its IP address,  \nPC name, name of the logged-in user, and information about the operating system (OS) version of \nthe machine, including the major patch levels.\n7. The attacker in charge of the C&C server can establish full remote control of the connected machine \nand can browse the file system, launch command-line shells, manipulate the registry, view the remote  \ndesktop, and uninstall the Trojan from the client.\n8. Browsing the client file system is a fully interactive process and has a familiar user interface similar  \nto Windows Explorer. Individual files and folders can be deleted, renamed, copied, downloaded,  \nand uploaded to the remote machine.\n17\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\n9. A remote command-line shell can be launched to execute commands directly on the remote machine.  \nWhen the attacker uses this function, a copy of CMD.EXE is copied to the compromised system in a \nWindows %Temp% directory with the filename svchost.exe. This copy is an unmodified version of \nthe Microsoft Windows command shell executable.\n10. The Registry can also be viewed and edited in a user interface similar to the Windows Registry editor.\n18\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nAppendix B: Attribution\nIMPORTANT: McAfee has no direct evidence to name the originators of these attacks but rather has \nprovided circumstantial evidence. \nWhile we believe many actors have participated in these attacks, we have been able to identify one \nindividual who has provided the crucial C&C infrastructure to the attackers — this individual is based in  \nHeze City, Shandong Province, China. Although we don’t believe this individual is the mastermind behind  \nthese attacks, it is likely this person is aware or has information that can help identify at least some  \nof the individuals, groups, or organizations responsible for these intrusions. \nThe individual runs a company that, according to the company’s advertisements, provides ”Hosted \nServers in the U.S. with no records kept” for as little as 68 RMB (US$10) per year for 100 MB of space. \nThe company’s U.S.-based leased servers have been used to host the zwShell C&C application that \ncontrolled machines across the victim companies.\nBeyond the connection to the hosting services reseller operation, there is other evidence indicating \nthat the attackers were of Chinese origin. Beyond the curious use of the “zw.china” password that \nunlocks the operation of the zwShell C&C Trojan, McAfee has determined that all of the identified data \nexfiltration activity occurred from Beijing-based IP addresses and operated inside the victim companies \nweekdays from 9:00 a.m. to 5:00 p.m. Beijing time, which also suggests that the involved individuals \nwere “company men” working on a regular job, rather than freelance or unprofessional hackers. In \naddition, the attackers employed hacking tools of Chinese origin and that are prevalent on Chinese \nunderground hacking forums. These included Hookmsgina and WinlogonHack, tools that intercept \nWindows logon requests and hijack usernames and passwords.\nFigure 6. Shandong Province, ChinaThe information in this document is provided only for educational purposes and for the convenience of McAfee customers. The information \ncontained herein is subject to change without notice, and is provided “as is,” without guarantee or warranty as to the accuracy or applicability \nof the information to any specific situation or circumstance.\nMcAfee, the McAfee logo, McAfee Labs, McAfee Foundstone, McAfee ePolicy Orchestrator, McAfee ePO, McAfee Global Threat Intelligence, \nand McAfee VirusScan Enterprise are registered trademarks or trademarks of McAfee or its subsidiaries in the United States and other countries. \nOther marks and brands may be claimed as the property of others. Copyright © 2011 McAfee  \n21401wp_night-dragon_0211McAfee, Inc.  \n2821 Mission College Boulevard  \nSanta Clara, CA 95054  \n888 847 8766  \nwww.mcafee.com\nWhite Paper  Global Energy Cyberattacks: “Night Dragon” DRAFT\nOn the compromised web server, they also deployed ASPXSpy, a web-based remote administration tool, \nalso of Chinese origin.\nThere is nothing to suggest that the developers of these tools had any direct connection to these \nintrusions, as the tools are widely available on the Chinese web forums and tend to be used extensively \nby Chinese hacker groups. Although it is possible that all of these indicators are an elaborate red-herring \noperation designed to pin the blame for the attacks on Chinese hackers, we believe this to be highly \nunlikely. Further, it is unclear who would have the motivation to go to these extraordinary lengths \nto place the blame for these attacks on someone else. We have strong evidence suggesting that the \nattackers were based in China.\nFigure 7. Instructions on the use of WinlogonHack tool by its Chinese developers.\nFigure 8. Parts of the ASPXSpy code with attribution to the Chinese developer."
}