{
    "title": "mexico foiled a $110 million bank heist_ then kept it a secret - bloomberg(1)",
    "text": "Terms of Service  Trademarks  Privacy Policy  \n©2020 Bloomberg L.P. All Rights ReservedCareers  Made in NYC  Advertise  Ad Choices\n  Contact Us  \nHelpCybersecurity\nBy Michelle F Davis\nMay 29, 2018, 7:00 AM EDTMexico Foiled a  Bank Heist,\nThen Kept It a Secret$110 Million\n●LIVE ON BLOOMBERG\nWatch Live TV\nListen to Live Radio\nSHARE THIS ARTICLE\nAlejandro Diaz de\nLeon Photographer:\nSusana\nGonzalez/Bloomberg\nHave a conﬁdential tip\nfor our reporters?\nGET IN TOUCH\nBefore it's here, it's on the\nBloomberg Terminal.\nLEARN MORE Now, its banking system is being hit by a new wave of attacks\n Policy makers are being criticized for a lack of communication\nA Banorte bank branch in Mexico City.  Photographer: Jonathan Levinson/Bloomberg\nOn a Tuesday morning in early January, the computer system at Mexico’s\nstate-owned trade bank went haywire. Some of Bancomext’s  workers\ncouldn’t get their PCs to turn on. The internet was slow. Routine operations\nwere taking longer than normal.\nInside the lender’s concrete-and-glass building on the southern outskirts of\nMexico City, a mid-level technician was monitoring messages coming in on\nthe Swift  network, the air-traﬃc control system for sending money around\nthe world. His job was to check fund transfers to make sure they matched\nthe payment orders dispatched by Swift.\nThat day, transaction volume was several times higher than normal. The\nworker scanned the messages from Swift until he discovered something:\nunusual activity at the Standard Chartered Plc  account Bancomext used for\ninternational wires.\nBancomext would later learn that hackers suspected to be from North\nKorea had tried to siphon oﬀ more than , forcing the lender to\ntemporarily suspend  operations in its international payment platform.\nThese accounts of cyberattacks are based on conversations with individuals\nbriefed on the details of the incidents, who asked not to be identiﬁed\nbecause investigations by authorities haven’t been completed.\nBangladesh Heist\nWorldwide, a string of attacks  targeting banks’ connections to the Swift\nnetwork has prompted ﬁnancial institutions to enact new security\nmeasures, with the most famous invasion coming in 2016 when criminals\nattempted to  steal  from the central bank of Bangladesh. But in\nMexico, details surrounding the Bancomext assault have been kept secret\nby government authorities and the bank, meaning the nation’s sprawling\nﬁnancial system never got the wake-up call  that could have helped guard\nagainst a new series of intrusions that authorities are still trying to contain.\nJust a few months after the Bancomext attack, hackers began hijacking\nMexican ﬁnancial institutions’ connections to the country’s domestic\npayment transfer system, known as SPEI . So far, they’ve gotten away with\nat least . While authorities don’t know where the attacks\noriginated, they suspect they were orchestrated by sophisticated parties\nwho colluded with account holders to withdraw massive amounts of cash\nfrom bank branches around Mexico. Oﬃcials say they still aren’t certain the\nthefts have ended.\n“There’s still a culture of reactivity when it comes to cyber risks,” said\nMichael Rohrs, an associate director  for Control Risks’s information\nsecurity practice in Washington. “All the news around the attempt against\nBancomext and the Swift incident with the central bank of Bangladesh\ncould have been a loud-enough wake-up call for the sector.”\nA representative for Bancomext said the lender followed all security\nprotocols and communicated with authorities from the start. Press oﬃcials\nfor Standard Chartered and Swift declined to comment.\nCybersecurity professionals and bank executives who spoke to Bloomberg\nsaid the poor coordination among ﬁnancial institutions and regulators\nhelped propagate the recent raids targeting three lenders, a brokerage and\na credit union. Knowing more about how the Bancomext assault and other\ncyber heists went down could have helped the ﬁrms protect themselves.\nA central bank spokeswoman said that information sharing is very\nimportant, but that institutions coming under cyberattacks don’t always\nreport them because of concerns about their reputation. It’s a matter of\ngreat to concern to the bank, she said. Case in point: the authority didn’t\nlearn about one of the breaches until about a week after it happened\nbecause the ﬁrm didn’t immediately disclose it.\nWorkers Go Home\nOﬃcials say they don’t have any reason to believe the current issues with\ndomestic payment transfers are related to the attempted heist of\nBancomext funds in January. While both were “man in the middle attacks,”\nthe central bank spokeswoman said, one targeted vulnerabilities in\ninternational payment systems, while the current spate of attacks aﬀected\nMexico’s domestic wire system. The central bank has maintained an open\nline of communication with all SPEI participants since the ﬁrst incident, the\nspokeswoman said.\nBack at Bancomext’s headquarters shortly after the Swift abnormalities\nwere ﬁrst discovered, executives took action. The lender, which has \n of loans outstanding and is charged with promoting international\ntrade, suspended operations and sent some workers home. Desk phones\nwere turned oﬀ and the bank shut down its email server.\nOﬃcials soon discovered the unusual transactions were payments that had\nbeen disguised as a donation from the Mexican bank to a Korean church.\nLuckily for Bancomext, it was after 3 a.m. in Seoul and since banks weren’t\nyet open for the day, the money hadn’t gone through. That bought the\nlender some time to get in contact with oﬃcials at Standard Chartered, who\nwere able to stop the transfer.\nNext Generation\nOnce the central bank was aware of Bancomext’s issues, it directed some\nother banks to double-check the security of their operations, but it didn’t\nprovide them any detail about what to look for, according to two people\nwith knowledge of the matter who asked not to be identiﬁed because the\ninformation is private. A spokeswoman said the level of detail the central\nbank provided reﬂected the amount of information it had at the time.\nExperts consulted by Bancomext would later tell the bank that hackers had\nmanaged to penetrate its Swift connection thanks to a so-called “next\ngeneration” virus that had probably been activated after an employee\nclicked on a malicious email attachment. It had likely sat undetected in the\nbank’s systems for several months or even years, allowing hackers to\nassemble data on typical operations so it’d be easier to disguise the theft.\nIn the more recent hack involving Mexico’s domestic payment system, the\nperpetrators have so far managed to steal about 300 million pesos (\n). Ultimately, the aﬀected institutions will be the ones on the hook\nfor that money, the central bank has said.\nThe central bank ﬁrst detected irregularities in a small ﬁnancial institution’s\nconnection to the SPEI network April 17 but it didn’t disclose it until 10 days\nlater  because the incident seemed like an isolated event.\nAbout a week after the initial attack, oﬃcials at Grupo Financiero Banorte\nnoticed hundreds of irregular transactions being dispatched through SPEI,\naccording to a person familiar with the matter. The biggest Mexican bank\nhad been the victim of a cyberattack just like the one discovered by the\ncentral bank the previous week. Banorte spokeswoman Veronica Reynold\nsaid the lender has acted in direct coordination with the central bank.\nIt wasn’t until April 27, after the Banorte attack, that the central bank\npublished a press release saying some ﬁnancial ﬁrms had experienced\n“incidents”  when operating the SPEI and that those ﬁrms would be\nconnecting to the payment network via an alternate method that was more\nlaborious but also more secure. Even then, the authority didn’t mention a\ncyberattack.\nNo Names\nBy then, the central bank had knowledge that three ﬁrms’ connections to\nthe SPEI network had been compromised. On May 2, a fourth institution\ndisclosed to the central bank that it had also been hacked the previous\nweek. A week later, the number of hacked ﬁrms grew to ﬁve. The central\nbank still hasn’t disclosed  the names of the aﬀected parties.\nTop executives from four lenders in Mexico complained to Bloomberg that\nthe central bank’s decision to stay silent about details of the attacks made it\nharder to shore up their systems. Banorte hasn’t had issues since it\nswitched to the backup SPEI connection. But the authority didn’t ask other\nbanks to enact contingency plans until the following days and weeks.\nIn Latin America, Mexico ranks as the country with the most cyberattacks\nafter Brazil, according to a January 2017 paper  from the Wilson Center on\nsecurity in the country. The ﬁnancial sector has been hit with extortion\nattempts and denial-of-service schemes as well as trading platform\ndisruptions, according to a 2015 Control Risks report.\nNo Fines\nIn the Bangladesh job, the thieves were able to get away with  by\nsending fake Swift messages that tricked  the Federal Reserve Bank of New\nYork into wiring money to accounts in the Philippines. Swift has said its\nsystem hasn’t been breached; rather security issues  have originated in\nbanks’ systems.\nLast year, the central bank set rules related to the SPEI system that require\nﬁnancial institutions to have in place certain emergency response protocols\nfor when attackers strike, among other requirements. Banxico evaluated\nﬁnancial institutions’ adherence in January and found some banks weren’t\nfully compliant, Governor Alejandro Diaz de Leon said in an interview May\n18. So far, the authority hasn’t levied any ﬁnes.\nWhile the central bank hasn’t been particularly forthcoming about the\nattacks, neither have the banks that were targeted gone out of their way to\nshare what happened with other lenders. Cybersecurity analysts speculate\nthat could be because they’re afraid they’ll get punished for not having\nsuﬃcient controls and they don’t want to give competitors any information\nthat would give them a leg up.\nInside Job\nBut experts agree that sharing information makes the whole system\nstronger.\n“It’s so important that these banks talk to each other, that they share the\nbest practices,” said David Schwartz, chief executive oﬃcer of the Florida\nInternational Bankers Association, a Miami-based trade association.\n“There’s not enough of that” in Mexico, he said.\nThere are plenty of theories around how the most recent hacks went down.\nSome suspect help from current or former central bank employees. Diaz de\nLeon has denied this. Others say hackers had access to the passwords to\nauthentication tokens for accounts, which would suggest insiders at the\nrespective banks may have helped them inﬁltrate their systems.\nMexico is ﬁnally taking steps in the wake of the SPEI scandal to ensure\nauthorities and banks have a better way of sharing information  with\neach other to be able to coordinate responses the next time criminals\nstrike, the central bank governor said. The monetary authority is also\ncreating a new division to set policies to better guard banking information.\nIgnorance\n“The idea is to have an understanding among authorities and ﬁnancial\nentities that whenever you get some type of shock or cybersecurity event,\nyou should share it, and everyone will have information and clarity about\nwhat’s going on,” Diaz de Leon said.\nUp until now, online security hasn’t been taken seriously in Mexico’s\nbanking sector, according to Federico De Noriega, a partner in the ﬁnance\ngroup at Hogan Lovells in Mexico City. He cited his experience representing\na foreign insurance company that was marketing policies to protect against\ncyberattacks to ﬁnancial institutions in Mexico.\n“There was a lot of ignorance,” De Noriega said. “That tells you people\naren’t aware of this risk, or they’re not taking it seriously. I think they’ll\nstart taking it more seriously now.”\nShare\nTweet\nPost\nEmail\n$110 million\n$1 billion\n$15 million\n$13\nbillion\n$15\nmillion\n$81 million\nBloomberg the Company & Its Products\n Bloomberg Anywhere Remote Login Bloomberg Terminal Demo Request\nBloomberg Menu Search Subscribe\n "
}