{
    "title": "microsoft patches office zero-day bug used by apt group _ securityweek.com",
    "text": "SECURITYWEEK NETWORK: Information Security News Infosec Island CISO Forum Security Experts: WRITE FOR US\nTweet\n Recommend 22\nEduard Kovacs ( @EduardKovacs )\nis a contributing editor at\nSecurityWeek. He worked as a high\nschool IT teacher for two years\nbefore starting a career in journalism\nas Softpedia’s security news reporter. Eduard\nholds a bachelor’s degree in industrial informatics\nand a master’s degree in computer techniques\napplied in electrical engineering.\nCritical Flaw in VMware Workstation, Fusion Allows Code\nExecution on Host From Guest\nCurrency Data Provider 'Open Exchange Rates' Discloses\nBreach\nOut-of-Band Windows Updates Patch Wormable SMB\nVulnerability\nSeveral Vulnerabilities Expose Phoenix Contact Industrial\n4G Routers to Attacks\nGoogle Offering Higher Bonuses for Cloud Platform\nVulnerabilitiesPrevious Columns by Eduard Kovacs:\n2020 ICS Cyber Security Conference | USA [Oct. 19-22]\n2020 Singapore ICS Cyber Security Conference | June 16-18 2020]\n2019 CISO Forum, Presented by Intel (Ritz-Carlton, Half Moon Bay CA)sponsored links\nTags: NEWS & INDUSTRY  VulnerabilitiesTweet\n Recommend 22\nBy Eduard Kovacs  on July 16, 2015\nHome  › Vulnerabilities\nMicrosoft Patches Office Zero-Day Bug Used by\nAPT Group\nMicrosoft on Tuesday patched  several memory corruption vulnerabilities in Office,\nincluding one that had been exploited in the wild by a well known advanced persistent\nthreat (APT) actor.\nTrend Micro reported earlier this week that the Russian threat group Pawn Storm (also known\nas APT28, Sednit, Fancy Bear, Sofacy and Tsar Team) had been leveraging an Oracle Java\nzero‐day  vulnerability in attacks against the armed forces of a NATO member country, and\ndefense organizations in the United States and Canada.\nAccording to iSIGHT Partners, this isn’t the only zero‐day bug used recently by the group. On\nJune 30, the threat intelligence company discovered that Pawn Storm had been exploiting an\nunpatched vulnerability in Microsoft Office (CVE‐2015‐2424). iSIGHT Partners immediately\nnotified Microsoft and the flaw was patched when the company released its July 2015\nsecurity updates.\n“When we found the exploit it appeared to be under development and evidence suggests it\nwas deployed in Georgia,” iSIGHT Partners noted in a blog post.\nThe Microsoft Office zero‐day exploited by the threat actor is a heap corruption vulnerability\ntriggered during processing of a malformed Microsoft Forms Image. The flaw affects Office\n2013 SP1 and prior, and it can be exploited to execute arbitrary code via a specially crafted\nOffice document.\nIn the Pawn Storm attack spotted by iSIGHT, the attackers used a document named\n“Iran_nuclear_talks.rtf” to hide the exploit. Brian Bartholomew, senior researcher in the\nCyber Espionage Threat Intelligence team at iSIGHT Partners, told SecurityWeek  that the\ncontent of the lure document was ripped from a June 28 CNN article on nuclear talks with\nIran.\nWhen the document was opened, an embedded OLE object triggered the vulnerability and a\ndropper payload was written and executed on the targeted system. The dropper then\ndropped a Sofacy malware payload.\n“Based on several artifacts in the exploit document and the unreliability of successful\nexploitation when running the exploit document, iSIGHT Partners believes the exploit\ndocument was potentially hastily thrown together, or the exploit is still being developed to\nbe more reliable,” iSIGHT explained .\nThe threat group, which the security firm calls Tsar Team, has also leveraged at least one of\nthe zero‐day exploits leaked after the Hacking Team breach.\nBartholomew told SecurityWeek  that iSIGHT has observed Tsar Team using one of the three\nAdobe Flash Player exploits ( CVE‐2015‐5119 ) from the Hacking Team leak .\n“While this is the only one we have observed in use by this team, it is not out of the realm\nof possibility that they may have repurposed any of the other five released zero‐days from\nHacking Team,” said Bartholomew. “5119 was re‐written and in use by Tsar Team within 24\nhours of the exploit being released on the Internet.\nIn April, FireEye reported that the threat group had used Flash Player and Windows zero‐days\nin a highly targeted attack aimed at an international government entity.\niSIGHT Partners has been monitoring the APT actor’s activities and the company believes that\nthe group is actually behind the hacktivist group known as Cyber Caliphate , which attacked\nseveral companies apparently in support of ISIS.\n Search\nBusiness Email AddressSUBSCRIBE TO THE DAILY BRIEFING\n   \n   \n    \nMost Recent Most Read\nHow National Security Surveillance Nabs More\nThan Spies\nEuropean Authorities Dismantle Two SIM Hijacking\nGangs\nUS Surveillance Powers Set to Temporarily Expire\nFlaws in Popup Builder Plugin Impacted Over\n100,000 WordPress Sites\nMicrosoft Deprecates Remote Desktop\nConnection Manager\nCritical Flaw in VMware Workstation, Fusion Allows\nCode Execution on Host From Guest\nChina‐linked APT Hackers Launch Coronavirus‐\nThemed Attacks\nU.S. Senators Seek to Ban TikTok on Government\nDevices\nTrump Signs Bill to Help Telecoms Replace Huawei\nEquipment\nHouse Strikes Deal to Extend Surveillance Powers\nPopular Topics\nInformation Security News\nIT Security News\nRisk Management\nCybercrime\nCloud Security\nApplication Security\nSmart Device Security\nSecurity Community\nIT Security Newsletters\nICS Cyber Security Conference\nCISO Forum, Presented by Intel\nInfosecIsland.Com\nStay Intouch\nTwitter\nFacebook\nLinkedIn Group\nCyber Weapon Discussion\nGroup\nRSS Feed\nSubmit Tip\nSecurity Intelligence Group\nAbout SecurityWeek\nTeam\nAdvertising\nEvents\nWriting Opportunities\nFeedback\nContact Us\nCopyright © 2020 Wired Business Media. All Rights Reserved.  Privacy Policy\nSubscribe 2019 CISO Forum, Presented by Intel ICS Cyber Security Conference Contact\nMalware & Threats Cybercrime Mobile & Wireless Risk & Compliance Security Architecture Security Strategy SCADA / ICS IoT Security\nShare\nShare\n "
}