{
    "title": "miragefox_ apt15 resurfaces with new tools based on old ones - intezer",
    "text": "MirageFox: APT15 Resurfaces With New Tools Based\nOn Old Ones\nWritten by Jay Rosenberg  - 14 June 2018JOIN OUR FREE\nCOMMUNITY\nGet Started\nSHARE ARTICLE\n\n\n\nJay RosenbergAPT15 Background\nCoincidentally, following the recent hack of a US Navy contractor and theft of highly sensitive\ndata on submarine warfare , we have found evidence of very recent activity by a group\nreferred to as APT15, known for committing cyber espionage which is believed to be affiliated\nwith the Chinese government. The malware involved in this recent campaign, MirageFox,\nlooks to be an upgraded version of a tool, a RAT believed to originate in 2012, known as\nMirage.\nAPT15 is known for committing cyberespionage against companies and organizations\nlocated in many different countries, targeting different sectors such as the oil industry,\ngovernment contractors, military, and more. They are known for “living off the land,”\nmeaning they use already available tools and software installed on the computer to operate,\nand once inside a target network, they will tailor their malware specifically to the target.\nOther names for the group are Vixen Panda, Ke3chang, Royal APT, and Playful Dragon.\nThere are many articles and researches online about APT15 and their activities, the most\nrecent one by NCC Group ; although posted in March 2018, it refers to a campaign in 2017. In\naddition, although the 2017 campaign has been documented, during our research regarding\nMirageFox, we found a recently uploaded binary (6/8/2018) from the 2017 campaign, pretty\nmuch identical to a RAT mentioned in their RoyalAPT report, barely detected with only 7/66\ndetections on VirusTotal . \n \nAPT15 Code Reuse\nWe found the new version of the RAT on VirusTotal hunting, by a YARA signature we created\nbased off code only found in  Mirage and Reaver , both attributed to Chinese government\naffiliated groups. After seeing that these binaries were new uploads to VirusTotal, with very\nfew detections, we analyzed them using Intezer Analyze™ to see if we could find any code\nreuse.\n(https://analyze.intezer.com/#/analyses/d00b6787-0078-4148-aec3-a66779a22ba5 )\n \nAs can be seen in this code reuse analysis report (SHA256:\n28d6a9a709b9ead84aece250889a1687c07e19f6993325ba5295410a478da30a), there is shared\ncode with Mirage and Reaver. The compilation timestamp is from June 8, 2018 while the\nupload date to VirusTotal was June 9, 2018.\n \n(VirusTotal )\nOn VirusTotal, we can see there are only 10/66 detections for this binary, 11/66 for another\nsimilar version of MirageFox (SHA256:\n97813e76564aa829a359c2d12c9c6b824c532de0fc15f43765cf6b106a32b9a5), and 9/64 for the\nthird MirageFox binary that was uploaded (SHA256:\nb7c1ae10f3037b7645541acb9f7421312fb1e164be964ee7acd6eb1299d6acb2).\nHere’s a couple examples of code reuse similarities found in the Mirage family between one\nof the newer binaries and older ones.\nRemote Shell :\nThe function above is seen throughout many of the binaries in the Mirage family and is\nexecuted when a command is sent from the C&C. It is responsible for executing commands\nin cmd.exe (later down in the functions, not seen in the screenshot, it looks for cmd.exe and\nexecutes it using CreateProcessA ).\nConfiguration Decryption:\n \nAnother small, but same important function in the photo above, is the function for\ndecrypting the data containing the C&C configuration. Similar to Reaver as posted by Palo\nAlto, it gets the IP or domain of the C&C server, the port, name of the binary, a sleep timer,\nand what Palo Alto calls a “campaign identifier.”\n \nTechnical Details\nAt this moment, we were unable to retrieve the original infection vector and other\ninformation regarding what other tools the APT15 group is using to attack their targets. We\nare able to come up with a few very interesting conclusions about what is going on here,\nalthough we cannot say for sure what the case is without the full context.\nFirstly, the reason this has been named MirageFox instead of just Mirage, is because in the\nExport directory for the modules, the name field is filled with a string MirageFox_Server.dat.\n \nEvidently in the image, you can see there is an exported function. The MirageFox binaries\nexport a function called dll_wWinMain, the name of an export in vsodscpl.dll , a module by\nMcAfee that is loaded by a few of their executables that import and call this function. This\nmost likely means there is some type of DLL hijacking going on by distributing a legitimate\nMcAfee binary with MirageFox to load up the DLL properly into a legitimate looking process.\nDLL hijacking techniques have been seen in the past with the APT15 group. The problem here\nis that once the export is called the first time, the module renames itself to sqlsrver.dll and\nthere is no evidence within the module of any type of persistence. By renaming it to this, the\nfuture executions of the RAT will not be through a McAfee binary. The future persistence\ncould be setup through another component of the malware or even a command sent by the\nC&C to the infected computer.\nThe most interesting part is the decrypted C&C configuration, as can be seen in the image\nbelow.\nDecrypted Config:\nC&C IP: 192.168.0.107\nPort: 80\nSleep Timer: 30000\nCampaign Identifier: Mirage\n \nIf you look at it the decrypted configuration, you may notice that the IP being used for the\nC&C is an internal IP address . If you read the report mentioned above about RoyalAPT by\nNCC Group, it is mentioned that APT15 infiltrated an organization again after stealing a VPN\nprivate key, therefore we can assume this version was tailor made to an organization they\nhave already infiltrated and are connecting to the internal network using a VPN .\n \n \n \nThe rest of MirageFox functions similarly to previous malware created by APT15, first\ncollecting information about the computer like the username, CPU information, architecture,\nand so forth. Then it sends this information to the C&C, opens a backdoor, and sits waiting\nfor commands from the C&C with functionality such as modifying files, launching processes,\nterminating itself, and more functionality typically seen in APT15’s RATs.\n \nConclusion\nThere is high confidence that MirageFox can be attributed to APT15 due to code and other\nsimilarities in the MirageFox binaries. As is known about APT15, after infiltrating their target,\nthey conduct a lot of reconnaissance work, send the commands from the C&C manually, and\nwill customize their malware components to best suit the environment they have infected.\n \nIOCs\nMirageFox\n28d6a9a709b9ead84aece250889a1687c07e19f6993325ba5295410a478da30a\n97813e76564aa829a359c2d12c9c6b824c532de0fc15f43765cf6b106a32b9a5\nb7c1ae10f3037b7645541acb9f7421312fb1e164be964ee7acd6eb1299d6acb2\n \nRoyalAPT\n016948ec7743b09e41b6968b42dfade5480774df3baf915e4c8753f5f90d1734\n \nRoyalAPT C&C\nbuy.healthcare-internet[.]com\n \nMirage (w/ Same C&C Config Decryption)\n5787eff4b4d6ee5b4c5457c9af5e2f2e3c75204b5989606b1faa9b944dc49a30\nb6bd5d8f5a824db05c37dde459b60a5571df87966e00390f2df56628da49b856\nb9403fb1e3743617bcdf8c1e5dd332c325c1e1f2e79bef166261fec0091880cf\nffaddb93042243926a964864e21a28365807ac5be843f5e690f9916cddbbd55b\nb0a2923e817ac982c89510e4bd8eab68892ee51e5fa625bd806508a4b701aa78\nda4dbc738d069fbcc9b96ab4af2bd3f7a87c7b69a4b47071e099e36b481dfa01\nf633df1fb42666f62eb23fd70dac4e3c0c4908af123f9335f3b58e6ea205df8a\ne67e58bc736bd54e6915cb43af5f3c332da3592839a5a4884ba141b089310815\n1534432fafb21c0479343bc2d9f3991e56c75baa41c54b3470d41055bb578f8f\n27a0ce9761363f6a1eafc719b96bbe1f9a426e50e8b5abf84db963efddb89a8d\nd22c2ef1453d5575e05a673777931e07c44734fe467a77969bebe86e26aacf98\nf85023ae81917a7fae0d987134a968ffad346d5c3b35d3a98e237419dd334696\n24b3c3527a2431d1c1dd27fe6566ddcaa8e4b92e31e468bb733e827350830a14\n57550ab2d20a757b24137ab764a2e9bf644fd8e1f4313bca22e04db7fa608cc2\n4d45ddc35abf77cded21bafe5483d345585c1d84f52a101a65ebfda88be5ad7d\n421f4c83898ff3ae9b2a94621140ef770888a8a0914b163cdae4690433173899\nc27fb5fd362fdaec2e344564f76197d01e1dc463ee3552b16452fc41e67f2709\ncec9c4e48fad6e4c2b7cf4bc34d357893ef878e8be076c9f680f297e06184c20\nPreviews Article\nDigital Certificates- When The Chain Of Tru …Next Article\nProduct Updates\nProducts\nIntezer Analyze\nIntezer Protect\nWhy Intezer\nTechnology\nCompany\nAbout\nEvents\nNews\nCareers\nContact us\nPartners\nBlog\nResources\n © Intezer.com 2020 All rights reserved\n| Terms of Use\n| Privacy Policy\n Products Why Intezer Technology Company Partners Blog Resources  Get Started for Free\n "
}