{
    "title": "new spear phishing campaign pretends to be eff _ electronic frontier foundation",
    "text": "TECHNICAL ANALYSIS BY COOPER QUINTIN AUGUST 27, 2015New Spear Phishing Campaign Pretends to be EFF\nUpdate 01/28/16: EFF now controls  the Electronicfrontierfoundation.org domain and that\nURL currently redirects to this blog post. If you arrived at this page via a link in a message\nthat may have been phishing, please let us know and we will investigate.\nGoogle's security team recently identified a new domain masquerading as an official EFF site as part of\na targeted malware campaign. That domain, electronicfrontierfoundation.org, is designed to trick\nusers into a false sense of trust and it appears to have been used in a spear phishing attack, though it\nis unclear who the intended targets were. The domain was registered on August 4, 2015, under a\npresumably false name, and we suspect that the attack started on the same day. At the time of this\nwriting the domain is still serving malware.\nElectronicfrontierfoundation.org was not the only domain involved in this attack. It seems to be part\nof a larger campaign, known as “Pawn Storm” . The current phase of the Pawn Storm attack campaign\nstarted a little over a month ago , and the overall campaign was first identified in an October 2014\nreport from Trend Micro  (PDF). The group behind the attacks is possibly associated with the Russian\ngovernment and has been active since at least 2007 .\nThe attack is relatively sophisticated—it uses a recently discovered Java exploit , the first known Java\nzero-day in two years. The attacker sends the target a spear phishing email containing a link to a\nunique URL on the malicious domain (in this case electronicfrontierfoundation.org). When visited, the\nURL will redirect the user to another unique URL in the form of\nhttp://electronicfrontierfoundation.org/url/{6_random_digits}/Go.class  containing a\nJava applet which exploits a vulnerable version of Java. Once the URL is used and the Java payload is\nreceived, the URL is disabled and will no longer deliver malware (presumably to make life harder for\nmalware analysts). The attacker, now able to run any code on the user's machine due to the Java\nexploit, downloads a second payload, which is a binary program to be executed on the target's\ncomputer.\nWe were able to recover the following samples of the malicious Java code from\nelectronicfrontierfoundation.org.\nFilename MD5 Sum SHA1 Sum\nApp.class 0c345969a5974e8b1ec6a5e23b2cf777 95dc765700f5af406883d07f165011d2ff8dd0fb\nGo.class 25833224c2cb8050b90786d45f29160c df5f038d78f5934bd79d235b4d257bba33e6b3\nThe decompiled Java for App.class\nThe decompiled Java for App.class\nThe Go.class applet bootstraps and executes App.class, which contains the actual attack code. The\nApp.class payload exploits the same Java zero-day reported by Trend Micro  and then downloads a\nsecond stage binary, internally called cormac.mcr, to the user's home directory and renames it to a\nrandomly chosen string ending in `.exe`. Interestingly, App.class contains code to download a *nix\ncompatible second stage binary if necessary, implying that this attack is able to potentially target Mac\nor Linux users.\nUnfortunately we weren't able to retrieve the second stage binary, however this is the same path and\nfilename that has been used in other Pawn Storm attacks, which suggests that it is likely to be the\nsame payload: the malware known as Sednit . On Windows, the Sednit payload is downloaded to the\nlogged-in user's home directory with a randomly generated filename and executed. On running itJoin Our Newsletter!\nEmail updates on news, actions, events in your area, and more.\nEmail Address\nPostal Code (optional)\nAnti-spam question: Enter the three-letter abbreviation for Electronic Frontier Foundation :\nSUBMIT\n  \nRELATED ISSUES :\nSECURITY STATE-SPONSORED MALWARE\nRELATED CASES :\nKIDANE V. ETHIOPIA      About Issues Our Work Take Action Tools Donate  \n Imagine an Internet where the law required every message sent to be read\nby government-approved scanning software. Companies that handle such\nmessages wouldn’t be allowed to securely encrypt them, or they’d lose\nlegal protections that allow them to operate. Take Action  Stop the\nGraham-Blumenthal Attack on Encryption  That’s...The EARN IT Bill Is the Government’s Plan to Scan Every\nMessage Online\nMembers of Congress have mounted a major threat to your freedom of\nspeech and privacy online. Senators Lindsey Graham (R-SC) and Richard\nBlumenthal (D-CT) recently introduced a bill that would undermine key\nprotections for Internet speech in U.S. law. It would also expose providers\nof the private messaging services we...The Graham-Blumenthal Bill Is an Attack on Online\nSpeech and Security\nNow that HTTPS  encrypts over 80% of web connections , powerful actors\nare targeting root certificate stores  to compromise our security and surveil us.\nIn the past year alone, that’s included a “market research” company\nsecretly owned by Facebook  and the government of Kazakhstan . Forcing\nusers...Victory: Android 11 Rolls out Improved Certificate\nWarnings\nMembers of Congress are about to introduce a bill that will undermine the\nlaw that undergirds free speech on the Internet. If passed, the bill known\nas the Eliminating Abusive and Rampant Neglect of Interactive\nTechnologies (EARN IT) Act , will fulfill a long-standing dream of U.S. law\nenforcement. If...The Graham-Blumenthal Bill: A New Path for DOJ to\nFinally Break Encryption\nTwitter has publicly disclosed a security “incident” that points to long-\nstanding problems with how the service handles phone numbers. Twitter\nannounced  it had discovered and shut down “a large network of fake\naccounts” that were uploading large numbers of phone numbers and using\ntools in Twitter’s API to match...How Twitter's Default Settings Can Leak Your Phone\nNumber\nThere’s a new and serious threat to both free speech and security online.\nUnder a draft bill that Bloomberg recently leaked , the Attorney General\ncould unilaterally dictate how online platforms and services must operate. If\nthose companies don’t follow the Attorney General’s rules, they could be\non the hook...Congress Must Stop the Graham-Blumenthal Anti-\nSecurity Bill\nComputer security researchers and journalists play a critical role in\nuncovering flaws in software and information systems. Their research and\nreporting allows users to protect themselves, and vendors to repair their\nproducts before attackers can exploit security flaws. But all too often,\ncorporations and governments try to silence reporters, and...Lawsuit in India Seeks to Shut Down Access to U.S.\nJournalism Website\nThe FTC recently took action  against stalkerware  developer Retina-X, theFTC Takes Action Against Stalkerware Company Retina-Xhooks a variety of services and downloads a DLL file. The DLL file is executed and connects to a\ncommand and control server where it appears to verify the target and then execute a keylogger or\nother modules as may be required by the attacker.\nBecause this attack used the same path names, Java payloads, and Java exploit that have been used in\nother attacks associated with Pawn Storm, we can conclude that this attack is almost certainly being\ncarried out by the same group responsible for the rest of the Pawn Storm attacks. Other security\nresearchers have linked the Pawn Storm campaign with the original Sednit and Sofacy targeted\nmalware campaigns–also known as “APT 28”–citing the fact that they use the same custom malware\nand have similar targets . In a 2014 paper the security company FireEye linked the “APT 28” group\nbehind Sednit/Sofacy with the  Russian Government  (PDF) based on technical evidence, technical\nsophistication, and targets chosen. Drawing from these conclusions, it seems likely that the\norganization behind the fake-EFF phishing attack also has ties to the Russian government. Past\nattacks have targeted Russian dissidents and journalists, U.S. Defense Contractors, NATO forces, and\nWhite House staff. We do not know who the targets were for this particular attack, but it does not\nappear that it was EFF staff.\nThe phishing domain has been reported for abuse–though it is still active, and the vulnerability in\nJava has been patched by Oracle. Of course this is an excellent reminder for everyone to be vigilant\nagainst phishing attacks. Our SSD guide  contains advice on how to improve your security, watch for\nmalicious emails, and avoid phishing attacks such as this one.\nRELATED UPDATES\nDEEPLINKS BLOG  BY JOE MULLIN  | MARCH 12, 2020\nDEEPLINKS BLOG  BY ELLIOT HARMON  | MARCH 10, 2020\nDEEPLINKS BLOG  BY MONA WANG  | MARCH 10, 2020\nDEEPLINKS BLOG  BY JOE MULLIN  | MARCH 4, 2020\nDEEPLINKS BLOG  BY GENNIE GEBHART  | FEBRUARY 5, 2020\nDEEPLINKS BLOG  BY ELLIOT HARMON  | JANUARY 31, 2020\nDEEPLINKS BLOG  BY NAOMI GILENS  | JANUARY 31, 2020\nDEEPLINKS BLOG  BY GENNIE GEBHART , EVA GALPERIN  | NOVEMBER 6, 2019\n CONTACT ABOUT ISSUES UPDATES PRESS DONATE\ncompany behind apps MobileSpy, PhoneSheriff, and Teenspy. The FTC\nsettlement bars Retina-X from distributing  its mobile apps until it can\nadequately secure user information and ensure its apps will only be used for\n“legitimate purposes.” But here’s...\nRecent attacks on encryption have diverged. On the one hand, we’ve seen\nAttorney General William Barr call for “lawful access” to encrypted\ncommunications, using arguments that have barely changed since the\n1990’s . But we’ve also seen suggestions from a different set of actors for\nmore purportedly “reasonable” interventions ...Why Adding Client-Side Scanning Breaks End-To-End\nEncryption\nIt's old news that governments around the world are misusing private\ncompany-sold digital surveillance software track and target people for\nhuman rights abuses. Recently, Amnesty International reported  finding\nthat two prominent Moroccan human rights defenders had been targeted\nusing Israeli-based NSO Group’s software. Just this week WhatsApp sued...Private Companies, Government Surveillance Software\nand Human RightsDEEPLINKS BLOG  BY ERICA PORTNOY  | NOVEMBER 1, 2019\nDEEPLINKS BLOG  BY EVA GALPERIN , CINDY COHN  | OCTOBER 28, 2019\nFOLLOW EFF:\nGeneral\nLegal\nSecurity\nMembership\nPressCalendar\nVolunteer\nVictories\nHistory\nInternships\nJobs\nStaffFree Speech\nPrivacy\nCreativity & Innovation\nTransparency\nInternational\nSecurityBlog\nEvents\nPress Releases\nWhitepapersPress Contact Join or Renew Membership Online\nOne-Time Donation Online\nShop\nOther Ways to Give\nCOPYRIGHT (CC BY) TRADEMARK PRIVACY POLICY THANKS\n "
}