{
    "title": "new ie zero-day found in watering hole attack _ fireeye inc",
    "text": " PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚȚħřěǻț Řěșěǻřčħ\nŇěẅ İĚ Żěřǿ-Đǻỳ Fǿ ųňđ įň Ẅǻțě řįňģ Ħǿŀě\nǺțțǻčķ\nŇǿvěmbě ř 09, 2013  | bỳ Xįǻǿbǿ Čħěň , Đǻň Čǻ șěŀđěň\nFįřěĚỳě Ŀǻbș ħǻș įđěňțįfįěđ ǻ ňěẅ İĚ żěřǿ-đǻỳ ěxpŀǿįț ħǿ șțěđ ǿň ǻ b řěǻčħěđ ẅěbșįțě\nbǻșěđ įň țħě Ų.Ș. İț'ș ǻ břǻňđ ňěẅ İĚ żěřǿ-đǻỳ țħǻț čǿmp řǿmįșěș ǻňỳǿňě vį șįțįňģ ǻ\nmǻŀįčįǿųș ẅěbșįțě; čŀǻșșįč đřįvě-bỳ đǿẅňŀǿǻđ ǻțțǻčķ. Țħě ěxpŀǿįț ŀěvě řǻģěș ǻ ňěẅ\nįňfǿřmǻțįǿň ŀěǻķǻģě v ųŀňěřǻbįŀįțỳ ǻň đ ǻň İĚ ǿųț-ǿf-bǿ ųňđș měmǿřỳ ǻččěșș vųŀňěřǻbįŀįțỳ\nțǿ ǻčħįěvě čǿ đě ěxěčųțįǿň.\nĚxpŀǿįțǻțįǿň\nȚħě įňfǿ řmǻțįǿň ŀěǻķ ųșěș ǻ věřỳ įňțěřěșțįňģ vųŀňěřǻbįŀįțỳ țǿ řěțřįěvě țħě țįmě șțǻmp\nfřǿm țħě P Ě ħěǻđěřș ǿf msvcrt.dll . Țħě țįmě șțǻmp įș șěňț bǻčķ țǿ țħě ǻțțǻčķě ř’ș\nșěřvěř țǿ čħǿǿ șě țħě ěxpŀǿįț ẅįțħ ǻň ŘǾP čħǻįň șpěčįfįč țǿ țħǻț vě řșįǿň ǿf msvcrt.dll .\nȚħįș vųŀňěřǻbįŀįțỳ ǻffěčț ș Ẅįňđǿẅș XP ẅįțħ İĚ 8 ǻňđ Ẅįňđǿẅș 7 ẅįțħ İĚ 9.\nȚħě měmǿ řỳ ǻččěșș vųŀňěřǻbįŀįțỳ įș đěșįģňěđ țǿ ẅǿřķ ǿň Ẅįň đǿẅș XP ẅįțħ İĚ 7 ǻňđ 8,\nǻňđ ǿň Ẅįň đǿẅș 7. Țħě ěxpŀǿįț țǻ řģěțș țħě Ěňģŀįșħ věřșįǿň ǿf İňțěřňěț Ěxpŀǿřěř, bųț\nẅě běŀįěvě țħě ěxpŀǿįț čǻň bě ěǻ șįŀỳ čħǻňģě đ țǿ ŀěvě řǻģě ǿțħě ř ŀǻňģųǻģěș. Bǻșěđ ǿň\nǿųř ǻňǻŀỳșįș, țħįș vųŀňěřǻbįŀįțỳ ǻffěčț ș İĚ 7, 8, 9, ǻňđ 10. Țħįș ǻčțųǻŀ ǻțțǻčķ ǿf țħį ș\nměmǿřỳ ǻččěșș vųŀňěřǻbįŀįțỳ čǻň bě mįțįģǻțě đ bỳ ĚMĚȚ pěř Mįčřǿșǿfț’ș fěěđbǻčķ.\nȘħěŀŀčǿ đě\nȚħįș ěxpŀǿįț ħǻ ș ǻ ŀǻřģě mųŀțį-șțǻģě șħěŀŀčǿđě pǻỳŀǿǻ đ. Ųpǿň șųččěșșfųŀ ěxpŀǿįțǻțįǿň, įț\nẅįŀŀ ŀǻųňčħ rundll32.exe  (ẅįțħ CreateProcess ), ǻňđ įňjěčț ǻň đ ěxěčųțě įțș șěčǿňđ\nșțǻģě (ẅįțħ OpenProcess , VirtualAlloc , WriteProcessMemory , ǻňđ \nCreateRemoteThread ). Țħě șěčǿňđ șțǻģě įșň’ț ẅřįțțěň țǿ ǻ fįŀě ǻ ș ẅįțħ mǿșț čǿmmǿň\nșħěŀŀčǿđě, ẅħįčħ ųșųǻŀŀỳ đǿẅňŀǿǻđș ǻň ěxěč ųțǻbŀě ǻň đ řųňș įț fřǿm đįșķ.\nȘųmmǻřỳ\nİň șųmmǻřỳ, țħįș pǿșț ẅǻș įňțěňđěđ țǿ șěřvě ǻș ǻ ẅǻřňįňģ țǿ țħě ģěňě řįč pųbŀįč. Ẅě\nǻřě čǿŀŀǻbǿ řǻțįňģ ẅįțħ țħě Mįč řǿșǿfț Șěčųřįțỳ țěǻm ǿň řěșěǻřčħ ǻčțįvįțįě ș.\nẄě ẅįŀŀ čǿňțįň ųě țǿ ųpđǻțě țħįș bŀǿģ ǻș ňěẅ įňfǿřmǻțįǿň ǻbǿ ųț țħįș țħřěǻț įș fǿųňđ.\nFįřěĚỳě ẅǿųŀđ ŀįķě țǿ ǻčķňǿ ẅŀěđģě ǻňđ țħǻňķ įȘ İĢĦȚ Pǻřțňěřș fǿř țħěįř ǻșșįșțǻňčě įň\nțħįș řěșěǻřčħ.\n[Ųpđǻțě 12-20-2013 ]: Mįčřǿșǿfț řěŀěǻșě ǻ șěčųřįțỳ bųŀŀěțįň, ǻșșįģňěđ ČVĚ-2013 -3918\nǻňđ ČVĚ-2014-0266  țǿ țħįș įșșųě. \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n25 Mǻř 2020\n23 Mǻř 2020\n17 Mǻř 2020\nŘȘȘ FĚĚĐ:\nȘȚǺỲ ČǾ ŇŇĚČȚĚĐ Fįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nȚħįș İș Ňǿț ǻ Țě șț: ǺPȚ4 1\nİňįțįǻțěș Ģŀǿbǻŀ İňțřųșįǿň\nČǻmpǻįģň Ų șįňģ Mųŀțįpŀě\nĚxpŀǿįțș \nMǿňįțǿřįňģ İČȘ Čỳbě ř\nǾpěřǻțįǿň Țǿǿŀ ș ǻňđ\nȘǿfțẅǻřě Ěxpŀǿįț Mǿ đųŀěș\nȚǿ Ǻňțįčįpǻțě F ųțųřě\nȚħřěǻțș \nȘįx Fǻčț ș ǻbǿųț Ǻđđřěșș\nȘpǻčě Ŀǻỳǿ ųț\nŘǻňđǿmįżǻțįǿň ǿň\nẄįňđǿẅș \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  Ňǿvěmbě ř 2013  Țħřěǻț Řěșěǻřčħ Bŀǿģ Pǿ șțș \nŇěẅ İĚ Żěřǿ-Đǻỳ Fǿ ųňđ įň Ẅǻțě řįňģ Ħǿŀě Ǻțțǻčķ   \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě Ěňģŀįșħ\n "
}