{
    "title": "north korean hacking group steals $13.5 million",
    "text": "Search Dark Reading\nNetwork Computing Dark Reading\n Welcome Guest Login to your account Register Advertise About Us\nFollow DR:\n Authors Slideshows Video Tech Library University Radio Calendar Black Hat News\nTHE\nEDGEANALYTICS ATTACKS /\nBREACHESAPP SEC CAREERS &\nPEOPLECLOUD ENDPOINT IoT OPERATIONS PERIMETER RISK THREAT\nINTELLIGENCEVULNS /\nTHREATS\nSPONSORED CONTENT\nSynopsys Aims to Boost Security of Software\nDevelopment Processes\nIt's no surprise that most software developers aren't security experts,\nbut they still have plenty of incentive to bring better security practices\nto the code they write, says Patrick Carey, senior director of product\nmarketing at Synopsys. He describes what developers are looking for\nand how application security testing is shifting \"left.\"\nLEARN MORE\nBrought to you by AxoniusSponsored Content\nAsset Management Trends: As IT\nComplexity Increases, Visibility Plummets\nThis eBook highlights the current asset visibility challenges\nthat IT and security teams are facing as the IT landscape\nbecomes more complex.\nCOMMENT   | EMAIL THIS   | PRINT   | RSS\nWebcasts\nCyber Attack Evasion\nTechniques\n5 Steps to Integrate\nSAST into the\nDevSecOps Pipeline\nMORE WEBCASTS\nWhite Papers\nSimplify Your App\nSecurity\nNetFlow vs Packet\nData\nMORE WHITE PAPERS\nReports\n2020 IT Salary Survey\nResults Revealed\n[Report] DevSecOps &\nSecure App Delivery:\nWhat's Working &\nWhat's Not\nMORE REPORTS\n100%\n 0%\n0 COMMENTS\nCOMMENT NOW\nTweet\n8/27/2018\n05:30 PM\nJai Vijayan\nNews\nConnect Directly\nLogin\nNEWEST FIRST   |  OLDEST FIRST   |  THREADED VIEW\nNorth Korean Hacking Group Steals\n$13.5 Million From Indian Bank\nTactics that Lazarus Group used to siphon money from India's Cosmos\nBank were highly sophisticated, Securonix says.\nNorth Korean-linked Lazarus Group is believed responsible for stealing $13.5\nmillion from India's Cosmos Bank in a brazen attack that has exposed\nlimitations in the measures banks use to defend against targeted cyber\nthreats.\nThe theft occurred between August 10 and August 13, 2018, and was\nenabled via thousands of fraudulent ATM transactions across 28 countries\nand by at least three unauthorized money transfers using the bank's access\nto the SWIFT international financial network.\nIt is still unclear how the threat actors managed to initially infiltrate the bank's\nnetwork. But based on how Lazarus Group actors have typically operated in\nthe past, the attackers broke in via a spear-phishing email and then moved\nlaterally within the bank's network, according to researchers at Securonix.\n\"This attack is a good example of the fact that, while ATM and SWIFT\ntransaction monitoring is important, it often is not enough, and may only give\nyou 10%-20% of the required detection coverage,\" the security vendor noted\nin its report.\nThe Cosmos Co-operative Bank is a 111-year old co-operative bank in India\nwith branches in 7 states and 39 major cities. Between August 10 and August\n11, Lazarus Group operators managed to compromise an end-user system at\nthe bank and used that to access and compromise the institution's ATM\ninfrastructure.\nPublicly available information and Securonix' own analysis suggest that the\nattackers used multiple targeted malware exploits to set up a malicious\nATM/POS proxy switch in parallel with Cosmos Bank's own central switch.\nThey then broke or redirected the connection between the bank's ATM/POS\ncentral switch and its back-end Core Banking System. Securonix described\nthe banking switch as a component that is primarily used to perform routing\nand transaction-processing decisions.\n\"Based on the publicly available details, most likely there was no  additional\nhardware installed,\" says Oleg Kolesnikov, a member of the Securonix threat\nresearch team. \"The malicious payment switch typically  comes in the form of\nsoftware, so this is likely what was installed  and/or cloned/modified by the\nattackers to proxy the requests from  the ATM terminals instead of the existing\nswitch.\"\nATM Withdrawls\nThe attackers are believed to have increased the withdrawal limits on\nhundreds of targeted accounts at the bank and set them up so cash\nwithdrawals could be made from the accounts from abroad. In total, operators\nworking on behalf of Lazarus Group used 450 cloned non-EMV debit cards\nlinked to accounts at Cosmos Bank to make some 12,000 international ATM\nwithdrawals and 2,849 domestic transactions totaling $11.5 million.\nBecause the attackers had previously tampered with the link between the\nbanks' ATM switch and the core banking system, the required messages and\ncodes for authorizing the debit card withdrawals were never forwarded to the\ncore banking system. So typical checks on card number, card status, and PIN\nwere never conducted. Instead, the attackers used the rogue ATM/POS\nswitch that they had installed to send fake instructions for authorizing the\nfraudulent transactions.\nAbout two days after the initial break-in, the attackers gained access to\nCosmos Banks' SWIFT environment and used it to illegally transfer $2 million\nto an account belonging to a trading company at Hang Seng Bank in Hong\nKong.\nThe attack on Cosmos Bank's ATM network was different from typical\njackpotting and black box attacks where attackers physically tamper with\nATMs to get them to spit out large amounts of cash. In this case, the attack\ntargeted the bank's core infrastructure and effectively bypassed all measures\nrecommended by the Interpol for protecting a bank's ATM infrastructure\nagainst logical attacks, Securonix said.\nWhat remains unclear is why Cosmos Bank did not receive any alerts when\nthe connection between its ATM switch and core banking system was cut or\nwhen thousands of ATM transactions that were clearly not normal were being\nmade.\n\"We do not know for certain, but it is likely that the connection was  redirected\nsuch that the connection remained active, and only the  malicious requests in\nquestion were selectively redirected by the  malicious component,\" Kolesnikov\nsays. This would ensure that the malicious requests never made it to\nthe legitimate payment switch, and therefore were never visible at the  core\nbackend system, he says.\nThe attack also likely involved a lot of malicious and suspicious attack\nbehaviors that the bank should have spotted.\nBased on the publicly available  details, the attackers had to stand up a proxy\nswitch capable of  responding to malicious transaction requests from the\nterminals, Kolesnikov says.\nThey  also likely had to install some targeted malware components needed\nto monitor the card management process and the payment infrastructure,\nto gain access to the SWIFT terminals and to understand the\nstandard  operating procedures.\n Related Content:\nThieves Target ATMs In First US 'Jackpotting' Attacks\nThe Future Of ATM Hacking\nCybercriminals Battle Against Banks' Incident Response\n6 Reasons Security Awareness Programs Go Wrong\n \nBlack Hat Europe returns to London Dec 3-6 2018  with hands-on\ntechnical Trainings, cutting-edge Briefings, Arsenal open-source tool\ndemonstrations, top-tier security solutions and service providers in the\nBusiness Hall. Click for information on the conference  and to register.\nJai Vijayan is a seasoned technology reporter with over 20 years of\nexperience in IT trade journalism. He was most recently a Senior Editor at\nComputerworld, where he covered information security and data privacy\nissues for the publication. Over the course of his 20-year ... View Full Bio\nINSIGHTS\nMORE INSIGHTS\nCOMMENTS\nBe the first to post a comment  regarding this story.\n3 Many Ransomware Attacks Can be\nStopped Before They Begin\nJai Vijayan, Contributing Writer,  3/17/2020\n2 This Tax Season, Save the Scorn\nand Protect Customers from\nPhishing Scams\nDr. Salvatore Stolfo, Founder & CTO, Allure\nSecurity,  3/17/2020\n1 Fewer Vulnerabilities in Web\nFrameworks, but Exploits Remain\nSteady\nRobert Lemos, Contributing Writer,  3/16/2020\nSUBSCRIBE TO NEWSLETTERS\nWEBINAR ARCHIVESChatbots for the Enterprise\nThe ROI Story: Identifying & Justifying Disruptive\nTechnology\nThe 6 Must-Haves for Practical Cloud Security\nMORE WHITE PAPERSWHITE PAPERS\n2020 IT Salary Survey Results Revealed\nSimplify Your App Security\nNetFlow vs Packet Data\nAnatomy of a Cloud-Native Data Breach\nNetwork Traffic Analysis Instrumentation Guide\nALL VIDEOSVIDEO\nCARTOON ARCHIVECARTOON\nLatest Comment: Unfortunately nobody wants to spend\nmoney on security. Usually they change their mind but\noften it is too late\nDOWNLOAD THIS ISSUE!\n6 Emerging Cyber Threats That\nEnterprises Face in 2020\nThis Tech Digest gives an in-depth look at six emerging\ncyber threats that enterprises could face in 2020.\nDownload your copy today!\nBACK ISSUES  | MUST READSCURRENT ISSUE\nALL POLLSFLASH POLL\nHas the U.S. political climate caused\nyou to make infosecurity-related\nchanges to your disaster\nrecovery/business continuity plans?\n Yes\n No\n No but we are considering it\n Still waiting for cybersecurity guidance from\nTrump admin EO\n Don't know\n Other (Please explain in the comments)\nSubmit\nDOWNLOAD NOW!\nState of Cybersecurity Incident\nResponse\nData breaches and regulations have forced\norganizations to pay closer attention to the security\nincident response function. However, security leaders\nmay be overestimating their ability to detect and respond\nto security incidents. Read this report to find out more.\nHow Enterprises Are Developing and\nMaintaining Secure Applications0 COMMENTS\nHow Enterprises are Attacking the\nCybersecurity Problem0 COMMENTS\nHow Data Breaches affect the Enterprise\n0 COMMENTS\nMORE REPORTS\nTWITTER FEED\nBUG REPORT\nENTERPRISE VULNERABILITIES\nFrom DHS/US-CERT's National Vulnerability Database\nCVE-2019-5104\nPUBLISHED: 2020-03-19\n** REJECT ** DO NOT USE THIS CANDIDATE\nNUMBER. ConsultIDs: CVE-2019-9013. Reason: This\ncandidate is a duplicate of CVE-2019-9013. Notes: All\nCVE users should reference CVE-2019-9013 instead\nof this candidate. All references and descriptions in\nthis candidate have been removed to prevent\naccidental u...\nCVE-2020-10678\nPUBLISHED: 2020-03-19\nIn Octopus Deploy before 2020.1.5, for customers\nrunning on-premises Active Directory linked to their\nOctopus server, an authenticated user can leverage a\nbug to escalate privileges.\nCVE-2019-12416\nPUBLISHED: 2020-03-19\nwe got reports for 2 injection attacks against the\nDeltaSpike windowhandler.js. This is only active if a\ndeveloper selected the ClientSideWindowStrategy\nwhich is not the default.\nCVE-2019-20524\nPUBLISHED: 2020-03-19\nilchCMS 2.1.23 allows XSS via the\nindex.php/partner/index Banner parameter.\nCVE-2019-20527\nPUBLISHED: 2020-03-19\nIgnite Realtime Openfire 4.4.1 allows XSS via the\nsetup/setup-datasource-standard.jsp serverURL\nparameter.ATTACKS/BREACHES\nLike\nShare\nADVERTISEMENT. CLICK FOR SOUND.\nSynopsys Aims to Boost Security of Soft\n …\nHOT TOPICS EDITORS' CHOICE\n WEBINARS  \n REPORTS  \nDiscover More From Informa Tech\nInterop\nInformationWeek\nNetwork ComputingIT Pro Today\nData Center Knowledge\nBlack HatContact us\nAbout Us\nAdvertise\nReprintsWorking With Us Follow DarkReading On Social\nHome Cookies CCPA: Do not sell my personal info Privacy Terms\nCopyright © 2020 Informa PLC Informa UK Limited is a company registered in England and Wales with\ncompany number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.6 COMMENTS\nRansomware Trains Its\nSights on Cloud ...\n1 COMMENTS\nQualys Launches Free\nApp for IT Asset ...\n "
}