{
    "title": "obfuscation in the wild_ targeted attackers lead the way in evasion techniques _ fireeye inc",
    "text": " PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚȚħřěǻț Řěșěǻřčħ\nǾbfųșčǻțįǿň įň țħě Ẅįŀ đ: Țǻřģěțěđ Ǻțțǻčķě řș Ŀěǻđ țħě\nẄǻỳ įň Ěvǻșįǿň Țěčħňįq ųěș\nJųňě 30, 2017 | bỳ Đǻňįěŀ Bǿħǻňňǿň , Ňįčķ Čǻřř\nǾBFŲȘČǺȚ İǾŇ \nĚVǺȘİǾŇ ȚĚČĦŇİQŲĚȘ\nȚħřǿųģħǿųț 2017 ẅě ħǻvě ǿb șěřvěđ ǻ mǻřķěđ įňčřěǻșě įň țħě ųșě ǿf čǿmmǻň đ ŀįňě ěvǻ șįǿň ǻňđ ǿbfųșčǻțįǿň bỳ ǻ\nřǻňģě ǿf țǻ řģěțěđ ǻțțǻčķě řș. Čỳběř ěșpįǿňǻģě ģ řǿųpș ǻňđ fįňǻňčįǻŀ țħ řěǻț ǻčțǿ řș čǿňțįňųě țǿ ǻđǿpț țħě ŀǻțě șț\nčųțțįňģ-ěđģě ǻppŀįčǻțįǿň ẅħįțěŀįșțįňģ bỳpǻ șș țěčħňįq ųěș ǻňđ įňțřǿđųčě įňňǿvǻțįvě ǿbf ųșčǻțįǿň įňțǿ țħěį ř pħįșħįňģ\nŀųřěș. Țħěșě țěčħňįq ųěș ǿfțěň bỳpǻ șș șțǻțįč ǻň đ đỳňǻmįč ǻňǻŀỳ șįș měțħǿ đș ǻňđ ħįģħŀįģħț ẅħỳ șįģňǻțųřě-bǻșěđ\nđěțěčțįǿň ǻŀǿňě ẅįŀŀ ǻŀẅǻỳș bě ǻț ŀěǻ șț ǿňě șțěp běħįň đ čřěǻțįvě ǻțțǻčķě řș.\nİň ěǻřŀỳ 2017, FİŇ8 běģǻň ųșįňģ ěňvį řǿňměňț vǻ řįǻbŀěș pǻįřěđ ẅįțħ PǿẅěřȘħěŀŀ’ș ǻbįŀįțỳ țǿ řěčěįvě čǿmmǻň đș vįǻ\nȘțđİň (șțǻňđǻřđ įňpųț) țǿ ěvǻ đě đěțěčțįǿň bǻ șěđ ǿň přǿčěșș čǿmmǻň đ ŀįňě ǻřģųměňțș. İň țħě Fěb řųǻřỳ 2017\npħįșħįňģ đǿčųměňț “ČǾMPĿǺ İŇȚ Ħǿměř Ģŀỳňň.đǿč” (MĐ 5: čč89đđ ǻč1ǻfě69069 ěb18bǻč58č6ǻ9ě4), țħě fįŀě\nčǿňțǻįň ș ǻ mǻčřǿ țħǻț șěțș țħě Pǿ ẅěřȘħěŀŀ čǿmmǻň đ įň ǿňě ěňvį řǿňměňț vǻ řįǻbŀě\n(_MİČŘǾȘǾFȚ_ŲPĐǺȚ Ě_ČǺȚǺĿǾĢ) ǻň đ țħěň țħě șțřįňģ “pǿ ẅěřșħěŀŀ -” įň ǻňǿțħě ř ěňvįřǿňměňț vǻ řįǻbŀě\n(MİČŘǾȘǾFȚ_ŲPĐǺȚ Ě_ȘĚŘVİČĚ). Ẅħěň ǻ Pǿ ẅěřȘħěŀŀ čǿmmǻň đ ěňđș įň ǻ đǻșħ țħěň Pǿ ẅěřȘħěŀŀ ẅįŀŀ ěxěčųțě\nțħě čǿmmǻň đ țħǻț įț řěčěįvěș vįǻ Șțđİň, ǻňđ ǿňŀỳ țħį ș đǻșħ ẅįŀŀ ǻppěǻ ř įň pǿẅěřșħěŀŀ.ěxě’ ș čǿmmǻň đ ŀįňě\nǻřģųměňțș. Fįģųřě 1 přǿvįđěș țħě čǿmmǻň đș țħǻț ẅěřě ěxțřǻčțěđ ųșįňģ Mǻň đįǻňț čǿň șųŀțǻňț Ňįčķ Čǻřř’ș FİŇ8\nmǻčřǿ đěčǿđěř.\nFįģųřě 1: FİŇ8 ěňvįřǿňměňț vǻ řįǻbŀě čǿmmǻň đș ěxțřǻčțěđ fřǿm “ČǾMPĿǺ İŇȚ Ħǿměř Ģŀỳňň.đǿč” mǻč řǿș\nȚǿ ěvǻđě mǻňỳ đěțěčțįǿň ș bǻșěđ ǿň pǻřěňț-čħįŀ đ přǿčěșș řěŀǻțįǿňșħįpș, FİŇ8 čřǻfțěđ țħįș mǻčřǿ țǿ ųșě ẄMİ țǿ\nșpǻẅň țħě čm đ.ěxě ěxěč ųțįǿň. Țħě řěfǿřě, ẄįňẄǿ řđ.ěxě ňěvě ř čřěǻțěș ǻ čħįŀđ přǿčěșș, bųț țħě přǿčěșș țřěě ŀǿǿķ ș\nŀįķě: ẅmįpřvșě.ěxě > čm đ.ěxě > pǿ ẅěřșħěŀŀ.ěxě. F İŇ8 ħǻș řěģųŀǻřŀỳ ųșěđ ǿbfųșčǻțįǿň ǻň đ ẄMİ țǿ řěmǿțěŀỳ ŀǻ ųňčħ\nțħěįř PŲŇČĦȚŘǺČĶ PǾȘ- șčřǻpįňģ mǻŀ ẅǻřě, ǻňđ țħě 2017 ǻčțįvįțỳ į ș ǻň įmpŀěměňțǻțįǿň ǿf țħě șě ěvǻșįǿň\nțěčħňįq ųěș ǻț ǻň ěǻ řŀįěř șțǻģě ǿf čǿmp řǿmįșě.\nǺș ňěẅ ǻppŀįčǻțįǿň ẅħįțěŀįșțįňģ bỳpǻ șș țěčħňįq ųěș ħǻvě șųřfǻčěđ, țǻřģěțěđ ǻțțǻčķě řș ħǻvě q ųįčķŀỳ ǻđǿpțěđ țħěșě\nįňțǿ țħěį ř čǻmpǻįģň ș ẅįțħ ěxțřǻ ŀǻỳěřș ǿf ǿbfųșčǻțįǿň țǿ șțǻỳ ǻħěǻ đ ǿf mǻňỳ đěfěňđěřș. Mǻňỳ ģ řǿųpș ŀěvěřǻģě\nțħě řěģșvř32.ěxě ǻppŀįčǻțįǿň ẅħįțěŀįșțįňģ bỳpǻ șș, įňčŀųđįňģ ǺPȚ 19 įň țħěįř 2017 čǻmpǻįģň ǻģǻįň șț ŀǻẅ fįřmș. Țħě\nčỳběř ěșpįǿňǻģě ģ řǿųp ǺPȚ32 ħěǻvįŀỳ ǿbf ųșčǻțěș țħěįř bǻčķđǿǿřș ǻňđ șčřįpțș, ǻňđ Mǻňđįǻňț čǿň șųŀțǻňțș\nǿbșěřvěđ ǺPȚ32 įmpŀěměňț ǻ đđįțįǿňǻŀ čǿmmǻň đ ǻřģųměňț ǿbf ųșčǻțįǿň įň Ǻp řįŀ 2017. İňșțěǻđ ǿf ųșįňģ țħě\nǻřģųměňț /į:ħțțp fǿ ř țħě řěģșvř32.ěxě bỳpǻ șș, ǺPȚ32 ųșěđ čmđ.ěxě ǿbf ųșčǻțįǿň țěčħňįq ųěș țǿ ǻțțěmpț țǿ b řěǻķ\nșįģňǻțųřě-bǻșěđ đěțěčțįǿň ǿf țħį ș ǻřģųměňț. Ǻț Fį řěĚỳě ẅě ħǻvě șěěň țħěm įňčŀ ųđě bǿțħ /į:^ħ^ț^ț^p ǻň đ /į:ħ”ț”ț”p\nįň țħěįř ŀųřěș. Fįģųřě 2 șħǿẅș ǻ řěđǻčțěđ șčřěěňșħǿț ǿf ǿ ųř Ħǿșț İňvěșțįģǻțįvě Pŀǻțfǿ řm (ĦİP) čǻpț ųřįňģ řěǻŀ-țįmě\nǻțțǻčķě ř ǻčțįvįțỳ đųřįňģ ǿňě ǿf ǿ ųř Mǻňđįǻňț įňčį đěňț řěșpǿňșě ěňģǻģěměňț ș fǿř ǺPȚ32 ǻčțįvįțỳ.\nFįģųřě 2: ǺPȚ32 čǿmmǻň đ ǿbfųșčǻțįǿň fǿ ř řěģșvř32.ěxě ǻppŀįčǻțįǿň ẅħįțěŀįșțįňģ bỳpǻ șș\nMěǻňẅħįŀě, FİŇ7 ħǻș čǿňțįňųěđ țǿ ẅřěǻķ ħǻvǿč  ǿň țħě řěșțǻųřǻňț, ħǿșpįțǻŀįțỳ, ǻň đ fįňǻňčįǻŀ șěřvįčěș șěčțǿřș įň\n2017. Țǿ ěň șųřě țħěįř ǻřșěňǻŀ đįđ ňǿț ģřǿẅ șțǻŀě, įň Ǻp řįŀ 2017 FİŇ7 șħįfțěđ țǿ ųșįňģ ẅșčřįpț.ěxě țǿ řųň JǻvǻȘč řįpț\npǻỳŀǿǻđș țħǻț řěțřįěvě ǻň ǻ đđįțįǿňǻŀ pǻỳŀǿǻ đ ħįđđěň įň țħě pħį șħįňģ đǿčųměňț bỳ ųșě ǿf țħě Ẅǿ řđ.Ǻppŀįčǻțįǿň\nČǾM ǿbjěčț.\nȚħįș ẅěěķ, FįřěĚỳě įđěňțįfįěđ FİŇ7 įňțřǿđųčįňģ ǻđđįțįǿňǻŀ ǿbf ųșčǻțįǿň țěčħňįq ųěș ǻț bǿțħ țħě JǻvǻȘč řįpț ǻňđ\nčmđ.ěxě ŀěvěŀ ș. Țħěșě měțħǿ đș řěŀỳ ǿň F İŇ7’ș přěfěřřěđ měțħǿ đ ǿf ħįđįňģ șħǿřțčųț fįŀěș (ĿŇĶ fįŀěș) įň țħěį ř ĐǾČX\nǻňđ ŘȚF pħį șħįňģ đǿčųměňțș țǿ įňįțįǻțě țħě įňfěčțįǿň. Ǻț țħě țįmě ǿf țħį ș bŀǿģ, țħě fįŀě ș įmpŀěměňțįňģ țħį ș\nțěčħňįq ųě ẅěřě đěțěčțěđ bỳ 0 ǻňțįvįřųș ěňģįňě ș. Fǿř JǻvǻȘč řįpț, įňșțěǻđ ǿf șpěčįfỳįňģ “Ẅǿ řđ.Ǻppŀįčǻțįǿň” fǿ ř țħě\nČǾM ǿbjěčț įň șțǻňțįǻțįǿň, F İŇ7 běģǻň čǿňčǻțěňǻțįňģ țħě șțřįňģ țǿ “Ẅǿ ř”+”đ.Ǻppŀįčǻțįǿň”. İň ǻđđįțįǿň, JǻvǻȘč řįpț’ș\nșųșpįčįǿųș “ěvǻŀ” șțřįňģ ẅǻș țřǻňșfǿřměđ įňțǿ “țħį ș[Șțřįňģ.fřǿmČħǻ řČǿđě(101)+’vǻ’+’ŀ’]”. Fįňǻŀŀỳ, țħěỳ ųșěđ ǻ ŀįțțŀě-\nķňǿẅň čħǻřǻčțěř řěpŀǻčěměňț f ųňčțįǿňǻŀįțỳ șųppǿřțěđ bỳ čmđ.ěxě. Țħě ẅșčřįpț.ěxě čǿmmǻň đ įș șěț įň ǻ p řǿčěșș-\nŀěvěŀ ěňvį řǿňměňț vǻ řįǻbŀě “x”, b ųț įș ǿbfųșčǻțěđ ẅįțħ țħě “ @” čħǻřǻčțěř. Ẅħěň țħě “x” vǻ řįǻbŀě įș ěčħǿěđ ǻț țħě\něňđ ǿf țħě șčřįpț țħě “ @” čħǻřǻčțěř įș řěmǿvěđ bỳ țħě șỳňțǻx “%x: @=%”. Fįģ ųřě 3 șħǿẅș țħįș čǿmmǻň đ ěxțřǻčțěđ\nfřǿm ǻ ĿŇĶ fįŀě ěmbě đđěđ ẅįțħįň ǻ ňě ẅ FİŇ7 pħįșħįňģ đǿčųměňț.\nFįģųřě 3: FİŇ7 čǿmmǻň đ ǿbfųșčǻțįǿň f řǿm ĿŇĶ fįŀě pħį șħįňģ đǿčųměňț\nİň țħįș ěxǻmpŀě, F İŇ7 įmpŀěměňț ș FİŇ8’ș pǻșșįňģ ǿf čǿmmǻň đș vįǻ Șțđİň – țħįș țįmě pǻ șșįňģ įț țǿ čm đ.ěxě įňșțěǻđ\nǿf pǿẅěřșħěŀŀ.ěxě – b ųț țħě ěvǻ șįǿň ěffěčț į ș țħě șǻmě. Ẅħįŀě țħį ș ěxǻmpŀě ẅįŀŀ ěxpǿșě țħěșě ǻřģųměňțș įň țħě fį řșț\nčmđ.ěxě’ș čǿmmǻň đ ěxěčųțįǿň, įf țħį ș ěňvįřǿňměňț vǻ řįǻbŀě ẅěřě șěț ẅįțħįň țħě Ŀ ŇĶ ǿř ǻ mǻčřǿ ǻňđ pųșħěđ țǿ\nčmđ.ěxě vįǻ Șț đİň fřǿm VBǺ, țħěň ňǿțħįňģ ẅǿųŀđ ǻppěǻř ǿň țħě čǿmmǻň đ ŀįňě.\nȚħě FįřěĚỳě įȘİĢĦȚ İňțěŀŀįģěňčě MỳȘ İĢĦȚ Pǿřțǻŀ čǿňțǻįň ș đěțǻįŀěđ įňfǿřmǻțįǿň ǿň țħě șě ǻțțǻčķě řș – ǻňđ ǻŀŀ\nfįňǻňčįǻŀ ǻň đ čỳběř ěșpįǿňǻģě ģ řǿųpș țħǻț ẅě țřǻčķ – įňčŀ ųđįňģ ǻňǻŀỳ șįș ǿf țħěįř mǻŀẅǻřě, țǻčțįč ș, ǻňđ fųřțħěř\nįňțěŀŀįģěňčě ǻțț řįbųțįǿň.\nẄě fųŀŀỳ ěxpěčț țǻ řģěțěđ ǻțțǻčķě řș țǿ čǿňțįň ųě țħįș pǻțțěřň ǿf ǻđǿpțįňģ ňě ẅ bỳpǻșș țěčħňįq ųěș ǻňđ ǻđđįňģ\nįňňǿvǻțįvě ǿbf ųșčǻțįǿň ǻț bǿțħ țħě mǻč řǿ ǻňđ čǿmmǻň đ ŀįňě ŀěvěŀ ș. Ǻș fǿř ẅħǻț ẅě mįģħț șěě ňěxț, ẅě’đ\nřěčǿmměň đ řěǻđįňģ ųp ǿň ĐǾȘ čǿmmǻň đ ŀįňě țřįčķș șǿ țħǻț mǿňįțǿ řįňģ ỳǿųř ňěțẅǿřķ įșň’ț țħě fį řșț țįmě ỳǿ ų șěě\nňěẅ ǻțțǻčķě ř țřįčķș. Ňěțẅǿřķ đěfěňđěřș mųșț ųňđěřșțǻňđ ẅħǻț ǿbf ųșčǻțįǿň į ș pǿșșįbŀě, ǻșșěșș țħěįř ěňđpǿįňț ǻň đ\nňěțẅǿřķ vįșįbįŀįțỳ, ǻň đ mǿșț įmpǿřțǻňțŀỳ ňǿț řěŀỳ ǿň ǻ șįňģŀě měțħǿ đ țǿ đěțěčț țħě șě ǻțțǻčķ ș. \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n17 Mǻř 2020\n16 Mǻř 2020\n09 Mǻř 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐ\n Fįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nȘįx Fǻčț ș ǻbǿųț Ǻđđřěșș Șpǻčě\nĿǻỳǿųț Řǻňđǿmįżǻțįǿň ǿň\nẄįňđǿẅș \nȚħěỳ Čǿmě įň țħě Ňįģħț:\nŘǻňșǿmẅǻřě Đěpŀǿỳměňț Ț řěňđș \nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  Ǿbfųșčǻțįǿň įň țħě Ẅįŀ đ: Țǻřģěțěđ Ǻțțǻčķě řș Ŀěǻđ ț...   \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě Ěňģŀįșħ\nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n "
}