{
    "title": "operation clandestine wolf – adobe flash zero-day in apt3 phishing campaign _ fireeye inc",
    "text": "Țħřěǻț Řěșěǻřčħ\nǾpěřǻțįǿň Čŀǻň đěșțįňě Ẅǿŀf – Ǻ đǿbě Fŀǻ șħ Żěřǿ-Đǻỳ įň\nǺPȚ3 Pħįșħįňģ Čǻmpǻįģň\nJųňě 23, 2015  | bỳ Ěřįčǻ Ěňģ, Đǻň Čǻ șěŀđěň | Țħřěǻț İňțěŀŀįģěňčě\n0ĐǺỲ ĚXPĿǾİȚȘ \nȚĦŘĚǺȚ İŇȚĚĿĿİĢĚŇČĚ\nǺđǿbě ħǻș ǻŀřěǻđỳ řěŀěǻșěđ ǻ pǻțčħ fǿ ř ČVĚ-2015 -3113 ẅįțħ ǻň ǿ ųț-ǿf-bǻň đ șěčųřįțỳ bųŀŀěțįň\n(ħțțpș://ħěŀpx.ǻ đǿbě.čǿm/ șěčųřįțỳ/přǿđųčțș/fŀǻșħ-pŀǻỳě ř/ǻpșb15-14.ħțmŀ ). FįřěĚỳě řěčǿmměň đș țħǻț Ǻđǿbě\nFŀǻșħ Pŀǻỳě ř ųșěřș ųpđǻțě țǿ țħě ŀǻțě șț věřșįǿň ǻș șǿǿň ǻș pǿșșįbŀě.\nFįřěĚỳě MVX đěțěčțș țħįș țħřěǻț ǻș ǻ ẅěb įňfěčțįǿň, țħě İPȘ ěňģįňě řěpǿřțș țħě ǻțțǻčķ ǻ ș ČVĚ-2015 -3113, ǻňđ țħě\nȘĦǾȚPŲȚ bǻčķ đǿǿř įș řěpǿřțěđ ǻș Bǻčķđǿǿř.ǺPȚ.ČǿǿķįěČ ųțțěř.\nǺPȚ3\nȚħě Čħįňǻ-bǻ șěđ țħřěǻț ģřǿųp FįřěĚỳě țřǻčķș ǻș ǺPȚ3, ǻķǻ ŲPȘ, į ș řěșpǿňșįbŀě fǿř țħįș ěxpŀǿįț ǻň đ țħě ǻčțįvįțỳ\nįđěňțįfįěđ įň ǿųř přěvįǿųș bŀǿģ pǿ șț, Ǿpěřǻțįǿň Čŀǻň đěșțįňě Fǿx . Țħįș ģřǿųp įș ǿňě ǿf țħě mǿ řě șǿpħįșțįčǻțěđ\nțħřěǻț ģřǿųpș țħǻț Fį řěĚỳě Țħřěǻț İňțěŀŀįģěňčě ț řǻčķș, ǻňđ țħěỳ ħǻvě ǻ ħį șțǿřỳ ǿf įňțřǿđųčįňģ ňě ẅ břǿẅșěř-bǻșěđ\nżěřǿ-đǻỳ ěxpŀǿįț ș (ě.ģ., İňțěřňěț Ěxpŀǿřěř, Fįřěfǿx, ǻň đ Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř). Ǻfțěř șųččěșșfųŀŀỳ ěxpŀǿįțįňģ ǻ țǻ řģěț\nħǿșț, țħįș ģřǿųp ẅįŀŀ qųįčķŀỳ đųmp čřěđěňțįǻŀș, mǿvě ŀǻțě řǻŀŀỳ țǿ ǻ đđįțįǿňǻŀ ħǿ șțș, ǻňđ įňșțǻŀŀ čųșțǿm bǻčķ đǿǿřș.\nǺPȚ3’ș čǿmmǻň đ ǻňđ čǿňțřǿŀ (ČňČ) įňf řǻșțřųčțųřě įș đįffįčųŀț țǿ țřǻčķ, ǻș țħěřě įș ŀįțțŀě ǿvě řŀǻp ǻčřǿșș čǻmpǻįģň ș.\nǺčțįvįțỳ Ǿvě řvįěẅ\nİň țħě ŀǻ șț șěvěřǻŀ ẅěěķș, ǺPȚ3 ǻčțǿřș ŀǻųňčħěđ ǻ ŀǻřģě-șčǻŀě pħį șħįňģ čǻmpǻįģň ǻģǻįň șț ǿřģǻňįżǻțįǿňș įň țħě\nfǿŀŀǿẅįňģ įňđųșțřįěș:\nǺěřǿșpǻčě ǻň đ Đěfěňșě\nČǿňșțřųčțįǿň ǻň đ Ěňģįňěěřįňģ\nĦįģħ Țěčħ\nȚěŀěčǿmm ųňįčǻțįǿň ș\nȚřǻňșpǿřțǻțįǿň\nŲpǿň čŀįčķįňģ țħě ŲŘĿ ș přǿvįđěđ įň țħě pħį șħįňģ ěmǻįŀ ș, țǻřģěțș ẅěřě řěđįřěčțěđ țǿ ǻ čǿmp řǿmįșěđ șěřvěř\nħǿșțįňģ JǻvǻȘč řįpț přǿfįŀįňģ șčřįpțș. Ǿňčě ǻ țǻ řģěț ħǿșț ẅǻș přǿfįŀěđ, vįčțįmș đǿẅňŀǿǻđěđ ǻ mǻŀįčįǿ ųș Ǻđǿbě\nFŀǻșħ Pŀǻỳě ř ȘẄF fįŀě ǻň đ ǻň FĿV fįŀě, đěțǻįŀěđ běŀǿẅ. Țħįș ųŀțįmǻțěŀỳ řěșųŀțěđ įň ǻ čųșțǿm bǻčķ đǿǿř ķňǿẅň ǻș\nȘĦǾȚPŲȚ, đěțěčțěđ bỳ FįřěĚỳě ǻș Bǻčķđǿǿř.ǺPȚ.ČǿǿķįěČ ųțțěř, běįňģ đěŀįvěřěđ țǿ țħě vįčțįm’ ș șỳșțěm.\nȚħě pǻỳŀǿǻ đ įș ǿbșčųřěđ ųșįňģ xǿř ěňčǿđįňģ ǻňđ ǻppěňđěđ țǿ ǻ vǻŀį đ ĢİF fįŀě. \nǺțțǻčķ Věčțǿ ř\nȚħě pħį șħįňģ ěmǻįŀ ș ųșěđ bỳ ǺPȚ 3 đųřįňģ țħįș čǻmpǻįģň ẅěřě ěxțřěměŀỳ ģěňě řįč įň ňǻț ųřě, ǻŀmǿ șț ǻppěǻ řįňģ țǿ\nbě șpǻm. Ǻň ěxǻmpŀě ěmǻįŀ bǿ đỳ:\nSave between $200-450 by purchasing an Apple Certified Refurbished iMac through this link. Refurbished\niMacs come with the same 1-year extendable warranty as new iMacs. Supplies are limited, but update\nfrequently.\nDon't hesitate . . .>Go to Sale\nȚħě șțřįňģ “>Ģǿ țǿ Șǻŀě” ẅǻș ǻ ŀįňķ țħǻț ųșěđ țħě fǿŀŀǿ ẅįňģ ŲŘĿ șțřųčțųřě:\nhxxp://<subdomain>.<legitdomain>.<TLD>/<directory>/<alphanumericID>.html\nĚxpŀǿįț Đěțǻįŀ ș\nȚħě ǻțțǻčķ ěxpŀǿįț ș ǻň ųňpǻțčħě đ vųŀňěřǻbįŀįțỳ įň țħě ẅǻỳ Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř pǻřșěș Fŀǻșħ Vįđěǿ (FĿV) fįŀě ș. Țħě\něxpŀǿįț ųșěș čǿmmǿň věčțǿ ř čǿřřųpțįǿň țěčħňįq ųěș țǿ bỳpǻ șș Ǻđđřěșș Șpǻčě Ŀǻỳǿ ųț Řǻňđǿmįżǻțįǿň (ǺȘĿŘ),\nǻňđ ųșěș Řěțųřň-Ǿřįěňțěđ Přǿģřǻmmįňģ (ŘǾP) țǿ bỳpǻ șș Đǻțǻ Ěxěčųțįǿň Přěvěňțįǿň (Đ ĚP).  Ǻ ňěǻț ț řįčķ țǿ\nțħěįř ŘǾP țěčħňįq ųě mǻķě ș įț șįmpŀěř țǿ ěxpŀǿįț ǻň đ ẅįŀŀ ěvǻđě șǿmě ŘǾP đěțěčțįǿň țěčħňįq ųěș.\nȘħěŀŀčǿđě įș șțǿřěđ įň țħě pǻčķě đ Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř ěxpŀǿįț fįŀě ǻŀǿňģ șįđě ǻ ķěỳ ųșěđ fǿř įțș đěčřỳpțįǿň. Țħě\npǻỳŀǿǻđ įș xǿř ěňčǿđěđ ǻňđ ħįđđěň įňșįđě ǻň įmǻģě.\nĚxpŀǿįț Pǻčķǻģįňģ\nȚħě Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř ěxpŀǿįț į ș pǻčķěđ ẅįțħ ǻ șįmpŀě ŘČ4 pǻčķě ř. Țħě ŘČ4 ķěỳ ǻň đ čįpħěřțěxț ǻřě BįňǻřỳĐǻțǻ\nbŀǿbș țħǻț țħě pǻčķě ř ųșěș țǿ đěčřỳpț țħě ŀǻỳě ř 2 Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř fįŀě. Ǿňčě đěčřỳpțěđ, ŀǻỳěř 2 įș ěxěčųțěđ\nẅįțħ ŀǿǻđěř.ŀǿǻđBỳțěș.\nVěčțǿř Čǿřřųpțįǿň\nĿǻỳěř 2 ųșěș ǻ čŀǻșșįč Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř Věčțǿř čǿřřųpțįǿň țěčħňįq ųě țǿ đěvěŀǿp įț ș ħěǻp čǿ řřųpțįǿň\nvųŀňěřǻbįŀįțỳ țǿ ǻ f ųŀŀ řěŀǻțįvě řěǻđ/ẅřįțě ǻvǻįŀǻbŀě țǿ ǺčțįǿňȘč řįpț3. İň țħįș țěčħňįq ųě, țħě ǻțțǻčķě ř șpřǻỳș Ǻđǿbě\nFŀǻșħ Pŀǻỳě ř Věčțǿřș țǿ țħě ħěǻp, ǻň đ țřįģģěřș ǻ ẅřįțě vųŀňěřǻbįŀįțỳ țǿ čħǻňģě țħě șįżě ǿf ǿňě ǿf țħě věčțǿ řș. Țħě\nǻțțǻčķě ř čǻň țħěň pě řfǿřm șųbșěqųěňț řěǻđș ǻňđ ẅřįțěș țǿ měmǿ řỳ ǿųțșįđě țħě įňțěň đěđ bǿųňđǻřįěș ǿf țħě\nčǿřřųpțěđ Věčțǿř ǿbjěčț f řǿm ǺȘ3. Fǿř mǿřě đěțǻįŀș ǿň țħįș țěčħňįq ųě, șěě Fŀǻșħ įň 2015 .\nǾňčě țħě ǻțțǻčķě ř ħǻș ŀįmįțěđ řěǻđ/ẅřįțě ǻččě șș țǿ měmǿ řỳ, țħěỳ čħǿǿ șě țǿ čǿ řřųpț ǻ șěčǿňđ Věčțǿř țǿ įňčřěǻșě\nțħěįř ǻččěșș țǿ ǻ řǻňģě ǿf 0x3fffffff bỳțě ș. Țħįș șěčǿňđ Věčțǿř įș ųșěđ fǿř țħě řěmǻįňđěř ǿf țħě ěxpŀǿįț. \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n09 Mǻř 2020\n24 Fěb 2020\n20 Fěb 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐFįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \nŘǻňșǿmẅǻřě Ǻģǻįň șț țħě Mǻčħįňě:\nĦǿẅ Ǻđvěřșǻřįěș ǻřě Ŀěǻřňįňģ țǿ\nĐįșřųpț İňđųșțřįǻŀ Přǿđųčțįǿň bỳ\nȚǻřģěțįňģ İȚ ǻňđ ǾȚ \nM-Țřěňđș 2020 : İňșįģħțș Fřǿm țħě\nFřǿňț Ŀįňě ș \n\nIn June, FireEye’s FireEye as a Service  team in Singapore uncovered a phishing\ncampaign exploiting an Adobe Flash Player zero-day vulnerability (CVE-2015-3113).\nThe attackers’ emails included links to compromised web servers that served either\nbenign content or a malicious Adobe Flash Player file that exploits CVE-2015-3113.\nĦěǻř ẅħǻț ǿųř ěxpěřțș ħǻvě țǿ șǻỳ.\nJǿįň ųș fǿř ǻ ŀįvě ẅěbįňǻř Fřįđǻỳ, Jųňě 26, 2015  \n8:00 ǻm PĐȚ/ 11:00 ǻm ĚĐȚ\nŘĚĢİȘȚĚŘ ŇǾẄ \nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  Ǿpěřǻțįǿň Čŀǻň đěșțįňě Ẅǿŀf – Ǻ đǿbě Fŀǻ șħ Żěřǿ-Đǻỳ ...   \nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n Řěțųřň-Ǿřįěňțěđ Přǿģřǻmmįňģ\nȚħě ǻțțǻčķě řș ųșě ǻ ŘǾP čħǻįň țǿ čǻŀŀ ķě řňěŀ32!VįřțųǻŀǺŀŀǿč țǿ mǻ řķ țħěįř șħěŀŀčǿđě ǻș ěxěčųțǻbŀě běfǿ řě jųmpįňģ\nțǿ țħěįř șħěŀŀčǿđě.\nİňșțěǻđ ǿf ẅřįțįňģ țħěį ř ŘǾP čħǻįň țǿ țħě ħěǻp ǻŀǿňģ ẅįțħ țħěįř șħěŀŀčǿđě ǻňđ pǻỳŀǿǻ đ, țħěỳ ųșěđ ǻ đįffěřěňț\nțěčħňįq ųě. Ųșųǻŀŀỳ, ěxpŀǿįț đěvěŀǿpě řș ẅįŀŀ čǿřřųpț ǻ bųįŀț-įň Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř ǿbjěčț șųčħ ǻș ǻ Șǿųňđ ǿbjěčț.\nİňșțěǻđ, țħě ǻțțǻčķě řș čħǿșě țǿ đěfįňě țħěį ř ǿẅň čŀǻșș įň ǺȘ3 ẅįțħ ǻ fųňčțįǿň țħǻț țǻķě ș ǻ ŀǿț ǿf ǻ řģųměňțș:\nclass CustomClass {\n    public function victimFunction(arg1:uint, arg2:uint, …, arg80:uint):uint\n}\nȚħěň, țħě ǻțțǻčķě řș čǻň șįmpŀỳ ǿvě řẅřįțě țħě f ųňčțįǿň pǿįňțě ř ẅįțħ ǻ ģǻ đģěț țħǻț ǻ đđș țǿ țħě șțǻčķ pǿįňțě ř ǻňđ\nřěțųřňș țǿ pįvǿț țǿ ŘǾP. Țħěỳ ħǻvě ňǿ ňěě đ țǿ įđěňțįfỳ țħě ǻb șǿŀųțě ǻđđřěșș ǿf țħě ŘǾP čħǻįň ǻň đ přěșěřvě įț įň\nǻ řěģįșțěř fǿř ǻ țỳpįčǻŀ xčħģ řěģ32, ěșp pįvǿț. Ǻ đđįțįǿňǻŀŀỳ, șțǿřįňģ țħě ŘǾP čħǻįň ǿň țħě șțǻčķ ẅįŀŀ ěvǻđě ŘǾP\nđěțěčțįǿň měčħǻňį șmș đěșįģňěđ ǻřǿųňđ đěțěčțįňģ ẅħěň țħě șțǻčķ pǿįňțě ř pǿįňțș ǿųțșįđě ǿf ǻ țħ řěǻđ’ș șțǻčķ\nřěģįǿň.\nthis.customObj.victimFunction(\n6f73b68b, // ret; (ROPsled)\n…,\n6f73b68a, //pop eax\n1f140100,\n6fd36da1, //call Kernel32!VirtualAlloc(0x1f140000, 0x10000, 0x1000, 0x40)\n1f140000, // Address\n00010000, // Size\n00001000, // Type\n00000040, // Protection = RWX\n6f73b68b*9 // ret (ROPsled)\n6fd36da7*2 // ret\n6f73aff0 pop ecx\n6fd36da7\n6fd36da7 jmp [eax]\n…\n)\nthis.customObj.victimFunction  pǿįňțěř mǿđįfįěđ țǿ:\n00000000`6de533dc 5e          pop     rsi\n00000000`6de533dd 83c448      add     esp,48h\n00000000`6de533e0 c3          ret\nĿǻșțŀỳ, țħě ŘǾP čħǻįň ħǻ ș ǻ ŘǾP șŀěđ fǿŀŀǿẅįňģ țħě čǻŀŀ țǿ Vį řțųǻŀǺŀŀǿč. Țħį ș čǿųŀđ jųșț bě ǻň ǻ řțįfǻčț ǿf\nđěvěŀǿpměňț, ǿ ř įț čǿųŀđ bě đěșįģňěđ țǿ bỳpǻ șș đěțěčțįǿň měčħǻňį șmș țħǻț țě șț fǿř vǻŀįđ řěțųřň ǻđđřěșșěș ųp țǿ\nǻ ŀįmįțěđ đěpțħ ǻț čǻŀŀ ș țǿ VįřțųǻŀǺŀŀǿč.\nFųŀŀ Ěxpŀǿįț Fŀǿ ẅ\n1.     Čřěǻțě ǻ ňě ẅ Vįđěǿ ǿbjěčț\n2.     Fěțčħ țħě pǻỳŀǿǻ đ\n3.     Ǻțțǻčħ țħě vį đěǿ țǿ ǻ ňě ẅ ŇěțȘțřěǻm\n4.     Șp řǻỳ țħě ħěǻp ẅįțħ Ǻđǿbě Fŀǻ șħ Pŀǻỳě ř Věčțǿřș\n        ǻ.     Č řěǻțě ǻ Věčțǿ ř čǿňțǻįňįňģ 98688  Věčțǿřș čǿňțǻįňįňģ 1022  ųįňțș\n        b.     Șěț țħě fį řșț țẅǿ đẅǿřđș įň ěǻčħ Věčțǿ ř<ųįňț> țǿ 0x41414141, 0x42424242\n5.     Čřěǻțě ħǿŀě ș fǿř țħě čǿňț řǿŀŀěđ FĿV ǿbjěčț\n        ǻ.     F řěě ǻppřǿxįmǻțěŀỳ ěvě řỳ 3řđ Věčțǿř įň țħě șpřǻỳ\n6.     Șpřǻỳ čųșțǿm čŀǻ șș ǿbjěčțș fǿř fųțųřě čǿňțřǿŀ țřǻňșfěř\n        ǻ.     Đěfįňě ǻ ňě ẅ čŀǻșș ČųșțǿmČŀǻ șș\n                į.     Đěfįňě ǻ f ųňčțįǿň vįčțįmF ųňčțįǿň ẅįțħ ŀǿțș ǿf ǻřģųměňțș\n        b.     Č řěǻțě ǻ Věčțǿ ř ǿf 0x100 Věčțǿřș ǿf 1007 řěfěřěňčěș țǿ ǻň Č ųșțǿmČŀǻ șș įňșțǻňčě\n7.     Fěțčħ ǻň đ pŀǻỳ țħě FĿV ěxpŀǿįț\n        ǻ.     Țħě FĿV fįŀě ẅįŀŀ ǻŀŀǿčǻțě ǻň ǻțțǻčķě ř čǿňțřǿŀŀěđ ǿbjěčț įň ǿňě ǿf țħě ħǿŀě ș fřǿm șțěp 5\n        b.     Țħě ǻțțǻčķě ř čǿňțřǿŀŀěđ ǿbjěčț ẅįŀŀ ǿvěřẅřįțě țħě ŀěňģțħ fįěŀ đ ǿf ǻň ǻ đjǻčěňț věčțǿ ř\n8.     Řě-fįŀŀ ħǿŀě ș fřǿm șțěp 5 ẅįțħ Věčțǿ řș ǻș įň șțěp 4\n9.     Fįňđ țħě čǿřřųpțěđ věčțǿř\n        ǻ.     Șěǻ řčħ țħřǿųģħ Věčțǿ řș fřǿm șțěp 4\n        b.     Čħěčķ țħě ŀěňģțħ ǿf ěǻčħ Věčțǿ ř țǿ fįňđ ǿňě țħǻț į ș ǻbňǿřmǻŀŀỳ ŀǻ řģě\n10.  Čǿřřųpț ǻ șěčǿňđ Věčțǿř (Věčțǿ ř2)\n        ǻ.     Ų șįňģ țħě čǿ řřųpțěđ Věčțǿř fřǿm șțěp 9 țǿ řěǻđ/ẅřįțě řěŀǻțįvě měmǿ řỳ ǻđđřěșșěș\n                į.     Șěǻ řčħ měmǿ řỳ fǿř ǻň ǻđjǻčěňț věčțǿ ř\n                įį.     Ǿvě řẅřįțě țħě ŀěňģțħ fįěŀ đ ẅįțħ 0x3fffffff\n                įįį.     Vě řįfỳ țħǻț ǻ čǿ řřųpțěđ věčțǿř ẅįțħ ŀěňģțħ 0x3fffffff ňǿ ẅ ěxįșțș įň țħě șpřǻỳ\n                        1.     İf ňǿț, ųňđǿ čǿřřųpțįǿň ǻň đ ǻțțěmpț țǿ čǿ řřųpț țħě ňěxț věčțǿ ř\n11.  Đěčřỳpț șħěŀŀčǿđě ǻňđ șțǿřě įț ǻňđ țħě pǻỳŀǿǻ đ ǿň țħě ħěǻp\n12.  Ǿvěřẅřįțě țħě Č ųșțǿmČŀǻ șș.vįčțįmF ųňčțįǿň f ųňčțįǿň pǿįňțě ř\n        ǻ.     Fįň đ țħě șpřǻỳěđ ČųșțǿmČŀǻ șș ǿbjěčț įň șțǻňčě řěfěřěňčěș fřǿm șțěp 6\n        b.     Țħě ňě ẅ fųňčțįǿň į ș ǻ fǿřm ǿf “pįvǿț” țħǻț ț řǻňșfěřș čǿňțřǿŀ țǿ țħě ǻțțǻčķě ř\n13.  Bųįŀđ ŘǾP čħǻįň ǿň țħě șțǻčķ ǻň đ čǻŀŀ įț\n        ǻ.     Fįň đ ŘǾP ģǻ đģěțș įň měmǿ řỳ ųșįňģ Věčțǿ ř2\n                į.     İňčŀųđįňģ ǻ čǻŀŀ țǿ ķě řňěŀ32!VįřțųǻŀǺŀŀǿč\n        b.     Čǻŀŀ țħě čǿ řřųpțěđ ČųșțǿmČŀǻ șș.vįčțįmF ųňčțįǿň f řǿm șțěp 6.ǻ.į\n                į.     Ǻ řģųměňțș țǿ țħě f ųňčțįǿň ǻ řě țħě ģǻ đģěțș ǿf țħě ŘǾP čħǻįň\n                įį.     Țħěỳ ǻ řě čǿňvěňįěňțŀỳ p ųșħěđ ǿňțǿ țħě șțǻčķ\n                įįį.     Čǿ řřųpțěđ vțǻbŀě f řǿm șțěp 12 čǻŀŀș ǻ pįvǿț\n                        1.     Țħě “pįvǿț” j ųșț ǻđđș țǿ țǿ țħě șțǻčķ pǿįňțě ř ǻňđ řěțųřňș běčǻųșě țħě ŘǾP čħǻįň į ș ǿň\n                                țħě șțǻčķ\n14.  ŘǾP čħǻįň čǻŀŀ ș șħěŀŀčǿđě\n        ǻ.     Čǻŀŀ ķě řňěŀ32!VįřțųǻŀǺŀŀǿč\n        b.     jmp țǿ șħěŀŀčǿđě\n15.  Șħěŀŀčǿ đě čǻŀŀș pǻỳŀǿǻ đ\n        ǻ.     Șħěŀŀčǿ đě șěǻřčħěș měmǿřỳ fǿř țħě pǻỳŀǿǻ đ, ẅħįčħ įș șțǿřěđ įňșįđě ǻň įmǻģě\n        b.     Șħěŀŀčǿ đě đěčǿđěș țħě pǻỳŀǿǻ đ bỳ xǿřįňģ ěǻčħ bỳțě (țħǻț į ș ňǿț 0 ǿř 0x17) ẅįțħ 0x17\nČǿňčŀųșįǿň\nǾňčě ǺPȚ 3 ħǻș ǻččěșș țǿ ǻ țǻ řģěț ňěț ẅǿřķ, țħěỳ ẅǿřķ qųįčķŀỳ ǻň đ țħěỳ ǻřě ěxțřěměŀỳ p řǿfįčįěňț ǻț ěň ųměřǻțįňģ\nǻňđ mǿvįňģ ŀǻțě řǻŀŀỳ țǿ mǻįňțǻįň țħěį ř ǻččěșș. Ǻđđįțįǿňǻŀŀỳ, țħį ș ģřǿųp ųșěș żěřǿ-đǻỳ ěxpŀǿįț ș, čǿňțįň ųǻŀŀỳ ųpđǻțěđ\nčųșțǿm bǻčķ đǿǿřș, ǻňđ țħřǿẅǻẅǻỳ ČňČ įňf řǻșțřųčțųřě, mǻķįňģ įț đįffįčųŀț țǿ țřǻčķ țħěm ǻč řǿșș čǻmpǻįģň ș.\nǺčķňǿẅŀěđģěměňț ș\n  PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚȚħǻňķ ỳǿ ų țǿ țħě fǿŀŀǿ ẅįňģ čǿňț řįbųțǿřș țǿ țħįș bŀǿģ!\n·      Jǿșěpħ Ǿbě đ, Běň Ẅįțħňěŀŀ, Ķěvįň Ż ųķ, Ģěňẅěį Jįǻňģ, ǻň đ Čǿřbįň Șǿųffřǻňț ǿf Fį řěĚỳě\n \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě Ěňģŀįșħ\n "
}