{
    "title": "operation daybreak _ securelist",
    "text": "Earlier this year, we deployed new technologies in Kaspersky Lab products to identify and block zero-day attacks. This\ntechnology already proved its effectiveness earlier this year, when it caught an Adobe Flash zero day exploit (CVE-2016-\n1010 ). Earlier this month, our technology caught another zero-day Adobe Flash Player exploit deployed in targeted attacks.\nWe believe the attacks are launched by an APT Group we track under the codename “ScarCruft”.\nScarCruft is a relatively new APT group; victims have been observed in Russia, Nepal, South Korea, China, India, Kuwait and\nRomania. The group has several ongoing operations, utilizing multiple exploits — two for Adobe Flash and one for Microsoft\nInternet Explorer.\nOperation Daybreak appears to have been launched by ScarCruft in March 2016 and employs a previously unknown (0-day)\nAdobe Flash Player exploit. It is also possible that the group deployed another zero day exploit, CVE-2016-0147, which was\npatched in April.\nThis exploit caught by our technologies highlights a few very interesting evasion methods, some of which we haven’t seen\nbefore. We describe them below.\nOperation Daybreak general information\nOperation Daybreak appears to have been launched by unknown attackers to infect high profile targets through spear-\nphishing e-mails. To date, we have observed more than two dozen victims for these attacks.\nAlthough the exact  attack vector remains unknown, the targets appear to receive a malicious link which points to a hacked\nwebsite where the exploitation kit is hosted. The hacked web server hosting the exploit kit is associated with the ScarCruft\nAPT and used in another line of attacks. Certain details, such as using the same infrastructure and targeting, make us believe\nthat Operation Daybreak is being done by the ScarCruft APT group.\nThe ScarCruft APT group is a relatively new player and managed to stay under the radar for some time. In general, their\nwork is very professional and focused. Their tools and techniques are well above the average. Prior to the discovery of\nOperation Daybreak, we observed the ScarCruft APT launching a series of attacks in Operation Erebus. Operation Erebus\nleverages another Flash Player exploit (CVE-2016-4117) through the use of watering hole attacks.\nIn the case of Operation Daybreak, the hacked website hosting the exploit kit performs a couple of browser checks before\nredirecting the visitor to a server controlled by the attackers hosted in Poland.\nThe main exploit page script contains a BASE64 decoder, as well as rc4 decryption implemented in JS.\nThe parameters sent to the “ap.php” script are randomly generated on each hit, so the second stage payload gets encrypted\ndifferently each time. This prevents easy detection by MD5 or signatures of the second stage payload.\nThe exploitation process consists of three Flash objects. The Flash object that triggers the vulnerability in Adobe Flash Player\nis located in second SWF delivered to the victim.\nAt the end of the exploitation chain, the server sends a legitimate PDF file to user – “china.pdf”. The “china.pdf” file shown\nto the victims in the last stage of the attack seems to be written in Korean:\nDecoy document shown to victims\nThe document text talks about disagreements between China and “The North” over nuclear programs and demilitarization.\nVulnerability technical details\nThe vulnerability (CVE-2016-4171) is located in the code which parses the ExecPolicy metadata information.\nThis is what the structure looks like:\nThis structure also contains an array of item_info structures:\nThe documentation says the following about these structures:\n“The item_info entry consists of item_count elements that are interpreted as key/value pairs of indices into the string table\nof the constant pool. If the value of key is zero, this is a keyless entry and only carries a value.”\nIN THE SAME CATEGORY\nChafer used Remexi malware to spy on\nIran-based foreign diplomatic entities\nGreyEnergy’s overlap with Zebrocy\nA Zebrocy Go Downloader\nAPT review of the year\nDarkPulsar FAQ\nAPT REPORTS\nOperation Daybreak\nFlash zero-day exploit deployed by the ScarCruft APT Group\nBy Costin Raiu , Anton Ivanov  on June 17, 2016. 6:00 am\nCONTENTS\nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\n English\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPRCompanyAccount GET IN TOUCHSolutions for: Home Products  Small Business 1-50 employees Medium Business 51-999 employees Enterprise 1000+ employees\n In the exploit used by the ScarCruft group, we have the following item_info structures:\nItem_info array in exploit object\nThe code that triggers the vulnerability parses this structure and, for every key and value members, tries to get the\nrespective string object from string constant pool. The problem relies on the fact that the “.key” and “.value” members are\nused as indexes without any kind of boundary checks. It is easy to understand that if key or value members are larger than\nstring constant pool array, a memory corruption problem appears. It is also important to mention that this member’s (value,\nkey) are directly read from SWF object, so an attacker can easily use them to implement arbitrary read/write operations.\nGetting object by index from constant pool without any checks\nUsing this vulnerability, the exploit implements a series of writes at specified addresses to achieve full remote code\nexecution.\nBypassing security solutions through DDE\nThe Operation Daybreak attack employs multiple stages, which are all outstanding in some way. One of them attracted our\nattention because it implements a bypass for security solutions we have never seen before.\nIn the first stage of the attack, the decrypted shellcode executed by the exploit downloads and executes a special DLL file.\nThis is internally called “yay_release.dll”:\nSecond stage DLL internal name and export\nThe code of this module is loaded directly into the exploited application and has several methods of payload execution.\nOne of method uses a very interesting technique of payload execution which is designed mostly to bypass modern anti-\nmalware products. This uses an interesting bug in the Windows DDE component. It is not a secret that anti-malware systems\ntrigger on special system functions that are called in the context of potential vulnerable applications to make a deeper\nanalysis of API calls such as CreateProcess, WinExec or ShellExecute.\nFor instance, such defense technologies trigger if a potentially vulnerable application such as Adobe Flash starts other\nuntrusted applications, scripts interpreters or even the command console.\nTo make execution of payload invisible for these defense systems, the threat actors used the Windows DDE interface in a\nvery clever way. First, they register a special window for it:\nIn the window procedure, they post WM_DDE_EXECUTE messages with commands:\nSending WM_DDE_EXECUTE message to window\nThe attackers used the following commands:\nThe main idea here is that if you create a LNK to an executable or command, then use the ShowGroup method, the\nprogram will be executed. This is an undocumented behavior in Microsoft Windows.\nIn our case, a malicious VBS was executed, which installs a next stage payload stored in CAB file:\n Share post on:\nMalicious VBS used in the attack\nWe have reported this “creative” abuse of DDE to Microsoft’s security team.\nThe final payload of the attack is a CAB file with the following MD5:\n8844a537e7f533192ca8e81886e70fbc\nThe MS CAB file (md5: 8844a537e7f533192ca8e81886e70fbc) contains 4 malicious DLL files:\nMD5 Filename\na6f14b547d9a7190a1f9f1c06f906063 cfgifut.dll\ne51ce28c2e2d226365bc5315d3e5f83e cldbct.dll\n067681b79756156ba26c12bc36bf835c cryptbase.dll\nf8a2d4ddf9dc2de750c8b4b7ee45ba3f msfte.dll\nThe file cldbct.dll (e51ce28c2e2d226365bc5315d3e5f83e) connects to the following C2:\nhXXp://webconncheck.myfw[.]us:8080/8xrss.php\nThe modules are signed by an invalid digital certificates listed as “Tencent Technology (Shenzhen) Company Limited” with\nserial numbers, copied from real Tencent certificates:\n5d 06 88 f9 04 0a d5 22 87 fc 32 ad ec eb 85 b0\n71 70 bd 93 cf 3f 18 9a e6 45 2b 51 4c 49 34 0e\nInvalid digital signature on malware samples\nThe malware deployed in this attack is extremely rare and apparently reserved only for high profile victims. Our products\ndetect it as well as other malware from ScarCruft as HEUR:Trojan.Win32.ScarCruft.gen .\nVictims:\nAlthough our visibility is rather limited, some of the victims of these attacks include:\nA law enforcement agency in an Asian country\nOne of the largest trading companies in Asia and in the world\nA mobile advertising and app monetization company in the USA\nIndividuals related to the International Association of Athletics Federations\nA restaurant located in one of the top malls in Dubai\nSome of these were compromised over the last few days, indicating the attackers are still very active.\nConclusions:\nNowadays, in-the-wild Flash Player exploits are becoming rare. This is because in most cases they need to be coupled with\na Sandbox bypass exploit, which makes them rather tricky.\nAdditionally, Adobe has been doing a great job at implementing new mitigations to make exploitation of Flash Player more\nand more difficult.\nNevertheless, resourceful threat actors such as ScarCruft will probably continue to deploy zero-day exploits against their\nhigh profile targets.\nAs usual, the best defense against targeted attacks is a multi-layered approach. Windows users should combine traditional\nanti-malware technologies with patch management, host intrusion detection and, ideally, whitelisting and default-deny\nstrategies. According to a study by the Australian DSD, 85% of the targeted attacks analysed could have been stopped by\nfour simple defense strategies . While it’s impossible to achieve 100% protection, in practice and most cases all you have to\ndo is increase your defenses to the point where it becomes too expensive for the attacker – who will just give up and move\non to other targets.\nKaspersky products detect flash exploit as HEUR:Exploit.SWF.Agent.gen also our AEP (Automatic Exploit Prevention)\ncomponent can successfully detect this attack. Payloads are detected with HEUR:Trojan.Win32.ScarCruft.gen verdict.\n* More information about the ScarCruft APT group is available to customers of Kaspersky Intelligent Services .\nIndicators of compromise:\nMalicious IPs and hostnames:\n212.7.217[.]10\nreg.flnet[.]org\nwebconncheck.myfw[.]us\nMD5s:\n3e5ac6bbf108feec97e1cc36560ab0b6\na6f14b547d9a7190a1f9f1c06f906063\ne51ce28c2e2d226365bc5315d3e5f83e\n067681b79756156ba26c12bc36bf835c\nf8a2d4ddf9dc2de750c8b4b7ee45ba3f\n8844a537e7f533192ca8e81886e70fbc\nADOBE FLASH  APT VULNERABILITIES AND EXPLOITS  ZERO-DAY VULNERABILITIES\nRelated Posts \n LEAVE A REPLY\nYour email address will not be published.  Required fields are marked *\nEnter your comment here\nName *\nEmail *\nSave my name, email, and website in this browser for the next time I comment.\n \nSUBMIT\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\n Notify me when new comments are added.\n© 2020 AO Kaspersky Lab.  All Rights Reserved. \nRegistered trademarks and service marks are the property of their respective owners.\nContact us  | Privacy Policy  | License AgreementEmail\n I agree to provide my email address to “AO Kaspersky\nLab” to receive information about new posts on the\nsite. I understand that I can withdraw this consent at\nany time via e-mail by clicking the “unsubscribe” link\nthat I find at the bottom of any e-mail sent to me for\nthe purposes mentioned above.SUBSCRIBE\nMokes and Buerak\ndistributed under the guise\nof security certificates\nOilRig’s Poison Frog – old\nsamples, same trick\nKaspersky Security Bulletin\n2019. Statistics\nWe use cookies to make your experience of our websites better. By using and further navigating this website you accept this. Detailed\ninformation about the use of cookies on this website is available by clicking on more information .ACCEPT AND CLOSE\n "
}