{
    "title": "pawn storm ramps up spear-phishing before zero-days get patched - trendlabs security intelligence blog",
    "text": "Trend Micro About TrendLabs Security Intelligence Blog\nHome    »   Exploits    »   Pawn Storm Ramps Up Spear-phishing Before Zero-Days Get Patched\nSecurity Predictions for 2020\nCybersecurity in 2020 will be viewed\nthrough many lenses — from differing\nattacker motivations and cybercriminal\narsenal to technological developments\nand global threat intelligence — only so\ndefenders can keep up with the broad\nrange of threats.\nRead our security predictions for 2020.\nBusiness Process Compromise\nAttackers are starting to invest in long-\nterm operations that target specific\nprocesses enterprises rely on. They\nscout for vulnerable practices,\nsusceptible systems and operational\nloopholes that they can leverage or\nabuse. To learn more, read our Security 101:\nBusiness Process Compromise.\nRecent Posts\nOpenSMTPD Vulnerability (CVE-2020-8794) Can\nLead to Root Privilege Escalation and Remote\nCode Execution\nOperation Overtrap Targets Japanese Online\nBanking Users Via Bottle Exploit Kit and Brand-\nNew Cinobi Banking Trojan\nMarch Patch Tuesday: LNK, Microsoft Word\nVulnerabilities Get Fixes, SMBv3 Patch Follows\nBusting Ghostcat: An Analysis of the Apache\nTomcat Vulnerability (CVE-2020-1938 and CNVD-\n2020-10487)\nDissecting Geost: Exposing the Anatomy of the\nAndroid Trojan Targeting Russian Banks\nPopular Posts\nLokiBot Impersonates Popular Game Launcher\nand Drops Compiled C# Code File\nMisconfigured Container Abused to Deliver\nCryptocurrency-mining Malware\nDissecting Geost: Exposing the Anatomy of the\nAndroid Trojan Targeting Russian Banks\nFebruary Patch Tuesday: Fixes for Critical LNK,\nRDP, Trident Vulnerabilities\nOutlaw Updates Kit to Kill Older Miner Versions,\nTargets More Systems\nStay Updated\nEmail Subscription\nYour email here\nSubscribe\nPawn Storm Ramps Up Spear-phishing Before Zero-Days\nGet Patched\nPosted on: November 9, 2016  at 5:00 am Posted in: Exploits , Targeted Attacks , Vulnerabilities\nAuthor:  Trend Micro\nby Feike Hacquebord and Stephen Hilt \nThe effectiveness of a zero-day  quickly deteriorates as an\nattack tool after it gets discovered and patched by the affected\nsoftware vendors. Within the time between the discovery of the\nvulnerability and the release of the fix, a bad actor might try to\nget the most out of his previously valuable attack assets. This is\nexactly what we saw in late October and early November 2016,\nwhen the espionage group Pawn Storm  (also known as Fancy\nBear, APT28, Sofacy, and STRONTIUM) ramped up its spear-\nphishing  campaigns against various governments and\nembassies around the world.  In these campaigns, Pawn Storm\nused a previously unknown zero-day in Adobe’s Flash (CVE-2016-7855, fixed on October 26,\n2016 with an emergency update ) in combination with a privilege escalation in Microsoft’s Windows\nOperating System (CVE-2016-7255) that was fixed on November 8, 2016.\nAfter the fix of CVE-2016-7855 in Adobe’s Flash, Pawn Storm probably devalued the two zero-\ndays in its attack tool portfolio. Instead of only using it against very high profile targets, they\nstarted to expose much more targets to these vulnerabilities. We saw several campaigns against\nstill-high-profile targets since October 28 until early November, 2016.\nFigure 1. Infection chain of the spear-phishing campaign\nIn early November, Pawn Storm sent spear-phishing e-mails to various governments around the\nworld. In one of Pawn Storm’s campaigns on November 1, the subject line was “European\nParliament statement on nuclear threats.” The e-mail seemingly came from a real press officer\nworking for the media relations office of the European Union, but in reality, the sender e-mail\naddress was forged. Clicking on the link in the spear-phishing e-mail led to the exploit kit of Pawn\nStorm.\nThe exploit kit will first fingerprint its targets with invasive JavaScript, which uploads OS details,\ntime zone, installed browser plugins, and language settings to the exploit server. The exploit server\nmay then send back an exploit or simply redirect to a benign server. In recent attacks, we\nobserved that the exploit kit exposed selected targets to the Flash vulnerability CVE-2016-7855,\ncombined with the then-unpatched privilege escalation vulnerability in Windows (CVE-2016-7255).\nInternet users who were using Windows Vista up to Windows 7 without the latest patch for Flash\nwould be at high risk of automatically getting infected.\nFrom October 28 until early November 2016, several waves of spear-phishing e-mails were sent to\nembassies and other governmental institutions. Some of the e-mails posed as an invitation for a\n“Cyber Threat Intelligence and Incident Response conference in November” by Defense IQ, a\nmedia organization that specializes in news on defense and the military. The conference is real,\nbut of course, the sender address was forged. The spear-phishing e-mail contained an RTF (Rich\nText Format) document called “Programm Details.doc.”\nOpening the RTF document (detected by Trend Micro as TROJ_ARTIEF.JEJOSU) would show the\nprogram details of the real conference, which was to be held in London in late November 2016.\nHowever, the RTF document has an embedded Flash file (SWF_CONEX.A) that downloads\nadditional files from a remote server. This attack methodology of Pawn Storm has been previously\nobserved . We also noted that the embedded Flash file downloaded a Flash exploit for the just-\npatched CVE-2016-7855. A second file was also downloaded, but this file consistently crashed\nMicrosoft Word during our tests.\nFigure 2. Spear-phishing e-mail from Pawn Storm\nFigure 3. The Word document with an embedded Flash file that will try to download exploits from a\nremote server. The program was taken from a real conference to be held in London in end of\nNovember.\nApart from these two campaigns, several others were also launched by Pawn Storm in the period\nbetween the discovery of the zero-days and the release of Adobe’s and Microsoft’s patches on\nOctober 26 and November 8, 2016.  This shows that Pawn Storm ramped up their spear-phishing\nattacks shortly after its zero-days were discovered.  Not all organizations may have been able to\nimmediately patch Adobe’s Flash, and the Windows vulnerability wasn’t patched until November 8,64 \nHome Categories\nSearch:\n Privacy Statement Legal Policies Copyright © 2020 Trend Micro Incorporated. All rights reserved.HOME AND HOME OFFICE  | FOR BUSINESS  | SECURITY INTELLIGENCE  | ABOUT TREND MICRO\nAsia Pacific Region (APAC): Australia  / New Zealand , 中国, 日本, 대한민국 , 台灣 Latin America Region (LAR): Brasil , México  North America Region (NABU): United States , Canada  \nEurope, Middle East, & Africa Region (EMEA): France , Deutschland / Österreich / Schweiz , Italia, Россия , España , United Kingdom / IrelandTags: Adobe zero-day exploit Pawn Storm spear-phishing email Windows zero-day exploit2016.\nEnd users are urged to update their Windows OS (through MS16-135 ), and Flash Player (via its\nemergency patch ) to mitigate these threats.\n \nTrend Micro Solutions\nTrend Micro ™ Deep Discovery ™ provides detection, in-depth analysis, and proactive response to\ntoday’s stealthy malware, and targeted attacks in real-time. It provides a comprehensive defense\ntailored to protect organizations against targeted attacks and advanced threats through\nspecialized engines, custom sandboxing , and seamless correlation across the entire attack\nlifecycle, allowing it to detect threats like the above mentioned zero-day attacks even without any\nengine or pattern update.\nTrend Micro™ Deep Security ™ and Vulnerability Protection  provide virtual patching  that protects\nendpoints from threats that abuses unpatched vulnerabilities. OfficeScan ’s Vulnerability Protection\nshield endpoints from identified and unknown vulnerability exploits even before patches are\ndeployed.\nTippingPoint customers are protected from attacks exploiting these vulnerabilities with these\nMainlineDV filters:\n25498: HTTP: Adobe Flash AMF Use-After-Free Vulnerability\n25729: HTTP: Microsoft Windows NtSetWindowLongPtr Privilege Escalation Vulnerability\n25728: HTTPS: TROJ_KEFLER.A Checkin\n25718: HTTP: Microsoft Windows Privilege Escalation Vulnerability\nTrend Micro ™ Deep Security™  and Vulnerability Protection  shield endpoints and networks through\nRule update DSRU16-034, which includes these Deep Packet Inspection (DPI) rules:\n1008003-Adobe Flash Player Use-After-Free Vulnerability (CVE-2016-7855)\n1008033-Microsoft Windows Elevation Of Privilege Vulnerability\n1008034-Microsoft Windows Multiple Security Vulnerabilities (MS16-135)\n \nIndicators of Compromise:\nExploit sites:\nabc24news[.]com\ndefenceglobalnews[.]com\nglobaldefencetalk[.]com\npolitlco[.]com\npressservices[.]net\nwashingtnpostnews[.]com\nworldpressjournal[.]com\nworldpostjournal[.]com\nRTF document (TROJ_ARTIEF.JEJOSU): 4173b29a251cd9c1cab135f67cb60acab4ace0c5\nCVE-2016-7855 sample ( SWF_EXES.A ): cb1e30e6e583178f8d4bf6a487a399bd341c0cdc\nPayload ( TSPY_SEDNIT.F ): c2f8ea43f0599444d0f6334fc6634082fdd4a69f\nC&C Servers:\nmicrosoftstoreservice[.]com\nservicetlnt[.]net\nwindowsdefltr[.]net\nRemote sites giving back exploits to RTF Documents with embedded SWF:\nappexsrv[.]net\nsecurityprotectingcorp[.]com\nuniquecorpind[.]com\nversiontask[.]com\n \nWith additional analysis by Francis Antazo and Jeanne Jocson\n \nUpdate as of November 10, 2016, 2:00 AM (UTC-8):\nWe updated to include additional rules in TippingPoint’s MainlineDV filters and Trend Micro™\nDeep Security™ and Vulnerability Protection Deep Packet Inspection that address the\nvulnerabilities.\nLearn how to protect Enterprises, Small Businesses, and Home Users from ransomware:\nENTERPRISE SMALL BUSINESS HOME\n» » »\n "
}