{
    "title": "press releases _ news _ kaspersky",
    "text": "May 25, 2016\nDanti and Co.: Cyberespionage Groups Use a\nSingle Vulnerability to Target Organizations\nAround the World\nKaspersky Lab’s Global Research and Analysis Team has spent the last few\nmonths observing a wave of cyberespionage attacks conducted by\ndifferent groups across the Asia-Paciﬁc (APAC) and Far East regions, all of\nwhich share one common feature: in order to infect their victims with\nmalware, the attackers use an exploit for the CVE-2015-2545 vulnerabilityHome About Corporate News\nKaspersky Lab’s Global Research and Analysis Team has spent the last few months observing a wave of cyberespionage\nattacks conducted by different groups across the Asia-Paciﬁc (APAC) and Far East regions, all of which share one common\nfeature: in order to infect their victims with malware, the attackers use an exploit for the CVE-2015-2545 vulnerability. This\nweakness in Microsoft Oﬃce software was patched at the end of 2015, but still appears to be of use to these threat actors.\nThe Platinum, APT16, EvilPost, and SPIVY groups were already known to use the exploit, and they are now joined by a fairly\nnew and previously unknown group called Danti.    \nAn exploit is a malicious tool widely utilized by cyberespionage groups and cybercriminals to silently infect targeted machines\nwith malware. Several years ago, the use of so-called zero-day vulnerabilities (those that are used in the wild before the\nvendor of the affected software releases the patch) was the deﬁning characteristic of sophisticated threat actors, but things\nhave changed: nowadays cyberespionage groups are more likely to use exploits for known vulnerabilities, just because it is\ncheaper and seems to deliver an acceptable rate of infection.\nThe CVE-2015-2545 error enables an attacker to execute arbitrary code using a specially crafted EPS image ﬁle. The severity\nof the exploit for this vulnerability is high because it uses PostScript technique and can evade Address Space Layout\nRandomization (ASLR) and Data Execution Prevention (DEP) protection methods embedded in Windows. Danti is the latest\ngroup to have been spotted using this vulnerability.\nDanti is highly focused on diplomatic entities. It may already have full access to internal networks in Indian government\norganizations. According to Kaspersky Security Network, some Danti Trojans have also been detected in Kazakhstan,\nKyrgyzstan, Uzbekistan, Myanmar, Nepal and the Philippines. Its activity was ﬁrst spotted at the beginning of February and\ncontinued through March to the present day.\nThe exploit is delivered through spear-phishing emails. In order to attract the attention of potential victims, the threat actors\nbehind Danti have created emails in the names of several high-ranking Indian government oﬃcials. Once the exploitation of\nthe vulnerability takes place, the Danti backdoor is installed and this subsequently provides the threat actor with access to the\ninfected machine so they can withdraw sensitive data.  \nThe origin of Danti is unknown, but Kaspersky Lab researchers have reason to suspect that the group is somehow connected\nto the Nettraveler and DragonOK groups. It is believed that Chinese-speaking hackers are behind these groups.\nAlso, Kaspersky Lab researchers have spotted CVE-2015-2545-attacks of unknown origin against some organizations in\nTaiwan and Thailand. These attacks have been given the internal name SVCMONDR after the name of the Trojan that is\ndownloaded after exploitation of the vulnerability. The Trojan is different to the one used by the Danti group, but it shares\nsome common features with Danti as well as with APT16 – a known cyberespionage group presumed to be of Chinese origin.\nAbout Us\n Transparency Corporate News Press Center Careers Innovation Hub Sponsorships Policy Blog\nSolutions for:  Home Products   Small Business 1-50 employees  Medium Business 51-999 employees  Enterprise 1000+ employees\n “We expect to see more incidents with this exploit, and we continue to monitor new waves of attacks and the potential\nrelationship with other attacks in the region. Waves of attacks conducted with the help of just one vulnerability suggests two\nthings: ﬁrstly, that threat actors tend not to invest many resources into the development of sophisticated tools, like zero-day\nexploits, when 1-day exploits will work almost as well. Secondly, that the patch-adoption rate in the target companies and\ngovernment organizations is low.  We urge companies to pay closer attention to patch-management in their IT infrastructure\nin order to protect themselves from known vulnerabilities at the very least,” - said Alex Gostev, Chief Security Expert at\nKaspersky Lab Research Center in APAC.\nRead more about targeted attacks utilizing CVE-2015-2545 at Securelist.com   \nMore information on how Kaspersky Lab technologies protect against cyberattacks that make use of vulnerabilities is available\non Kaspersky Business blog .\nHidden threat: criminals\nconceal miners under\nthe guise of legitimate\nthematic applications\nKaspersky Lab’s researchers have\ndiscovered that more and more cyber\ncriminals are turning their attention to\nmalicious software that is mining\ncryptocurrencies at the expense of users’\nmobile devices.\nRead More >Kaspersky Lab DDoS\nIntelligence quarterly\nreport: ampliﬁcation\nattacks and old botnets\nmake a comeback\nKaspersky Lab has published its report\nlooking at botnet-assisted DDoS attacks\nfor the ﬁrst quarter of 2018\nRead More >New variant of SynAck\nransomware uses\nsophisticated\nDoppelgänging\ntechnique to evade\nsecurity\nKaspersky Lab researchers have\ndiscovered a new variant of the SynAck\nransomware Trojan using the\nDoppelgänging technique to bypass\nanti-virus security by hiding in legitimate\nprocesses.\nRead More >Related Articles Virus News\nKaspersky Anti-Virus\nKaspersky Internet Security\nKaspersky Total Security\nKaspersky Security Cloud\nKaspersky Security Cloud - Free\nAll Products(1-50 EMPLOYEES)\nKaspersky Small Oﬃce Security\nKaspersky Endpoint Security Cloud\nAll Products(51-999 EMPLOYEES)\nKaspersky Endpoint Security Cloud\nKaspersky Endpoint Security for\nBusiness Select\nKaspersky Endpoint Security for\nBusiness Advanced\nAll Products(1000+ EMPLOYEES)\nCybersecurity Services\nThreat Management and Defense\nEndpoint Security\nHybrid Cloud Security\nAll Solutions\nContact Us •About Us •Partners •Corporate News •Sitemap© 2020 AO Kaspersky Lab. All Rights Reserved. • Privacy Policy  • Anti-Corruption Policy  • License AgreementHome Products Small Business Products Medium Business Products Enterprise Solutions\nGlobal \n We use cookies to make your experience of our websites better. By using and further navigating this website you accept this. Detailed\ninformation about the use of cookies on this website is available by clicking on more information .ACCEPT AND CLOSE\n "
}