{
    "title": "press releases _ kaspersky",
    "text": "October 16, 2017\nKaspersky Lab discovers Adobe Flash Zero\nDay used in the wild by a threat actor to\ndeliver spyware\nWoburn, MA – October 16, 2017 – The Kaspersky Lab advanced exploit\nprevention system has identiﬁed a new Adobe Flash zero day exploit, used\nin an attack on October 10, 2017 by a threat actor known as BlackOasis.Home About Press releases\nWoburn, MA – October 16, 2017  – The Kaspersky Lab  advanced exploit prevention system has identiﬁed a new Adobe Flash\nzero day exploit , used in an attack on October 10, 2017 by a threat actor known as BlackOasis. The exploit is delivered\nthrough a Microsoft Word document and deploys the FinSpy commercial malware. Kaspersky Lab has reported the\nvulnerability to Adobe, which has issued an advisory . \nAccording to Kaspersky Lab researchers, the zero day, CVE-2017-11292, has been spotted in a live attack, and they advise\nbusinesses and government organizations to install the update from Adobe immediately. \nThe researchers believe that the group behind the attack was also responsible for CVE-2017-8759, another zero day, reported\nin September – and they are conﬁdent that the threat actor involved is BlackOasis, which the Kaspersky Lab Global Research\nand Analysis Team began tracking in 2016. \nAnalysis reveals that, upon successful exploitation of the vulnerability, the FinSpy malware (also known as FinFisher) is installed\non the target computer. FinSpy is a commercial malware, typically sold to nation states and law enforcement agencies to\nconduct surveillance. In the past, use of the malware was mostly domestic, with law enforcement agencies deploying it for\nsurveillance on local targets. BlackOasis is a signiﬁcant exception to this – using it against a wide range of targets across the\nworld. This appears to suggest that FinSpy is now fuelling global intelligence operations, with one country using it against\nanother. Companies developing surveillance software such as FinSpy make this arms race possible. \nThe malware used in the attack is the most recent version of FinSpy, equipped with multiple anti-analysis techniques to make\nforensic analysis more diﬃcult. \nAfter installation, the malware establishes a foothold on the attacked computer and connects to its command and control\nservers located in Switzerland, Bulgaria and the Netherlands, to await further instructions and exﬁltrate data.  \nBased on Kaspersky Lab’s assessment, the interests of BlackOasis span a whole gamut of ﬁgures involved in Middle Eastern\npolitics, including prominent ﬁgures in the United Nations, opposition bloggers and activists, as well as regional news\ncorrespondents. They also appear to have an interest in verticals of particular relevance to the region. During 2016, the\ncompany’s researchers observed a heavy interest in Angola, exempliﬁed by lure documents indicating targets with suspected\nties to oil, money laundering and other activities. There is also an interest in international activists and think tanks.\nSo far, victims of BlackOasis have been observed in the following countries: Russia, Iraq, Afghanistan, Nigeria, Libya, Jordan,\nTunisia, Saudi Arabia, Iran, the Netherlands, Bahrain, United Kingdom and Angola.\n“The attack using the recently discovered zero-day exploit is the third time this year we have seen FinSpy distribution through\nexploits to zero-day vulnerabilities,” said Anton Ivanov, lead malware analyst at Kaspersky Lab. “Previously, actors deploying\nthis malware abused critical issues in Microsoft Word and Adobe products. We believe the number of attacks relying on\nFinSpy software, supported by zero day exploits such as the one described here, will continue to grow.”\nKaspersky Lab security solutions successfully detect and block exploits utilizing the newly discovered vulnerability.  \nKaspersky Lab experts advise organizations to take the following actions to protect their systems and data against this threat: \n For technical details, including indicators of compromise and YARA rules, please read the blogpost on Securelist.com . \nAbout Kaspersky Lab\nKaspersky Lab is a global cybersecurity company celebrating its 20 year anniversary in 2017. Kaspersky Lab’s deep threat\nintelligence and security expertise is constantly transforming into next generation security solutions and services to protect\nbusinesses, critical infrastructure, governments and consumers around the globe. The company’s comprehensive security\nportfolio includes leading endpoint protection and a number of specialized security solutions and services to ﬁght\nsophisticated and evolving digital threats. Over 400 million users are protected by Kaspersky Lab technologies and we help\n270,000 corporate clients protect what matters most to them. Learn more at www.kaspersky.com .\n \nFor the latest in-depth information on security threat issues and trends, please visit:\nSecurelist | Information about Viruses, Hackers and Spam  If not already implemented, use the killbit feature for Flash software and, wherever possible, disable it completely.\nImplement an advanced, multi-layered security solution that covers all networks, systems and endpoints.\nEducate and train personnel on social engineering tactics as this method is often used to make a victim open a malicious document or click\non an infected link.\nConduct regular security assessments of the organization’s IT infrastructure.\nUse Kaspersky Lab’s Threat Intelligence, which tracks cyberattacks, incident or threats and provides customers with up-to-date relevant\ninformation that they are unaware of. Find out more at intelreports@kaspersky.com .\nAbout Us Company Team Transparency Press Releases Press Center Careers Sponsorships\n Follow @Securelist  on Twitter \nThreatpost | The First Stop for Security News  \nFollow @Threatpost  on Twitter\n \nMedia Contact  \nSarah Kitsos  \n781.503.2615 \nsarah.kitsos@kaspersky.com   \nKaspersky Lab GReAT\nReleases Targeted Threat\nPredictions for 2019\nResearchers predict that in the coming\nyear, threat actors will go to new lengths\nto carry out devastating attacks\nRead More >Kaspersky Lab Finds\n2018’s Malicious Crypto-\nMining Fever Powered\nby Pirated Software and\nContent\nCryptocurrency mining malware wreaks\nhavoc in 2018, infecting more than ﬁve\nmillion people in the ﬁrst three quarters\nof the year\nRead More >Remote Access\nNightmare: Amount of\nMalware Found to be\nBackdoors Increases by\n44% in 2018\nNew report shows Kaspersky Lab\ntechnologies detected 346,000 new\nmalicious ﬁles every day in the ﬁrst ten\nmonths of the year\nRead More >Related Articles Virus News\nKaspersky Anti-Virus\nKaspersky Internet Security\nKaspersky Total Security\nKaspersky Security Cloud\nKaspersky Security Cloud - Free\nAll Products(1-50 EMPLOYEES)\nKaspersky Small Oﬃce Security\nKaspersky Endpoint Security Cloud\nAll Products(51-999 EMPLOYEES)\nKaspersky Endpoint Security Cloud\nKaspersky Endpoint Security for\nBusiness Select\nKaspersky Endpoint Security for\nBusiness Advanced\nAll Products(1000+ EMPLOYEES)\nCybersecurity Services\nThreat Management and Defense\nEndpoint Security\nHybrid Cloud Security\nAll Solutions\nContact Us •About Us •Partners •Press Releases •Sitemap •Careers© 2020 AO Kaspersky Lab. All Rights Reserved. Adaptive security technology is based on the patent US7584508 B1:\n‘Adaptive security for information devices’. • Privacy Policy  • Anti-Corruption Policy  • License Agreement  • Refund PolicyHome Products Small Business Products Medium Business Products Enterprise Solutions\nUnited States \n "
}