{
    "title": "prolific cybercrime gang favors legit login credentials",
    "text": "Search Dark Reading\nNetwork Computing Dark Reading\n Welcome Guest Login to your account Register Advertise About Us\nFollow DR:\n Authors Slideshows Video Tech Library University Radio Calendar Black Hat News\nTHE\nEDGEANALYTICS ATTACKS /\nBREACHESAPP SEC CAREERS &\nPEOPLECLOUD ENDPOINT IoT OPERATIONS PERIMETER RISK THREAT\nINTELLIGENCEVULNS /\nTHREATS\nSPONSORED CONTENT\nRethinking the Role of the CISO: Collaboration\nImproves Security\nSecurity executives who from strong relationships across business lines\nare experiencing lower breach costs and driving down risk, according\nto J. Wolfgang Goerlich, Cisco's advisory CISO. He also discusses\nother key findings in the sixth annual CISO Benchmark Report, such as\nwhich metrics are used to measure security success and what\nstrategies to use to combat complexity and cyber fatigue. Find the\nreport by clicking here: cisco.com/go/cisoreport\nLEARN MORE\nBrought to you by CycognitoSponsored Content\nCyCognito Takes On Elimination of 'Shadow\nRisk' to Improve Security\nWhile current vulnerability and threat management techniques\nhistorically have performed well, they're less robust given how\nnetworks and data operate now, according to Rob Gurzeev,\nCEO and co-founder of CyCognito. He proposes something\ncalled \"shadow risk elimination,\" along with reconnaissance,\nautomation, and other innovations for better protection.\nCOMMENT   | EMAIL THIS   | PRINT   | RSS\nWebcasts\nBuilding a Strategy for\nDetection and\nResponse\nSecurity Alert Fatigue:\nTips for Taking Control\nMORE WEBCASTS\nWhite Papers\nSimplify Your App\nSecurity\nNetFlow vs Packet\nData\nMORE WHITE PAPERS\nReports\n[Report] DevSecOps &\nSecure App Delivery:\nWhat's Working &\nWhat's Not\nApex Report: Global\nCyber Infection\nMORE REPORTS\n50%\n 50%\n0 COMMENTS\nCOMMENT NOW\nTweet\n10/13/2015\n07:45 PM\nKelly Jackson\nHiggins\nNews\nConnect Directly\nLogin\nNEWEST FIRST   |  OLDEST FIRST   |  THREADED VIEW\nProlific Cybercrime Gang Favors\nLegit Login Credentials\nFireEye researchers shed more light on infamous cybercriminals\nassociated with RawPOS malware. and christen it 'FIN5.'\nFIREEYE CYBER DEFENSE SUMMIT -- Washington, D.C. -- No 0days. No\nspearphishing, either: The cybercriminal group tied to numerous payment\ncard breaches including Goodwill  and best known by its so-called \"RawPOS\"\nmalware employed legitimate user credentials to access its targets' networks.\nResearchers at FireEye here today shared their recent findings on this\nprolific and long-running cybercrime gang that has been the subject of\nmultiple Visa security alerts  to merchants. The RawPOS memory scraper\nmalware has been infecting the lodging industry in epidemic proportions over\nthe past year, and is considered one of the first memory scrapers to target\npoint-of-sale systems.\nFireEye has dubbed the cybercrime gang FIN5. \"One of the most unique\nthings about FIN5 is that in every intrusion we responded to where FIN5 has\nbeen active, legitimate access was identified. They had valid user credentials\nto remotely log into the network,\" said Barry Vengerik, principal threat analyst\nat FireEye. \"No sexy zero-days, no remote exploits -- not even spearphishing.\nThey had credentials from somewhere.\"\nFIN5, which earlier this year was profiled by researchers at Trend Micro and\nhas been in action since at least 2008, uses real credentials from the victim\norganization's virtual private network, Remote Desktop Protocol, Citrix, or\nVNC. Vengerik says the attackers got those credentials via third parties\nassociated with the victims' POS systems.\n\"Most of the maintenance and administration of POS systems are done by a\nthird party -- the maintenance, patching, troubleshooting\" is done remotely\nvia those credentials, he said.  \n\"FIN5 maintained access to two or more payment processor networks\nprimarily for the goal of logging into and accessing their customers'\nenvironments,\" he said. \"It's a textbook case of a lateral compromise between\ncompanies based on trust.\"\nFireEye last year investigated a massive breach at a casino hotel with 1,200\nendpoints that suffered losses to more than 150,000 payment cards.\nVengerik declined to name the hotel.\nThe casino attackers used a stolen VPN account to gain access, said\nEmmanuel Jean-Georges, senior consultant with FireEye's Mandiant.\nFIN5 uses a tool called GET2 Penetrator, a brute force scanning tool that\nlooks for remote login and hard-coded credentials, as well as a free tool\ncalled EssentialNet that scans the victim's network to give the attackers \"the\nlay of the land,\" Vengerik said.\nRawPOS pulls information from a POS system's memory. The malware\nincludes several components, FireEye found: Duebrew, which ensures the\nmalware remains on the infected Windows machine, even when it gets\nrebooted; Fiendcry, a memory scraper that grabs the payment card data;\nDriftwood, which encodes the stolen payment card information to hide it from\nanalysis tools.\nAnother unusual feature of FIN5's operation is that the malware code is \"well-\ncommented,\" Vengerik said. \"That's incredibly rare in malware, the author\ntaking time to comment on the code and to show what section of code is\ndoing what,\" he said. It's like a secure development lifecycle approach, he\nnoted.\nThe release notes for the Driftwood code are written in an older Russian\nlanguage character set, the researchers showed.\nWhy would the malware author actively comment on the code? \"It points to a\npossible ecosystem -- for advertising or support\" of the malware as a product,\nVengerik told Dark Reading .\nFireEye says the attackers first target the Active Directory to get to the card\ndata, and use tools such as Windows Credentials Editor in their quest for legit\ncredentials. They also created several custom tools for covering their tracks\nand cleaning up any traces of the malware, as well as proxy tools for\naccessing segregated network segments.\n\"They also encoded hard kill-times into most of their malware for a hard end\ndate\" of the attack, he said.\nTrend Micro earlier this year noted how RawPOS was able to evolve to target\nvarious types of POS software. \"Aside from being multi-component, RawPOS\nis notable for its support for multiple PoS software. Since business\nestablishments would have different PoS software, attackers have modified\nRawPOS’ code to support multiple PoS software over time,\" Trend Micro\nresearchers wrote in a blog post in late April .\nMeanwhile, FireEye today also announced that is has partnered with Visa Inc.\nto power a new threat intelligence service for merchants and card issuers.\nThe so-called Visa Threat Intelligence service is the first product under a\nnewly forged partnership between Visa and FireEye.\n\"We want to offer faster, actionable intelligence to our constituents,\" said\nMark Nelson, senior vice president of risk products at Visa.\n \nKelly Jackson Higgins is the Executive Editor of Dark Reading. She is an\naward-winning veteran technology and business journalist with more than two\ndecades of experience in reporting and editing for various publications,\nincluding Network Computing, Secure Enterprise ... View Full Bio\nINSIGHTS\nMORE INSIGHTS\nCOMMENTS\nBe the first to post a comment  regarding this story.\n2 Achieving DevSecOps Requires\nCutting Through the Jargon\nMario DiNatale, Head of Platform Security.\nZeroNorth,  3/19/2020\n2 DDoS Attack Targets German Food\nDelivery Service\nDark Reading Staff 3/19/2020\n2 Remote Workforce Jumps 15% In\nTwo Weeks\nDark Reading Staff 3/17/2020\nSUBSCRIBE TO NEWSLETTERS\nWEBINAR ARCHIVESBuilding a Strategy for Detection and Response\nChatbots for the Enterprise\n5 Steps to Integrate SAST into the DevSecOps Pipeline\nMORE WHITE PAPERSWHITE PAPERS\nSimplify Your App Security\nNetFlow vs Packet Data\nIs Smishing the New Backdoor?\nDatacenters of the Future\nGlobal Application and Network Security Report\nALL VIDEOSVIDEO\nCARTOON ARCHIVECARTOON\nLatest Comment: Unfortunately nobody wants to spend\nmoney on security. Usually they change their mind but\noften it is too late\nDOWNLOAD THIS ISSUE!\n6 Emerging Cyber Threats That\nEnterprises Face in 2020\nThis Tech Digest gives an in-depth look at six emerging\ncyber threats that enterprises could face in 2020.\nDownload your copy today!\nBACK ISSUES  | MUST READSCURRENT ISSUE\nALL POLLSFLASH POLL\nHas the U.S. political climate caused\nyou to make infosecurity-related\nchanges to your disaster\nrecovery/business continuity plans?\n Yes\n No\n No but we are considering it\n Still waiting for cybersecurity guidance from\nTrump admin EO\n Don't know\n Other (Please explain in the comments)\nSubmit\nDOWNLOAD NOW!\nState of Cybersecurity Incident\nResponse\nData breaches and regulations have forced\norganizations to pay closer attention to the security\nincident response function. However, security leaders\nmay be overestimating their ability to detect and respond\nto security incidents. Read this report to find out more.\nHow Enterprises Are Developing and\nMaintaining Secure Applications0 COMMENTS\nHow Enterprises are Attacking the\nCybersecurity Problem0 COMMENTS\nHow Data Breaches affect the Enterprise\n0 COMMENTS\nMORE REPORTS\nTWITTER FEED\nBUG REPORT\nENTERPRISE VULNERABILITIES\nFrom DHS/US-CERT's National Vulnerability Database\nCVE-2020-5252\nPUBLISHED: 2020-03-23\nThe command-line &quot;safety&quot; package for\nPython has a potential security issue. There are two\nPython characteristics that allow malicious code to\n&acirc;&euro;&oelig;poison-pill&acirc;&euro;&#65533;\ncommand-line Safety package detection routines by\ndisguising, or obfuscating, other malicious ...\nCVE-2019-17559\nPUBLISHED: 2020-03-23\nThere is a vulnerability in Apache Traffic Server 6.0.0 to\n6.2.3, 7.0.0 to 7.1.8, and 8.0.0 to 8.0.5 with a smuggling\nattack and scheme parsing. Upgrade to versions 7.1.9\nand 8.0.6 or later versions.\nCVE-2019-17565\nPUBLISHED: 2020-03-23\nThere is a vulnerability in Apache Traffic Server 6.0.0 to\n6.2.3, 7.0.0 to 7.1.8, and 8.0.0 to 8.0.5 with a smuggling\nattack and chunked encoding. Upgrade to versions\n7.1.9 and 8.0.6 or later versions.\nCVE-2020-10875\nPUBLISHED: 2020-03-23\nMotorola FX9500 devices allow remote attackers to\nconduct absolute path traversal attacks, as\ndemonstrated by PL/SQL Server Pages files such as\n/include/viewtagdb.psp.\nCVE-2020-10879\nPUBLISHED: 2020-03-23\nrConfig before 3.9.5 allows injection because\nlib/crud/search.crud.php does not properly construct a\nfind command.ANALYTICS\nLike\nShare\nRethinking the Role of the CISO: Collabor\n …\nHOT TOPICS EDITORS' CHOICE\n WEBINARS  \n REPORTS  \nDiscover More From Informa Tech\nInterop\nInformationWeek\nNetwork ComputingIT Pro Today\nData Center Knowledge\nBlack HatContact us\nAbout Us\nAdvertise\nReprintsWorking With Us Follow DarkReading On Social\nHome Cookies CCPA: Do not sell my personal info Privacy Terms\nCopyright © 2020 Informa PLC Informa UK Limited is a company registered in England and Wales with\ncompany number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.7 COMMENTS\nRansomware Trains Its\nSights on Cloud ...\n1 COMMENTS\nQualys Launches Free\nApp for IT Asset ...\n "
}