{
    "title": "promethium _ neodymium apts used same zeroday against turkishsecurity affairs",
    "text": "Adobe releases out-of-band patches for critical issues in Acrobat Reader,  MUST READ\nCopyright 2015 Security Affairs by Pierluigi Paganini All Right Reserved. Back to top\nHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  \nLaws and regulations  Malware  Mobile  Reports  Security  Social Networks  Terrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\n\nHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  \nTerrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\nSponsored Content\nDigging the Deep Web: Exploring the dark side of the\nweb\nYoroi Blog\nYoroi Blog\nSponsored Content\nSponsored Content\nSponsored Content\nSponsored ContentPROMETHIUM and NEODYMIUM APTs used same\nZero-Day to Target Turkish citizens\nDecember 16, 2016  By Pierluigi Paganini\nSHARE ON       \nPierluigi Paganini\nPierluigi Paganini is member of the ENISA (European Union Agency for Network\nand Information Security) Threat Landscape Stakeholder Group and Cyber G7\nGroup, he is also a Security Evangelist, Security Analyst and Freelance Writer.\nEditor-in-Chief at \"Cyber Defense Magazine\", Pierluigi is a cyber security expert\nwith over 20 years experience in the field, he is Certified Ethical Hacker at EC\nCouncil in London. The passion for writing and a strong belief that security is\nfounded on sharing and awareness led Pierluigi to find the security blog\n\"Security Affairs\" recently named a Top National Security Resource for US.\nPierluigi is a member of the \"The Hacker News\" team and he is a writer for some\nmajor publications in the field such as Cyber War Zone, ICTTF, Infosec Island,\nInfosec Institute, The Hacker News Magazine and for many other Security\nmagazines. Author of the Books \"The Deep Dark Web\" and “Digital Virtual\nCurrency and Bitcoin”.\nTrend Micro addresses two issues\nexploited by hackers in the wild\nMarch 18, 2020  By Pierluigi Paganini TrueFire Guitar tutoring website was\nhacked, financial data might have\nbeen exposed\nMarch 18, 2020  By Pierluigi PaganiniMicrosoft discovered two distinct APT groups, PROMETHIUM\nand NEODYMIUM, that exploited the same Flash Player zero-\nday flaw on same targets.\nSecurity researchers have discovered two distinct APT groups, PROMETHIUM and NEODYMIUM,\nthat exploited the same Flash Player zero-day vulnerability ( CVE-2016-4117 ) in cyber espionage\ncampaigns on Turkish citizens living in Turkey and various other European countries. Both groups\nexploited the flaw before its public disclosure and against the same type of targets.\nWe have already read about the activities of the PROMETHIUM APT group in a report published by\nKaspersky Lab that named it StrongPity . In October, Kaspersky published a report on cyber espionage\nactivities conducted by StrongPity APT  that most targeted Italians and Belgians with watering holes\nattacks.\nThe experts noticed many similarities in the operation of both groups, a circumstance that suggests a\npossible link between them. The ATP groups used different infrastructure and malware, but there are\nsome similarities that indicate a possible connection at a higher organizational level.\nThe flaw was patched  by Adobe on May 12, but according to the experts from the firm Recorded\nFuture  published a report on the most common vulnerabilities used by threat actors in the exploit kits.\nThe PROMETHIUM APT has been active since at least 2012, the hackers used instant messaging\napplications as the attack vector and shared malicious links that pointed to documents to exploit the\nCVE-2016-4117 vulnerabilities. Microsoft observed that the attacker used a specific strain of\nmalware dubbed Truvasys that was designed to compromise target devices with Turkish locale\nsettings.\n“The attack itself began with certain individuals receiving links in instant messenger clients. These links led to\nmalicious documents that invoked exploit code and eventually executed a piece of malware called Truvasys  on\nunsuspecting victims’ computers” states the Microsoft Security Intelligence Report .\nThe PROMETHIUM APT also used another malware dubbed Myntor in targeted attacks.\nThe NEODYMIUM also exploited the CVE-2016-4117  flaw in targeted attacks in May via spear-\nphishing messages. This second APT leveraged a backdoor, dubbed Wingbird , that shows many\nsimilarities with surveillance software FinFisher .\n“NEODYMIUM used a backdoor detected by Windows Defender as Wingbird, whose characteristics closely\nmatch FinFisher, a government-grade commercial surveillance package. Data about Wingbird activity indicates\nthat it is typically used to attack individuals and individual computers instead of networks” continues the Report.\nThe vast majority of the NEODYMIUM victims was located in Turkey (80%), but several infections\nwere also detected in the U.S., Germany and the U.K.\nLet me suggest reading the Microsoft Security Intelligence Report  to have more details on\nPROMETHIUM and NEODYMIUM, including indicators of compromise (IoC).\nPierluigi Paganini\n(Security Affairs  – NEODYMIUM APT, PROMETHIUM APT)\nAPT cyber espionage Hacking malware NEODYMIUM PROMETHIUM StrongPity\nYOU MIGHT ALSO LIKEShare this...\n\n\nPREVIOUS ARTICLE\nMore than 8,800 WordPress Plugins out\nof 44,705 are flawed\n NEXT ARTICLE\nCryptolulz666 continues targeting\nGovernment websites with DDoS \n\n "
}