{
    "title": "rancor cyber espionage group uncovered _ securityweek.com",
    "text": "SECURITYWEEK NETWORK: Information Security News Infosec Island CISO Forum Security Experts: WRITE FOR US\nTweet\n Recommend 0\nIonut Arghire is an international\ncorrespondent for SecurityWeek.\n Tech Companies Partner to Securely Connect IoT to\nCloud\nTwo Dozen Arrested for Laundering Funds From BEC,\nOther Scams\nRare Android Stalkerware Can Steal Data, Control\nDevices\nOrganizations Slow to Patch Targeted Microsoft Exchange\nVulnerability\nProtonMail, ProtonVPN Will Use Alternative Routing to\nBypass CensorshipPrevious Columns by Ionut Arghire:\n2020 ICS Cyber Security Conference | USA [Oct. 19-22]\n2020 Singapore ICS Cyber Security Conference | June 16-18 2020]\n2019 CISO Forum, Presented by Intel (Ritz-Carlton, Half Moon Bay CA)sponsored links\nTags: NEWS & INDUSTRY  CybercrimeTweet\n Recommend 0\nBy Ionut Arghire  on June 26, 2018\nHome  › Cybercrime\nRANCOR Cyber Espionage Group Uncovered\nA cyber espionage group that has remained undetected until recently, has been targeting\nSouth East Asia with two previously unknown malware families, according to Palo Alto\nNetworks.\nThe group, referred to as RANCOR , has been targeting political entities in Singapore,  \nCambodia, and Thailand, but might have hit targets in other countries as well. The group  \nmainly uses two malware families, DDKONG and PLAINTEE, the latter apparently being a new  \naddition to its arsenal.  \nAccording to Palo Alto Networks reserachers, the attacks likely begin with spear phishing  \nemails and use decoy documents containing details taken from public news articles on  \npolitical news and events. These documents are hosted on legitimate websites, including a  \nwebsite belonging to the Cambodia Government, and Facebook.\nThe newly discovered campaign appears related to the KHRAT Trojan , a backdoor associated  \nwith the China‐linked cyber espionage group known as DragonOK . \nOne of the IPs the KHRAT associated domains started resolving to in February 2018 led the  \nresearchers to websites mimicking popular technology companies, including one named  \nfacebook‐apps[.]com . The researchers connected two malware samples to the domain,  \nnamely a loader and PLAINTEE.  \nOnly six samples of the malware were found, and the researchers managed to link  them to  \ntwo infrastructure clusters that do not appear to overlap. Both clusters, however, were  \ninvolved in attacks targeting organizations in South East Asia, and the malware was observed  \nusing the same file paths in each cluster.  \nAt least one of the attacks used a Microsoft Office Excel document with an embedded macro  \nto launch the payload. The main malicious code was embedded in an EXIF metadata property  \nof the document. In another attack, an HTML Application file (.hta) was used, while other  \nattacks used DLL loaders.  \nOne of the DLLs downloaded a decoy from a government website that was previously used in  \na KHRAT attack and two DLLs (out of three) were found hosted on this same compromised  \nwebsite (the domain was likely hacked again in early 2018).\nFirst observed in February 2017, the DDKONG malware might be used by multiple threat  \nactors.  \nFirst observed in October 2017, PLAINTEE appears to be exclusively used by the RANCOR  \nattackers. The malware uses a custom UDP protocol for its network communications, can add  \npersistence on the victim machine, ensures only a single instance is running, and then starts  \ncollecting general system information.  \nThe malware also beacons to the command and control (C&C) server and attempts to decode  \na configuration blob. After the server responds, the malware spawns several new threads to  \nload and execute a new plugin that is to be received from the C&C in the form of a DLL with  \nan export function of either ‘shell’ or ‘file’.\nThe researchers believe the attackers were sending commands to the malware manually, due  \nto a long period of delay between these commands (automated commands are performed  \nquicker).  \n“The RANCOR campaign represents a continued trend of targeted attacks against entities  \nwithin the South East Asia region. In a number of instances, politically motivated lures were  \nused to entice victims into opening and subsequently loading previously undocumented  \nmalware families. These families made use of custom network communication to load and  \nexecute various plugins hosted by the attackers,” Palo Alto Networks concludes.  \nRelated : China‐linked KHRAT Operators Adopt New Delivery Techniques\nRelated : Hackers Linked to Luminosity RAT Targeted by Law Enforcement\n Search\nBusiness Email AddressSUBSCRIBE TO THE DAILY BRIEFING\n   \n   \n    \nMost Recent Most Read\nThe Other Virus Threat: Surge in COVID‐Themed\nCyberattacks\nBarr: FBI Probing If Foreign Gov't Behind HHS\nCyber Incident\nTrend Micro Patches Two Vulnerabilities Exploited\nin the Wild\nFinancial Services Firms Exposed 500,000 Sensitive\nDocuments\nTech Companies Partner to Securely Connect IoT\nto Cloud\nPrivate Application Access Firm Axis Security\nEmerges From Stealth\nTwo Dozen Arrested for Laundering Funds From\nBEC, Other Scams\nUsers Complain About Windows Update That\nPatches SMBGhost Vulnerability\nSenate Votes to Renew Surveillance Powers,\nDelaying Changes\nRare Android Stalkerware Can Steal Data, Control\nDevices\nPopular Topics\nInformation Security News\nIT Security News\nRisk Management\nCybercrime\nCloud Security\nApplication Security\nSmart Device Security\nSecurity Community\nIT Security Newsletters\nICS Cyber Security Conference\nCISO Forum, Presented by Intel\nInfosecIsland.Com\nStay Intouch\nTwitter\nFacebook\nLinkedIn Group\nCyber Weapon Discussion\nGroup\nRSS Feed\nSubmit Tip\nSecurity Intelligence Group\nAbout SecurityWeek\nTeam\nAdvertising\nEvents\nWriting Opportunities\nFeedback\nContact Us\nCopyright © 2020 Wired Business Media. All Rights Reserved.  Privacy Policy\nSubscribe 2019 CISO Forum, Presented by Intel ICS Cyber Security Conference Contact\nMalware & Threats Cybercrime Mobile & Wireless Risk & Compliance Security Architecture Security Strategy SCADA / ICS IoT Security\nShare\nShare\n "
}