{
    "title": "redbaldknight_bronze butler_u2019s daserf backdoor now using steganography - trendlabs security intelligence blog",
    "text": "Trend Micro About TrendLabs Security Intelligence Blog\nHome    »   Malware    »   REDBALDKNIGHT/BRONZE BUTLER’s Daserf Backdoor Now Using Steganography\nSecurity Predictions for 2020\nCybersecurity in 2020 will be viewed\nthrough many lenses — from differing\nattacker motivations and cybercriminal\narsenal to technological developments\nand global threat intelligence — only so\ndefenders can keep up with the broad\nrange of threats.\nRead our security predictions for 2020.\nBusiness Process Compromise\nAttackers are starting to invest in long-\nterm operations that target specific\nprocesses enterprises rely on. They\nscout for vulnerable practices,\nsusceptible systems and operational\nloopholes that they can leverage or\nabuse. To learn more, read our Security 101:\nBusiness Process Compromise.\nRecent Posts\nOpenSMTPD Vulnerability (CVE-2020-8794) Can\nLead to Root Privilege Escalation and Remote\nCode Execution\nOperation Overtrap Targets Japanese Online\nBanking Users Via Bottle Exploit Kit and Brand-\nNew Cinobi Banking Trojan\nMarch Patch Tuesday: LNK, Microsoft Word\nVulnerabilities Get Fixes, SMBv3 Patch Follows\nBusting Ghostcat: An Analysis of the Apache\nTomcat Vulnerability (CVE-2020-1938 and CNVD-\n2020-10487)\nDissecting Geost: Exposing the Anatomy of the\nAndroid Trojan Targeting Russian Banks\nPopular Posts\nLokiBot Impersonates Popular Game Launcher\nand Drops Compiled C# Code File\nMisconfigured Container Abused to Deliver\nCryptocurrency-mining Malware\nDissecting Geost: Exposing the Anatomy of the\nAndroid Trojan Targeting Russian Banks\nFebruary Patch Tuesday: Fixes for Critical LNK,\nRDP, Trident Vulnerabilities\nOutlaw Updates Kit to Kill Older Miner Versions,\nTargets More Systems\nStay Updated\nEmail Subscription\nYour email here\nSubscribe\nREDBALDKNIGHT/BRONZE BUTLER’s Daserf Backdoor\nNow Using Steganography\nPosted on: November 7, 2017  at 4:34 am Posted in: Malware , Targeted Attacks , Vulnerabilities\nAuthor:  Trend Micro\nby Joey Chen and MingYen Hsieh (Threat Analysts)\nREDBALDKNIGHT, also known as BRONZE BUTLER  and Tick,\nis a cyberespionage group known to target Japanese\norganizations such as government agencies (including defense)\nas well as those in biotechnology, electronics manufacturing,\nand industrial chemistry. Their campaigns employ the Daserf\nbackdoor (detected by Trend Micro as BKDR_DASERF,\notherwise known as Muirim and Nioupale) that has four main\ncapabilities: execute shell commands, download and upload\ndata, take screenshots, and log keystrokes.\nOur recent telemetry, however, indicates that variants of Daserf were not only used to spy on and\nsteal from Japanese and South Korean targets, but also against Russian, Singaporean, and\nChinese enterprises. We also found various versions of Daserf that employ different techniques\nand use steganography—embedding codes in unexpected mediums or locations (i.e., images)—to\nconceal themselves better.\nLike many cyberespionage campaigns, REDBALDKNIGHT’s attacks are intermittent but drawn-out.\nIn fact, REDBALDKNIGHT has been zeroing in on Japanese organizations as early as 2008—at\nleast based on the file properties of the decoy documents they’ve been sending to their targets.\nThe specificity of their targets stems from the social engineering tactics used. The decoy\ndocuments they use in their attack chain are written in fluent Japanese, and particularly, created\nvia the Japanese word processor Ichitaro. One of the decoy documents, for instance, was about\nthe “plan of disaster prevention in heisei 20” (Heisei is the current/modern era in Japan).\nFigure 1: File properties of one of the decoy documents that REDBALDKNIGHT sends to\nJapanese targets\nFigures 2: Sample of decoy documents used by REDBALDKNIGHT, employing socially engineered\ntitles in their spear phishing emails such as “disaster prevention”\nAttack Chain\nREDBALDKNIGHT’s attacks typically use spear phishing emails as an entry point. Their\nattachments exploit a vulnerability in Ichitaro, as shown above. These are decoy documents, often\nused by cyberespionage groups as a distraction while they execute their malware behind the\nscenes using lures such as “CPR” and “disaster prevention.”\nDaserf will be installed and launched on the affected machine once the victim opens the\ndocument. Daserf wasn’t well-known until security researchers publicly disclosed  it last year, and\nwhose beginnings they’ve traced as far back as 2011. Based on the hardcoded version number\nthey divulged (Version:1.15.11.26TB Mini), we were able to source other versions of the backdoor\n(listed in the appendix).\nFine-tuning Daserf\nOur analyses revealed Daserf regularly undergo technical improvements to keep itself under the\nradar against traditional anti-virus (AV) detection. For instance, Daserf versions 1.50Z, 1.50F,\n1.50D, 1.50C, 1.50A, 1.40D, and 1.40C use encrypted Windows application programming\ninterfaces (APIs). Version v1.40 Mini uses the MPRESS packer, which provides some degree of\nprotection against AV detection and reverse engineering. Daserf 1.72 and later versions use the\nalternative base64+RC4 to encrypt the feedback data, while others use different encryption such\nas 1.50Z, which uses the Ceasar cipher (which substitutes letters in plaintext with another that\ncorresponds to a number of letters, either upwards or downwards).\nMore notably, REDBALDKNIGHT integrated steganography to conduct second-stage, command-\nand-control (C&C) communication and retrieve a second-stage backdoor. This technique has\nbeen observed in Daserf v1.72 Mini and later versions. Daserf’s use of steganography not only\nenables the backdoor to bypass firewalls (i.e., web application firewalls); the technique also allows\nthe attackers to change second-stage C&C communication or backdoor faster and more\nconveniently.\nHow REDBALDKNIGHT Employs Steganography\nDaserf’s infection chain accordingly evolved, as shown below. It has several methods for infecting\nits targets of interest: spear phishing emails, watering hole  attacks, and exploiting a remote code\nHome Categories\nSearch:\n execution vulnerability ( CVE-2016-7836 , patched last March 2017) in SKYSEA Client View, an IT\nasset management software widely used in Japan.\nFigure 3: Daserf’s latest execution and infection flow\nA downloader will be installed on ther victim’s machine and retrieve Daserf from a compromised\nsite. Daserf will then connect to another compromised site and download an image file (i.e., .JPG,\n.GIF). The image is embedded in either the encrypted backdoor configurations or hacking tool.\nAfter their decryption, Daserf will connect to its C&C and await further commands. Daserf 1.72 and\nlater versions incorporate steganographic techniques.\nREDBALDKNIGHT’s use of steganography isn’t limited to Daserf. We also found two of their\ntoolkits employing the same technique— xxmm2_builder , and xxmm2_steganography . Based on\ntheir pdb strings, they’re both components of another REDBALDKNIGHT-related threat, XXMM\n(TROJ_KVNDM), a downloader Trojan that can also act as a first-stage backdoor with its capability\nto open a shell. While xxmm2_builder  allows REDBALDKNIGHT to customize the settings of XXMM,\nxxmm2_ steganography is used to hide malicious code within an image file.\nREDBALDKNIGHT’s tool can create, embed, and hide executables or configuration files within the\nimage file with its tag and encrypted strings via steganography. An encrypted string can be an\nexecutable file or a URL. A threat actor will use/upload an existing image that the builder then\ninjects with steganographic code. Additionally, we also found that the steganography algorithm\n(alternative base64 + RC4) between XXMM and Daserf were the same.\nFigure 4: Code snippets showing Daserf’s decode function, which is the same as XXMM’s\nFigure 5: Steganography toolkit used by REDBALDKNIGHT for XXMM\nFigure 6: Snapshots of Daserf’s steganographic code generated by their toolkit\nMitigation\nSteganography is a particularly useful technique in purposeful cyberattacks: the longer their\nmalicious activities stay undetected, the more they can steal and exfiltrate data. And indeed, the\nroutine is increasingly gaining cybercriminal traction, in varying degrees of proficiency—from\nexploit kits , malvertising campaigns , banking Trojans , and C&C communication  to even\nransomware . In the case of REDBALDKNIGHT’s campaigns, the use of steganography is further\ncompounded by their use of malware that can better evade detection and analysis.\nREDBALDKNIGHT’s continuous campaigns—along with their diversity and scope—highlight the\nimportance of defense in depth . Organizations can mitigate  these threats by enforcing the\nprinciple of least privilege to reduce their opportunities for lateral movement significantly. Network\nsegmentation  and data categorization  help in this regard. Mechanisms like access control and\nblacklisting as well as intrusion detection and prevention systems  help further secure the network\nwhile whitelisting (e.g., application control ) and behavior monitoring help detect and block\nanomalous activities from suspicious or unknown files. Safeguard the email gateway  to defend\nagainst REDBALDKNIGHT’s spear phishing methods. Disable unnecessary and outdated\ncomponents or plug-ins, and ensure that the system administration tools  are used securely, as\nthey can be misused by threat actors. And more crucially, keep the infrastructure and its\napplications up-to-date to reduce attack surface—from the gateways  and networks  to endpoints ,\nand servers .\nTrend Micro Solutions\nTrend Micro ™ Deep Discovery ™ provides detection, in-depth analysis, and proactive response to\ntoday’s stealthy malware and targeted attacks in real-time. It provides a comprehensive defense\ntailored to protect organizations against targeted attacks and advanced threats through\nspecialized engines, custom sandboxing , and seamless correlation across the entire attack\nlifecycle, allowing it to detect threats like REDBALDKNIGHT’s attacks even without any engine or\npattern update. Trend Micro™ Deep Security ™ and Vulnerability Protection  provide virtual\npatching  that protects endpoints from threats that abuses unpatched vulnerabilities. OfficeScan ’s\nVulnerability Protection shield endpoints from identified and unknown vulnerability exploits even\nbefore patches are deployed.\nTrend Micro’s suite of security solutions is powered by XGen™ security , which features high-fidelity\nmachine learning to secure the gateway  and endpoint  data and applications. XGen™ protects\nagainst today’s purpose-built threats that bypass traditional controls, exploit known, unknown, or\nundisclosed vulnerabilities, and either steal or encrypt personally-identifiable data.\nA list of the Indicators of Compromise (hashes, C&Cs) related to this research is in this appendix .\nAdditional analysis and insights by Higashi Yuka and Chizuru Toyama\nLearn how to protect Enterprises, Small Businesses, and Home Users from ransomware:\n Privacy Statement Legal Policies Copyright © 2020 Trend Micro Incorporated. All rights reserved.HOME AND HOME OFFICE  | FOR BUSINESS  | SECURITY INTELLIGENCE  | ABOUT TREND MICRO\nAsia Pacific Region (APAC): Australia  / New Zealand , 中国, 日本, 대한민국 , 台灣 Latin America Region (LAR): Brasil , México  North America Region (NABU): United States , Canada  \nEurope, Middle East, & Africa Region (EMEA): France , Deutschland / Österreich / Schweiz , Italia, Россия , España , United Kingdom / IrelandTags: BRONZE BULTER Daserf REDBALDKNIGHT steganographyENTERPRISE SMALL BUSINESS HOME » » »\n "
}