{
    "title": "roy moore scandal used for phishing schemes aimed at law firms - cyberscoop",
    "text": "Written by \n Chris Bing\nDEC 4, 2017 | CYBERSCOOP\nSince at least June, Chinese hackers have been actively targeting a\nshortlist of multinational law  rms in an apparent effort to spy on\nlawyers and steal con dential information, according to cybersecurity\n rm FireEye.\nThe hacking group, which is known as APT19, will often design phishing\ncampaigns that contain references to pertinent, high-pro le U.S. news\nstories. Most recently, these booby-trapped emails have separately\nmentioned U.S. Senate candidate Roy Moore, disgraced Hollywood\nproducer Harvey Weinstein and former presidential candidate Hillary\nClinton.\nThe hacking group has been loosely linked to China.\nFireEye says APT19 crafted the subject line “FW: Roy Moore scandal\nignites fundraising explosion for Democratic challenger Doug Jones”\nto seemingly capitalize on the contentious campaign to  ll the vacant\nsenate seat in Alabama. Moore, 70, has been accused of making\nunwanted sexual advances toward multiple teenage girls when he was\nin his 30s.\nIt’s relatively common for hackers to leverage public events to lure\ntargets into clicking a suspicious email or link. Other groups known to\nleverage this technique include Russian groups APT28 and APT29,\nmore commonly known as “Fancy Bear” and “Cozy Bear.” APT28 used\nthe technique in the aftermath of a terrorist attack in New York City\nearlier this year .\nFireEye has evidence of at least three law  rms being repeatedly and\ncontinuously targeted as part of APT19’s latest activity. These\norganizations are based in the U.S. but have of ces globally, including\nin China. All three boast business internationally, offering various\ndifferent legal practices.\nBen Read, an analyst with FireEye, told CyberScoop the most recent\nwave of APT19’s phishing emails had been detected last week. It is the\nfourth known wave of related malicious emails following a barrage of\nsimilar messages in June, October and then again in mid-November.\nIn each case, the emails carried malware inside a Microsoft word\ndocument, Read said. When opened, the document would covertly\ndownload an open-source backdoor onto the victim’s computer\nGOVERNMENT\nRoy Moore scandal used for phishing\nschemes aimed at U.S. law  rms\n(Roy moore for senate)\nGOVERNMENT TRANSPORTATION HEALTHCARE TECHNOLOGY FINANCIAL WATCH LISTEN ATTEND CONTENT STUDIOSUBSCRIBE ABOUT RSS\n BROUGHT TO YOU BY\n Privacy Policy\n© 2020 Scoop News Group | All Rights Reserved\nbefore then establishing a connection to the attacker’s own server.\nThis backdoor can provide APT19 with wide-access to a compromised\ndevice as well as the network it is connected to.\nAll four identi ed waves of phishing emails targeted the same group\nof law  rms. FireEye’s visibility into the threat is limited to its\ncustomer base, meaning that a variety of other APT19 targets may\nexist.\n“It’s dif cult to say what they’re after because the lures are so broadly\nwritten and we’re stopping them at the perimeter, before they really\nget a chance to do much,” said Read. “It’s feasible that APT19 is looking\nto steal  nancial documents, including information about business\nmergers and acquisitions which could be worth a lot.”\nFireEye  rst detailed APT19’s interest in law  rms \n in June. Read says\nthe group has continued to use the same toolset since June although\nin some instances they’ve slightly tweaked their intrusion techniques\nto avoid detection. The original sighting in June saw APT19 use a well-\nknown and outdated Microsoft of ce vulnerability (CVE-2017-0199) to\ndeliver malware.\n“Based on what we can observe, the targets are mostly the same every\ntime (major U.S.-based law  rms),” said FireEye analyst Ian Ahl. “The\nemails all originate from an APT19 owned domain, but the sender\nusername is often changed.”\nRead said it remains unclear whether APT19 is in any way af liated\nwith the Chinese government.\nLast week, the Justice Department indicted three Chinese hackers who\nwere at one point connected to a group also tracked by FireEye,\nnamed APT3. While there’s some indication those indicted individuals\nworked for a state run intelligence agency, the trio regularly used what\nappeared to be a Chinese shell company to obfuscate the nature of\ntheir offensive operations. Experts say it’s typical for Beijing to use a\nmix of contractors and fake companies to hide traditional intelligence\ngathering efforts which are in reality led by state agencies.\n-In this Story-\nadvanced persistent threat (APT) , APT19, breaches , China, FireEye, government , hacking,\nIntelligence , law  rms , legal, security research\nFSB asset introduced...\nby Jeff Stone  • 2 days agoElection commission hires...\nby Sean Lyngaas  • 3 days agoWhat to expect from the...\nby Shannon Vavra  • 4 days agoRELATED NEWS\nGOVERNMENT\n GOVERNMENT\n GOVERNMENT\nAD SPECS SPONSOR RSS\nWe use cookies  to provide you with the best experience across all Scoop News Group websites.\nBy using Scoop News Group websites, you consent to the use of cookies. Learn more GOT IT!\n "
}