{
    "title": "rp-operation-oceansalt",
    "text": "REPORT\n‘Operation Oceansalt’ Attacks South \nKorea, U.S., and Canada With Source \nCode From Chinese Hacker Group\nMcAfee Advanced Threat ResearchOctober 18, 2018REPORT\n2 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupComment Crew or Another Actor?\nThe actions of Comment Crew, also known as APT1, \nwere exposed in 2013 in a ground-breaking report on \nChinese cyber espionage against the United States. This \nreport detailed the inner workings of Comment Crew \nand its cyber offensive capabilities. The consequences \nof releasing this public report forced the group to either \nmake changes to their techniques or cease their activity \naltogether. Until this analysis, we had observed no new activity related to Comment Crew since they were \nexposed, but now we find portions of their implant code \nappearing in new operations targeting South Korea.\nAs we investigated this code overlap, we found no \nevidence that the source code from Comment Crew \nwas ever made public, nor did we find it being sold in \nunderground markets we examined. Has Comment \nCrew returned? We think it is unlikely. Due to the lack of \nindications that this is a new Comment Crew campaign, it ‘Operation Oceansalt’ Attacks South Korea, \nU.S., and Canada With Source Code From \nChinese Hacker Group\nIntroduction\nMcAfee® Advanced Threat Research and Anti-Malware Operations teams have discovered \nanother unknown data reconnaissance implant targeting Korean-speaking users. We \nhave named this threat Operation Oceansalt based on its similarity to the earlier malware \nSeasalt, which is related to earlier Chinese hacking operations. Oceansalt reuses a portion \nof code from the Seasalt implant (circa 2010) that is linked to the Chinese hacking group \nComment Crew. Oceansalt appears to have been part of an operation targeting South \nKorea, United States, and Canada in a well-focused attack. A variation of this malware has \nbeen distributed from two compromised sites in South Korea. (They are currently offline.) \nOceansalt appears to be the first stage of an advanced persistent threat. The malware can \nsend system data to a control server and execute commands on infected machines, but \nwe do not yet know its ultimate purpose. The Advanced Threat Research team has not \npreviously described this implant in any of our analyses.Authors\nThis report was researched  \nand written by:\n ■Ryan Sherstobitoff \n ■Asheer Malhotra\nConnect With Us3 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nraises the question of who is responsible. Based on our \nresearch, we offer a few potential scenarios that could \nexplain the existence of Comment Crew’s code in the \ncurrent actor’s malware targeting South Koreans.\n ■This is a code-sharing arrangement between two \nactors\n ■An actor has privately gained access to the source \ncode from someone involved in the original Comment \nCrew operations\n ■This is a “false flag” operation using Comment Crew’s \ncode to make it appear that China and North Korea \nhave collaborated on this cyberattack\nDoes the Actor Speak Korean?\nThe contents of the malicious documents were written in \nKorean and contained subjects specifically relating to the \nfinances of projects in South Korea. These documents \nappear to be unique, not found on open-source \nchannels. We were not able to determine the source of \nthese documents, suggesting they were created by the \nactor.\nThe metadata in the malicious Microsoft Office \ndocuments used in the attacks contains a Korean-\nlanguage code page. This data indicates the document \ncontained the Korean-language pack, most likely to \nensure the victims could read it. We also see a consistent \nauthor, which is typical of the techniques of previous \ncampaigns we have analyzed that involved malicious \ndocuments targeting South Koreans.\nFigure 1. Metadata from a code page in a malicious .xls document.\nThe Advanced Threat Research team concludes that we \nhave found a new implant family created by an actor \ntargeting Korean-speaking users and using components \nfrom Comment Crew’s source code. Furthermore it is \nlikely that the actor has a good working knowledge of the \nKorean language.\nTargets\nDuring our research we discovered the initial attack \nvector was spear phishing, with two malicious Korean-\nlanguage Microsoft Excel documents acting as \ndownloaders of this implant. According to our document \nanalysis, the targets likely had knowledge of South \nKorean public infrastructure projects and related \nfinancials—a clear indication that the actor focused \ninitially on infrastructure.\nA second round of malicious documents, this time in \nMicrosoft Word, carried the same metadata and author \nas the Excel documents. The content was related to the \nfinancials of the Inter-Korean Cooperation Fund. The 4 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nmalicious activity first appeared on May 31, 2018, in \nSouth Korea. Further telemetry indicates organizations \noutside of Korea have fallen victim to this attack; as of \nAugust 14, the attack had reached multiple industries in \nCanada and the United States.\nThe date of the attack’s first appearance in North \nAmerica is unknown. We did not find Office documents \naffecting targets in Canada and the United States, but \nour telemetry indicates the threat has also affected \nsystems in North America. It is possible the attack \non North American companies is part of a separate \ncampaign from the one targeting Koreans, especially \nbecause we discovered only a handful of malicious \ndocuments and they distributed only one variant of the \nimplant out of several we found. Based on our telemetry, \nthe team learned these organizations were in the \ninvestment, banking, and agriculture industries.\nObjectives and Impact\nOur research suggests the targets were those who \nwould read documents related to South Korea’s public \nconstruction expenses, Inter-Korean Cooperation fund, \nor other global financial data. One possible motive for \nthe campaign is financial theft. These attacks might \nbe a precursor to a much larger attack that could be \ndevastating given the control the attackers have over \ntheir infected victims. The impact of these operations \ncould be huge: Oceansalt gives the attackers full control \nof any system they manage to compromise and the \nnetwork it is connected to. A bank’s network would be \nan especially lucrative target.Further, the code overlaps with that from a previously \nreported advanced state-sponsored group. The overlap \nsuggests a close collaboration between members of \na state-sponsored group and the current actors in \nconducting cyber operations.\nCampaign Analysis\nThe campaign to target and compromise victims across \nthe world began in Korea and expanded globally in \nstages. The distribution URLs for the implants were fairly \nconsistent for the malicious documents; it appears the \nactor hacked a number of South Korean websites to \nhost the implant code.\nWave One: South Korean higher education\nThe first wave of attacks began with a malicious \ndocument created May 18, with a last saved date of May \n28. The author of this Korean-language document was \nLion, whom we will continue to see throughout later \ndocuments.\nFigure 2. Metadata from a first-wave malicious document.5 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nIn the first wave the malicious Excel file contains a list of \nKorean names, physical addresses, and email addresses. \nMany of the names belong to those involved in higher \neducation in South Korea or who attend various \ninstitutes. However, the list is random and looks like a \ncopy of a database of personal information from a South \nKorean government authority.\nThis document contains macro code to download the \nimplant from www.[redacted].kr/admin/data/member/1/\nlog.php and execute it as V3UI.exe, the name of a \nsecurity product in South Korea.\nWave Two: South Korean public infrastructure\nThe Advanced Threat Research team discovered that the \nimplant was hosted at a legitimate site in South Korea \nbelonging to a music teachers organization that has \nno relationship to the malicious document. The actor \nhosted a PHP page that triggered the download of the \nimplant from a malicious VBA script embedded in two \nExcel documents, which contained Visual Basic macros \nto communicate, download, and install an implant on \nthe victim’s system once the document was opened and \nviewed. The documents were submitted to us by a South \nKorean organization during the first wave of attacks.hxxp://[redacted].kr/admin/data/member/1/log.php\nFigure 3. The download URL for the second wave of attacks, against \npublic infrastructure.\nThis Excel document was created May 31 by the author \nLion, a day before the implant was compiled and hosted \non the distribution site. The documents appear to be \nrelated to South Korean public infrastructure projects \nand their expenses. Based on our analysis of the \ndocuments, it is clear that this attack is targeted toward \nSouth Korean individuals in this field.\nFigure 4. Metadata from a second-wave malicious document.6 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nFigure 5. Malicious document 1: investment trends in public infrastructure projects.7 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nFigure 6. Malicious document 2: expenses in public infrastructure \nprojects.\nFigure 7. Malicious document 3: a public projects expense report.\nThe last document in this wave was created by Lion \non June 4 with the filename 0. 온나라 _상용_SW_2018 년 \n대상_list _(20180411)_ 지역업체 .xls. This document was \nobserved downloading the implant from the distribution \nserver. It references Onnara, a government agency \nresponsible for land and development in South Korea.8 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nWave Three: Inter-Korean Cooperation\nThe third wave included a Word document with \nthe same type of macro code as the Excel files. The \ndocument contained fake information related to the \nfinancials of the Inter-Korean Cooperation Fund. The \ndocument was created at the same time as the attacks \non South Korean public infrastructure officials. Lion \nauthored both Excel and Word documents. This Word \ndocument used a different South Korean compromised \nwebsite to distribute the implant. In this wave, an \nadditional Excel document appeared with telephone \nnumbers and contact information connected to the \ncontent of the Word document.\nhxxp://[redacted].kr/gbbs/bbs/admin/log.php\nFigure 8. The distribution URL for the implant for Wave Three.\nFigure 9. Fake statistics statement monthly report from the Inter-Korean Corporation Fund.9 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nFigure 10. Fake statistics statement monthly report from the Inter-Korean Corporation Fund.10 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nFigure 11. Fake product and partner information.11 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nWave Four: Targets outside of South Korea\nWe identified a small number of targets outside of \nSouth Korea, as the attacks expanding their scope. We \nhave yet to identify the malicious documents involved \nin delivering this implant to the victims. Because Waves \nOne and Two contained different distribution servers \nfor the implant, we expect this wave had its own as well. \nAccording to McAfee telemetry data between August 10 \nand 14, these North American targets fall within several \nindustries:\nIndustry Country\nFinancial United States\nHealth Care United States\nHealth Care United States\nTelecommunications Canada\nFinancial United States\nAgriculture and Industrial United States\nFinancial United States\nTelecommunications Canada\nFinancial Canada\nFinancial Technology United States\nGovernment United States\nFigure 12. Victims in Wave Four of the campaign.Wave Five: South Korea and United States\nThe Oceansalt implant was not limited to just one \nsample. We discovered additional variants using \ndifferent control servers. As we continued to investigate, \nwe found more samples, though obfuscated to \navoid detection. The samples were all identical to \nthe initial Oceansalt implant. The fifth-wave samples \nwere compiled between June 13 and July 17 and were \nsubmitted to us by organizations in South Korea and the \nUnited States.\nHash Compile Date Control Server\n38216571e9a9364b509e52ec19fae61b 6/13/2018 172.81.132.62\n531dee019792a089a4589c2cce3dac95 6/14/2018 211.104.160.196\n0355C116C02B02C05D6E90A0B3DC107C 7/16/2018 27.102.112.179\n74A50A5705E2AF736095B6B186D38DDF 7/16/2018 27.102.112.179\n45C362F17C5DC8496E97D475562BEC4D 7/17/2018 27.102.112.179\nC1773E9CF8265693F37DF1A39E0CBBE2 7/17/2018 27.102.112.179\nD14DD769C7F53ACEC482347F539EFDF4 7/17/2018 27.102.112.179\nB2F6D9A62C63F61A6B33DC6520BFCCCD 7/17/2018 27.102.112.179\n76C8DA4147B08E902809D1E80D96FBB4 7/17/2018 27.102.112.17912 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nTechnical Analysis\nDownload and execution capabilities\n ■Once the .xls/.doc files are opened in Office, \nembedded malicious macros contact a download \nserver and write the Oceansalt implant to disk\n ■These malicious macros execute the Oceansalt implant \non the infected endpoint\nThe indicators of compromise from the malicious .xls \ndownloaders:\nIOC Description IOC Value\nDownload servers contacted [redacted].kr  \n[redacted].kr\nOceansalt location on the \ndownload server/admin/data/member/1/log[.]php  \n/gbbs/bbs/admin/log[.]php\nOceansalt location on the \ninfected endpoint%temp%\\SynTPHelper[.]exe  \n%temp%\\LMworker[.]exe\nFigure 13. A portion of the malicious macro code used to download the implant.13 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nControl Server\nThe campaign employed multiple control servers. We \nobserved the following IP addresses in implants dating \nfrom June to July.\n ■172.81.132.62\n ■211.104.160.196\n ■27.102.112.179\n ■158.69.131.78\nOur telemetry shows this campaign is operational in \nseveral countries. Address 211.104.160.196 indicates \ninfections in Costa Rica, the United States, and the \nPhilippines. Address 158.69.131.78 reveals additional \ninfections in the United States and Canada.\nThese machines resided in numerous countries \nfrom August 18–21. Because this operation involves \nmultifunction implants, these machines are likely to be \npart of a larger covert listener network. The Advanced \nThreat Research team has observed this kind of \ntargeting in similar operations that compromise victims \nas control server relays.\nImplant Origins\nOur initial investigation into earlier similar samples led \nus to a variant—bf4f5b4ff7ed9c7275496c07f9836028, \ncompiled in 2010. Oceansalt uses portions of code from \nthis sample; their overall similarity is 21%. The reused \ncode is unique, is not considered a common library or \ncommon code, and serves reconnaissance and control.The misclassified sample used a Comment \nCrew domain. Further investigation revealed \nthe misclassified sample is 99% like Seasalt \n(5e0df5b28a349d46ac8cc7d9e5e61a96 ), a Comment \nCrew implant reported to have been used in their \noperations around 2010. Thus the Oceansalt actor is \nreusing portions of code from Seasalt to form a new \nimplant. Based on the overall techniques, Oceansalt is \nunlikely to signal a rebirth of Comment Crew, raising the \nquestion of how the actor obtained the Seasalt code. \nWas it provided to this or another actor, or was it leaked \nand discovered by this actor? We have been unable to \nfind any evidence in underground or public forums that \nsuggest the source code of Seasalt has been leaked or \nmade available.\nWe discovered another batch of samples compiled \non July 16–17 that are obfuscated and essentially the \nsame implant, with minor changes such as the control \nservers. Some of the samples are missing reverse-shell \nfunctionality, indicating that this actor has access to \nSeasalt source code and can compile implants from \nthe original source. This could demonstrate is a level of \ncollaboration between two nation-states on their cyber \noffensive programs.\nCode Similarities with Seasalt\nOceansalt contains the following strings that are part of \nSeasalt:\n ■Upfileer\n ■Upfileok14 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nFigure 14. Seasalt strings appearing in Oceansalt.\nFigure 15. Seasalt strings appearing in Oceansalt.\nBoth implants have a high degree of similarity in code \nsharing and functions. A few of their commonalities \nfollow.\nCommand handler and index table similarities\nThe command handler for both implants uses similar \nsemantics and command codes to execute the same \nfunctionalities. Even the mechanism for calculating the \ncommand code is similar. Seasalt code is represented on \nthe left and Oceansalt appears on the right:\nFigure 16. Command handler similarity between Seasalt, at left, and Oceansalt.\nFigure 17. Command index table similarity between Seasalt, at left, and Oceansalt.\nCommand and capability similarities\nBoth implants execute their capabilities in the same \nway, which indicates they were both developed from \nthe same code base. The response codes used by \nboth implants to indicate the success or failure of the \ncommands executed on the endpoint are also an exact \nmatch. Some of these similarities:\n ■Drive reconnaissance capability: Similar code \nsignatures. Both implants use the same codes to \nindicate the drive type to the control server.15 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nFigure 18. Similarity in the drive recon functionality. Seasalt is at left.16 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\n ■File reconnaissance capability: Similar API and code \nusage to get file information. The response codes sent \nto the control server to indicate whether a file was \nfound is an exact match.\nFigure 19. Similarity in the command execution capability. Seasalt is at left.17 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\n ■Reverse-shell creation capability: Both implants use \nsimilar code signatures to create a reverse shell on the \ninfected endpoint. Both reverse shells are based on \ncmd.exe.\nFigure 20. Reverse-shell creation capability similarities. Seasalt is at left.18 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nCode Differences from Seasalt\nThere are a few differences between the two implants \nin implementation; these demonstrate that Oceansalt \nis not simply a recompilation of Seasalt source code. \nHowever, these differences also provide evidence that \nOceansalt is an evolution of Seasalt.\n ■Encoding:  The Oceansalt implant uses an encoding \nand decoding mechanism before any data is sent to \nthe control server. The Seasalt implant does not use \nthis encoding and sends unencrypted data to the \ncontrol server.\n ■Control server address: Oceansalt uses a hardcoded \ncontrol server address to establish communication. \nSeasalt parses the control address from its binary by \ndecoding data.\n ■Persistence:  Oceansalt has no persistence \nmechanisms to ensure continued infection over \nendpoint reboots. Seasalt, on the other hand, copies \nitself to C:\\DOCUMEN~1\\<userid>\\java.exe and creates \na registry entry to ensure infection after reboot:\n −HKLM\\Software\\Microsoft\\Windows\\currentVersion\\\nRun | sysinfo\nBased on the executable header information, Seasalt \nwas compiled on March 30, 2010. Oceansalt was \ncompiled on June 1, 2018. Highlighting the compilation \ntimestamps is important because, as our preceding \nanalysis demonstrates, the samples have a high degree \nof code sharing: ■Multiple code matches and similarities\n ■Multiple functional similarities\n ■Identical command capabilities\n ■Same command and response codes issued by and \nsent to the control server\nThe code used to create the reverse shell in Oceansalt \nis an exact match with that of Comment Crew’s Seasalt \nimplant. The mechanism for creating the reverse shell \n(pipe-based inter-process communication for standard \nI/O handles) is also seen in Comment Crew implants \nsuch as WebC2-CSON and WebC2-GREENCAT.\nThese matches lead us to believe that Oceansalt is \nbased on Seasalt, because it reuses much of the code \nbase developed 10 years ago. Seasalt’s public disclosure \nin the Comment Crew report does not seem to have \ndiscouraged Oceansalt’s developer.\nObfuscated Oceansalt Comparison with Seasalt\nWe offer a comparative analysis of the following partially \nobfuscated implants against the initial Oceansalt sample \nand the Seasalt implant from Comment Crew.\nSHA-1 Compile Date Role\nfc121db04067cffbed04d7403c1d222d376fa7ba 7/16/2018 Partially obfuscated Oceansalt\n281a13ecb674de42f2e8fdaea5e6f46a5436c685 7/17/2018 Partially obfuscated Oceansalt\n1f70715e86a2fcc1437926ecfaeadc53ddce41c9 7/17/2018 Partially obfuscated Oceansalt\nec9a9d431fd69e23a5b770bf03fe0fb5a21c0c36 7/16/2018 Partially obfuscated Oceansalt\n12a9faa96ba1be8a73e73be72ef1072096d964fb 7/17/2018 Partially obfuscated Oceansalt\nbe4fbb5a4b32db20a914cad5701f5c7ba51571b7 7/17/2018 Partially obfuscated Oceansalt\n0ae167204c841bdfd3600dddf2c9c185b17ac6d4 7/17/2018 Partially obfuscated Oceansalt19 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nAll the partially obfuscated Oceansalt implants have the \nfollowing characteristics:\n ■All implants were compiled during a three-day period: \nJuly 16–18\n ■All implants contain debug statements (print logs) \nwritten to the log file: C:\\Users\\Public\\Videos\\temp.log\n ■These debug statements begin with the timestamp \nand consist of the following keywords at the beginning \nof the debug message:\n −[WinMain]\n −[FraudProc]\n ■All implants connected to the same control server IP \naddress: 27.102.112.179\n ■Although none of the partially obfuscated implants \ncontain any additional capabilities (as compared with \nthe initial Oceansalt or Seasalt), some of the partially \nobfuscated implants are missing the reverse-shell \ncapabilities:\nPartially Obfuscated Oceansalt HashReverse-Shell \nCapability?\nC1773E9CF8265693F37DF1A39E0CBBE2 No\n0355C116C02B02C05D6E90A0B3DC107C Yes\n74A50A5705E2AF736095B6B186D38DDF Yes\n45C362F17C5DC8496E97D475562BEC4D No\nD14DD769C7F53ACEC482347F539EFDF4 No\nB2F6D9A62C63F61A6B33DC6520BFCCCD Yes\n76C8DA4147B08E902809D1E80D96FBB4 YesEvidence of Source-Code Sharing\nWe present evidence of source-code sharing between \nthe Oceansalt authors and Comment Crew, based on \nour comparative analysis of the three sets of samples: \nOceansalt, partially obfuscated Oceansalt, and Seasalt.\n ■There is no possibility the attackers could have re-\ninstrumented Seasalt by simply modifying the control \nserver IP addresses:\n −The mechanism for obtaining the address in Seasalt \nis different from Oceansalt’s. Seasalt looks for \nencoded data at the end of the binary, decodes this \ndata into tokens separated by the marker “$,” and \nobtains the control server information.\n −Oceansalt implants have the control server IP \naddresses and port numbers hardcoded as plain-\ntext strings in the binaries\n ■Some of the partially obfuscated Oceansalt implants \nare missing the reverse-shell capability. All other \ncapabilities (code signatures, response codes, etc.) \nand command codes are similar. (Command codes are \neither the same or off by 1.) Modifying capabilities in \nthis fashion is possible only with access to the source \ncode of Seasalt.20 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\n ■The presence of debug strings tracing the code flow of \nthe Oceansalt implants indicates they were compiled \nafter adding debug information to the source code of \nSeasalt:\n −[WinMain]after recv cmd=%d 0Dh 0Ah\n −[WinMain]before recv 0Dh 0Ah\n −[FraudProc]Engine is still active! 0Dh 0Ah\n −[FraudPRoc]Process Restart! 0Dh 0Ah\n ■The presence of these debug strings also indicates \nthat the authors who modified the source code may \nhave used these samples to perform their initial \ntesting before obfuscating and releasing the implants \nto their victims, without scrubbing the debug strings\n ■The Oceansalt implant \n531dee019792a089a4589c2cce3dac95 (compiled June \n1) contains a few key features that indicate compilation \nfrom the source code of Seasalt:\n −Does not contain the reverse-shell capability\n −Does not contain the drive recon capability\n −Loads API SHGetFileInfoA() dynamically without \nstatically importing it. This also suggests that \nSeasalt’s source code was modified before \ncompilation.\nFigure 21. Dynamic API loading in an Oceansalt implant.21 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nOceansalt Capabilities\nOceansalt is 76KB, a minimal on-disk footprint that is \nharder to detect than larger malware. The implant has a \nvariety of capabilities for capturing data from the victim’s \nmachine using a structured command system. From \nour research we have determined that this implant is a \nfirst-stage component. Further stages are downloaded \nthrough its commands. Oceansalt also supports \ncommands enabling the attacker to take various actions \non the victim’s system.\nInitial reconnaissance\nOceansalt starts by trying to connect to its control server \nat 158.69.131.78:8080. Once connected, the implant \nsends the following information about the endpoint:\n ■IP address\n ■Computer name\n ■File path of the implant\nAll data sent to the control server is encoded with a NOT \noperation on each byte.\nFigure 22. Initial data gathered from the endpoint by Oceansalt.\nFigure 23. Control server connection functionality for Oceansalt.22 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nCommand handler functions\nOceansalt can execute 12 commands. Each command \nreceived from the control server is represented by a \ncommand code ranging from 0x0 to 0xB (0 to 11).\nFigure 24. Command index table showing Oceansalt’s capabilities.23 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nFigure 25. Oceansalt’s command execution functionality.24 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\n0x0: Drive recon\nThe control server sends this command code to \nOceansalt to extract drive information from the \nendpoint. The format of the drive information: \n#<Drive _ letter>:<Drive _ type><Drive _\nletter>:<Drive _ type>...#\nLegend Description\n<Drive_letter> A,B,C,D,E, etc., representing all logical drives on \nthe system\n<Drive_type> 0 = DRIVE_REMOVABLE \n1 = DRIVE_FIXED \n2 = DRIVE_CDROM \n3 = DRIVE_REMOTE\nFigure 26. Oceansalt gathering drive information.25 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\n0x1: File recon\nSends the following information about a specific file (or \nfile pattern) specified by the control server:\n ■Filename\n ■Type of file on disk, for example, file or folder\n ■“OK” if file was found on the location\n ■File creation time in format <YYYY-mm-DD HH:MM:SS>\n0x2: Command execute\nExecutes a command line using WinExec(). The \ncommand line is provided by the control server along \nwith the command number. For example:\n<DWORD representing command \nnumber><command line to be executed> \n02 00 00 00 C:\\Windows\\system32\\calc.exe\nThe command line is executed with a hidden window \n(using the SW_HIDE option for WinExec()).\nFigure 27. Oceansalt’s command execution capability.0x3: File delete\n ■Deletes a file specified by the control server from the \ndisk\n ■Once an operation is completed, the implant sends \na “0” (in ASCII) to the control server to indicate the \nsuccessful execution of the command\n ■If the operation fails, Oceansalt sends a “1” (in ASCII) to \nindicate failure\n0x4: File write\n ■Creates a file specified by a file path provided by the \ncontrol server, which also provides the content to be \nwritten to the file path\n ■If the file write is successful, Oceansalt sends the \nkeyword “upfileok” indicating success\n ■If the file write fails, the implant sends the keyword \n“upfileer” indicating failure26 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nFigure 28. Oceansalt’s file-writing capability.0x6: Process recon\n ■Sends the name and ID for every process running on \nthe system to the control server\n ■Process data is sent via individual packets, that is, one \npacket per process\nFigure 29. Oceansalt’s process listing via its recon capability.27 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\n0x7: Process terminate\n ■Terminates a process whose ID has been specified by \nthe control server\n0x8: Reverse shell create\n ■Opens a reverse shell from the infected endpoint to \nthe control server using Windows pipes\n ■This reverse shell is based on cmd.exe. It can carry out \nfurther recon and make changes to the endpoint.\nFigure 30. Oceansalt’s reverse-shell creation capability.28 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\n0x9: Reverse shell operate\n ■Operates the reverse shell established using the \nprevious command code\n ■Contains the commands sent by the control server to \nthe reverse shell that will be executed by cmd.exe on \nthe infected endpoint\n ■Once the command has been executed, the output is \nread from cmd.exe via a pipe and sent to the control \nserver\n0XA: Reverse shell terminate\n ■Closes the reverse shell by closing handles to the pipes \ncreated for the shell’s inter-process communication\n0XB: Connection test\n ■Tests receive and send capabilities of the implant by \nreceiving data (0x7 bytes) from the control server and \nsending it back\n ■Persistence\n ■Oceansalt has no persistence capabilities to remain on \nthe endpoint after the system reboots\n ■This lack suggests other components in the infection \nchain may ensure persistence and carry out other \nmalicious activitiesConclusion\nBased on our analysis, the McAfee Advanced Threat \nResearch team has named this global threat Operation \nOceansalt. This operation has focused on targets in \nSouth Korea and other countries with new malware that \nhas roots in Comment Crew activity from 2010.\nOur research shows that Comment Crew’s malware in \npart lives on in different forms employed by another \nadvanced persistent threat group operating primarily \nagainst South Korea. This research represents how \nthreat actors including nation-states might collaborate \non their campaigns. McAfee continues to monitor the \nthreat landscape in Asia and around the world to track \nthe evolution of known groups and changes to their \ntechniques.29 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupREPORT\nMcAfee Coverage\n ■Generic.dx!tjz\n ■RDN/Generic.grp\n ■RDN/Generic.ole\n ■RDN/Generic.grp (trojan)\n ■RDN/Trojan-FQBD\n ■RDN/Generic.RP\nIndicators of Compromise\nMITRE ATT&CK™ Techniques\n ■Scripting\n ■Spear phishing attachment\n ■Automated collection\n ■Command-line interface\n ■Network share discovery\n ■Process discovery\n ■File and directory discovery\n ■Data from local system\n ■Data from removable media\n ■Data from network shared drive\n ■Exfiltration over control server channelIP addresses\n ■158.69.131.78\n ■172.81.132.62\n ■27.102.112.179\n ■211.104.160.196\nHashes\n ■fc121db04067cffbed04d7403c1d222d376fa7ba\n ■832d5e6ebd9808279ee3e59ba4b5b0e884b859a5\n ■be4fbb5a4b32db20a914cad5701f5c7ba51571b7\n ■1f70715e86a2fcc1437926ecfaeadc53ddce41c9\n ■dd3f b2750da3e8fc889cd1611117b02d49c f17f 7\n ■583879cfaf735fa446be5bfcbcc9e580bf542c8c\n ■ec9a9d431fd69e23a5b770bf03fe0fb5a21c0c36\n ■d72bc671583801c3c65ac1a96bb75c6026e06a73\n ■e5c6229825f11d5a5749d3f2fe7acbe074cba77c\n ■9fe4bfdd258ecedb676b9de4e23b86b1695c4e1e\n ■281a13ecb674de42f2e8fdaea5e6f46a5436c685\n ■42192bb852d696d55da25b9178536de6365f0e68\n ■12a9faa96ba1be8a73e73be72ef1072096d964fb\n ■0ae167204c841bdfd3600dddf2c9c185b17ac6d4About McAfee\nMcAfee is the device-to-cloud cybersecurity company. \nInspired by the power of working together, McAfee \ncreates business and consumer solutions that make \nour world a safer place. By building solutions that \nwork with other companies’ products, McAfee helps \nbusinesses orchestrate cyber environments that are \ntruly integrated, where protection, detection, and \ncorrection of threats happen simultaneously and \ncollaboratively. By protecting consumers across all \ntheir devices, McAfee secures their digital lifestyle \nat home and away. By working with other security \nplayers, McAfee is leading the effort to unite against \ncybercriminals for the benefit of all. \nwww.mcafee.com .\nMcAfee and the McAfee logo are trademarks or registered trademarks of McAfee, LLC or its subsidiaries in the US and other countries. \nOther marks and brands may be claimed as the property of others. Copyright © 2017 McAfee, LLC.  4149_1018\nOCTOBER 20182821 Mission College Blvd.\nSanta Clara, CA 95054\n888.847.8766\nwww.mcafee.com\n30 ‘Operation Oceansalt’ Attacks South Korea, U.S., and Canada With Source Code From Chinese Hacker GroupAbout McAfee Labs and Advanced Threat \nResearch\nMcAfee Labs, led by McAfee Advanced Threat \nResearch, is one of the world’s leading sources for \nthreat research, threat intelligence, and cybersecurity \nthought leadership. With data from millions of sensors \nacross key threats vectors—file, web, message, and \nnetwork— McAfee Labs and McAfee Advanced Threat \nResearch deliver real-time threat intelligence, critical \nanalysis, and expert thinking to improve protection and \nreduce risks. \nwww.mcafee.com/us/mcafee-labs.aspx ."
}