{
    "title": "rpt-magnified-losses-amplified-need-for-cyber-attack-preparedness",
    "text": "TrendLabsSM 2014 Annual Security RoundupMagnified Losses, Amplified \nNeed for Cyber-Attack PreparednessTREND MICRO LEGAL DISCLAIMER\nThe information provided herein is for general information and educational purposes only. It is not intended and should not be construed to constitute legal advice. The information contained herein may not be applicable to all situations and may not reflect the most current situation. Nothing contained herein should be relied on or acted upon without the benefit of legal advice based on the particular facts and circumstances presented and nothing herein should be construed otherwise. Trend Micro reserves the right to modify the contents of this document at any time without prior notice.\nTranslations of any material into other languages \nare intended solely as a convenience. Translation accuracy is not guaranteed nor implied. If any questions arise related to the accuracy of a translation, please refer to the original language official version of the document. Any discrepancies or differences created in the translation are not binding and have no legal effect for compliance or enforcement purposes.\nAlthough Trend Micro uses reasonable efforts \nto include accurate and up-to-date information herein, Trend Micro makes no warranties or representations of any kind as to its accuracy, currency, or completeness. You agree that access to and use of and reliance on this document and the content thereof is at your own risk. Trend Micro disclaims all warranties of any kind, express or implied. Neither Trend Micro nor any party involved in creating, producing, or delivering this document shall be liable for any consequence, loss, or damage, including direct, indirect, special, consequential, loss of business profits, or special damages, whatsoever arising out of access to, use of, or inability to use, or in connection with the use of this document, or any errors or omissions in the content thereof. Use of this information constitutes acceptance for use in an “as is” condition.\nContents\nScale of Impact and Losses Due \nto Cyber Attacks Intensified5\n2014 Was the “Year of PoS RAM Scrapers”8\nHeartbleed and Shellshock Proved That No Application Was Invulnerable12\nOnline and Mobile Banking Faced Bigger Security Challenges14\nRansomware Became a Bigger and More Sophisticated Threat17\nThreat Actors and Cybercriminal Economies Continued to Thrive Worldwide24\nReferences34Overall Threat Volumes Decrease, but Phishing Almost Doubles262014 showed how destructive attacks could be to individuals and companies \nalike. Effects of losing massive amounts of confidential data to attackers such as substantive financial losses and irreparable reputation damage ran rampant throughout the year. The severity of the attacks and their effects revealed one thing—the risks of becoming the next victim of a cyber attack have gone higher.\nVarious companies suffered financial, legal, operational, and productivity \nlosses after getting hit by massive data breaches. Breaches across industries aided by point-of-sale (PoS) RAM scrapers, for one, increased in number in 2014. The year was not solely marred by the biggest breaches seen to date though, as attacks targeting vulnerabilities like Heartbleed and Shellshock in widely used, previously considered secure open source software as well as FakeID and Same Origin Policy (SOP) Bypass in mobile devices and platforms were also seen. Established processes like two-factor authentication also proved vulnerable to threats, as evidenced by attacks instigated by the criminals behind Operation Emmental.\nAs years pass, we are bound to see more crippling attacks against both \nlikely and unlikely targets. Attackers will always trail their sights on one thing—profit. They will continue to indiscriminately hit data gold mines because peddling stolen information is a lucrative business, as evidenced by the thriving cybercriminal underground economy.\nMerely dealing with threats as they surface is no longer enough, acting \non risk assessment results prior to security incidents is actually more beneficial. Organizations need to rethink their current cybersecurity investments so they can easily respond to and mitigate attacks. Planning ahead so they can instantly take action if they need to is critical because these kinds of cyber attacks can happen to companies in any industry and of whatever size.All in all, it’s a combination \nof identifying what’s most important, deploying the right technologies, and educating users. It is everybody’s job–not just that of IT professionals–to ensure that the company’s core data stays safe.\n—Raimund Genes\nTrend Micro CTO\nNOTE: All mentions of “detections” within the text refer to instances when threats were found on users’ computers and subsequently \nblocked by any Trend Micro security software. Unless otherwise stated, the figures featured in this report came from data gathered by the Trend Micro™ Smart Protection Network™ cloud security infrastructure, which uses a combination of in-the-cloud technologies and client-based techniques to support on-premise products and hosted services.TREND MICRO | TrendLabs 2014 Annual Security Roundup5 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessScale of Impact and Losses Due \nto Cyber Attacks Intensified\nMassive data breach disclosures came one after another in 2014 in much more rapid succession than past years. The Sony \nPictures breach illustrated the wide spectrum of losses that can hit a company that has failed to secure its network.\nAs expected, major data breach incidents were \nreported as 2014 wore on.1  Retailers, banks, public \nutilities, and numerous organizations lost millions of customer data to attackers. Companies across industries succumbed to breaches that not only cost them financially but also brought significant brand damage.\n2 In the second quarter of 2014, \nfor instance, source code repository Code Spaces went out of business after an attacker deleted its client databases and backups.\n3 P.F. Chang’s had to \ngo back to using manual credit-card-imprinting devices after a breach. Outside of the United States, an educational company for children in Japan, Benesse, suffered a major data breach, where a former employee of\n \n a third-party partner \nleaked at least 28.95 million customer records to advertisers. As a result, the company had to apologize and allocate part of\n its \n¥20-billion fund \n(almost US$169 million) to establish the Benesse Children’s Fund.\n4\nAmong the cyber attacks seen in 2014 though, the “Sony Pictures hack” probably best showed how much a company could lose as an aftermath of a security breach. The company was forced to temporarily shut its network down after it was compromised by the so-called Guardians of Peace (GOP).\n5   It reportedly lost 100TB of confidential data \nas a result.6 While Sony Pictures has not declared \nthe cost of the breach, cybersecurity experts from the Center of Strategic and International Studies \npegged the loss to reach US$100 million.7–9 Other \ncompanies under the Sony banner have fallen victim to massive attacks.\n10 A company executive \nwas quoted in 2007 as saying he would not invest US$10 million on security technologies to avoid a US$1-million incident.\n11\n“In order to detect anomalies, however, IT \nadministrators will need to know first what to look out for. Since attacks are commonly designed to leave little to no tracks at all, it is important to know where possible indicators of a compromise can be found.”\n—Ziv Chang\nDirector of Cybersafety Solutions\n“Attackers spend much time during \nreconnaissance to understand the target company—its IT environment and security defenses—and IT administrators need to adopt this mentality in terms of their security strategy. All networks are different. This means that each one will need to be configured differently. IT administrators need to fully understand the network and implement the necessary defense measures to fit their environment.”\n–Spencer Hsieh\nTargeted Attack Threat ResearcherTREND MICRO | TrendLabs 2014 Annual Security Roundup6 | Magnified Losses, Amplified Need for Cyber-Attack Preparedness All of the reports on who were responsible for the \nSony Pictures hack have so far been inconclusive. Some believe it was an insider job akin to the Amtrak incident motivated by reasons like money, ideology, coercion, or ego.\n12–13 Others, meanwhile, \nchose to lay the blame on hacktivists. At the end of the day though, it does not matter who was at fault. Had the conglomerate learned from past incidents and protected its network from possible intrusions, it could have spared itself from this situation.\n14Even if the truth about how hackers breached Sony Pictures’s defenses remains unknown, our own analysis of WIPALL, the destructive malware the FBI warned businesses against following the Sony Pictures hack, revealed it was not as sophisticated as other classes of malware the likes of STUXNET.\n15–17 \nHowever, there may be other components of the attack not made public. \nBehavior Comparison of Selected Malware\nWIPALL STUXNET BlackPOS ZeuS/ZBOTMBR Wiper in \nSouth Korea \nAttacks\nMalware \ncomponentsSeveral backdoors \nand malicious .SYS filesA worm, an .LNK file, and a rootkitMain Trojan scrapes and exfiltrates dataTrojan spyware and a configuration fileDropper drops the main Trojan\nArrival and/\nor autostart \nmechanismNot enough informationArrives via USB drives; the .LNK file executes copies of the wormExploits four vulnerabilitiesUses social engineering and registry keysUses a link in spear-phishing emails; exploits a Hangul Word Processor vulnerability\nStealth \nmechanismDisables a system’s real-time scannerUses exploits and a rootkit componentMimics security software to evade detectionVaried Mimics legitimate Windows services\nLateral \nmovementUses predefined credentials to hack network sharesInstalls client and server components to execute network commandsNot enough informationNot applicable Checks saved SSH \ncredentials for accounts with root access\nInformation \nstolenNot enough informationAllows attackers to view and alter the project database and information from the WinCC serverSteals credit card credentials of customers stored in infected (PoS) systemsLogs keystrokes to steal user credentials to bank login pagesLeaks confidential information (in a South Korean nuclear power plant’s case)\nPurposeFile deletion from systems and fixed and remote drivesControl programmable logic controllers (PLCs) Payment card data theftBanking credential theftSabotageTREND MICRO | TrendLabs 2014 Annual Security Roundup7 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessDifferent weak points contributed to the breaches. \nIn the Code Spaces case, attackers gained access to employee credentials to get inside the company’s network. This could have been prevented through stronger password management policies and employee awareness training. Home Depot claimed that the attackers broke in using credentials stolen from a vendor. This finding highlights the importance of vetting the security practices of partner entities.\n18 For Sony, custom defense could have given security defenders a means to detect an intrusion early on, as files are being accessed and deleted or sent outside the network.\n19 To do that \nthough, they should first know their baseline. They should know how their networks are configured and what the systems that comprise them contain so they can spot irregularities or clues of lateral movement.\n20TREND MICRO | TrendLabs 2014 Annual Security Roundup8 | Magnified Losses, Amplified Need for Cyber-Attack Preparedness2014 Was the “Year of PoS  \nRAM Scrapers”\nPoS RAM scrapers came close to becoming a mainstream threat in 2014, as several high-profile targets lost millions of \ncustomer data to attackers.\nHigh-profile targets across a wide variety of \nindustries were hit by attacks aided by PoS RAM scrapers that allowed cybercriminals to get their hands on millions of customer data. Retailers were no longer the sole PoS system breach targets, as attackers also trailed their sights on hotels, restaurants, and parking lots, among  \nothers.\n21–35\n Number of Systems Where PoS Malware Were Found in 2014Trend Micro data shows that the number of infected PoS systems in 2014 increased throughout the year. The infections were evenly distributed across countries as well.\n200\n100\n0\n1Q 2Q 3Q 4Q\n73124156\n138TREND MICRO | TrendLabs 2014 Annual Security Roundup9 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessCountry Distribution of Systems Where PoS Malware Were Found in 2014\nPoS Malware Family Distribution, 2013 Versus 2014\nA wider variety of PoS RAM scraper families was \nalso seen in 2014 compared with 2013. PoS malware creation could be considered more robust, as evidenced by the addition of more technologically advanced capabilities in newer variants even if these took pages off their older counterparts.\nUnited States\nCanadaUnited KingdomAustraliaPhilippinesTaiwanFranceItalyBrazilJapanOthers29.77%\n6.71%\n6.50%\n5.87%\n5.66%\n3.98%\n3.14%3.14%\n2.94%\n2.31%\n29.98%\nBlackPOS\nSorayaAlinaRdasrv JackPOSVSkimmerBackoﬀBrutPOSChewBaccaDecebal50.73%\n14.88%\n9.64%\n7.34%\n5.87%\n4.40%\n2.94%\n1.68%\n1.47%\n1.05%Alina\nRdasrvVSkimmer55.39%\n43.63%\n0.98%20132014TREND MICRO | TrendLabs 2014 Annual Security Roundup10 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessTimeline of PoS-RAM-Scraping Incidents in 2014, Including Damage\nCybercriminal underground markets across \nregions also proved that selling stolen data was indeed a lucrative business. Development kits specifically for PoS RAM scrapers, in fact, were seen in underground markets, most likely due to the success of PoS-malware-related attacks.\n36–37DEC\n2013\n2014\n2015FEBJAN\nMAR\nAPR\nMAY\nJUN\nJUL\nSEPAUG\nOCT\nNOV\nDEC\nJANRETAIL\nPayment card credentials of up to 40M \ncustomers\nRETAIL\nPayment card credentials of approximately 2.6M customers\nRETAIL\nPayment card information of customers from 335 shops\nRETAIL\nPayment card credentials\nRESTAURANTS\nPayment card credentials of customers from 216 storesHOTEL\nPayment card numbers with security codes and expiration datesRETAIL\nCredit card credentials of 350,000 \ncustomers, 9,200 of which were \nfraudulently used\nBEAUTY\nTrack 2 payment card data with CVV \nnumbers of <25,000 customers\nRESTAURANTS\nPayment card credentials\nCOURIER\nPayment card data of customers from\n51 locations\nRESTAURANTS\nPayment card credentials of customers from 395 stores\nPARKING\nPayment card details of customers of 17 parking facilities\nPARKING\nCredit card credentials\nRESTAURANTS\nPayment card credentialsRETAIL\nPayment card credentials of 56M and \nemail addresses of 53M customers \nRETAIL\nPayment card numbers\nRETAIL\nPayment card credentials of 1.16M \ncustomers\nRETAIL\nCredit card credentials\nPARKING\nPayment card credentialsTREND MICRO | TrendLabs 2014 Annual Security Roundup11 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessTimeline of PoS RAM Scraper Emergence,  \nIncluding Relationships with Other Versions\nAs cybercriminals prospered, however, businesses \ncontinued to suffer the consequences brought on by PoS malware attacks. Companies whose networks were successfully breached spent millions of dollars to rid their systems of the threat and, ultimately, regain their customers’ trust. Though individuals and businesses in the United States suffered most from PoS threats, those from other countries like Canada and the United Kingdom were not spared as well. The United States is at particular risk of credit card fraud due to the low adoption of EMV technology within the country.\nIn response, the biggest financial institutions \nworldwide, including American Express, Visa, MasterCard, and Discover, have started shifting the liability from fraudulent transaction theft to merchants if these merchants do not adopt EMV payment terminals. Solutions like shifting to chip-and-pin or EMV cards, along with other reforms, have also been suggested. Properly implemented, EMV usage can make credit card fraud significantly harder to monetize.Single-purpose systems like PoS devices were not readily thought to be targets by cybercriminals and threat actors but proved to be massively profitable if attacks against them succeed. This can signal increased interest in similar standalone equipment like industrial control systems (ICS) and SCADA-related devices as well.\n38–41\nFor retailers, hotels, restaurants, and other service providers that heavily rely on PoS systems in their day-to-day business, it will be worth examining the possible entry points that attackers can take advantage of. This also means that not only should these companies lock down PoS security through application control technology in order to limit the execution of programs to only those that PoS systems should be using, but companies should also look at the different parts of the entire network that attackers can breach. Technologies that provide advanced network security threat detection and real-time intelligence can increase the chances of detecting intrusions.2009\n20112010\n2012\n2013\n2014\n2015Alina BlackPOS\nDexter VSkimmer\nSoraya ChewBacca\nLusyPOS Decebal\nJackPOS BlackPOS 2\nBackoﬀ BrutPOSRawPOS Rdasrv\nNewPoSThings GetMyPassTREND MICRO | TrendLabs 2014 Annual Security Roundup12 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessHeartbleed and Shellshock Proved That \nNo Application Was Invulnerable\nSoftware and platforms previously considered secure proved otherwise in 2014.\nThough it was true that the number of major \nzero-day exploits declined in 2014 compared with previous years, the severity of the threats that surfaced did not diminish.\n42 Gaping security holes \n“No matter how many zero days or Heartbleed-/Shellshock-type vulnerabilities we may see, we \nshould never forget that the fundamental vulnerabilities in Web applications such as SQL injection, cross-site scripting (XSS), broken authentication, etc., are still very prevalent. They are, quite often, the reason behind the big data breaches that occur. Also, we should never forget the best practices on controlling access to data, encrypting it as much as we can, ensuring the right security products are in place, quickly shielding against vulnerabilities.”\n–Pawan Kinger\nDirector of Deep Security Labs\nthat were left unpatched in widely used software and platforms continued to be exploited to instigate attacks that rendered targets defenseless.\nTimeline of Major Zero-Day Vulnerabilities in 2014\nJAN\nMARFEB\nAPR\nMAYJUNJULAUGSEPOCTNOVDECCVE-2014-0810\nSanshiro\nCVE-2014-0498\nAdobe Flash Player\nCVE-2014-0502\nAdobe Flash Player\nCVE-2014-1776\nInternet Explorer\nCVE-2014-4113\nWindows\nCVE-2014-4148\nWindows\nCVE-2014-3566\nSSL 3.0CVE-2014-0322\nInternet Explorer\nCVE-2014-0499\nAdobe Flash Player\nCVE-2014-1761\nMicrosoft Word\nCVE-2014-0515\nAdobe Flash Player\nCVE-2014-4114\nWindows\nCVE-2014-6352\nWindows\nCVE-2014-7247\nIchitaroTREND MICRO | TrendLabs 2014 Annual Security Roundup13 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessApplications initially thought more secure than \nthose commonly exploited remained unpatched for years until two of the biggest exploits seen to date came to the fore.\n43 Heartbleed and Shellshock \nproved that even open source applications, which were believed more secure than their commercial counterparts (e.g., Windows\n®, Adobe®, and Java™), \nwere vulnerable to threats.44 They particularly \naffected systems running Linux, which is concerning given that 67.7% of websites use UNIX, on which the former is based. An overwhelming majority of supercomputers, which are primarily used by research facilities, academia, and other sectors that require ultra-fast computing power, use Linux as well.\n45–46\nComparison of Windows of Exposure of High-Profile  \nVulnerabilities Disclosed in 2014The fact that Linux is widely used as a server platform means Heartbleed and Shellshock put massive amounts of data at risk. If these servers are attacked, their owners could suffer crippling effects. Affected server owners would have to spend a lot of money paying staff to patch vulnerable systems. Patching could also cause system downtime, which could translate to revenue loss.\nOpen source initiatives can greatly benefit from a \nmore stringent review process in keeping with quality assurance as part of a good software development life cycle. Because of the pervasive impact of these kinds of vulnerabilities, affected companies and individuals should consider vulnerability protection technologies that can provide virtual patches for vulnerable software before a vendor does so.\n20092004199919941989\n2014UNKNOWNRisk: MEDIUM Risk: CRITICAL\nExposure: 9,241 Exposure: 828\nExposure after\nﬁrst attack:1Exposure after\nﬁrst attack:\nUNKNOWNBASH\n(SHELLSHOCK)OPENSSL\n(HEARTBLEED)\nJUN. 8, 1989\nSEP. 26, 2014\nSEP. 25, 201425+ YEARS 2+ YEARS\nDEC. 31, 2011\nAPR. 7, 2014\nVulnerability existing Patch date Exploit releasedTREND MICRO | TrendLabs 2014 Annual Security Roundup14 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessOnline and Mobile Banking Faced \nBigger Security Challenges\nOperation Emmental proved that two-factor authentication was no longer enough to secure sensitive transactions, while online \nbanking Trojans and malicious mobile apps continued to be a problem. \nOnline and mobile banking took off worldwide, \nespecially in technologically advanced countries though steps to secure transactions were not able to keep pace.\n47 Multifactor authentication has not \nyet been widely adopted.48 Even users have yet to \nfully grasp the concept of securing their financial transactions. They still fall for social engineering lures cleverly crafted to trick them into giving out sensitive information like their account numbers, usernames, or passwords.\nThe convenience that online and mobile banking \noffers comes with risks. In fact, cybercriminals continuously devise ways to try to steal from bank customers. Those behind one particular operation we have dubbed “Emmental” have, in fact, even proven that two-factor authentication could be circumvented.\n49\nIncremental increases month over month were seen in the number of online banking malware throughout the last quarter of 2014. Notorious online banking malware like ZeuS/ZBOT continuously lined cybercriminals’ pockets with millions of dollars in stolen cash.\n50 They \nhave constantly been enhanced throughout the years to keep up with online banking security improvements. And this fact is not expected to change because online and mobile banking users, individuals and companies alike, constantly prove to be lucrative cybercrime targets.\n“The malware that the attackers used \nrevealed a weakness in single-session token protection strategies. Banks and other organizations that continue to use these are exposing themselves and their customers to rogue mobile apps. More advanced defenses, which include the use of multiple transaction authentication numbers (TANs), photo-TANs, and card readers, should be considered.” \n—David Sancho, Feike \nHacquebord, and Rainer Link\nSenior Threat Researchers\nNumber of Computers Where Online \nBanking Malware Were Found in 2014\n150K\n75K\n0\n1Q 2Q 3Q 4Q\n102K112K145K\n137KTREND MICRO | TrendLabs 2014 Annual Security Roundup15 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessThreats that ran on computers were not the only \nones online and mobile banking users worried about though. They also had to stay protected from mobile malware and high-risk apps. Along with the increased adoption of mobile banking came more fake banking apps that aimed to steal not just users’ banking credentials but also the money saved in their accounts. Case in point, the number of Android™ malware and high-risk apps continuously increased throughout 2014. A fourfold increase in the number of banking- or finance-related malware for the Android platform alone was also seen.Cumulative Number of Android \nMalware in 2014\nNumber of Mobile Banking/Financial Malware\nNote: Banking-/Finance-related mobile apps refer to malicious apps that aim to steal victims’ \nfinancial information. Examples of these are fake banking apps.\n5M\n2.5M\n0\n1Q 2Q 3Q 4Q\n2.68M\n2.09M3.52M4.26M\n2.5K\n1.25K\n0\n1Q 2Q 3Q 4Q 1Q 2Q 3Q 4Q\n2013 2014\n1,466\n952\n475561\n125\n131,7212,069TREND MICRO | TrendLabs 2014 Annual Security Roundup16 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessAndroid users were not the only ones at risk though, as iOS threats also surfaced last year. Some examples of \nthese were WireLurker and Masque, which could infect even nonjailbroken devices.\niOS Malware Count\nNew mobile vulnerabilities like FakeID and SOP also caused security woes in 2014.\n51–52 Bugs like \nFakeID could pass off malicious mobile banking apps as legitimate, which could lead to disastrous consequences.\nCompanies that end up as banking fraud victims \nstand to lose a lot of money if made to reimburse customers’ stolen money in cases of qualified fraud. Even worse, they could lose their customers’ trust if the latter do not feel they are as protected as they should be.\n53\nBanks and other financial institutions should consider multifactor authentication in order to set more roadblocks against cybercriminals meaning to intercept bank-to-customer communication. Companies at risk should also be proactive in informing customers on how to improve their computer security—through the use of security software and good password management practices—if they have knowledge of attacks that are victimizing their or other banks’ account holders. \nAs to users of mobile devices, only download \napplications from official app stores, and even then, take the time to check out the developer and read app reviews prior to download, whether the device used runs on Android or iOS.\n10\n5\n0\nOCT NOV DEC JAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV\n2013 2014\n1 1 15\n479TREND MICRO | TrendLabs 2014 Annual Security Roundup17 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessRansomware Became a Bigger \nand More Sophisticated Threat\nRansomware spread more malice across regions and segments. And unlike older variants, they no longer just issue empty \nthreats but actually encrypt files.\nRansomware, now capable of actually encrypting \nfiles held for ransom instead of just issuing empty threats, have crossed borders.\n54–57 They can now be \nfound in Australia and New Zealand (ANZ) after spreading mayhem in Europe, the Middle East, and Africa as well as Japan. More recent variants of the threat have moved beyond focusing on a single segment as well, as perpetrators victimized consumers and small businesses alike.\nAlthough the number of detected ransomware \ndeclined from 2013 to 2014, related infections remained destructive. And while traditional ransomware like REVETON and RANSOM dominated 2013 with a 97% share, crypto-ransomware took the stage in 2014, as their share increased 27.35%.\n“While not presenting anything new to \nthe table, CryptoLocker has taken the scare tactics effectively used before by ransomware and fake antivirus attacks to a new level. Most users rely nowadays on good antimalware, but it is important to note that user education, regular software updates, and strict computer usage policies are crucial in defending against CryptoLocker and similar threats.”\n–Jay Yaneza\nThreat Analyst\nNumber of Computers Where Ransomware Were Found, 2013 Versus 2014\n100K\n50K\n0\n2013 2014\n84K\n48K\n15K\n2KNumber of\ncrypto-ransomwareTREND MICRO | TrendLabs 2014 Annual Security Roundup18 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessNumber of Computers Where Ransomware Were Found by Quarter\nCountry Distribution of Ransomware Detections, 2013 Versus 2014\n30K\n15K\n0\n1Q 2Q 3Q 4Q 1QCryptoLocker ﬁrst emerges\n2Q 3Q 4Q\n2014 2013\n9K 9K11K15K20K21K\n16K29K\nUnited States\nJapanGermanyAustraliaTurkeyItalyFranceCanadaPhilippinesUnited KingdomOthers35.93%\n19.94%\n6.39%\n5.67%\n3.19%\n2.49%\n2.00%\n1.87%\n1.70%\n1.64%\n19.18%United StatesJapanAustraliaGermanyTurkeyIndiaCanadaFranceUnited KingdomItalyOthers41.81%\n16.11%\n6.42%\n3.98%\n3.35%\n2.51%\n2.24%\n2.19%\n1.95%\n1.85%\n17.59%2013\n84K\n48K2014TREND MICRO | TrendLabs 2014 Annual Security Roundup19 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessRansomware Family Distribution, 2013 Versus 2014\nThe share of ransomware-infected systems in the United States, Australia, Turkey, India, Canada, France, \nand the United Kingdom increased from 2013 to 2014.\nComparison of Country Distribution of Ransomware Detections, 2013 Versus 2014\nCountry 2013 Country 2014 Change in Share\nUnited States 35.93% United States 41.81% \nJapan 19.94% Japan 16.11% \nGermany 6.39% Australia 6.42% \nAustralia 5.67% Germany 3.98% \nTurkey 3.19% Turkey 3.35% \nItaly 2.49% India 2.51% \nFrance 2.00% Canada 2.24% \nCanada 1.87% France 2.19% \nPhilippines 1.70% United Kingdom 1.95% \nUnited Kingdom 1.64% Italy 1.85% \nOthers 19.18% Others 17.58% Varies\nRANSOM\nREVETONCRILOCKMATSNUCRYPTOROthers76.54%\n18.21%\n2.91%\n1.79%\n0.38%\n0.17%RANSOM\nREVETONCRILOCKKOVTERCRYPWALLMATSNUCRIBITCRYPTORFINALDOCRYPDEFOthers32.12%\n30.65%\n12.29%\n8.83%\n5.17%\n5.13%\n1.98%\n1.03%\n0.88%\n0.87%\n1.05%2013\n84K\n48K2014\nRansom\nCryptoTREND MICRO | TrendLabs 2014 Annual Security Roundup20 | Magnified Losses, Amplified Need for Cyber-Attack Preparedness(Australia)\n(Spain)\nBUY IT NOW! 100% ﬁles back guaranteeBUY IT NOW! 100% ﬁles back guaranteeBuy Decryption Decrypt Single File FAQfreeSupport\nBuy decryption and get all your ﬁles back\nBuy Decryption with\nRegister bitcoin wallet\nYou should register Bitcoin wallet, see easy instructions or watch video on YouTube.1Buy decryption for 598 AUD before 2014-11-30 11:01:51 AM\nOR buy it later with the price of 1199 AUDTime left before price increase: 0\nYour total ﬁles encrypted: 33976\nCurrent price: 3.03347 BTC (around 1199 AUD)\nPaid until now: 0 BTC (around 0 AUD)Remaining amount: 3.03347 (around 1199 AUD)\nComprar descifrado Descifrar un solor archivo Preguntas mas frecuenteslibreApoyo\nCOMPRE YA! Garantia 100% de la restauracion de archivos\nCOMPRE YA! Garantia 100% de la restauracion de archivosComprar descifrado y restaurar los archivos\nComprar descifrado con\nRegistrar Bitcoin wallet\nUsted debe registrarse Bitcoin wallet, ver ubstrucciones faciles or ver el video en YouTube.1Comprar descifrado por 298 EUR antes de 2014-12-01 1:48:36 AMO comprario mas tarde con el precio de 598 EUR\nTiempo restante antes de aumento de precios: 0\nNumero de archivos cifrados: 33976\nPrecio actual: 2.07207 BTC (alrededor de 598 EUR)\nPagado: 0 BTC (alrededor de 0 EUR)Restante a pagar: 3.03347 (alrededor de 598 EUR)TREND MICRO | TrendLabs 2014 Annual Security Roundup21 | Magnified Losses, Amplified Need for Cyber-Attack Preparedness(France)\n(Italy)Acquista decrittograﬁa Decrittografare File FAQliberoSupporto\nCompralo Subito! 100% garanzia di ripristinare 1 ﬁle\nCompralo Subito! 100% garanzia di ripristinare 1 ﬁleAcquista derittazione e ripristinare i ﬁle\nAcquista decifratura con\nRegistrati bitcoin wallet\nSi dovrebbe registrare Bitcoin waller, vedi semplici istruzioni o gurdare i video su YouTube.1Acquista decrittazione per 398 EUR prima 2014-11-30 2:45:35 AM\nO acquistare in un secondo momento con il prezzo di 798EUR\nTempo rimasto prima aumento dei prezzi: 0\nNumero di ﬁle crittografati: 16147\nPrezzo corrente: 2.98452 BTC (circa 798 EUR)\nPagato: 0 BTC (environ 0 EUR)Rimanendo a pagare: 2.98452 (circa 798 EUR)Acheter decryptage Decrypter un Fincher FAQgratuitSoutien\nACHETEZ-LE MAINTENANT! Garantie de 100% de la restauration de ﬁchiers\nACHETEZ-LE MAINTENANT! Garantie de 100% de la restauration de ﬁchiersAcheter decryptage et restaurer tous vos ﬁchiers\nAcheter Decryptage avec\nCreer bitcoin portefeuille\nVous devez vous inscrire Bitcoin portefeuille, svoir les intructions faciles ou regarder des video sur YouTube.1Acheter decryptage pour 399 EUR avant le 2014-11-30 2:49:10 AMOU acheter plus tard avec le prix de 799 EURTemps restant avant augmentation de prix: 0\nVos ﬁchiers chiﬀres au total: 33976\nPrix actual: 2.98826 BTC (environ 799 EUR)\nPaye: 0 BTC (environ 0 EUR)Restant a payer: 2.98826 (environ 799 EUR)TREND MICRO | TrendLabs 2014 Annual Security Roundup22 | Magnified Losses, Amplified Need for Cyber-Attack Preparedness(Germany)\nRansomware Segment Distribution, 2013 Versus 2014\nA similar increase, specifically toward the end of \n2014, in the number of ransomware infections was seen in the mobile landscape. Apart from widening their target base, ransomware also evolved to ensure the anonymity of their operators by requiring victims to pay in Bitcoins and other cryptocurrencies.Acquista decrittograﬁa Decrittografare File FAQliberoSupporto\nKAUFE ES JETZT! 100% Garantie der Wiederherstellung von Datein\nKAUFE ES JETZT! 100% Garantie der Wiederherstellung von Dateinkaufen entschlusselung und wiederherstellung ihrer dateien\nKaufen Entschlusselung mit\nRegistrieren Bitcoin Wallet\nSie solten Bitcoin Wallet registrieren, siehe einfachen Anweisungen oder Videos absielen auf YouTube.1Kaufen Entschlusselung fur 398 EUR bevor 2014-11-30 2:45:35 AM\noder kaufen Sie es spater mit dem Preis von 798EURVerbleibende Zeit bis sum Preisansrieg: 0\nAnzhal von verschlusselten Dateien: 16147\nAktueller Preis: 2.89674 BTC (rund 798 EUR)\nBezhalt: 0 BTC (rund 0 EUR)Verbleibende zu zahlen: 2.89674 (rund 798 EUR)\nHome users\nSmall businessesMedium and large enterprises71.51%\n9.61%\n18.88%69.75%\n11.66%\n18.59%2013 20142014 2013TREND MICRO | TrendLabs 2014 Annual Security Roundup23 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessMobile Ransomware Count\nUnfortunately for home users and employees who \nencounter ransomware, prevention is the best route that will save them from having to pay ransom. It is important to keep the following tips in mind:\n•\n Avoid clicking suspicious links.\n•\n Back up important data using the 3-2-1 rule.58\n• Check the email sender.\n•\n Double-check the message content.\n•\n Ensure that security software is updated.\n300\n150\n0\nMAY JUN JUL AUG SEP OCT NOV DEC\n2972\n33\n9 9 979276TREND MICRO | TrendLabs 2014 Annual Security Roundup24 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessThreat Actors and Cybercriminal \nEconomies Continued to Thrive Worldwide\nThreat actors are no longer associated with a single country, as evidenced by targeted attacks like Operation Pawn Storm.\nWe have been tracking developments in \nthe cybercriminal underground economy to better understand cybercrime motivations. Unsurprisingly, financial profit is the biggest if not the sole driver of the different cybercriminal hubs springing up around the world. Like any developing real-world economy, the cybercriminal underground thrives on constantly improving specializations and activities related to setting up and running cybercriminal operations.\nCredit Card Prices in the Russian Cybercriminal Underground by YearOn one hand are suppliers of products and services—blackhat developers of Trojan builders and distributed denial-of-service (DDoS) tools as well as owners of massive credit card dumps—while on the other are buyers with specific needs who can choose from among different vendors. Throughout the years, the prices of different underground products and services have been influenced by market forces—as the supply increases,  \nprices decrease.\n2011 2012 2013 2014US$10\nUS$5\n0USA\nAUSCANGER\nUK2011\nUS$2.50\nUS$7.00\nUS$5.00\nUS$9.00\nUS$7.002012\nUS$1.00\nUS$5.00US$5.00\nUS$7.00\nUS$8.002013\nUS$1.00\nUS$4.00\nUS$6.00\nUS$9.00\nUS$5.002014\nUS$2.50\nUS$4.50\nUS$4.00\nUS$3.00\nUS$4.50\nTREND MICRO | TrendLabs 2014 Annual Security Roundup25 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessWhile several commonalities among regional \ncybercriminal underground markets exist, each tends to develop in slightly different ways. The Russian underground, for instance, is notorious for trading traffic direction systems (TDSs) and pay-per-install services—business models that drive the volume of grayware and adware in victims’ computers upward, alongside commissions. The Chinese cybercriminal underground, meanwhile, is much more fixated on mobile fraud, with hardware setups that can send SMS spam to thousands of potential victims in under an hour. Finally, the Brazilian underground is known for phishing banks and, more notably, a 10-module training course for cybercriminal newbies on how to commit fraud.\nMost of the cybercriminal \ncommunications on the surface Web are relatively well-hidden through the use of forums or encrypted social media posts. However, anonymity is such a key factor in a cybercriminal’s longevity in the business that the use of darknets in the Deep Web has become significant as well. After the Silkroad takedown in 2013, in fact, a lot of players were expected to try and take the place of Dread Pirate Roberts. Different marketplaces emerged in 2014 while law enforcement played cat and mouse with unsearchable websites as in an operation called “Operation Onymous,” which brought down 17 alleged operators.\n59 Cryptocurrencies also play \na large role in the Deep Web, and in 2014 we saw  \n“Operation Pawn Storm used next-level \nspear-phishing tactics to obtain the email credentials of primarily military, embassy, and defense contractor personnel from the United States and its allies. The threat actors used a mix of spear-phishing emails and specially crafted Webmail service phishing websites to gain access to victims’ inboxes in hopes of getting better footholds inside target organizations.”\n—Loucif Kharouni, Feike \nHacquebord, Numaan Huq, \nJim Gogolinski, Fernando \nMercês, Alfred Remorin, and  \nDouglas Otis \nSenior Threat Researchers\na new cryptocurrency called “Cloakcoins,” which, unlike Bitcoins, offer complete untraceability of the transaction chain.\n60\nEven in the clandestine world of targeted attack campaigns launched by a different breed of threat actors, the emergence of international players was evident. While cybercriminals primarily pursued monetary profit, threat actors worldwide realized the value of stealing corporate data, \nintellectual property, and other trade secrets. The diversity of targets and locations of targeted-attack-related command-and-control (C&C) servers do not suggest a single dominant player when it comes to espionage. Targets as diverse as telecommunications  companies, manufacturing firms, governments, and media outfits continued to be seen. Campaigns like Regin targeted victims in Belgium; Operation Pawn Storm in the United \nStates, Hungary, and Austria; and Plead in Taiwan.\nCompanies assessing their risk levels should \ntake into account all kinds of possible intruders, including those who target them across the planet. As cybercrime becomes more attractive to the unscrupulous and as targeted attack campaigns become much easier to mount, the pressure to reassess the breadth and quality of cybersecurity investments must only intensify.TREND MICRO | TrendLabs 2014 Annual Security Roundup26 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessOverall Threat Volumes Decrease, \nbut Phishing Almost Doubles\nTrend Micro Smart Protection Network telemetry showed a general decrease in the volume of threat components like malicious \ndomains and spam, but malware continued to be important tools in cybercriminal operations. Phishing sites almost doubled in number this year.\nQuality over quantity was a resounding theme \nin the 2014 threat landscape, reflected in part by the overall volume of malicious components we identified and blocked throughout the year. Web threats largely remained multicomponent in nature. However, as security events proved, attackers continued to fine-tune their strategies even if these were not original to obtain not just more victims but more desirable ones.Number of Email Reputation  \nQueries Blocked as Spam\nBlocking spam-sending IP addresses is a crucial step in breaking infection chains. Emails haphazardly sent to huge mailing lists remained part of the threat landscape, albeit as white noise. Trend Micro spam filters were able to easily weed them out though, as we detected 50 billion email reputation queries—slightly lower than the numbers seen in 2012 and 2013 but still fairly significant—as spam.Volume of Spam Blocked by  \nMessaging Products\nNote: This data set is from Trend Micro messaging \nproduct feedback.We were also able to block spam based on content, \nalongside the reputation of the sender. Based on data from Trend Micro messaging products, the volume of spam tended to be stable, with a slight uptick in the third quarter of 2014.\n80B\n40B\n0\n2012 2013 2014\n67B\n50B69B\n1Q 2Q 3Q 4Q12T\n6T\n0\n9T\n8T 8T11TTREND MICRO | TrendLabs 2014 Annual Security Roundup27 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessTop 10 Spam Languages in  2013 and 2014 \nEnglish\nChineseJapaneseGermanRussianPortugueseSpanishIcelandicItalianFrenchOthers87.14%\n2.36%\n1.84%\n1.48%\n1.20%\n0.28%\n0.21%0.12%\n0.10%0.10%\n5.17% EnglishGermanJapaneseChineseRussianPortuguesePolishSpanishFrenchItalianOthers85.84%\n3.29%\n1.87%\n1.84%\n0.85%\n0.41%\n0.37%\n0.32%\n0.29%\n0.12%\n4.80%2013 2014\nEnglish remained spammers’ most preferred \nlanguage even though its overall share decreased from 2013’s 87.14%. This means we saw slightly more non-English spam in 2014. Among the non-English spam, those written in German topped the list, toppling Chinese and Japanese.TREND MICRO | TrendLabs 2014 Annual Security Roundup28 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessTop Spam-Sending Countries, 2013 Versus 2014\nThe United States and Spain were the most active \nspam senders, as in 2013, despite posting relatively smaller shares. A spike in the salad spam volume was seen in Spain, Germany, Italy, and Iran, which could have further contributed to the 2014 spam language distribution.\n61\nSpammers also made full use of other channels like social networking sites in 2014 with the same end goal—to get as many valuable clicks as possible. For instance, in our investigation of Twitter abuse, we saw how attackers can use social platforms to lure people.\n62 Webmail clients also helped spammers \nslip through spam filters because network communications were likely encrypted. This is precisely why the ability to block malicious URLs, IP addresses, and domains is critical to an enterprise’s security arsenal. Should a spam slip through or use social media or Webmail, URL-blocking technology should be able to catch a user’s wayward click before it accesses a malicious remote location.\nURLs can serve as phishing landing pages, \nredirectors, malware download locations, and thus are the lifeblood of any cybercriminal operation. In 2014, we were able to block close to 4 billion user queries from accessing malicious sites, or up to 7,000 clicks per minute.\nUnited States\nSpainIndiaArgentinaItalyTaiwanColombiaChinaPeruMexicoOthers9.91%\n6.29%6.26%\n5.37%\n4.87%\n4.38%\n3.69%\n3.53%3.53%\n3.29%\n48.88% United StatesSpainArgentinaItalyGermanyVietnamIranChinaRussiaColombiaOthers8.37%\n7.89%\n6.35%\n5.00%\n4.84%\n4.27%\n3.95%\n3.90%\n3.58%\n3.19%\n48.66%2013 2014TREND MICRO | TrendLabs 2014 Annual Security Roundup29 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessUser Visits Blocked from Accessing Malicious Sites\nDespite what appears to be a decline in the number \nof malicious sites, the volume of phishing sites continued to grow. We observed an 88.65% increase in the number of phishing sites in 2014. Bulk creation of new domains with one-year registration was easy and as cheap or even cheaper than renewal.  \nWebsite -creation or ready-made website templates were also available underground.\nVolume of Phishing Sources, 2013 Versus 2014\nOf the malicious URLs we blocked, the top ones were related to malicious sites known for serving malware. \n4M\n2M\n0\n2013 2014\n1.98M3.74M\n5B\n2.5B\n0\n2012 2013 2014\n4.87B\n3.82B4.99BTREND MICRO | TrendLabs 2014 Annual Security Roundup30 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessTop Malicious Domains Users Were Blocked from Visiting in 2014\nMalicious URL Blocked Reason for Blocking\nads.alpha00001.com:80/cgi-bin/advert/getads.cgiHas multiple records related to \nmalware-download/spam sites\nody.cc:80/vip48.htmlHas multiple records related to malware-download/spam sites\ninteryield.jmp9.com:80/interyield/bindevent.do Exhibits malicious behaviors\ndirectxex.com:80/uploads/698118324.server.exe Related to WORM_AUTORUN.BMC\nflyclick.biz:80/click Used in exploit kits\nsp-storage.spccint.com:80/autoupdate/2.11.11.7/autoupdate.zip Exhibits malicious behaviors\nupload.mobogenie.com:80/mu/release/mobogenie2.2.1.zip Detected as ADW_NEXTLIVE\nwww. advconversion.com:80/ads-conversiontrack/conversion/set.do Exhibits malicious behaviorsads.alpha00001.com:80/cgi-bin/advert/getkws.cgi Exhibits malicious behaviors\nody.cc:80/vip53.html Exhibits malicious behaviors\nAs in 2013, the United States had the highest \nnumber of C&C servers related to botnet activities, followed by the United Kingdom and India. Note, however, that the threat actors or attackers did not necessarily reside in the said countries because C&C servers can be remotely managed.\nCountry Distribution of C&C Servers in 2014\nUnited States\nUnited KingdomIndiaBrazilIranGermanyRussiaUkraineNetherlandsRomaniaOthers21.08%\n9.45%\n6.11%\n3.14%\n2.94%\n2.86%\n2.85%\n2.63%\n2.60%\n2.47%\n43.87%TREND MICRO | TrendLabs 2014 Annual Security Roundup31 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessCountry Distribution of C&C Connections in 2014\nZombie computers were broadly distributed across \ncountries though the United States, Japan, and India topped the list.\nShould spam and URL filters fail to block threats, \nsecurity solutions should be able to identify whether an unknown file is likely to be malicious or not based on its source’s reputation or its content and behaviors. In 2014, Trend Micro blocked 10 billion requests to access or download malicious files, almost twice the number recorded in 2013. Around 21,000 file reputation queries per minute turned out to be malicious.\nNumber of Malicious Files Blocked\nUnited States\nJapanIndiaAustraliaTaiwanFranceGermanyMalaysiaItalyIndonesiaOthers20.04%\n18.99%\n6.20%\n6.17%\n5.84%\n5.66%\n5.37%\n5.27%\n3.05%\n2.17%\n21.24%\n12B\n6B\n0\n2012 2013 2014\n2.06B6.28B10.96BTREND MICRO | TrendLabs 2014 Annual Security Roundup32 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessDOWNAD continued to be the top enterprise \ninfector. This could be att ributed to the fact several companies still use Windows\n® XP, which is \nvulnerable to this threat, especially since Microsoft has ceased supporting the OS.As attacks and attacker tools and tactics continue to improve, enterprises must ensure they use multilayer solutions that can better catch threats before these reach user endpoints.\nTop Malware and Adware in 4Q 2014\nComputers Affected by Malware\n100K\n50K\n0\nSALITY DOWNAD GAMARUE\n96K\n67K80KMalware\n300K\n150K\n0\nADW_\nOPENCANDYADW_\nINSTALLCOREADW_\nSSEARCH\n299K\n119K246KAdware\n60K\n30K\n0\nDOWNAD DUNIHI SALITY\n59K\n33K35KMedium and Large Enterprise\n12K\n6K\n0\nDOWNAD SALITY VOBFUS\n11K\n5K8KSmall Business\n40K\n20K\n0\nGAMARUE SALITY VIRUX\n40K\n23K39KHomeTREND MICRO | TrendLabs 2014 Annual Security Roundup33 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessMALWARE/ADWARE \nFAMILYBEHAVIORDAMAGE \nPOTENTIAL\nADW_INSTALLCORE Freeware-bundled toolbars Medium\nADW_OPENCANDY Adware that comes bundled with third-party application \ninstallersMedium\nADW_SSEARCH Bundled with malware packages as a component Low\nDOWNADWorm with multiple routines to spread, blocks access to security vendor sites, downloads malwareCritical\nDUNIHIWorm that arrives via spam or malicious sites, turns computers into botsMedium\nGAMARUEWorm, turns computers into bots, spreads through link files, hides filesMedium\nSALITYFile infector, spreads by infecting. EXE and .SCR files and removable drives, downloaderHigh\nVIRUXFile infector downloaded from crack-download sites, spreads by infecting various file types, downloads FAKEAV, etc.High\nVOBFUSWorm, uses autorun to infect drives, downloads FAKEAV, etc., polymorphicHigh\nTotal Number of Threats Blocked Annual Detection Rates\n80B\n40B\n0\n2012 2013 2014\n74B\n65B80B\n2,600/s\n1,300/s\n0\n2012 2013 2014\n2,337\n2,0652,546TREND MICRO | TrendLabs 2014 Annual Security Roundup34 | Magnified Losses, Amplified Need for Cyber-Attack PreparednessReferences\n1. Trend Micro Incorporated. (2013). Trend Micro Security News.   \n“Blurring Boundaries: Trend Micro Security Predictions for 2014 and Beyond.” Last accessed on 29 January 2015,  \nhttp://about-threats.trendmicro.com/us/security-predictions/2014/blurring-boundaries/ .\n2.\n Lewis Morgan. (23 December 2014). \nIT Governance.   \n“List of Cyber Attacks and Data Breaches in 2014.” Last accessed on 29 January 2015,  \nhttp://www.itgovernance.co.uk/blog/list-of-the-hacks-and-breaches-in-2014/ .\n3.\n Trend Micro Incorporated. (2014)  Trend Micro Security News.  \n“Turning the Tables on Cyber Attacks.” Last accessed on 9 February 2015,  \nhttp://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/reports/rpt-turning-the-tables-on-cyber-attacks.pdf . \n4.\n “Report and Response Regarding L\neakage of Customers’ Personal Information.” (10 September 2014). Last accessed on 17 February 2015,  \nhttp://blog.benesse.ne.jp/bh/en/ir_news/m/2014/09/10/uploads/news_20140910_en.pdf.\n5. Trend Micro Incorporated. (8 December 2014). Trend Micro Security News.   \n“The Hack of Sony Pictures: What We Know and What You Need to Know.” Last accessed on 29 January 2015,  \nhttp://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/the-hack-of-sony-pictures-what-you-need-to-know .\n6.\n Reuters. (9 December 2014). \nFortune.  \n“Cyber Attack Could Cost Sony Studio as Much as $100 Million.” Last accessed on 29 January 2015,  \nhttp://fortune.com/2014/12/09/cyber-attack-could-cost-sony-studio-as-much-as-100-million/ .\n7.\n Steve Tobak. (18 December 2014). \nFox Business.  \n“3 Revelations from the Sony Hack.” Last accessed on 29 January 2015,  \nhttp://www.foxbusiness.com/technology/2014/12/18/revelations-from-sony-hack/ .\n8.\n Andrea Peterson. (5 December 2014). The Washington Post.  \n \n“Why It’s So Hard to Calculate the Cost of the Sony Pictures Hack.” Last accessed on 29 January 2015,  \nhttp://www.washingtonpost.com/blogs/the-switch/wp/2014/12/05/why-its-so-hard-to-calculate-the-cost-of-the-sony-pictures-hack/ .\n9.\n The Associated Press and Bloomberg. (18 December 2014). TheStar.com.  \n \n“Sony Hacker Attack Will Cost Company Tens of Millions of Dollars.” Last accessed on 29 January 2015,  \nhttp://www.thestar.com/business/2014/12/18/sony_hacker_attack_will_cost_company_tens_of_millions_of_dollars.html .\n10.\n Adam Clark Estes. (9 December 2014). Gizmodo.  \n“Why Sony Keeps Getting Hacked.” Last accessed on 29 January 2015,  \nhttp://gizmodo.com/why-sony-keeps-getting-hacked-1667259233 .\n11.\n Trend Micro Incorporated. (22 December 2014). Simply Security.  \n“The Reality of the Sony Pictures Breach.” Last accessed on 29 January 2015,  \nhttp://blog.trendmicro.com/reality-sony-pictures-breach/ .\n12.\n Masayoshi Someya. (18 August 2014). TrendLabs Security Intelligence Blog.  \n \n“Risks from Within: Learning from the Amtrak Breach.” Last accessed on 29 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/risks-from-within-learning-from-the-amtrak-data-breach/ .\n13.\n Jim Gogolinski. (9 December 2014). TrendLabs Security Intelligence Blog.  \n \n“Insider Threats 101: The Threat Within.” Last accessed on 29 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/insider-threats-101-the-threat-within/ .\n14.\n Rich Trenholm. (8 December 2014). \nCNET.  \n“Sony Hacked Again, This Time the PlayStation Network.” Last accessed on 29 January 2015,  \nhttp://www.cnet.com/uk/news/sony-hacked-again-this-time-the-playstation-store/ .TREND MICRO | TrendLabs 2014 Annual Security Roundup35 | Magnified Losses, Amplified Need for Cyber-Attack Preparedness15. Trend Micro Incorporated. (5 December 2014).  TrendLabs Security Intelligence Blog.   \n“WIPALL Malware Leads to #GOP Warning in Sony Hack.” Last accessed on 29 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/wipall-malware-leads-to-gop-warning-in-sony-hack/ .\n16.\n Trend Micro Incorporated. (23 December 2014). TrendLabs Security Intelligence Blog.  \n \n“MBR Wiper Attacks Strike Korean Power Plant.” Last accessed on 29 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/mbr-wiper-attacks-strike-korean-power-plant/ .\n17.\n Trend Micro Incorporated. (25 September 2014). \nTrend Micro Security News.  \n“Utilizing Island Hopping in Targeted Attacks.” Last accessed on 17 February 2015,  \nhttp://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/utilizing-island-hopping-in-targeted-attacks.\n18. Trend Micro Incorporated. (3 December 2014). TrendLabs Security Intelligence Blog.   \n“An Analysis of the ‘Destructive’ Malware Behind FBI Warnings.” Last accessed on 29 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/an-analysis-of-the-destructive-malware-behind-fbi-warnings/ .\n19.\n Bryant Tan. (14 September 2014). TrendLabs Security Intelligence Blog.  \n \n“The Easy-to-Miss Basics of Network Defense.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/the-easy-to-miss-basics-of-network-defense/ .\n20.\n Ziv Chang. (14 August 2014). TrendLabs Security Intelligence Blog.  \n \n“7 Places to Check for Signs of a Targeted Attack in Your Network.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/7-places-to-check-for-signs-of-a-targeted-attack-in-your-network/ .\n21.\n Target Brands, Inc. (10 January 2014). Target.com.  \n \n“Target Provides Update on Data Breach and Financial Performance.” Last accessed on 30 January 2015,  \nhttp://pressroom.target.com/news/target-provides-update-on-data-breach-and-financial-performance .\n22.\n Karen Katz. (15 June 2014). Nieman Marcus.\n  \n“To Our Loyal Nieman Marcus Group Customers.” Last accessed on 30 January 2015,  \nhttp://www.neimanmarcus.com/en-tw/NM/Security-Info/cat49570732/c.cat .\n23.\n White Lodging Services, Inc. (3 February 2014).  White Lodging.  \n \n“Resources and Information for Guests.” Last accessed on 30 January 2015,   \nhttp://www.whitelodging.com/about/payment-card-issues .\n24.\n Sally Beauty Holdings, Inc. (17 March 2014). \nSally Beauty Holdings, Inc.  \n“Sally Beauty Data Incident.” Last accessed on 30 January 2015,  \nhttps://sallybeautyholdings.com/questions-and-answers.aspx .\n25.\n Chuck Rubin. (17 April 2014). Michaels.  \n \n“A Letter from Our CEO.” Last accessed on 30 January 30, 2015,  \nhttp://www.michaels.com/payment-card-notice-ceo-letter/payment-card-notice-CEO.html .\n26.\n P.F. Chang’s. (4 August 2014). P.F. Chang’s.  \n \n“P.F. Chang’s Security Compromise Update.” Last accessed on 30 January 2015,  \nhttp://pfchangs.com/security/ .\n27.\n Charlene Sarmiento. (2 September 2014). \nGoodwill.   \n“Goodwill Provides on Data Security Issue.” Last accessed on 30 January 2015,  \nhttp://www.goodwill.org/press-releases/goodwill-provides-update-on-data-security-issue/ .\n28.\n Homer TLC, Inc. (6 November 2014). The Home Depot.  \n \n“The Home Depot Reports Findings in Payment Data Breach Investigation.” Last accessed on 30 January 30, 2015,  \nhttps://corporate.homedepot.com/MediaCenter/Documents/Press%20Release.pdf .\n29.\n Jimmy John’s. (24 September 2014). Jimmy John’s. \n \n“Jimmy John’s Notifies Customers of Payment Card Security Incident.” Last accessed on 30 January 30, 2015,  \nhttps://www.jimmyjohns.com/datasecurityincident/index.html .\n30.\n Alasdair James. (10 October 2014). Kmart.  \n \n“Kmart Investigating Payment System Breach.” Last accessed on 30 January 2015,  \nhttp://www.kmart.com/en_us/dap/statement1010140.html .TREND MICRO | TrendLabs 2014 Annual Security Roundup36 | Magnified Losses, Amplified Need for Cyber-Attack Preparedness31. John Gainor. (9 October 2014). DQ.   \n“Data Security Incident.” Last accessed on 30 January 2015,  \nhttp://www.dq.com/us-en/datasecurityincident/?localechange=1& .\n32.\n SP Plus Corporation. (28 November 2014). SP+. \n \n“SP+ Acts to Block Payment Card Security Incident.” Last accessed on 30 January 2015,   \nhttp://www.spplus.com/sp-acts-block-payment-card-security-incident/ .\n33.\n Brian Krebs. (4 December 2014). \nKrebs on Security.  \n“Banks: Credit Card Breach at Bebe Stores.” Last accessed on 30 January 2015,  \nhttp://krebsonsecurity.com/2014/12/banks-credit-card-breach-at-bebe-stores/ .\n34.\n Park ’n Fly. (13 January 2015). Park \n’n Fly.   \n“Park ’n Fly Notifies Customers of Data Security Compromise.” Last accessed on 30 January 2015,  \nhttp://www.pnf.com/security-update/ .\n35.\n CFA Properties, Inc. (2 January 2015). Chik-fil-A.\n  \n“Information and Resources Related to Investigation of Potential Data Breach at Chick-fil-A.” Last accessed on 30 January 2015,  \nhttp://press.chick-fil-a.com/Pressroom/LatestNews/PressDetail/databreach .\n36.\n Trend Micro Incorporated. (2014) Trend Micro Security News.  \n \n“PoS RAM Scraper Malware: Past, Present, and Future.” Last accessed 9 February 9 2015,  \nhttp://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/white-papers/wp-pos-ram-scraper-malware.pdf . \n37.\n Trend Micro Incorporated. (2014). Trend Micro Security News.  \n \n“The Evolution of PoS Malware.” Last accessed on 30 January 2015,  \nhttp://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/the-evolution-of-point-of-sale-pos-malware .\n38.\n American Express Company. (29 June 2012). American Express.\n  \n“American Express Announces U.S. EMV Roadmap to Advance Contact, Contactless, and Mobile Payments.” Last accessed on 30 January 2015,  \nhttp://about.americanexpress.com/news/pr/2012/emv_roadmap.aspx .\n39.\n Visa. (9 August 2011). Visa.  \n \n“Visa Announces U.S. Participation in Global Point-of-Sale Counterfeit Liability Shift.” Last accessed on 30 January 2015,  \nhttp://usa.visa.com/download/merchants/bulletin-us-participation-liability-shift-080911.pdf .\n40.\n MasterCard. (2015). MasterCard.  \n“The Next Generation of Payments Comes to the United States.” Last accessed on 30 January 2015,  \nhttp://www.mastercard.us/mchip-emv.html .\n41.\n DFS Services LLC. (12 November 2012). Discover.\n  \n“Discover Announces Next Steps for EMV Deployment Across the Globe.” Last accessed on 30 January 2015,  \nhttp://blog.discovernetwork.com/stories/news/discover-announces-next-steps-for-emv-deployment-across-the-globe/ .\n42.\n Pawan Kinger. (14 January 2015). TrendLabs Security Intelligence Blog.  \n \n“Remembering the Vulnerabilities of 2014.” Last accessed on 30 January 30, 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/remembering-the-vulnerabilities-of-2014/ .\n43.\n Pavan Thorat and Pawan Kinger. (25 September 2014).\n TrendLabs Security Intelligence Blog.  “Bash Vulnerability Leads to \nShellshock: What It Is, How It Affects You.” Last accessed on 30 January 2015, http://blog.trendmicro.com/trendlabs-security-\nintelligence/shell-attack-on-your-server-bash-bug-cve-2014-7169-and-cve-2014-6271/ .\n44.\n Pawan Kinger. (8 April 2014). TrendLabs Security Intelligence Blog.  \n \n“Skipping a Heartbeat: The Analysis of the Heartbleed OpenSSL Vulnerability.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/skipping-a-heartbeat-the-analysis-of-the-heartbleed-openssl-vulnerability/ .\n45.\n W3TECHS.com. (29 January 2015). W3 Techs.  \n \n“Usage of Operating Systems for Websites.” Last accessed on 30 January 2015,  \nhttp://w3techs.com/technologies/overview/operating_system/all . \n46.\n TOP500.org. (29 January 2015). Top 500.  \n \n“Development Over Time.” Last accessed on 30 January 2015,  \nhttp://www.top500.org/statistics/overtime/ .TREND MICRO | TrendLabs 2014 Annual Security Roundup37 | Magnified Losses, Amplified Need for Cyber-Attack Preparedness47. MEF. (24 January 2014). MEF Minute.   \n“Mobile Payments Driving Global M-Commerce Adoption.” Last accessed on 30 January 2015,  \nhttp://mefminute.com/2014/01/24/mobile-payments-driving-global-m-commerce-adoption/ .\n48.\n Martin C.\n Libicki, Edward Balkovich, Brian A. Jackson, Rena Rudavsky, and Katharine Watkins Webb. (2015).  RAND Corporation.  \n“Influences on the Adoption of Multifactor Authentication.” Last accessed on 30 January 2015,  \nhttp://www.rand.org/pubs/technical_reports/TR937.html .\n49.\n David Sancho. (22 July 2014). TrendLabs Security Intelligence Blog.  \n“Finding Holes in Banking Security: Operation Emmental.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/finding-holes-operation-emmental/ .\n50.\n Brian Krebs. (2 June 2014). Krebs on Security.\n  \n“‘Operation Tovar’ Targets ‘Gameover’ ZeuS Botnet, CryptoLocker Scourge.” Last accessed on 30 January 2015,  \nhttp://krebsonsecurity.com/2014/06/operation-tovar-targets-gameover-zeus-botnet-cryptolocker-scourge/ .\n51.\n Simon Huang. (12 August 2014). TrendLabs Security Intelligence Blog.  \n“The Dangers of the Android FakeID Vulnerability.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/the-dangers-of-the-android-fakeid-vulnerability/ .\n52.\n Simon Huang. (26 December 2014). TrendLabs Security Intelligence Blog.  \n \n“Facebook Users Targeted by Android Same Origin Policy Exploit.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/facebook-users-targeted-by-android-same-origin-policy-exploit/ .\n53.\n EY. (2014). EY.\n  \n“Global Commercial Banking Survey 2014: Advancing Service in a Digital Age.” Last accessed on 30 January 2015,  \nhttp://www.ey.com/Publication/vwLUAssets/EY-global-commercial-banking-survey-2014/$FILE/EY-global-commercial-banking-survey-2014.pdf.\n54. L uis Raul Parra. (5 December 2014). TrendLabs Security Intelligence Blog.  \n“Crypto-Ransomware Goes Local in EMEA Region.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/crypto-ransomware-goes-local-in-emea-region/\n55. Joseph C. Chen. (21 October 2014). TrendLabs Security Intelligence Blog.   \n“TorrentLocker Run Hits Italian Targets.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/torrentlocker-run-hits-italian-targets/ .\n56.\n Paul Pajares and Christopher Ke. (11 January 2015). \nTrendLabs Security Intelligence Blog.   \n“TorrentLocker Ransomware Hits ANZ Region.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/torrentlocker-ransomware-hits-anz-region/ .\n57.\n Rhena Inocencio. (24 March 2014). TrendLabs Security Intelligence Blog.  \n“Ransomware and Bitcoin Theft Combine in BitCrypt.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/ransomware-and-bitcoin-theft-combine-in-bitcrypt/ .\n58.\n Jonathan Leopando. (2 April 2014). TrendLabs Security Intelligence Blog.  \n \n“World Backup Day: The 3-2-1 Rule.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/world-backup-day-the-3-2-1-rule/ .\n59.\n Caleb Chen. (6 November 2014). \nCryptocoinsnews.  \n“Operation “ONYMOUS” Also Shut Down Dark Net Markets Cloud 9 Hydra and Maybe More.” Last accessed on 30 January 2015,  \nhttps://www.cryptocoinsnews.com/operation-onymous-also-shut-down-deep-net-markets-cloud-9-hydra-and-more/ . \n60.\n Cloakcoin.com (30 November 2014). Cloakcoin.  \n \nLast accessed on 30 January 2015,  \nhttp://www.cloakcoin.com/ .\n61.\n Michael Casayuran. (1 October 2014). \nTrendLabs Security Intelligence Blog.   \n“KELIHOS Spambot Highlights Security Risks in SPF Records.” Last accessed on 5 February 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/kelihos-spambot-highlights-security-risk-in-spf-records/ .\n62.\n Jon Oliver. (14 October 2014). TrendLabs Security Intelligence Blog.  \n \n“Investigating Twitter Abuse, Part 3.” Last accessed on 30 January 2015,  \nhttp://blog.trendmicro.com/trendlabs-security-intelligence/investigating-twitter-abuse-part-3/ . TREND MICRO TM\nTrend Micro Incorporated, a global cloud security leader, creates \na world safe for exchanging digital information with its Internet content security and threat management solutions for businesses and consumers. A pioneer in server security with over 20 years experience, we deliver top-ranked client, server, and cloud-based security that fits our customers’ and partners’ needs; stops new threats faster; and protects data in physical, virtualized, and cloud environments. Powered by the Trend Micro™ Smart Protection Network™ infrastructure, our industry-leading cloud-computing security technology, products and services stop threats where they emerge, on the Internet, and are supported by 1,000+ threat intelligence experts around the globe. For additional information, visit\n www.trendmicro.com\n©2015 by Trend Micro, Incorporated. All rights reserved. Trend Micro and the Trend Micro t-ball logo are trademarks or registered trademarks of  \nTrend Micro, Incorporated. All other product or company names may be trademarks or registered trademarks of their owners.Created by:\nThe Global Technical Support & R&D Center of TREND MICRO"
}