{
    "title": "rpt-fin6",
    "text": "FIREEYE THREAT INTELLIGENCE\nSPECIAL REPORT / APRIL 2016FOLLOW  \nTHE MONEY: \nDISSECTING THE OPERATIONS  \nOF THE CYBER CRIME GROUP FIN6\nSS\nFC\nPAN\nFS\nNAME\nFS\nPrimary Account No.  \n(19 digits max.)\nName  \n(26 alphanumeric  \ncharacters max.\nADDITIONAL DATA\nES\nDISCRETIONARY DATA\nLRC\n Expiration Date (YY/MM) 4\nService Code 3No. of  \nCharactersNo. of  \nCharacters\n SPECIAL REPORT / FOLLOW THE MONEY: DISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6  2CONTENTS\nFollow the Money: Dissecting the Operations of the Cyber Crime Group FIN6 3\nFIN6 4\nGaining Access - Indiscriminate or Intentional? 5\nFIN6 - Getting the Job Done 6\nUnderground Card Shops -  Following the Money 9\nConclusion  11Reports on payment card intrusions and theft are often fragmentary. \nThe focus is on various pieces of the attack and less about capturing \nthe end-to-end cycle of compromise, data theft, illicit sale and use. \nThe full scope of attacker activity traditionally occurs beyond the \nview of any one group of investigators. Incident response teams may \nhave visibility into the technical aspects of the breach itself, while \ncyber crime researchers monitor the movement and sale of stolen \ndata in the criminal underground.\nFireEye Threat Intelligence and iSIGHT Partners recently combined \nour research to illuminate the activities of one particular threat group: \nFIN6. This combined insight has provided unique and extensive \nvisibility into FIN6’s operations, from initial intrusion to the methods \nused to navigate the victims’ networks to the sale of the stolen \npayment card data in an underground marketplace. In this report, \nwe describe FIN6’s activities and tactics, techniques and procedures \n(TTPs), and provide a glimpse into the criminal ecosystem that \nsupports the “payoff” for their operations. \nDISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6FOLLOW THE MONEY: \n SPECIAL REPORT /  FOLLOW THE MONEY: DISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6  3 SPECIAL REPORT / FOLLOW THE MONEY: DISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6  4\nFIGURE 1:  \nFIN6 OPERATIONAL  \nMETHODOLOGY \nINDISCRIMINATE TARGETED CASH OUTCARD  \nSHOPEmail phishing  \ncredential theftLateral movement \non the networkExfiltration payment card data to \nthe cyber criminal underground\nGRABNEW  \nMALWAREPOS \nMALWAREFIN6 is a cyber criminal group intent on stealing payment card data \nfor monetization. In 2015, FireEye Threat Intelligence supported several \nMandiant Consulting investigations in the hospitality and retail sectors \nwhere FIN6 actors had aggressively targeted and compromised point-\nof-sale (POS) systems, making off with millions of payment card \nnumbers. Through iSIGHT, we learned that the payment card numbers \nstolen by FIN6 were sold on a “card shop”  — an underground criminal \nmarketplace used to sell or exchange payment card data. Figure 1 \nillustrates what we believe to be FIN6’s typical operational methodology.FIREEYE INTELLIGENCE TRACKS  \ntargeted Financial threats (known as \n“FIN” groups) capable of using a wide \nrange of tools and tactics during their \ncomputer network intrusions. These \ngroups employ a high level of planning, \norganization and task management \nto accomplish their goals. The threat \nactors generally target a particular \ndemographic or type of organization, \nand their goal is financial gain from the \ndata they steal. They may profit through \ndirect sale of stolen data (such as \npayment cards or personally identifiable \ninformation), unauthorized transfer of \nfunds (such as with stolen bank account \nor bank routing credentials); or insider \ntrading (based on the theft of non-\npublic business information).FIN6 SPECIAL REPORT /  FOLLOW THE MONEY: DISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6  5\nIt’s not entirely clear how FIN6 initially compromises \nvictims. In Mandiant’s investigations, FIN6 already \npossessed valid credentials to each victim network \nand used those credentials to initiate further intrusion \nactivity.1 In one case, GRABNEW malware was found on a \nvictim computer that FIN6 later used in its operations. We \nsuspect that the computer was originally compromised with \nGRABNEW by a separate threat actor, who used GRABNEW \nto capture valid user credentials. FIN6 may have obtained \nthose credentials (through purchase or trade) and used them \nfor its operations.GAINING ACCESS \nINDISCRIMINATE OR INTENTIONAL?\nFIN6’s use of GRABNEW, or credentials collected by \nGRABNEW, is not altogether surprising and possibly \npoints to a cyber crime support ecosystem that opens \ndoors to threat actors capable of lateral movement \nand more damaging activities. Previously, we observed \nanother FIN group — FIN2 — leverage several existing \nCitadel compromises to deploy their custom tools \nand expand within a network to compromise payment \ncard systems. Likewise, Proofpoint recently observed \nGRABNEW variants leading to downloads of POS \nmalware known as AbaddonPOS.GRABNEW, ALSO KNOWN AS NEVERQUEST AND VAWTRAK,  \nemerged around 2013 and since then has been consistently and \nindiscriminately spread through massive spam campaigns. We \ntypically differentiate between threat actors who indiscriminately \ndistribute malware and threat actors who use malware selectively. \nGRABNEW itself is a credential-stealing backdoor with form-grabbing \ncapabilities and the ability to inject code into specific web pages to, \nfor example, mimic a valid login prompt for a financial institution to \nfacilitate banking fraud. In some cases, the presence of GRABNEW \nmalware has overlapped with the spread of POS malware such as \nPoSeidon, a variant of the Backoff POS malware. \n1  When investigating an intrusion, it may be challenging to determine the initial method of compromise — the means through which a threat group \nfirst gained access to a victim network. While in some cases evidence may point to a spear-phishing attack or exploit execution, in other cases little \nto no forensic evidence of the original compromise remains. SPECIAL REPORT / FOLLOW THE MONEY: DISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6  6\nAll threat groups generally follow a broad \noperational framework known as the \nAttack Lifecycle. While the phases of \nthe Attack Lifecycle — from initial compromise \nto privilege escalation to maintaining presence \nand completing the mission — are remarkably \nconsistent, the specific TTPs used vary widely \nbased on a group’s skills, motivations and \nultimate goals.\nAfter gaining access with valid credentials, \nwe observed FIN6 leveraging components of \nthe Metasploit Framework to establish their \nfoothoold. For example, in one case, FIN6 used \na Metasploit PowerShell module to download \nand execute shellcode and to set up a local \nlistener that would execute shellcode received \nover a specific port. Similarly, FIN6 used at \nleast two downloaders called HARDTACK and \nSHIPBREAD (apparent variations on Metasploit \npayloads) to establish backdoor access to the \ncompromised environment. Both of these tools \nare configured to connect to remote command and control (CnC) servers and download and \nexecute shellcode. FIN6 generally used either \nregistry run keys or Windows scheduled tasks \nin order to establish persistence for these tools.\nOnce their accesses were established with \npreferred backdoors, FIN6 used additional \npublic utilities such as Windows Credentials \nEditor for privilege escalation and credential \nharvesting. Additional privilege escalation \ntools exploited Microsoft Windows \nvulnerabilities in an attempt to compromise \nprivileged account credentials on various \nhosts. The tools targeted CVE-2013-3660, \nCVE-2011-2005  and CVE-2010-4398, all \nof which could allow local users to access \nkernel-level privileges.2 Continuing their use \nof Metasploit-related tools, FIN6 also used \nMetasploit’s PsExec NTDSGRAB module \nto obtain a copy of the Active Directory \ndatabase (ntds.dit). Access to this file would \nallow them to extract password hashes from \nthe file and crack them offline.FIN6 \nGETTING THE JOB DONE\n2 These vulnerabilities have all been patched by Microsoft; Windows systems with up-to-date software and security \npatches should not be exploitable.\nADDITIONAL DATA\nES\nDISCRETIONARY DATA\nLRC\nExpiration Date (YY/MM) 4\nService Code 3No. of  \nCharactersNo. of  \nCharactersAfter locating POS systems within the \ntarget’s environment, FIN6 deployed \nPOS malware that we call TRINITY. SPECIAL REPORT /  FOLLOW THE MONEY: DISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6  7In addition to collecting credentials, FIN6 \nused publicly available tools to map the \ninternal network and conduct reconnaissance \nagainst Active Directory, Structured Query \nLanguage (SQL) servers and NetBIOS. In \nparticular, during the reconnaissance phase \nthey gathered information on systems running \nSQL instances, dumping schemas for multiple \ndatabases and SQL user accounts. Specific \ntools used by FIN6 included Microsoft’s \nbuilt-in SQL querying tool (osql.exe), Query \nExpress (a free, portable graphical SQL \nclient capable of connecting to Microsoft \nSQL and Oracle databases) and AdFind, a \nfree command-line tool for querying Active \nDirectory. Over the course of one day, for \nexample, the group targeted more than \n900 SQL servers to dump reconnaissance \ninformation to support further operations. \nCapitalizing on the acquired reconnaissance \ndata, FIN6 began lateral movement using \ncredentials stolen from various systems on \nwhich they gathered usernames and password \nhashes. They likely cracked these hashes \noutside of the target’s network before using \nmultiple sets of domain admin credentials in \ncombination with remote command execution \ntools such as PsExec and Remote Command \nExecutor (RemCom) throughout the rest of \nthe lateral movement phase.\nTo maintain presence and support interactive \naccess in the environment, FIN6 leveraged the \npublicly available Plink command-line utility \n(part of the PuTTY SSH and Telnet suite) to \ncreate SSH tunnels to CnC servers under their \ncontrol. As shown in Figure 2, they used these \nSSH tunnels to route Remote Desktop Protocol \n(RDP) traffic and allow for interactive RDP \nsessions with systems in the target network.\nAfter locating POS systems within the \ntarget’s environment, FIN6 deployed POS \nmalware that we call TRINITY (also known \nas FrameworkPOS), with Scheduled Tasks \nbeing used for persistence. TRINITY runs continuously and targets system processes not \nlisted in its accompanying process blacklist, \nseeking data that matches payment card \ntrack data. Once the malware identifies track \ndata, it copies and encodes it to a local file in \na subdirectory of the c:\\windows\\ directory \nwhile attempting to conceal these files with \n.dll or .chm extensions. In one particular \ncase — and as an example of scale — FIN6 \ncompromised and deployed TRINITY on \naround 2,000 systems, resulting in millions  \nof exposed cards.\nFinally, to move the stolen payment card \ndata out of the environment, FIN6 used a \nscript to systematically iterate through a list \nof compromised POS systems, copying the \nharvested track data files to a numbered \n“log” file before removing the original data \nfiles. They then compressed the log files into \na ZIP archive and moved the archive through \nthe environment to an intermediary system \nand then to a staging system. From the \nstaging system, they then copied the stolen \ndata to external CnC servers under their \ncontrol using the FTP command line utility. \nIn another case, FIN6 used an alternative \nextraction method to upload payment card \ndata to a public file sharing service.TRINITY IS POS MALWARE THAT ATTEMPTS TO LOCATE   \nAND STEAL PAYMENT CARD DATA FROM MEMORY.  \nThe malware  first creates mutexes named m_number3 and \nMuTex-Check and exits if either already exists. The malware \nthen continuously iterates over the current process listing and \nexamines the memory space of each process. Processes with \nmodule names less than five characters are skipped, along \nwith some specific process names that are unlikely to contain \npayment card information. TRINITY logs captured data to disk, \ntypically to a file in %WINDIR%\\temp or %WINDIR%\\help. The \nmalware encodes the data with a simple substitution cipher \nand single-byte XOR using the OxAA key.  SPECIAL REPORT / FOLLOW THE MONEY: DISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6  8\nFIGURE 2: NETWORK DIAGRAM SHOWING FIN6 PLINK SSH TUNNEL USED TO ROUTE RDP TRAFFIC TO VICTIM COMPUTERS\nATTACKER  \nCnC SERVER\nVICTIM 1  \nHOSTATTACKER  \nCnC SERVERATTACKER  \nCnC SERVER\nVICTIM 2\nVICTIM 3\nVICTIM 4PLINK  \nTUNNELRDP  \nTUNNEL\nRDPFOLLOWING THE MONEY\nUsing iSIGHT Partners’ collected \nintelligence, we discovered that the \nstolen payment card data from these \nintrusions were sold in an underground card \nshop. This particular shop is advertised on \nmultiple underground cyber crime forums and \nhas offered diverse criminals access to millions \nof stolen payment cards on a regular basis. \nThis closes the loop on the “lifecycle” of cyber \ncriminal activity and exemplifies one of the \nfinal stages of cyber crime actors monetizing \ntheir stolen data.\nWe have identified stolen data from several of \nFIN6’s victims being sold by this vendor as far \nback as 2014. This connection means th at data UNDERGROUND \nCARD SHOPS  \nstolen by FIN6 has almost certainly ended up in \nthe hands of fraud operators across the world, \nas they buy and exploit payment cards from \nthe underground shop. In each case, the stolen \ndata began appearing in the shop within six \nmonths of the FIN6 breach. While the amount \nof data sold through the shop varies by breach, \nin some cases more than 10 million cards \nassociated with a specific FIN6-linked breach \nhave been identified on the shop. After being \nposted, much of the stolen card data is quickly \npurchased for exploitation. Along with the \ndata we have linked to FIN6, this underground \nshop has sold data from millions of other cards, \nwhich may be linked to breaches perpetrated \nby other threat actors. \n SPECIAL REPORT / FOLLOW THE MONEY: DISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6  9Our analysis of the data sold \nthrough this underground \nvendor indicates that FIN6’s \ncompromises are highly \nprofitable to the actors involved, \npotentially resulting in extensive \nfraud losses. SPECIAL REPORT / FOLLOW THE MONEY: DISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6  10Our analysis of the data sold through this \nunderground vendor indicates that FIN6’s \ncompromises are highly profitable to the actors \ninvolved, potentially resulting in extensive fraud \nlosses. For instance, in one FIN6-linked breach \nthe vendor was advertising nearly than 20 \nmillion cards. These cards were predominantly \nfrom the United States and selling for an \naverage of $21. So the total return for the shop \n— if all the data was sold at full price — could \nhave been about $400 million. \nIn reality, the shop would typically only make \na fraction of this figure since not all the data \nwould be sold (laundering stolen cards is \ntypically much harder than stealing them), \nbuyers want the newest data they can get (data \nthat has been on the shop for a while loses its \nvalue) and the shop offers discounts based \non various criteria. Still, a fraction of $400 \nmillion is a significant sum. In turn, cyber criminals purchasing the data would expect \nto make more than they paid for the cards \nby conducting fraudulent transactions using \nthose cards. \nNot all of the data sold on this particular card \nshop has been tied to an identified compromise \nor specific cyber criminal group. Additionally, as \nis often the case with prominent cyber criminal \nvendors, it is not yet clear how the operators \nof the underground site are linked to the actors \nwho steal the data the shop sells. The vendor \nhas sold large amounts of card data with \nvaried characteristics, so it is possible the shop \noperators maintain relationships with more \nthan one data provider. FIN6 members could \ninclude some of the operators behind this shop; \nalternately, FIN6 could be selling stolen data to \nthe operators of this site. \nUNDERGROUND COMMUNITIES  DEALING  IN STOLEN CARD DATA EXIST ACROSS THE  \nworld and are a major facilitator of money laundering operations. A large number of these \ncommunities take the form of illicit e-commerce sites called “card shops” or “dump shops” \n(criminals refer to stolen card-present transaction data as “dumps”). These shops allow \ntheir clientele to use a web-based platform to sort through data on thousands or millions of \npayment cards and purchase exactly the types they want based on their money laundering \ncapabilities. These data are then added to the client’s cart for checkout, similar to a legitimate \nwebsite. Subsequently, customers use the card information they have purchased for many \ndifferent money laundering schemes, such as buying and reselling gift cards or electronics.Good threat intelligence comes from \na combination of factors. It requires \nvisibility into the threat landscape, \nincluding both a broad view (the ability to \nidentify activity across a range of countries, \nindustries and organizations) and a deep view \n(the ability to gather detailed information \nabout how threat actors operate). It also \nrequires skilled analysts who are able to \nreview, fuse and understand the available data.\nIn this case, the combined intelligence from \nFireEye, Mandiant and iSIGHT intelligence \nteams was able to not only identify malicious \nactivity aimed at stealing payment card \ndata, but also provide a detailed window \ninto that activity from compromise through \nmonetization of the stolen data.The story of FIN6 shows how real-world threat \nactors operate, providing a glimpse not only \ninto the technical details of the compromise, \nbut also into the human factor as well; namely, \nthe interactions between different criminals \nor criminal groups, and how it is not just data \nbeing bartered or sold in the underground, but \nalso tools, credentials and access.CONCLUSION\n SPECIAL REPORT / FOLLOW THE MONEY: DISSECTING THE OPERATIONS OF THE CYBER CRIME GROUP FIN6  11FireEye, Inc.  \n1440 McCarthy Blvd. Milpitas, CA 95035  \n408.321.6300 / 877.FIREEYE (347.3393) / info@FireEye.com   \nwww.FireEye.com\n© 2016 FireEye, Inc. All rights reserved. FireEye is a registered trademark of FireEye, Inc.  \nAll other brands, products, or service names are or may be trademarks  \nor service marks of their respective owners. SP.FIN6.EN-US.042016To download this or other  \nFireEye Threat Intelligence reports, \nvisit: www.fireeye.com/reports.html"
}