{
    "title": "rpt_APT37",
    "text": "The Overlooked North Korean Actor\nSPECIAL REPORTPYAPT37 (REAPER) CONTENTS\nIntroduction  3\nTargeting and Mission  4\nInitial Infection Vectors  7\nExploited Vulnerabilities  8\nCommand and Control Infrastructure  9\nMalware  10\nAttribution  12\nOutlook and Implications  13\nAppendix: Malware Used by APT37  14SPECIAL REPORT 2INTRODUCTION\nOn Feb. 2, 2018, we published a blog detailing the use of an Adobe Flash zero-day \nvulnerability (CVE-2018-4878) by a suspected North Korean cyber espionage group that we now track as APT37 (Reaper). Recent examination of this group’s activities by FireEye iSIGHT Intelligence reveals APT37 has expanded its operations in both scope and sophistication. APT37’s toolset, which includes access to zero-day vulnerabilities and wiper malware, combined with heightened tensions in Northeast Asia and North Korea’s penchant for norm breaking, means this group should be taken seriously.\nWe assess with high confidence that this activity is carried out on behalf of the North \nKorean government given malware development artifacts and targeting that aligns with North Korean state interests. FireEye iSIGHT Intelligence believes that APT37 is aligned with the activity publicly reported as Scarcruft and Group123.APT37 (REAPER): THE OVERLOOKED NORTH KOREAN ACTOR 3NORTH KOREA\nSOUTH KOREA\nMIDDLE EAST\nVIETNAMJAPAN\nINTERNET\nSERVICE \nPROVIDERSAEROSPACE\nAND DEFENSEAUTOMOTIVE EDUCATIONFINANCIAL\nSECTORGOVERNMENT HEALTHCAREHIGH TECH\nINDUSTRYMEDIA NGOsSTEEL\nMANUFACTURINGAPT37 has likely been active since at least 2012 \nand focuses on targeting the public and private \nsectors primarily in South Korea. In 2017, APT37 \nexpanded its targeting beyond the Korean \npeninsula to include Japan, Vietnam and the \nMiddle East, and to a wider range of industry \nverticals, including chemicals, electronics, \nmanufacturing, aerospace, automotive and \nhealthcare entities (Fig. 1).Targeting  \nand Mission\nFigure 1. APT37 Targeting Scope.SPECIAL REPORT 4We judge that APT37’s primary mission is \ncovert intelligence gathering in support of North \nKorea’s strategic military, political and economic \ninterests. This is based on consistent targeting \nof South Korean public and private entities and \nsocial engineering. APT37’s recently expanded \ntargeting scope also appears to have direct \nrelevance to North Korea’s strategic interests.\nFrom 2014 to 2017, APT37 targeting \nconcentrated primarily on the South Korean \ngovernment, military, defense industrial base, \nand media sector. Lure materials (Fig. 2) \ntypically leveraged the Korean language and \nfeatured themes such as Korean peninsula \nreunification or sanctions. \nFigure 2. “2016 Korean \nReunification Conference Form” \n(MD5:183be2035d5a546670d2b9deeca4eb59).\nNORTH KOREA\nSOUTH KOREA\nMIDDLE EAST\nVIETNAMJAPAN\nINTERNET\nSERVICE \nPROVIDERSAEROSPACE\nAND DEFENSEAUTOMOTIVE EDUCATIONFINANCIAL\nSECTORGOVERNMENT HEALTHCAREHIGH TECH\nINDUSTRYMEDIA NGOsSTEEL\nMANUFACTURING5 APT37 (REAPER): THE OVERLOOKED NORTH KOREAN ACTORAPT37 targeted a research fellow, advisory \nmember, and journalist associated with different \nNorth Korean human rights issues and strategic \norganizations. It also targeted an entity in Japan \nassociated with the United Nations missions on \nsanctions and human rights. APT37 distributed \nSLOWDRIFT malware using a lure referencing \nthe Korea Global Forum against academic and \nstrategic institutions located in South Korea. \nNotably, the email was sent from a compromised \nSouth Korean institute that conducts studies on \nNorth Korea. The string “durihana,” which is also \nthe name of a Christian missionary organization \nthat works with North Korean defectors, was \nincluded in an APT37 weaponized document \nsent to an individual who works with a North \nKorean human rights organization.In 2017, APT37 targeted a Middle Eastern \ncompany that entered into a joint venture \nwith the North Korean government to provide \ntelecommunications service to the country (read \non for a case study). At that time, other targets \nincluded individuals involved in international \naffairs and trade issues, the general director of a \nVietnamese international trading and transport \ncompany, and possibly individuals working with \nOlympics organizations assisting in securing \nresources for athletes.\nNorth Korean defector and human rights-related \ntargeting provides further evidence that APT37 \nconducts operations aligned with the interests of \nNorth Korea. \nIn May 2017, APT37 used a bank \nliquidation letter as a spear phishing lure against a board member of a Middle Eastern financial company. The specially crafted email included an attachment containing exploit code for CVE-2017-0199, a vulnerability in Microsoft Office that had been disclosed just a month earlier. Once opened, the malicious document communicated with a compromised website, most likely to surreptitiously download and install a backdoor called SHUTTERSPEED (MD5: 7c2ebfc7960aac6f8d58b37e3f092a9c). The tool would enable APT37 to collect system information, take screenshots and download additional malicious files to the victim computer.\nCASE STUDY:  \nTargeting of Middle \nEastern Organization with Business ties to North Korea\nWe believe a Middle Eastern organization \nwas targeted by APT37 because it had been involved with a North Korean company and a business deal went bad. This firm was targeted shortly after media reports of this schism had gone public. The targeting effort may have been an attempt by the North Korean government to gather information on a former business partner. The operation exemplifies APT37’s tactics, techniques and procedures (TTPs), and reflects the advanced capabilities of this espionage group.\n“The GDPR will change …  \nthe whole world as we know it.”SPECIAL REPORT 6Initial Infection Vectors\nIn addition to the aforementioned spear phishing tactics, APT37 \nleverages a variety of methods to deliver malware. These include \nstrategic web compromises typical of targeted cyber espionage \noperations, as well as the use of torrent file-sharing sites to distribute \nmalware more indiscriminately. \nNumerous campaigns have employed social engineering tactics \ntailored specifically to desired targets. Lures and websites of particular \ninterest to South Korean organizations (e.g. reunification) are regularly \nleveraged in campaigns. Multiple South Korean websites were abused \nin strategic web compromises to deliver newer variants of KARAE \nand POORAIM malware. Identified sites included South Korean \nconservative media and a news site for North Korean refugees and \ndefectors. In one instance, APT37 weaponized a video downloader \napplication with KARAE malware that was indiscriminately distributed \nto South Korean victims through torrent websites.7 APT37 (REAPER): THE OVERLOOKED NORTH KOREAN ACTORFEB JAN DEC NOV OCT SEP AUG JUL JUN MAY APR MAR FEB JAN DEC NOV OCT SEP AUG JUL JUN MAY APR MAR FEB JAN DEC NOV OCT SEP AUG JUL JUN MAY APR MAR FEB JAN DEC NOV OCT SEP AUG JUL JUN MAY APR MAR FEB JAN\n2018 2017 2016 2015 2014CVE-2018-4878 (Zero-day vulnerability)\nCVE-2017-0199\nCVE-2015-2387\nCVE-2015-2545\nCVE-2015-7645\nCVE-2016-4117\nCVE Release Date\nExploit\nFigure 3. Timeline of CVE Release Dates vs. Dates of APT37 CVE Exploitation.\nExploited Vulnerabilities\nAPT37 frequently exploits vulnerabilities in Hangul \nWord Processor (HWP) due to the software’s \nprevalence in South Korea. Further, the group \nrecently demonstrated access to zero-day \nvulnerabilities (CVE-2018-0802) and has the \nflexibility to quickly incorporate recently publicized \nvulnerabilities into spear phishing and strategic web \ncompromise operations. These capabilities suggest \na high operational tempo and specialized expertise.\nAPT37 has repeatedly deployed exploits, especially \nin Flash, quickly after vulnerabilities are initially \npublicized (see Table 1). CVE-2016-4117, CVE-\n2016-1019 and CVE-2015-3043 were all exploited \nby APT37 in this way. FireEye iSIGHT Intelligence \nconfirmed that since at least November 2017, APT37 exploited a zero-day Adobe Flash vulnerability, CVE-2018-4878, to distribute DOGCALL malware to \nSouth Korean victims. \nWhile use and discovery of zero-day exploits over \nthe past several years has expanded beyond a \nnation-state dominated environment to include \ncommercial vendors of cyber espionage capabilities \nand sophisticated financially motivated actors, access \nto zero-day exploits remains a factor in distinguishing \nsophisticated or well-resourced actors.  \nFigure 3 details the vulnerabilities exploited by \nAPT37, comparing the time of exploitation to the \ntime the CVE was released. SPECIAL REPORT 8FEB JAN DEC NOV OCT SEP AUG JUL JUN MAY APR MAR FEB JAN DEC NOV OCT SEP AUG JUL JUN MAY APR MAR FEB JAN DEC NOV OCT SEP AUG JUL JUN MAY APR MAR FEB JAN DEC NOV OCT SEP AUG JUL JUN MAY APR MAR FEB JAN\n2018 2017 2016 2015 2014CVE-2013-4979\nCVE-2013-4979\nCVE-2015-5122\nCVE-2016-4117\nCVE-2014-8439\nCVE-2016-1019\nCVE-2015-5119\nCVE-2015-2419\nCVE-2015-3105\nCommand and Control Infrastructure\nAPT37 uses a variety of techniques for command \nand control. They leverage compromised servers, \nmessaging platforms and cloud service providers \nto avoid detection. The group often relies on \ncompromised sites to host second stage malware \npayloads. Over time, APT37 has changed the email \nproviders to set up command and control accounts \nin a possible attempt to cover their tracks and cause \nmisdirection. These tactics have been refined over the \nyears as APT37 evolves to evade network defenders. \nAPT37 has used various legitimate platforms as \ncommand and control for its malware tools. While \nsome early campaigns leveraged POORAIM, which \nabused AOL Instant Messenger, newer activity \ndeploys DOGCALL, which uses cloud storage APIs \nsuch as pCloud and Dropbox.APT37 relies on compromised websites to host \nsecond stage malware. Small websites focused \non subjects such as aromatherapy and scuba \ndiving have been leveraged, and were most likely \ncompromised opportunistically and made to host \nmalicious payloads. \nAPT37 has improved its operational security over \ntime. For example, early 2015 use of SLOWDRIFT \ninvolved credentials associated with Korea related \nmail servers such as “Daum.net”. Later, in 2015 \nand early 2016, APT37 pivoted to different email \nproviders such as Gmail and “hmamail.com” in an \nattempt to anonymize activity. Then from mid-2016 \nonward, APT37 began using @yandex.com and @\nindia.com email accounts -- possibly an attempt to \ncause misattribution. 9 APT37 (REAPER): THE OVERLOOKED NORTH KOREAN ACTORAPT37 employs a diverse suite of malware for initial intrusion \nand exfiltration. Their malware is characterized by a focus \non stealing information from victims, with many set up to \nautomatically exfiltrate data of interest. Figure 4 shows APT37’s \nmalware usage over time. A full breakdown of the malware we \nassociate with APT37, along with how it is detected by FireEye \ndevices, is available in the Appendix. Malware  \n2015 2016 2017 2018\nJAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV DEC JAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV DEC JAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV DEC JAN\nKARAE\nSOUNDWAVE\nZUMKONG\nRICECURRY\nCORALDECK\nPOORAIM\nSLOWDRIFT\nMILKDROP\nGELCAPSULE\nDOGCALL\nHAPPYWORKAlong with custom malware used for espionage purposes, \nAPT37 also has access to destructive malware. In April 2017, \nAPT37 targeted South Korean military and government \norganizations with the DOGCALL backdoor and RUHAPPY \nwiper malware. Although the wiper capability was not \nused in the identified instance, RUHAPPY can overwrite a \nmachine's Master Boot Record (MBR), causing the system to \nfail to boot into preconfigured partitions.SPECIAL REPORT 102015 2016 2017 2018\nJAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV DEC JAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV DEC JAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV DEC JAN\nHAPPYWORK\nRUHAPPY\nSHUTTERSPEED\nWINERACKFigure 4.  \nTimeline of APT37 Malware Use  \nBy First and Last Observed  \nCompile Times.It is possible that APT37’s distribution of KARAE malware \nvia torrent websites could assist in creating and maintaining \nbotnets for future distributed denial-of-service (DDoS) \nattacks, or for other activity such as financially motivated \ncampaigns or disruptive operations. Disruptive and \ndestructive cyber threat activity, including the use of wiper \nmalware, public leaks of proprietary materials by false \nhacktivist personas, DDoS attacks and electronic warfare \ntactics such as GPS signal jamming is consistent with past \nbehavior by other North Korean actors. 11 APT37 (REAPER): THE OVERLOOKED NORTH KOREAN ACTORAttribution\n12 a.m.\n1 a.m.2 a.m3 a.m\n4 a.m\n5 a.m6 a.m\n7 a.m\n8 a.m\n9 a.m.10 a.m\n11 a.m.\n12 p.m.1 p.m.2 p.m.\n3 p.m.\n4 p.m.\n5 p.m.6 p.m.\n7 p.m.\n8 p.m.9 p.m.\n10 p.m.\n11 p.m.\nFrequencyFigure 5. APT37 Compile Times Against Local Time in North Korea.• An individual we believe to be the \ndeveloper behind several APT37 \nmalware payloads inadvertently \ndisclosed personal data showing that \nthe actor was operating from an IP \naddress and access point associated \nwith North Korea.\n• The compilation times of APT37 \nmalware is consistent with a developer \noperating in the North Korea time \nzone (UTC +8:30) and follows what is \nbelieved to be a typical North Korean \nworkday (Fig. 5). The majority of \nmalware compilation times occurred \nbetween 10:00 a.m. and 7:00 p.m., with We assess with high confidence that APT37 acts in support of the North \nKorean government and is primarily \nbased in North Korea. This assessment \nis based on multiple factors, including \nAPT37’s targeting profile, insight into \nthe group’s malware development \nand probable links to a North Korean \nindividual believed to be the developer \nof several of APT37’s proprietary \nmalware families:a dip around noon. Additional activity \noccurred late into the evening. This \nis consistent with media reporting of \nextremely long hours for North Korean \nworkers.\n• The majority of APT37 activity \ncontinues to target South Korea, North \nKorean defectors, and organizations \nand individuals involved in Korean \nPeninsula reunification efforts. Similarly, \nAPT37 targeting of a Middle Eastern \ncompany in 2017 is also consistent \nwith North Korean objectives given the \nentity’s extensive relationships inside \nNorth Korea. SPECIAL REPORT 12Outlook and Implications  \nNorth Korea has repeatedly demonstrated a \nwillingness to leverage its cyber capabilities for \na variety of purposes, undeterred by notional \nredlines and international norms. Though they \nhave primarily tapped other tracked suspected \nNorth Korean teams to carry out the most \naggressive actions, APT37 is an additional tool \navailable to the regime, perhaps even desirable for \nits relative obscurity. We anticipate APT37 will be \nleveraged more and more in previously unfamiliar \nroles and regions, especially as pressure mounts \non their sponsor.The slow transformation of regional actors into global threats is well established. Minor incidents \nin Ukraine, the Middle East and South Korea have \nheralded the threats, which are now impossible to \nignore. In some cases, the global economy connects \norganizations to aggressive regional actors. In other \ncases, a growing mandate draws the actor on to \nthe international stage. Ignored, these threats enjoy \nthe benefit of surprise, allowing them to extract \nsignificant losses on their victims, many of whom \nhave never previously heard of the actor.Figure 5.  APT37 Compile Times Against Local Time in North Korea.13 APT37 (REAPER): THE OVERLOOKED NORTH KOREAN ACTORSPECIAL REPORT14\nAppendix: Malware Used by APT37\nMalware Description Detected as\nCORALDECK CORALDECK is an exfiltration tool that searches for specified \nfiles and exfiltrates them in password protected archives using \nhardcoded HTTP POST headers. CORALDECK has been observed \ndropping and using Winrar to exfiltrate data in password \nprotected RAR files as well as WinImage and zip archives.APT.InfoStealer.Win.CORALDECK\nFE_APT_InfoStealer_Win_\nCORALDECK_1\nDOGCALL DOGCALL is a backdoor commonly distributed as an encoded \nbinary file downloaded and decrypted by shellcode following the \nexploitation of weaponized documents. DOGCALL is capable of \ncapturing screenshots, logging keystrokes, evading analysis with \nanti-virtual machine detections, and leveraging cloud storage APIs \nsuch as Cloud, Box, Dropbox, and Yandex.\nDOGCALL was used to target South Korean Government and \nmilitary organizations in March and April 2017. \nThe malware is typically dropped using an HWP exploit in a lure \ndocument. \nThe wiper tool, RUHAPPY, was found on some of the systems \ntargeted by DOGCALL. While DOGCALL is primarily an espionage \ntool, RUHAPPY is a destructive wiper tool meant to render \nsystems inoperable.FE_APT_RAT_DOGCALL \nFE_APT_Backdoor_Win32_\nDOGCALL_1 \nAPT.Backdoor.Win.DOGCALL\nGELCAPSULE GELCAPSULE is a downloader traditionally dropped or \ndownloaded by an exploit document. GELCAPSULE has been \nobserved downloading SLOWDRIFT to victim systems.FE_APT_Downloader_Win32_\nGELCAPSULE_1\nHAPPYWORK HAPPYWORK is a malicious downloader that can download and \nexecute a second-stage payload, collect system information, and \nbeacon it to the command and control domains. The collected \nsystem information includes: computer name, user name, system \nmanufacturer via registry, IsDebuggerPresent state, and execution \npath.\nIn November 2016, HAPPYWORK targeted government and \nfinancial targets in South Korea.FE_APT_Downloader_\nHAPPYWORK\nFE_APT_Exploit_HWP_Happy\nDownloader.APT.HAPPYWORK\nKARAE Karae backdoors are typically used as first-stage malware after an \ninitial compromise. The backdoors can collect system information, \nupload and download files, and may be used to retrieve a second-\nstage payload. The malware uses public cloud-based storage \nproviders for command and control.\nIn March 2016, KARAE malware was distributed through \ntorrent file-sharing websites for South Korean users. During \nthis campaign, the malware used a YouTube video downloader \napplication as a lure.FE_APT_Backdoor_Karae_enc\nFE_APT_Backdoor_Karae\nBackdoor.APT.Karae15\nAPT37 (REAPER): THE OVERLOOKED NORTH KOREAN ACTOR\nMalware Description Detected as\nMILKDROP MILKDROP is a launcher that sets a persistence registry \nkey and launches a backdoor.FE_Trojan_Win32_MILKDROP_1\nPOORAIM POORAIM malware is designed with basic backdoor \nfunctionality and leverages AOL Instant Messenger \nfor command and control communications. POORAIM includes the following capabilities: System information enumeration, File browsing, manipulation and exfiltration, Process enumeration, Screen capture, File execution, Exfiltration of browser favorites, and battery status. Exfiltrated data is sent via files over AIM.\nPOORAIM has been involved in campaigns against South \nKorean media organizations and sites relating to North Korean refugees and defectors since early 2014.\nCompromised sites have acted as watering holes to \ndeliver newer variants of POORAIM.Backdoor.APT.POORAIM\nRICECURRY RICECURRY is a Javascript based profiler used to \nfingerprint a victim's web browser and deliver malicious code in return. Browser, operating system, and Adobe Flash version are detected by RICECURRY, which may be a modified version of PluginDetect.Exploit.APT.RICECURRY\nRUHAPPY RUHAPPY is a destructive wiper tool seen on systems \ntargeted by DOGCALL. It attempts to overwrite the MBR, causing the system not to boot. When victims' systems attempt to boot, the string \"Are you Happy?\" is displayed.\nThe malware is believed to be tied to the developers of \nDOGCALL and HAPPYWORK based on similar PDB paths in all three.FE_APT_Trojan_Win32_RUHAPPY_1\nSHUTTERSPEED SHUTTERSPEED is a backdoor that can collect system \ninformation, acquire screenshots, and download/execute an arbitrary executable. SHUTTERSPEED typically requires an argument at runtime in order to execute fully. Observed arguments used by SHUTTERSPEED include: 'help', 'console', and 'sample'.\nThe spear phishing email messages contained documents \nexploiting RTF vulnerability CVE-2017-0199. \nMany of the compromised domains in the command \nand control infrastructure are linked to South Korean companies. Most of these domains host a fake webpage pertinent to targets.FE_APT_Backdoor_SHUTTERSPEED\nAPT.Backdoor.SHUTTERSPEEDAPT.Backdoor.SHUTTERSPEEDMalware Description Detected as\nSLOWDRIFT SLOWDRIFT is a launcher that communicates via cloud based \ninfrastructure. It sends system information to the attacker \ncommand and control and then downloads and executes \nadditional payloads.\nLure documents distributing SLOWDRIFT were not tailored for \nspecific victims, suggesting that TEMP.Reaper is attempting to \nwiden its target base across multiple industries and in the private \nsector.\nSLOWDRIFT was seen being deployed against academic and \nstrategic targets in South Korea using lure emails with documents \nleveraging the HWP exploit.\nRecent SLOWDRIFT samples were uncovered in June 2017 with \nlure documents pertaining to cyber crime prevention and news \nstories. These documents were last updated by the same actor \nwho developed KARAE, POORAIM and ZUMKONG.FE_APT_Downloader_Win_\nSLOWDRIFT_1\nFE_APT_Downloader_Win_\nSLOWDRIFT_2\nAPT.Downloader.SLOWDRIFT\nSOUNDWAVE SOUNDWAVE is a windows based audio capturing utility. Via \ncommand line it accepts the -l switch (for listen probably), \ncaptures microphone input for 100 minutes, writing the \ndata out to a log file in this format: C:\\Temp\\HncDownload\\\nYYYYMMDDHHMMSS.log.FE_APT_HackTool_Win32_\nSOUNDWAVE_1\nZUMKONG ZUMKONG is a credential stealer capable of harvesting usernames \nand passwords stored by Internet Explorer and Chrome browsers. \nStolen credentials are emailed to the attacker via HTTP POST \nrequests to mail[.]zmail[.]ru.FE_APT_Trojan_Zumkong\nTrojan.APT.Zumkong\nWINERACK WINERACK is backdoor whose primary features include user and \nhost information gathering, process creation and termination, \nfilesystem and registry manipulation, as well as the creation \nof a reverse shell that utilizes statically-linked Wine cmd.exe \ncode to emulate Windows command prompt commands. Other \ncapabilities include the enumeration of files, directories, services, \nactive windows and processes.FE_APT_Backdoor_WINERACK\nBackdoor.APT.WINERACK \nFireEye, Inc.  \n601 McCarthy Blvd. Milpitas, CA 95035  \n408.321.6300  \n877 FIREEYE (347.3393)  \ninfo@FireEye.com   \nwww.FireEye.comFireEye, Inc\n© 2018 FireEye, Inc. All rights reserved. FireEye is a registered trademark of FireEye, Inc.  \nAll other brands, products, or service names are or may be trademarks  \nor service marks of their respective owners. SP.APT37.2018.US-EN-000271-02"
}