{
    "title": "russian state hackers phish euro governments ahead of elections - infosecurity magazine",
    "text": "MAGAZINE EVENTS\n INSIGHT\nLatest\nBest Practices in Designing a Data Decommissioning Policy\nPhil Muncaster  UK / EMEA News Reporter , Infosecurity Magazine\nEmail Phil Follow @philmuncaster\nRelated to This Story\nMicrosoft: Russians Hacking Again Ahead of Euro\nElections\nThree Campaigns Targeted as Senate Pushes Security\nAPT28 Back in RussianDoll Attack Using Adobe,\nWindows Flaws\nMicrosoft Shuts Down Six APT28 Phishing Domains\nBolton Boasts Trumps Efforts to Secure Elections\n  The Magazine\nAbout Infosecurity\nSubscription\nMeet the Team\nContact UsAdvertisers\nMedia Pack\nContributors\nForward Features\nOp-ed\nNext-Gen SubmissionINFOSECURITY MAGAZINE HOME  » NEWS  » RUSSIAN STATE HACKERS PHISH EURO GOVERNMENTS AHEAD OF ELECTIONS\nLog In\n Sign Up\n  \n \nNews Topics Features Webinars White Papers Podcasts Events & Conferences Directory\nState-sponsored Russian hackers are targeting NATO members and European governments\nahead of the upcoming European Parliament elections, according to new  FireEye  intelligence.\nThe security vendor claimed to have detected spear-phishing activity from the prolific\nKremlin-linked APT28 and Sandworm Team groups.\nThe idea is to harvest passwords by sending the victim to a fake log-in page. To increase their\nchances of success, the groups are spoofing real government website portals, registering\ndomains similar to trusted destinations and displaying the sender of these phishing emails as\na trusted entity.\n“The groups could be trying to gain access to the targeted networks in order to gather\ninformation that will allow Russia to make more informed political decisions, or it could be\ngearing up to leak data that would be damaging for a particular political party or candidate\nahead of the European elections,” said Benjamin Read, senior manager of cyber espionage\nanalysis at FireEye.\n“The link between this activity and the European elections is yet to be confirmed, but the\nmultiple voting systems and political parties involved in the elections creates a broad attack\nsurface for hackers.”\nAlthough FireEye claimed the two groups’ activity appears to be coordinated, they use\ndifferent tools and tactics. The Sandworm Team  tends to use publicly available tools, while\nAPT28 uses expensive customized tools, and has deployed zero-day exploits in the past, it said.\nThis is not the first alert to be issued about Russian hacking activity ahead of the upcoming\nEuropean elections.\nIn February, Microsoft claimed to have spotted APT28 targeting NGOs, think tanks and other\ngovernment-linked organizations. It said 104 accounts across Belgium, France, Germany,\nPoland, Romania and Serbia had come under attack.\nThe infamous APT28 group  (aka Fancy Bear) has been blamed for the 2016 phishing attacks  on\nthe Democratic National Committee (DNC) which many believe helped Donald Trump to power.\nRecommended for you\nAddThisTop Ten Ways to\nReduce Your Digi...\nwww.infosecurity-mag …\nTales from the\nCrypt: Hardware...\nwww.infosecurity-mag …\nInfosecurity\nMagazine EMEA...\nwww.infosecurity-mag …\nInfosecurity\nMagazine North...\nwww.infosecurity-mag …\nRead Shared Watched Editor's ChoiceWhat’s Hot on\nInfosecurity Magazine?\n1\n2\n316 MAR 2020  NEWS\nUS Health Department Hacked Amid\nCoronavirus Pandemic\n13 MAR 2020  NEWS\nInfo-Stealing Coronavirus Threat Map\nDetected\n16 MAR 2020  OPINION\nWorking from Home Policies and the\nFuture of Cybersecurity\n4\n5\n616 MAR 2020  NEWS\nIllinois College Suffers Data Breach\n17 MAR 2020  NEWS\nAgents Arrest 24 on $30m Money\nLaundering Charges\n17 MAR 2020  NEWS\nUS VPN Use Could Soar 150% as Covid-\n19 Spreads\nCopyright © 2020 Reed Exhibitions Ltd.  Terms and Conditions  Privacy Policy  Intellectual property statement  Use of Cookies  Sitemap  Intuitiv Custom Websites\n21 MAR 2019  NEWS\nRussian State Hackers Phish Euro Governments Ahead\nof Elections\n "
}