{
    "title": "shifting tactics_ tracking changes in years-long espionage campaign against tibetans - the citizen lab",
    "text": " \n  \nPrivacy Policy Unless otherwise noted this site and its contents are licensed under a Creative Commons Attribution 2.5 Canada  license.\nRESEARCH NEWS ABOUT\nResearch Targeted Threats\nShifting Tactics\nTracking changes in years-long espionage campaign\nagainst Tibetans\nBy Jakub Dalek , Masashi Crete-Nishihata , and John Scott-Railton  March 10, 2016\nSummary\nThis report describes the latest iteration in a long-running espionage campaign against the\nTibetan community.  We detail how the attackers continuously adapt their campaigns to\ntheir targets, shi ing tactics from document-based malware to conventional phishing that\ndraws on “inside” knowledge of community activities. This adaptation appears to track\nchanges in security behaviors within the Tibetan community, which has been promoting  a\nmove from sharing attachments via e-mail to using cloud-based file sharing alternatives\nsuch as Google Drive.\nWe connect the attack group’s infrastructure and techniques to a group previously\nidentified by Palo Alto Networks, which they named Scarlet Mimic . We provide further\ncontext on Scarlet Mimic’s targeting and tactics, and the intended victims of their attack\ncampaigns.  In addition, while Scarlet Mimic may be conducting malware attacks using\nother infrastructure, we analyze how the attackers re-purposed a cluster of their malware\nCommand and Control (C2) infrastructure to mount the recent phishing campaign.\nThis move is only the latest development in the ongoing cat and mouse game between\nattack groups like Scarlet Mimic and the Tibetan community. The speed and ease with\nwhich attackers continue to adapt highlights the challenges faced by Tibetans who are\ntrying to remain safe online.\nBackground\nThe Tibetan community has been the target of malware-enabled espionage campaigns for\nover a decade. The attackers responsible for these campaigns are relentless in their\nattempts to compromise networks and harvest sensitive information. These attacks o en\ndemonstrate high levels of sophistication in the social engineering used to entice targets to\nopen malicious attachments or links, but are typically not very technically advanced . A\ncommon technique is the use of document-based malware. In a recent four-year study  on\ntargeted malware attacks against civil society, which included six Tibetan groups, we found\nthat document-based malware was the most common attack vector, accounting in some\ncases for up to 95 percent of all attacks against specific Tibetan groups.\nThe Tibetan community has recognized these patterns and made e orts to change user\nbehaviors to mitigate the attacks. For example, groups have started a digital security\ntraining campaign called “Detach from Attachments” , which urges users to avoid sending or\nopening email attachments, and to use cloud-based storage (e.g., Google Drive) to send files\ninstead. However, as the community changes behaviors, so do the attackers.\nRecently, Palo Alto Networks reported on a years-long espionage campaign they call\n“Scarlet Mimic ” that targeted Tibetan and Uyghur groups (as well as government agencies in\nRussia and India). The Scarlet Mimic campaigns are a typical example of the attacks civil\nsociety faces. Carefully cra ed email lures are sent to targets carrying exploits that leverage\nwell-known vulnerabilities (e.g., CVE-2012-0158&lt , CVE-2010-3333 ), which we have\nseen used in campaigns against Tibetan groups frequently in recent years.\nIn this post, we show that servers used as malware C2 infrastructure by Scarlet Mimic are\nnow hosting phishing pages designed to steal Google credentials from Tibetan activists and\njournalists. This shi  in tactics from malware to phishing campaigns suggests that the\nattackers are adapting to behavioral changes in the Tibetan community. In the following\nsections, we provide an overview of malware campaigns connected to Scarlet Mimic we\nobserved targeting Tibetan groups from 2013-2014, and analyze how the same\ninfrastructure is now being used to host a wave of phishing attacks. We conclude with\ndiscussion of what may have motivated this change in tactics, and provide\nrecommendations for targeted users.\nPart 1: Scarlet Mimic Campaigns against\nTibetans\nAccording to Palo Alto Networks , Scarlet Mimic has been active for at least four years. The\nattack group primarily uses well-known vulnerabilities and the “FakeM” malware family first\nreported by Trend Micro  in 2013, which attempts to disguise its malicious tra ic as\ncommonly used protocols.\nA cluster of Scarlet Mimic attacks used the FakeM Custom SSL variant and were deployed on\nC2 infrastructure that relied on free domains provided by Securepoint , a German dynamic\nDNS service. Dynamic DNS services typically allow anyone to make free subdomains from a\nmain domain. In the case of Securepoint, this service allows anyone to make free\nsubdomains from *.firewall‐gateway.com , *.my‐gateway.org , *.myfirewall.org  and others.\n We speculate that the attackers may have selected this particular service, because the\ndomains have innocuous technical names (e.g, *.firewall‐gateway.com ) that may escape\ncasual scrutiny. These kinds of domains can change ownership over time and may be shared\nby many unrelated users, which can also make analysis more challenging.\nOur analysis of attacks against the Tibetan community reveals a series of campaigns active\nfrom 2013 to 2014 using the FakeM Custom SSL variant and dynamic DNS infrastructure that\nis linked to Scarlet Mimic. These malware samples are described in detail in the Palo Alto\nNetworks Scarlet Mimic report . Through our engagement with the targeted groups, we\nprovide further context that demonstrates the level of social engineering and targeting put\ninto the attacks. Understanding this context provides insights into the attackers’ tactics,\nincluding their later pivot to phishing campaigns.\nCampaign 1\nThe first attack that we connected to Scarlet Mimic was observed in a July 3, 2013 e-mail.\nThe email was sent to the internal mailing list for a steering committee of a Tibetan NGO,\nand was highly customized.  The message spoofed the e-mail of the NGO’s director, and\ndemonstrated familiarity with the internal workings of the organization. Under the pretext\nof an updated strategic plan, the e-mail encouraged recipients to open the attached\ndocument titled “[Organization Name] Updated Strategic Plan.doc”\nFrom: [Redacted]\nDate: 03 Jul 2013\nSubject: Re: [Steering Committee] conclusions to Strategic Plan Review\nTo: [Redacted]\nDear Steering Committee Members, Thanks everyone for all of the good suggestions! Here is the Updated\nStrategic Plan and we’re looking forward to more comments please!\n[Redacted signature]\nThe malicious attachment installs the file pshvb.exe with the MD5 hash:\n8b83fc5d3a6a80281269f9e337fe3fff\nThis hash matches a FakeM Custom SSL variant sample described in the Palo Alto Networks\nreport. The malware connected to a C2 server on the domain: news[.]firewall‐\ngateway[.]com .  At the time of the attack this domain resolved to the IP address\n109[.]169[.]77[.]230 , and was hosted on UK-based virtual server provider iomart\nCampaign 2\nWe observed the attackers again on March 19, 2014 when they targeted a di erent Tibetan\ngroup. The attack masqueraded as a message from a representative of the O ice of His\nHoliness the Dalai Lama (HHDL) in Taiwan and contained an attachment that referenced an\nupcoming visit of HHDL to Japan.\nSimilar to the previous attack, the attachment dropped the FakeM Custom SSL variant, and\nis also referenced in the Palo Alto Networks report. In this case the malware connected to\nthe C2 detail43[.]myfirewall[.]org , which at the time of the attack also resolved to the\nsame IP address as the previous campaign, 109[.]169[.]77[.]230 .\nAnother set of attacks spanned from June to July 2014 targeting the same Tibetan group\nand a number of Tibetan journalists. The Tibetan group received multiple e-mails\npurportedly from NGOs working on Tibetan issues, while the journalists were enticed by a\npromise of survey results on Tibetan political attitudes.\nAll of these attacks used the same FakeM Custom SSL variant and connected to the C2\nsys[.]firewall‐gateway[.]net , which resolved to 95[.]154[.]195[.]159  at the time of the\nattack and was also hosted on UK server provider iomart. See Figure 1 for an overview of the\ncampaign.\nFigure 1: Overview of Campaign 2, showing how the same malicious files\nare spread using di erent pretexts.\nPart 2: Old Infrastructure, New Tricks\nThroughout November 2015 we observed Scarlet Mimic’s C2 infrastructure being\nrepurposed to host phishing attacks against the Tibetan community. The phishing\ncampaign we identified consisted of targeted emails with email senders and messages that\nare relevant to the Tibetan community. The emails appeared to share links to documents or\nvideos on Google Drive or video sharing websites.\nThe Phishing Campaign\nUsing the example of an e-mail sent to Tibetan journalists, we can demonstrate how a\ntypical phishing attack in the campaign works. The e-mail masquerades as sent by a Tibetan\nactivist, describes a video on China and Tibet, and shares a link to what appears to be a\nvideo sharing site.\nFrom: Dorjee Tenzin <tenzins @gmail.com>\nDate: 22 Nov 2015\nSubject: How CHINA takes care of Tibet and Tibetans – video\nTo: [Redacted]\nThis video – How CHINA takes care of Tibet and Tibetans – is short and easy to understand. Must watch.\nhttp://www.downvids.net/how-china-takes-care-of-tibet-and-tibetans-595657.html\nIn fact, the link directs the user to a phishing page:\nhttp://accountgoogle[.]firewall‐gateway[.]com/serviclogin\nThe site displays a lookalike to the Google Gmail login page (see Figure 2).\nFigure 2: Comparison of Google login phishing page (le ) and authentic\nGoogle login as of March 2016 (right).\nInterestingly, the login page used by the attackers is slightly outdated. Their version includes\nboth username and password prompts on the same page.  Google has been using a two-\nprompt process for authentication since May 2015\nIf a victim enters their credentials, the data is sent to the attackers via an HTTP POST\nrequest that is formatted as: http://accountgoogle.firewall‐\ngateway.com /serviclogin/ojkiojr09[.]asp .  An example of the data that is sent back to\nattackers is provided in Figure 3.\nFigure 3: A sample of the data sent to the attackers. The Email and\nPassword fields are the most relevant.\nDecoy Content\nOnce a user enters their credentials they are redirected to decoy content. In the example\nattack against Tibetan journalists, if the victim entered their credentials they were re-\ndirected to the video “How CHINA takes care of Tibet and Tibetans” on the video sharing site\nreferenced in the email (see Figure 4).\nFigure 4: Screenshot of destination content.\nThe destination content that the user is sent to is determined by a string in the subdirectory\nof the URL that has various misspellings of “ servicelogin ”. In the emails we collected, we\nfound three subdirectory variations:\nhttp://filegoogle[.]firewall‐gateway[.]com/ servicelogin\nhttp://accountgoogle[.]firewall‐gateway[.]com/ serviclogin\nhttp://accountgoogle[.]firewall‐gateway[.]com/ servicclogin\nWe speculate that the last part of the URL, “ ojkiojr09” in our example URL\n(http://accountgoogle.firewall‐gateway.com/serviclogin/ ojkiojr09 [.]asp) may be a\ncampaign code, or a way for the attackers to di erentiate on their end who is accessing the\nphished page, and the destination content to which they should be forwarded. We see a\nsimilar string in another of the emails that may be used for this purpose:\nhttp://filegoogle[.]firewall‐gateway[.]com/servicelogin/sfwef[.]asp\nPhishing Campaign Timeline\nWe have observed the campaign active between at least November 9, 2015 to December 18,\n2015. During this period we collected three phishing emails sent to Tibetan journalists and\nNGOs. Monitoring the URLs that link to the phishing page reveals that the destination\ncontent to which the user would be forwarded was changed frequently. These changes\nsuggest that the campaign was active beyond the three emails we collected and the\nattackers were sending out additional emails with messages linked to the new destination\ncontent.\nFigure 5 provides a timeline for the campaign and shows when emails were received, the\noriginal destination content provided, and changes to the destination content over time. On\nDecember 18 the servers were up, but no content was being served in reply to logins.\nFigure 5: Timeline of phishing campaign (see Appendix A for full details).\nWhile we only collected three emails during the span of the campaign, changes in the\ndestination content suggest the timing and theme of further phishing attacks. On\nNovember 25, 2015 the destination content on URLs 1 and 2 were both changed to climate\nchange-related content.\nThe content redirected from URL 1 was changed to a public Google Drive folder that\ncontained campaign materials on climate change from a Tibetan NGO. The content\nredirected from URL 2 was changed to a website used to organize the Global Climate March\n(globalclimatemarch.org ), a demonstration to raise climate change awareness.\nThe climate change theme is significant. During this period Tibetan organizations were\ntaking part in advocacy to raise awareness on climate change in Tibetan areas in\nanticipation of the United Nations Conference on Climate Change  held in Paris, France from\nNovember 30 to December 12, 2015.\nSee Appendix A for details on each attack and destination content change.\nOverlap with Scarlet Mimic\nSimilar to the previous FakeM Custom SSL campaigns, the phishing pages used domains\nprovided by Securepoint’s dynamic DNS service:\nfilegoogle[.]firewall‐gateway[.]com\naccountgoogle[.]firewall‐gateway[.]com\ndetail43[.]myfirewall[.]org\nSimilar to the previous malware campaigns, all three of these domains are also hosted on\niomart.\nWe observed the first phishing campaign using this infrastructure in early November 2015.\nDuring this time, two of the domains ( filegoogle[.]firewall‐gateway[.]com ,\naccountgoogle[.]firewall‐gateway[.]com ) resolved to the IP address 95[.]154[.]195[.]171 .\nWe further investigated this IP address through passive DNS data sources in PassiveTotal\nand found additional domains that match the “ firewall‐gateway ” naming scheme\n observed in the Scarlet Mimic malware campaigns:\naccountsgoogle[.]firewall‐gateway[.]com\naccounts‐google[.]firewall‐gateway[.]com\naccountsgoogles[.]firewall‐gateway[.]com\ngooglefile[.]firewall‐gateway[.]net\nfirewallupdate[.]firewall‐gateway[.]com\nfirewallupdate[.]firewall‐gateway[.]net\ndrivgoogle[.]firewall‐gateway[.]com\nTable 1 shows connections between domains identified by Palo Alto Networks, domains we\nsee used as C2 servers in the previous malware campaigns, and relations to servers hosting\nthe recent phishing campaigns. The overlap in domains and passive DNS records shows the\ninfrastructure relationships between the previous Scarlet Mimic campaigns and recent\nphishing campaigns.\nASN Name IP Address DomainCitlab\nSeenFakeM\nCustom\nHOL-GR hellas online Electronic\nCommunications S.A.,GR5.54.19.17drivgoogle.firewall-\ngateway.comX\nIOMART-AS Iomart,GB78.129.252.\n159admin.spdns.org X\nfirefox.spdns.de X\nintersecurity.firewall-\ngateway.comX\nkaspersky.firewall-\ngateway.netX\nkissecurity.firewall-\ngateway.netX\nopero.spdns.org X\n87.117.229.\n109detail43.myfirewall.org X X\n95.154.195.\n171accountgoogle.firewall-\ngateway.comX\naccountsgoogle.firewall-\ngateway.comX\naccountsgoogles.firewall-\ngateway.netX\nfilegoogle.firewall-\ngateway.comX\nfirewallupdate.firewall-\ngateway.comX\nfirewallupdate.firewall-\ngateway.netX X\ngooglefile.firewall-\ngateway.netX\nnews.firewall-\ngateway.comX X\nsys.firewall-gateway.net X X\n109.169.40.\n172economy.spdns.de X\nLGI-UPC Liberty Global Operations B.V.,AT46.127.56.1\n09mail.firewall-gateway.com X\nNEWMEDIAEXPRESS-AS-AP NewMedia\nExpress Pte Ltd. Singapore Web Hosting\nService Provider,SG192.253.25\n1.118aaa123.spdns.de X\nTable 1: Comparison of domains and hosting seen by Citizen Lab (labelled “Citizen Lab Seen”) and the FakeM\nCustom SSL cluster described in the Scarlet Mimic report (labelled “FakeM Custom”).\nEvidence of Other Campaigns\nWe leveraged patterns in the configuration of the phishing servers to identity additional\nservers. The IP address 95[.]154[.]195[.]171  that we saw previously was using Microso  IIS\nweb server version 6 and was configured to forbid access to the top level of the URL path.\nUsing the search engine Shodan we scanned all servers on iomart that ran IIS 6 and forbid\naccess to the root url path with the query:\nport:80 IIS/6.0 forbidden title:Error \"Content‐Length: 218\" country:\"GB\" org:iomart\nFor all the matched servers we sent a query to the URL path ( /servicelogin/ojkiojr09.asp ),\nwhich is used to redirect victims to destination content in the phish attacks. The purpose of\nthis query was to to determine if any other servers would forward us to content in the same\nmanner we had observed in the attacks.\nWe found one other IP address ( 87[.]117[.]229[.]109 ) on iomart that responded to this\nquery. We observed this server responding with a redirect to an article by Radio Free Asia\nregarding the arrest of the aunt of Tenzin Delek Rinpoche, a Tibetan monk who recently\ndied while in a Chinese prison.\nWe saw this content active from November 30, 2015 to December 3, 2015, when the forward\nlink stopped working, which may mean that the campaign completed at this time.\nWe used PassiveTotal  to identify which domains pointed to both IP addresses from March\n2015 to December 2015 and saw an overlap across three domains:\nsys[.]firewall‐gateway[.]net\nnews[.]firewall‐gateway[.]com\nfirewallupdate[.]firewall‐gateway[.]net\nThe domain: firewallupdate[.]firewall‐gateway[.]net  was referenced in the Palo Alto\nNetwork  report and pointed to both the IPs we identified at di erent times (see Figure 6).\nFigure 6: Domain overlap between two iomart IPs in the phishing\ninfrastructure.\nAdditionally this new IP had two additional domains that were also using the Securepoint\ndynamic DNS service: updata[.]firewall‐gateway[.]com  and accounts-google[.]firewall-\ngateway[.]com. We saw one of the domains: detail43[.]myfirewall[.]org  used as a C2\nserver for an attack in the previously described Scarlet Mimic campaign from 2014.\nWhy the Shift to Phishing?\nWhen Scarlet Mimic shi ed tactics, they failed to properly compartmentalize their phishing\nand malware operations, relying on known C2 infrastructure for the new phishing\ncampaigns. Although they tried di erent attack vectors they still fell back on old habits and\nresources that could be leveraged by analysts. Monitoring the infrastructure enabled us to\ntrack the campaigns over time and demonstrates the importance of infrastructure analysis\nfor security researchers.\nThe shi  to phishing campaigns is significant, as Palo Alto Networks only observed\ndocument-based malware attacks. [1] Importantly, Scarlet Mimic may be continuing to\nconduct as-yet unreported malware campaigns on other infrastructure. There are a number\nof potential explanations for this change.\nThe phishing campaigns targeted multiple organizations and individuals in the Tibetan\ncommunity. Many of these groups act as distributed networks, with sta  members and\ncollaborators around the world. The attackers are, therefore, not necessarily targeting\ncompromise of o ice networks, but rather social networks. Credential phishing is a\npotentially more e icient means of gaining access to these networks than document-based\nmalware.\nIn addition, the promotion of behavioral changes in the Tibetan community and the use of\ndocument-sharing platforms such as Google Docs over email attachments may have put\npressure on attackers’ tactics and led them to experiment with simpler, but potentially\ne ective vectors, such as phishing. In other attacks against the Tibetan community over the\npast year we have also seen  malware sent via Google Drive links in targeted emails. The\nScarlet Mimic phishing campaigns add further evidence that attackers are attempting to\nleverage the wide use and trust of Google applications in the Tibetan community.\nIt is also possible that the rising detections by antivirus products of Scarlet Mimic’s preferred\nmalware toolkit play a role. Out of the 74 FakeM sample hashes provided in the Palo Alto\nNetworks Scarlet Mimic  report, 61 are available on VirusTotal. When the samples were first\nsubmitted to VirusTotal some had zero detections and an overall average detection rate of\n38 percent. Following the publication of the Palo Alto Networks report the average\ndetection increased to 54 percent. The current average detection rate is 71 percent, the\nhighest is 80 percent (46 / 57 antivirus scanners), and the lowest is 51 percent (23 / 45\nantivirus scanners). These current detection rates may make the malware that the attackers\nused in past attacks less reliable for successful infection. While the attackers could be\npivoting to new, less detectable malware, simple phishing attacks may also involve less\ne ort and achieve higher success against journalists and NGO targets.\nFinally, we cannot rule out that converting burned or low-utility command and control\nservers to phishing might also be intentional down-cycling of infrastructure, before it is\ndiscarded.  Phishing, in other words, may be the last stop before domains and servers that\nare losing value are finally given up.\nConclusion\nThe Tibetan community has been targeted by sophisticated, persistent attackers for over a\ndecade. Scarlet Mimic is just one of these attack groups, and over the years they have\ndemonstrated deep familiarity and inside knowledge of the Tibetan groups they target.\nThey have also shown themselves to be adaptable and responsive to changes in the security\nbehaviors of their targets.\nTheir most recent turn to phishing seems to reflect this adaptability (although we leave\nopen the possibility that malware attacks are continuing, using other infrastructure). A\nnumber of factors may have played a role in this transition, including an increase in certain\nsecurity behaviors within the Tibetan community (such as not opening or sending\nattachments), and increasing rates of detection by antivirus products.\nThe information targeted by this group is sensitive, and in the hands of a well-resourced\nadversary, such as the sponsor of Scarlet Mimic, could cause harm to the safety and security\nof individuals in Tibet. The extracted information could also be used in support of e orts to\nfrustrate and isolate political groups in the Tibetan diaspora.\nPhishing relies on tricking users into entering credentials. In this case, there are several\ntelltale signs (such as a slightly outdated Gmail login phishing page) that may suggest to\npotential victims that something is “not quite right.” However, there are also a number of\ntools and tactics available to users in the Tibetan community and beyond to stay safe\nonline We describe several of these below.\nWhat Can Targeted Users Do?\nTools\nUse two-factor authentication.  This feature is available on many popular email and\nsocial network services including those from Google, Facebook, Microso , Yahoo, and\nothers. Enabling two-factor authentication means you have to enter your password as\nwell as a code provided by a text, app, or security key to access your account.  The\nsecond factor helps protect you from credential the .\nPassword Alert  [get it by clicking here ] is a Chrome extension developed by Google\nthat notifies you if you enter your Google credentials into any pages other than the real\nGoogle login page ( https://accounts.google.com ).\nBehavior\nAlways be cautious about emails containing links or attachments and carefully examine\nthe email sender address in suspicious messages.\nIf an email contains a link always verify that the domain in the URL matches the link\ntext.\nFor further resources on digital security see Tibet Action Institute’s Be a Cyber Super\nHero project.\nFootnotes\n1.The one divergence from this pattern that has been previously reported was a 2013\nStrategic Web Compromise  (SWC) attack against the Tibetan Alliance of Chicago’s website\ndocumented by WebSense. A SWC is an attack in which attackers compromise normally\ntrusted websites and serve malicious code to specific visitors. In this case, the attackers used\nthe Tibetan website to serve an Internet Explorer vulnerability ( CVE-2012-4969 ) that was\npatched in 2012. This attack used the domain mail[.]firewall‐gateway[.]com  as a C2, which\nis from the same dynamic DNS service as the FakeM SSL Custom variant attacks.\nAcknowledgements\nThis research was supported by the John D. and Catherine T. MacArthur Foundation\n(Professor Ronald J. Deibert, Principal Investigator). Special thanks to PassiveTotal, Ron\nDeibert, Lobsang Gyatso, Sarah McKune, Adam Sen , and Nart Villeneuve.\nAppendix A: Phishing Campaigns in Detail\nPhishing Attack 1\nThe first phishing attack we saw was sent on November 9, 2015 to a group of Tibetan\njournalists. The message purported to contain a link to a document with information on a\ncontroversial Buddhist sect known as Dorje Shugden or Dolgyal , which has been involved in\nprotests against the Dalai Lama.\nFrom: Choephel Tenzin <tenzinch128@gmail.com>\nDate: Mon, Nov 9, 2015\nSubject: Who is demonstrating against the Dalai Lama\nTo: [Redacted]  \nFile regarding Dolgyal.\nWho is demonstrating against the Dalai Lama.doc\nThe link “Who is demonstrating against the Dalai Lama.doc” actually goes to\nhttp://accountgoogle[.]firewall‐gateway[.]com/servicclogin . When we first checked this\nlink on November 13, the page was down and we therefore do not know what the original\ndestination content was for this attack.\nDestination Content Switch\nOn November 25 the link was active and the destination content was a public Google Drive\nfolder that contained campaign materials on climate change from a Tibetan NGO. The\nclimate change theme is significant, as during this period Tibetan organizations were taking\npart in advocacy to raise awareness on climate change in Tibetan areas in anticipation of the\nUnited Nations Conference on Climate Change held in Paris, France from November 30 to\nDecember 12, 2015.\nPhishing Attack 2\nThe second phishing attack was sent to Tibetan journalists on November 22, 2015.\nIn this case the email was made to appear to come from a Tibetan activist, describes a video\non China and Tibet, and shares a link to what appears to be a video sharing site, but is\nactually\nhttp://accountgoogle[.]firewall‐gateway[.]com/serviclogin .\nFrom: Dorjee Tenzin <tenzins @gmail.com>\nDate: 22 Nov 2015\nSubject: How CHINA takes care of Tibet and Tibetans – video\nTo: [Redacted]\nThis video – How CHINA takes care of Tibet and Tibetans – is short and easy to understand. Must watch.\nhttp://www.downvids.net/how-china-takes-care-of-tibet-and-tibetans-595657.html\nOn November 22, 2015, if users entered their credentials into the Google login phishing page\nthey would be redirected to the video described in the email.\nDestination Content Switch\nOn November 25, 2015, the destination content was changed to a website used to organize\nthe Global Climate March ( globalclimatemarch.org ), a demonstration to raise climate\nchange awareness around the United Nations Conference on Climate Change.\nThe November 25, 2015 destination content change shares the timing and theme of the\nchange we observed on the previous URL path variation. While we do not have additional\nphishing emails from this period, these commonalities suggest the attackers were sending\nphishing emails with climate change themes around November 25, 2015.\nPhishing Attack 3\nOn November 23, 2015, an email appearing to be from the Press O icer of the Central\nTibetan Administration was sent to multiple Tibetan journalists, activists, and NGO sta \nmembers.\nFrom: Tsering Wangchuk <euhrdesk.diir@gmail.com>\nDate: 23 Nov 2015\nSubject: Press Invitation\nTo: [Redacted]\nPress Invitation\nThe media is cordially invited by the Election Commission of the Central\nTibetan Administration its press conference regarding the upcoming Sikyong\nand Tibetan final elections at Lhakpa Tsering hall, DIIR, on November 27, 2015, at 10:00 AM.\nPress Invitation.pdf Tsering Wangchuk\nPress O icer\n+91 8679208465\nwww.tibet.net\nTwitter: https://twitter.com/Presso icerct\nFacebook: https://www.facebook.com/lhuabu\nDIIR, CENTRAL TIBETAN ADMINISTRATION\nThe “Press Invitation.pdf” link actually goes to http:// filegoogle[.]firewall‐\ngateway[.]com/servicelogin . On November 23, when the email was sent, if the user entered\ntheir credentials into the phishing page they would be redirected to a Google Doc containing\na copy of an op-ed written by the Central Tibetan Administration on climate change. The\ndestination content and the email message do not match in this case, which may be\nevidence of the attackers neglecting to switch out content from a previous campaign.\nDestination Content Switch\nOn November 26, 2015, the destination content to which the phishing page redirected users\nwas changed to a Google Drive document that provides the program for a visit to\nDharamsala, India by Chilean Parliamentarians.\nAppendix B: Indicators of Compromise\nScarlet Mimic Malware Campaign 1\nBinaries\nMD5: fef27f432e0ae8218143bc410fda340e\nCommand and Control Servers\nnews.firewall‐gateway[.]com\nScarlet Mimic Malware Campaign 2\nAttack 1\nFile attachments\nFilename: 20140317144336097.DOC\nMD5: 3b869c8e23d66ad0527882fc79ff7237\nBinaries\nFilename: cghnt.exe\nMD5: 1bf438b5744db73eea58379a3b9f30e5\nFilename: iph.bat\nMD5: d2e9412428c3bcf3ec98dba8a78adb7b\nCommand and Control Servers\ndetail43[.]myfirewall[.]org\nAttack 2\nFile attachments\nFilenames:  Reappraisal_of_India_Tibet_Policy.doc\nGenuine autonomy or complete independance.doc\nApplication for Mentee.doc \nMD5: 7735e571d0450e2a31e97e4f8e0f66fa\nBinaries\nFilename: uroyh.exe\nMD5: ea45265fe98b25e719d5a9cc3b412d66\nFilename: uroyh‐unpacked.exe \nMD5: 5c030802ad411fea059cc9cc4c118125\nCommand and Control Servers\nsys[.]firewall‐gateway[.]net\nPhishing Campaign Infrastructure\nfilegoogle[.]firewall‐gateway[.]com\naccountgoogle[.]firewall‐gateway[.]com\ndetail43[.]myfirewall[.]org\nhttp://filegoogle[.]firewall‐gateway[.]com/servicelogin\nhttp://accountgoogle[.]firewall‐gateway[.]com/serviclogin\nhttp://accountgoogle[.]firewall‐gateway[.]com/servicclogin\nམི་མང་གི་ཚ གས་ ེ་ཁག་ལ་ ན་མ ད་པའི་ ོག་ ད་ ི་ ་འ འི་ ོལ་ ང་འ ད་བཞིན་པ།\nSocial Engineering Attacks on Government OpponentsTags:\nMalware, Phishing, Targeted Threats , TibetRelated: Share:\nRESEARCH\nTargeted Threats\nFree Expression Online\nTransparency and Accountability\nApp Privacy and Controls\nGlobal Research Network\nTools & Resources\nAll PublicationsNEWS\nIn the Media\nEvents\nOpportunities\nNewsletter ArchivesABOUT\nAbout the Citizen Lab\nPeople\nMedia Resources\nTeaching\nDonate\nCONNECT\nNEWSLETTER\nYour email address Sign up\n "
}