{
    "title": "silverterrier – 2018 nigerian business email compromise",
    "text": "Tools Playbooks Speaking Events About Us\nSilverTerrier – 2018 Nigerian Business Email\nCompromise\n67,293 people reacted 32 11 min. read\nThis post is also available in: 日本語  (Japanese )\nExecutive Summary \nOver the past five years, Business Email Compromise (BEC) schemes have emerged as one of the most profitable\nand widespread activities amongst cyber criminals. This rapid rise has sparked alarm, recognition, and a call to\naction across both domestic and international law enforcement communities. In 2016 the Internet Crime\nComplaint Center (IC3) published its annual report  highlighting BEC as a “Hot Topic” with single year losses\nestimated at US$360 million. A year later, BEC retained special recognition as a hot topic in the\n2017 report  which estimated US$670 million in annual losses.  With rising public awareness and improved\nreporting mechanisms, law enforcement subsequently  reported a 136% increase in losses between December\n2016 and May 2018.  Of greatest concern, the same announcement  noted that global losses exceeded US$12.5\nbillion and impacted 150 countries in the five‐year period from 2013‐2018 . Unfortunately, t his trend shows no\nsign of slowing do wn with the recently released 2018 report  noting that  single year\nlosses have now eclipsed  US$1.29 billion .  \nConcurrently, Palo Alto Networks Unit 42 has actively monitored the evolution of this threat with a focus on\nNigerian cybercrime.  While BEC is a global threat, our focus on Nigerian actors provides insights into one of the\nlargest subcultures participating in this malign activity given the country’s historic ranking as a top five hotspot for\ncybercrime.  In 2014, we released our first report 419 Evolution , documenting one of the first cases of Nigerians\ndeploying malware for financial gain.  Two years later, we released The Next Evolution of Nigerian\nCybercrime , detailing a tremendous growth in malware adoption and assigning the code name “SilverTerrier” to\nthese actors.  In 2017, we observed the threat expand to hundreds of actors participating in BEC schemes with\ndetails released in The Rise of Nigerian Business Email Compromise .  Over the past year, the number\nof SilverTerrier actors surpassed 400.  Combined, these actors are now attributed to over 51,000 malware\nsamples and 1.1 million attacks over the past four years.  Leveraging this wealth of data, this blog outlines the\nmost recent SilverTerrier malware trends and provides an overview of positive actions taking place across law\nenforcement and industry to combat this activity.   \nAttacks \nCollectively, Nigerian cyber actors continued to prove their ability to deliver sizable year‐over‐year growth in\nattacks.  In 2017, we observed an average of 18,294 attacks per month, representing a 23% increase from 2016. \nThis period also included a new single month’s record of 41,000 attacks in August 2017.  In 2018, average attacks\ngrew to 28,227 per month with surges in March and April both surpassing previous records (see Figure 1).  This\ngrowth represents an alarming 54% annual increase and signifies that both the quantity and pace of attacks is\nincreasing. Moreover, one should note that these numbers only reflect attacks against our customer base.  Thus,\nwhile we assess that our metrics are representative of the global trends associated with this activity, it is very\nlikely that the actual number of global attacks far exceeds our numbers. \nFigure 1. Nigerian malware activity from July 2014 through December 2018  \nIn addition to impressive growth, Nigerian actors continue to launch their attacks against the breadth of all\nindustry segments.  Our data shows that the high‐tech industry received the greatest number of attacks, climbing\nfrom 46k to 120k over the past year.  The wholesale industry advanced to secure its place as the second most\ntargeted industry, witnessing a 400% growth in attacks from 2017.  Manufacturing also observed a sizeable\nincrease in attacks from 32k to 57k but dropped one position to become the third most targeted industry in\n2018.  Finally, education and professional/legal services both witnessed sizable growth in attacks as the fourth\nand fifth most targeted industries, respectively.\nFigure 2. Top five targeted industries\nAnalyzing the delivery vectors used in these attacks produced a consistent ranking of the top five applications\nbetween 2017 and 2018. Email applications topped the list with SMTP, POP3, and IMAP securing the first,\nsecond, and fourth most common delivery applications, respectively.  In terms of metrics, we observed malware\nin 219k SMTP sessions, 46k POP3 sessions, and 8.4k IMAP sessions.  Web browsing remained the third most\ncommon delivery application with malware detected in 20k sessions while FTP ranked fifth with only 654\nsessions. Comparatively, these metrics provide valuable insights for network administrators, informing the need\nfor email‐based detection capabilities in order to adequately defend against this threat.\nFigure 3. Top five delivery applications  \nMalware \nSilverTerrier actors are gaining experience quickly as they adopt new technologies, techniques, and malware to\nadvance their schemes.  Over the course of the past four years, we tracked their adoption and use of 20\ndifferent commodity malware tools.  Procured for nominal costs, these tools require minimal setup, and come\npreloaded with a variety of capabilities that enable actors to achieve their desired outcomes.  Given that the\nantivirus community is often quick to identify and signature these tools, Nigerian actors frequently leverage a\nvariety of constantly evolving “crypters” as a means to obfuscate the tools and circumvent signature‐based\ndetection capabilities.  Comparing 14,694 SilverTerrier samples collected in 2018 against VirusTotal demonstrated\nan average detection rate of 53% across vendor solutions at the time of discovery. By the end of the year,\nsubsequent measurements taken in early 2019 revealed that detection rates improved over time, but only by five\npercentage points, achieving 58% across all vendors.  This low number lends credence to, and highlights the\nsignificance of, the threat that this malware employment technique poses to organizations relying on traditional\nsignature‐based detection capabilities.  \nFocusing on the individual tools, we continue to find that the adoption and employment rates of malware families\nrise and fall consistent with popularity, effectiveness, detection rates, availability, and other traditional market\nfactors.  Analysis of these trends can provide valuable insights for network administrators in terms of validating\nand tailoring network defenses for the most common threats.  Of equal importance, these trends guide the\ncybersecurity industry in prioritizing detection capabilities while also enabling law enforcement to focus\nattribution and legal process against tool developers.  In performing this analysis, we grouped the tools into two\nbroad categories: Information Stealers and Remote Administration Tools, or RATs.  \nInformation Stealers  \nAgentTesla, Atmos, AzoRult, ISpySoftware, ISR Stealer, KeyBase, LokiBot, Pony, PredatorPain, and Zeus are all\ncommodity malware tools designed with a core information stealing component.  Upon infection, they capture\nscreenshots, passwords, or other sensitive files which are then transmitted to locations where they can later be\nretrieved by cyber actors.  In most cases, these tools rely on simple command and control mechanisms such as\nuploads to web servers, FTP servers, and SMTP email connections.  These common services blend in with\nnormal network traffic and ultimately impede detection capabilities by traditional port/protocol filtering edge\ndevices.  However, this strength is also a weakness in that the malware control infrastructure is generally hard\ncoded as a domain or email address.  Once identified, this infrastructure can be taken down by service providers\nthus terminating collection and limiting the period of effective use for these tools.  \nAcross the ten tools, Nigerian actors produced an average of 1000 unique samples of malware per month in\n2018 (see Figure 4).  Although substantial, this average represents a noteworthy 26% decline from the previous\nyear.  Our data suggests that the rapid growth experienced between 2014 and 2017 has reached its peak,\nplateaued, and is now in decline.  While difficult to pinpoint the exact reason behind this phenomenon, it is likely\nthat declining availability of tools, increased law enforcement efforts, advancements in the cybersecurity\nlandscape, and increased adoption of RATs by SilverTerrier actors were all contributing factors.\nFigure 4. Information Stealer samples 2014‐2018  \nExploring the most popular tools in this category, we found that SilverTerrier samples were disproportionately\nassociated with four of the ten tools seen in 2018.  At the top of the list, we observed an average of 446 samples\nof Lokibot.  Pony, which averaged 330 samples per month, maintained its popularity throughout 2018 likely due to\nits dual nature as a capability for stealing credentials and more importantly, its ability to download and install\nadditional malware tools on compromised systems. Next, actors produced an average of 95 samples per month\nof AgentTesla, a small .NET keylogger.  Finally, PredatorPain, a tool which has received multiple updates over the\nyears, fell in popularity from its peak usage in 2016, but maintained a steady following of actors producing an\naverage of 65 samples per month throughout 2018.\nFigure 5. Most popular Information Stealers 2018  \nOn the other end of the spectrum, our data shows that historically Atmos, AzoRult, KeyBase, ISpySoftware, and\nISR Stealer were very capable tools, yet all have experienced dramatic declines from their peak usage rates.  In\ncomparison with the most popular tools, we observed an average of only 24 samples per month of ISR Stealer\nattributed to a hand full of actors in 2018 while the remaining capabilities ranged from two to 16 samples per\nmonth.\nFigure 6. Least popular Information Stealers 2018  \nRemote Administration Tools  \nNetWire, DarkComet, NanoCore, LuminosityLink, Remcos, ImminentMonitor, NJRat, Quasar, Adwind, HWorm are\nall commodity malware tools that provide attackers with remote access to compromised systems.  In doing so,\nthese tools expand upon the basic data theft capabilities of information stealers and allow SilverTerrier actors to\nmodify systems, access network resources, and perform functions on behalf of compromised users.  This\nfunctionality is commonly leveraged to send malicious or fraudulent emails and access databases within victim\norganizations in hopes of monetizing their efforts.  However, with greater capabilities comes greater complexity\nand these tools often require additional experience to deploy and operate.  For example, the interactive nature of\nthese tools demands steady connections to control servers that are often running on high number\nephemeral ports .  In order to protect the control servers, actors frequently rely on dynamic DNS and virtual\nservers rather than static domain registrations.  This technique affords actors a layer of obfuscation making\nattribution more difficult while also extending the useable life of a malware sample, as dynamic DNS allows for\ntransfer of control to new servers over time.  \nEvaluating Nigerian use of these ten tools in 2018, we observed an average production of 533 samples per\nmonth, representing a gain of 36% over the previous year.  This sample rate is nearly half that of information\nstealers, yet the growth rate stands in stark contrast. Combined, the data suggests that Nigerian actors are\nmoving away from legacy information stealers in favor of remote administration tools which provide greater\ncapabilities to achieve their goals.  Given these metrics, we assess that RAT adoption and deployment will\ncontinue to climb at a consistent rate throughout 2019.\nFigure 7. Remote Administration Tool samples 2014‐2018  \nExploring the most popular tools in this category, we found that six out of the ten tools exceeded averages of 50\nsamples per month.  Securing the top spot with an average of 125 samples per month, NanoCore was the most\npopular RAT employed by SilverTerrier actors in 2018.  This is a fascinating result, given that the\ndeveloper behind NanoCore was arrested  in 2017.  Yet, despite legal efforts to curb its use, a “cracked” version\nof the tool remains available for free download on various forums across the internet, thus allowing for continued\nuse.  DarkComet and Netwire, both adopted back in 2014, followed in popularity with averages of 86 and 85\nsamples per month respectively.  HWorm, originally released in 2013, has received developer upgrades over the\nyears.  Despite its history, our first confirmed use by Nigerian actors was in March 2018 and since then, we have\nobserved an average of 70 samples per month. Finally, SilverTerrier actors continued to steadily employ Remcos,\nfirst seen in 2016, and Adwind, first seen in 2015, at average rates of 58 and 53 samples per month throughout\n2018.\n Figure 8. Most popular Remote Administration Tools 2018  \nStanding in contrast to the steady employment and rapid adoption of the most popular tools, we saw\nthat ImminentMonitor, LuminosityLink, NJRat, and Quasar have lost popularity over the past year.   Of the\nfour, ImminentMonitor maintains a small but loyal following of Nigerian actors that produced an average of 24\nsamples per month.  LuminosityLink, serves as a success story for law enforcement in that usage dropped from\nover 100 samples per month in early 2017 to an average of 18 samples per month in 2018 after the developer\nwas arrested.  Public attribution, attack metrics, and historical sales context provided in our February blog\npost aided law enforcement efforts in securing a guilty plea  in July, followed by sentencing  in October.  Finally,\nQuasar and NJRat exist as anomalies, having never gained tremendous adoption rates amongst SilverTerrier\nactors, thus resulting in low averages of 8 and 6 samples per month, respectively.\nFigure 9. Least popular Remote Administration Tools 2018  \nA Year of Action \nDespite the continued growth in attacks and US$12.5 billion in global loses attributed to BEC schemes over the\npast five years, there were also a series of positive actions that took place cementing 2018 as an important\nmilestone in the battle against this threat.  Arguably, the most noteworthy of these activities was the mobilization\nand unprecedented level of collaboration between law enforcement and private industry partners from the\ncybersecurity, technology, and financial sectors.  While the foundation for this collaboration dates back to the\nfirst BEC conference hosted in 2016, this industry‐led initiative has since transformed into an annual event that\ncontinues to pay dividends for all organizations involved.  \nOne such dividend was realized in January 2018 when the Federal Bureau of Investigation (FBI) launched its first\nlarge‐scale, coordinated effort to dismantle BEC operations globally. Over the course of six months, law\nenforcement officers participating Operation Wirewire  arrested 74 individuals.  Amongst them were 29 Nigerians\narrested as a result of the FBI’s close collaboration with the Nigerian Electronic Federal Crimes Commission\n(EFCC).  Capitalizing on the success of the operation, the third annual BEC conference convened in July 2018. \nThere, law enforcement organizations provided valuable feedback to industry partners and highlighted an\nexpanding list of new relationships with international counterparts energized to tackle this threat.   \nBeyond law enforcement actions and in October 2018, Mr. Ronnie Tokazowski, the founder and administrator of\nthe BEC collaboration group, graciously accepted the JD Falk Award  on behalf of the group’s 530+ members. \nThis award specifically recognized the group’s achievements on preventing millions of dollars in fraud through\nreal‐time, cross‐industry collaboration, as well as efforts that resulted in the disruption of thousands of Nigerian\nscheme email accounts.  \nCombined, these two exemplars mark the beginning of a positive turning point as organizations look beyond\nindividual defense activities towards proactive actions to combat the BEC threat.  Where cyber actors previously\nacted with impunity, law enforcement has now demonstrated the resolve to coordinate with foreign partners in\npursuit of these crimes.  Nowhere is the success of this collaboration more evident than in Nigeria where the\nEFCC proudly posts on their public Facebook  page photos of actors along with their associated charges.  \nConclusions \nBusiness Email Compromise (BEC) schemes are one of the most profitable and widespread activities amongst\ncyber criminals with recent reports quantifying global losses in excess of US$12.5 billion. Unit 42 monitors this\nthreat through the lens of Nigerian cybercrime.  In doing so, we active track more than 400 SilverTerrier actors\nattributed to roughly 51,000 malware samples and 1.1 million attacks over the past four years.  \nSilverTerrier  actors remain a formidable threat to businesses worldwide, demonstrating a 54 percent increase in\nattacks in 2018. These actors predominately rely on email to distribute their malware with the most targeted\nindustries being: High Tech, Wholesale, Manufacturing, Education and Professional/Legal Services.  \nOur data from 2018 shows that i nformation stealing malware families remain in common use,\nwith SilverTerrier actors producing an average of 1000  samples per month.   However, the production of new\nsamples declined 26% signaling a shift to more capable  Remote Administration Tools which saw a 36% increase\nand an average production of 533 samples per month.  \nWhile BEC campaigns remain an active threat, Palo Alto Networks customers are protected in the following\nways:   \nWildFire® cloud‐based threat analysis service and Traps™ advanced endpoint protection accurately identify\nsamples associated with these malware families.  \nDNS Security Service, Threat Prevention and URL Filtering identify all phishing and malware domains\nassociated with these actors as malicious.  \n Users of AutoFocus™ contextual threat intelligence service can view malware  associated with these attacks\nusing the following tags:  \nAdwind  \nAgentTesla  \nAtmos  \nAzoRult  \nBilalStealer  (ISR Stealer)  \nDarkComet  \nHWorm  \nImminentMonitor  \nISpySoftware  \nKeyBase  \nLokiBot  \nLuminosityLink  \nNanoCore  \nNetWire  \nNJRat  \nPony  \nPredatorPain  \nQuasar  \nRemcos  \nZeus  \nSilverTerrier  \n You can find a complete list of the malware domains associated with SilverTerrier actors on GitHub ®. \nPalo Alto Networks has shared our findings, including file samples and indicators of compromise, in this report with our fellow Cyber Threat Alliance members.\nCTA members use this intelligence to rapidly deploy protections to their customers and to systematically disrupt malicious cyber actors. For more information\non the Cyber Threat Alliance, visit www.cyberthreatalliance.org .\nGet updates from Palo Alto  Networks!\nSign up to receive the latest news, cyber threat intelligence and research from usBy Unit 42\nMay 9, 2019 at 6:00 AM\nCategory: Unit 42\nTags: BEC, Business Email Compromise , Nigeria , Nigerian Prince , SilverTerrier\nEmail address Subscribe\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\nBy submitting this form, you agree to our Terms of Use  and acknowledge\nour Privacy Statement .\n© 2020 Palo Alto Networks, Inc. All rights reserved.Popular Resources\nResource Center\nBlog\nCommunities\nTech Docs\nUnit 42\nSitemapLegal No ces\nPrivacy\nTerms of Use\nDocumentsAccount\nManage Subscriptions\nReport a Vulnerability\nSearch Unit 42\nSHARE \n "
}