{
    "title": "SolarWinds hack explained_ Everything you need to know",
    "text": "10/10/22, 6:12 PM SolarW inds hack e xplained: Everything you need to know\nhttps://www .techtar get.com/whatis/featur e/SolarW inds-hack-e xplained-Everything- you-need-to -know 1/10Essential Guide  Browse Sections  5The latest SolarWinds breach news 5\nHow the SolarWinds breach happened 5\nIT industry , vendors respond 5\nThis content is part of the Essential Guide:\nSolarW inds breach news center\nSolarWinds hack explained: Everything you need to know\nHackers targeted SolarW inds by deploying malicious code into its Orion IT monitoring and\nmanagement software used by thousands of enterprises and government agencies worldwide.FEATURE\nSaheed Oladimeji, Sean Michael Kerner\nPublished: 29 Jun 2022\n2020 was a roller coaster of major , world-shaking events. W e all couldn't wait for the year to\nend. But just as 2020 was about to close, it pulled another fast one on us: the SolarWinds hack,\none of the biggest cybersecurity breaches of the 21st century .9WhatIs.comg10/10/22, 6:12 PM SolarW inds hack e xplained: Everything you need to know\nhttps://www .techtar get.com/whatis/featur e/SolarW inds-hack-e xplained-Everything- you-need-to -know 2/10The SolarWinds hack was a major event not because a single company was breached, but\nbecause it triggered a much larger supply chain incident that af fected thousands of\norganizations, including the U.S. government.\nSolarWinds is a major software company based in T ulsa, Okla., which provides system\nmanagement tools  for network and infrastructure monitoring, and other technical services to\nhundreds of thousands of organizations around the world. Among the company's products is an\nIT performance monitoring system called Orion.\nAs an IT monitoring system, SolarWinds Orion has privileged access to IT systems to obtain log\nand system performance data. It is that privileged position and its wide deployment that made\nSolarWinds a lucrative and attractive target.\nThe SolarWinds hack is the commonly used term to refer to the supply chain breach that\ninvolved the SolarWinds Orion system.\nIn this hack, suspected nation-state hackers that have been identified as a group known as\nNobelium by Microsoft -- and often simply referred to as the SolarWinds Hackers by other\nresearchers -- gained access to the networks, systems and data of thousands of SolarWinds\ncustomers. The breadth of the hack is unprecedented and one of the largest, if not the largest,\nof its kind ever recorded.\nMore than 30,000 public and private organizations -- including local, state and federal agencies\n-- use the Orion network management system to manage their IT resources. As a result, the\nhack compromised the data, networks and systems of thousands when SolarWinds\ninadvertently delivered the backdoor malware as an update to the Orion software.\nSolarWinds customers weren't the only ones af fected. Because the hack exposed the inner\nworkings of Orion users, the hackers could potentially gain access to the data and networks of\ntheir customers and partners  as well -- enabling af fected victims to grow exponentially from\nthere.What is SolarW inds?\nWhat is the SolarW inds hack?10/10/22, 6:12 PM SolarW inds hack e xplained: Everything you need to know\nhttps://www .techtar get.com/whatis/featur e/SolarW inds-hack-e xplained-Everything- you-need-to -know 3/10The hackers used a method known as a supply chain attack  to insert malicious code into the\nOrion system. A supply chain attack works by targeting a third party with access to an\norganization's systems rather than trying to hack the networks directly .\nThe third-party software, in this case the SolarWinds Orion Platform, creates a backdoor\nthrough which hackers can access and impersonate users and accounts of victim organizations.\nThe malware could also access system files and blend in with legitimate SolarWinds activity\nwithout detection, even by antivirus software.\nSolarWinds was a perfect target for this kind of supply chain attack . Because their Orion\nsoftware is used by many multinational companies and government agencies, all the hackers\nhad to do was install the malicious code into a new batch of software distributed by SolarWinds\nas an update or patch.\nHere is a timeline of the SolarWinds hack:\nHow did the SolarW inds hack happen?\nThe SolarW inds hack timelineHackers compromised a digitally signed SolarWinds Orion network monitoring component, opening a backdoor into the\nnetworks of thousands of SolarWinds government and enterprise customers.k10/10/22, 6:12 PM SolarW inds hack e xplained: Everything you need to know\nhttps://www .techtar get.com/whatis/featur e/SolarW inds-hack-e xplained-Everything- you-need-to -know 4/10September 2019.  Threat actors gain unauthorized access to SolarWinds network\nOctober 2019. Threat actors test initial code injection into Orion\nFeb. 20, 2020.  Malicious code known as Sunburst injected into Orion\nMarch 26, 2020.  SolarWinds unknowingly starts sending out Orion software updates with\nhacked code\nAccording to a U.S. Department of Homeland Security advisory , the af fected versions of\nSolarWinds Orion are versions are 2019.4 through 2020.2.1 HF1.\nMore than 18,000 SolarWinds customers installed the malicious updates, with the malware\nspreading undetected. Through this code, hackers accessed SolarWinds's customer information\ntechnology systems, which they could then use to install even more malware to spy on other\ncompanies and organizations.\nAccording to reports, the malware af fected many companies and organizations . Even\ngovernment departments such as Homeland Security , State, Commerce and T reasury were\naffected, as there was evidence that emails were missing from their systems. Private\ncompanies such as FireEye, Microsoft, Intel, Cisco and Deloitte also suf fered from this attack.\nThe breach was first detected by cybersecurity company FireEye . The company confirmed they\nhad been infected with the malware when they saw the infection in customer systems. FireEye\nlabeled the SolarWinds hack \"UNC2452\" and identified the backdoor used to gain access to its\nsystems through SolarWinds as \"Sunburst.\"\nMicrosoft also confirmed that it found signs of the malware in its systems, as the breach was\naffecting its customers as well. Reports indicated Microsoft's own systems were being used to\nfurther the hacking attack, but Microsoft denied this claim to news agencies. Later , the company\nworked with FireEye and GoDaddy to block and isolate versions of Orion known to contain the\nmalware to cut of f hackers from customers' systems.\nThey did so by turning the domain used by the backdoor malware used in Orion as part of the\nSolarWinds hack into a kill switch . The kill switch here served as a mechanism to prevent\nSunburst from operating further .\nNonetheless, even with the kill switch  in place, the hack is still ongoing. Investigators have a lot\nof data to look through, as many companies using the Orion software aren't yet sure if they are\nfree from the backdoor malware. It will take a long time before the full impact of the hack is\nknown.Who was affected?\nThe SolarWinds Hack: 5 Things Y ou Need t o Know The SolarWinds Hack: 5 Things Y ou Need t o Know10/10/22, 6:12 PM SolarW inds hack e xplained: Everything you need to know\nhttps://www .techtar get.com/whatis/featur e/SolarW inds-hack-e xplained-Everything- you-need-to -know 5/10With attackers having first gained access to the SolarWinds systems in September 2019 and\nthe attack not being publicly discovered or reported until December 2020, attackers may well\nhave had 14 or more months of unfettered access.\nThe time it takes between when an attacker is able to gain access and the time an attack is\nactually discovered is often referred to as dwell time. According to a report released in January\n2020 by security firm CrowdStrike, the average dwell time  in 2019 was 95 days. Given that it\ntook well over a year from the time the attackers first entered the SolarWinds network until the\nbreach was discovered, the dwell time in the attack exceeded the average.\nThe question of why it took so long to detect the SolarWinds attack has a lot to do with the\nsophistication of the Sunburst code and the hackers that executed the attack.\n\"Analysis suggests that by managing the intrusion through multiple servers based in the United\nStates and mimicking legitimate network traf fic, the attackers were able to circumvent threat\ndetection techniques employed by both SolarWinds, other private companies, and the federal\ngovernment,\" SolarWinds said in its analysis of the attack .\nFireEye, which was the first firm to publicly report the attack, conducted its own analysis  of the\nSolarWinds attack. In its report, FireEye described in detail the complex series of action that the\nattackers took to mask their tracks. Even before Sunburst attempts to connect out to its\ncommand-and-control server , the malware executes a number of checks to make sure no\nantimalware or forensic analysis tools are running.\nThe purpose of the hack remains largely unknown. Still, there are many reasons hackers would\nwant to get into an organization's system, including having access to future product plans or\nemployee and customer information held for ransom. It is also not yet clear what information, if\nany, hackers stole from government agencies. But the level of access appears to be deep and\nbroad.Why did it take so long to detect the SolarW inds attack?\nWhat was the purpose of the hack?10/10/22, 6:12 PM SolarW inds hack e xplained: Everything you need to know\nhttps://www .techtar get.com/whatis/featur e/SolarW inds-hack-e xplained-Everything- you-need-to -know 6/10There are speculations that many enterprises might be collateral damage, as the main focus of\nthe attack was government agencies that make use of the SolarWinds IT management systems.\nFederal investigators and cybersecurity agents believe a Russian espionage operation -- mostly\nlikely Russia's Foreign Intelligence Service -- is behind the SolarWinds attack .\nThe Russian government has denied any involvement in the attack, releasing a statement that\nsaid, \"Malicious activities in the information space contradicts the principles of the Russian\nforeign policy , national interests and understanding of interstate relations.\" They also added that\n\"Russia does not conduct of fensive operations in the cyber domain.\"\nNot the first time\nThe SolarWinds hack is the latest in a series of recent attacks blamed on Russian operatives.\nIt is believed a Russian group known as Cozy Bear was behind attacks  targeting email\nsystems at the White House and the State Department in 2014. The group has also been\nmentioned as responsible for the infiltration of the Democratic National Committee's email\nsystems and members of Hillary Clinton's presidential campaign in 2015 in the lead-up to the\n2016 election, as well as further breaches around the 2018 midterm elections.\nContrary to experts in his administration, then-President Donald T rump hinted at around the\ntime of the discovery of the SolarWinds hack that Chinese hackers might be behind the\ncybersecurity attack. However , he did not present any evidence to back up his claim.\nShortly after his inauguration, President Joe Biden vowed that his administration intended to\nhold Russia accountable, through the launch of a full-scale intelligence assessment and review\nof the SolarWinds attack and those behind it. The president also created the position of deputy\nnational security adviser for cybersecurity  as part of the National Security Council. The role,\nheld by veteran intelligence operative Anne Neuberger , is part of an overall bid by the Biden\nadministration to refresh the federal government's approach to cybersecurity and better respond\nto nation-state actors.\nThe SolarWinds attack has a number of dif ferent names associated with it. While the attack is\noften referred to simply as the SolarWinds attack, that isn't the only name to know .\nSunburst . This is the name of the actual malicious code injection that was planted by\nhackers into the SolarWinds Orion IT monitoring system code. Both SolarWinds and\nCrowdStrike generally refer to the attack as Sunburst.\nSolorigate . Microsoft initially dubbed the actual threat actor group behind the SolarWinds\nattack as Solorigate. It's a name that stuck and was adopted by other researchers as well as\nmedia.Who was responsible for the hack?\nNaming the attack: What is Solorigate, Sunburst and Nobelium?10/10/22, 6:12 PM SolarW inds hack e xplained: Everything you need to know\nhttps://www .techtar get.com/whatis/featur e/SolarW inds-hack-e xplained-Everything- you-need-to -know 7/10Nobelium . In March 2021, Microsoft decided that the primary designation for the threat\nactor behind the SolarWinds attack should actually be Nobelium -- the idea being that the\ngroup is active against multiple victims -- not just SolarWinds -- and uses more malware\nthan just Sunburst.\nWhile it is suspected that the initial Sunburst code and the attack against SolarWinds and its\nusers came from a threat actor based in Russia, other nation-state threat actors have also used\nSolarWinds in attacks.\nAccording to a Reuters report , suspected nation-state hackers based in China exploited\nSolarWinds during the same period of time the Sunburst attack occurred. The suspected China-\nbased threat actors targeted the National Finance Center , which is a payroll agency within the\nU.S. Department of Agriculture.\nIt is suspected that the China-based attackers did not use Sunburst, but rather a dif ferent\nmalware that SolarWinds identifies as Supernova .\nThe SolarWinds supply chain attack is a global hack, as threat actors turned the Orion software\ninto a weapon gaining access to several government systems and thousands of private systems\naround the world. Due to the nature of the software -- and by extension the Sunburst malware --\nhaving access to entire networks, many government and enterprise networks and systems face\nthe risk of significant breaches.\nThe hack could also be the catalyst for rapid, broad change in the cybersecurity industry . Many\ncompanies and government agencies are now in the process of devising new methods to react\nto these types of attacks before they happen. Governments and organizations are learning that\nit is not enough to build a firewall and hope it protects them. They have to actively seek out\nvulnerabilities in their systems, and either shore them up or turn them into traps against these\ntypes of attacks.\nSince the hack was discovered, SolarWinds has recommended customers update their existing\nOrion platform. The company has released patches for the malware and other potential\nvulnerabilities  discovered since the initial Orion attack. SolarWinds also recommended\ncustomers not able to update Orion isolate SolarWinds servers and/or change passwords for\naccounts that have access to those servers.\nThe greater White House cybersecurity focus will be crucial, some industry experts have said.\nBut organizations should consider adopting modern software-as-a-service tools for monitoring\nand collaboration. While the cybersecurity industry has significantly advanced in the last\ndecade, these kinds of attacks  show that there is still a long way to go to get really secure\nsystems.The China connection to the SolarW inds attack\nWhy is the SolarW inds hack important?\nThe Nobelium group continues to attack targets10/10/22, 6:12 PM SolarW inds hack e xplained: Everything you need to know\nhttps://www .techtar get.com/whatis/featur e/SolarW inds-hack-e xplained-Everything- you-need-to -know 8/10The suspected threat actor group behind the SolarWinds attack has remained active in 2021\nand hasn't stopped at just targeting SolarWinds. On May 27, 2021, Microsoft reported  that\nNobelium, the group allegedly behind the SolarWinds attack, infiltrated software from email\nmarketing service Constant Contact. According to Microsoft, Nobelium targeted approximately\n3,000 email accounts at more than 150 dif ferent organizations.\nThe initial attack vector appears to be an account used by USAID. From that initial foothold,\nNobelium was able to send out phishing emails in an attempt to get victims to click on a link that\nwould deploy a backdoor T rojan designed to steal user information.\nPodcast: SolarW inds attacks come into focus\nDownload this podcast\nIn the aftermath of the attack, the U.S. Cybersecurity and Infrastructure Security Agency issued\nguidance  on software supply chain compromise mitigations. The guidance provides specific\ntactical recommendations on what organizations should look for to identify and remove\npotentially exploited components.\nAs it turned out, the SolarWinds incident was one of multiple attacks in 2020 and 2021 that\nhighlighted risks with supply chain security . Incidents such as the Colonial Pipeline attack  in\nMay 2021 and the  Kaseya ransomware attack  in July 2021 demonstrated how attackers were\nable to exploit vulnerabilities in components of the software supply chain to af fect a wider group\nof vendors.\nModern software applications no longer rely on a monolithic stack of discrete software\ncomponents. Developers now build applications out of many components that can come from\nmany sources. Any one of the components that makes up an application could potentially\nrepresent a risk if there is an unpatched vulnerability . As such, it is critical for developers,\norganizations they work for and end users that consume applications be aware of all the\ndifferent components that make up an application. It's an approach that is known as a software\nbill of materials (SBOM). An SBOM is like a \"nutritional label” that is present on packaged food\nproducts, clearly showing consumers what's inside a product.\nThe need for SBOMs was mandated by an executive order  issued in May 2021 by the Biden\nAdministration. The executive order led to the National T elecommunications and Information\nAdministration report  released in July 2021 that provides guidance on SBOM best practices and\nminimum requirements. The executive orders also mandated that U.S. government agencies\nonly work with software vendors that provide SBOMs.\n\"Those who operate software can use SBOMs to quickly and easily determine whether they are\nat potential risk of a newly discovered vulnerability ,\" the Executive Order stated.00:00 27:21\nNeed for software bill of materials highlighted in aftermath of attack10/10/22, 6:12 PM SolarW inds hack e xplained: Everything you need to know\nhttps://www .techtar get.com/whatis/featur e/SolarW inds-hack-e xplained-Everything- you-need-to -know 9/10SolarWinds hackers still active, using new techniquesNext Stepsm\nE-Guide: Cloud computing security - Infrastructure issues\n–SearchSecurity .com\nBuilding the Right Mobile Security T oolkit\n–SearchSecurity .com\nBest Practices for Mobile Data Protection\n–SearchSecurity .com\nDefining Y our Corporate Mobile Policies\n–SearchSecurity .comRelated Resources\nDig Deeper on Securitym\nSecurity Think T ank: Attackers leveraging the supply chain\nBy: Paddy Francis\nSolarW inds hackers Nobelium spotted using a new backdoor\nBy: Shaun Nichols\nSolarW inds hackers compromised Microsoft support agent\nBy: Arielle W aldman\nSentinelOne: More supply chain attacks are coming10/10/22, 6:12 PM SolarW inds hack e xplained: Everything you need to know\nhttps://www .techtar get.com/whatis/featur e/SolarW inds-hack-e xplained-Everything- you-need-to -know 10/10\n-ADS BY GOOGLE\n    NETWORKING SECURITY CIO HR SOFTW ARE CUST OMER EXPERIENCE\nSearch Networking\nnetwork security\nNetwork security encompasses all the steps taken to protect the integrity of a computer network and the data within it.\ncloud-native network function (CNF)\nA cloud-native network function (CNF) is a service that performs network duties in software, as opposed to purpose-built\nhardware.\nBrowse by T opic\nBrowse Resources\nAbout Us  Meet The Editors  Editorial Ethics Policy  Contact Us  Advertisers  Business Partners\nEvents  Media Kit  Corporate Site  Reprints\nAll Rights Reserved, Copyright 1999 - 2022 , TechT arget  \n \nPrivacy Policy  \nCookie Preferences \nDo Not Sell My Personal InfoBy: Arielle W aldman"
}