{
    "title": "stolen pencil campaign targets academia _ netscout",
    "text": " NAVIGATION COMPANY CONNECTSTOLEN PENCIL Campaign\nTargets Academia\nby ASERT Team onDECEMBER 5TH, 2018\nExecutive Summary\nASERT has learned of an APT campaign, possibly originating from DPRK, we are calling STOLEN PENCIL\nthat is targeting academic institutions since at least May 2018. The ultimate motivation behind the\nattacks is unclear, but the threat actors are adept at scavenging for credentials. Targets are sent spear\nphishing e-mails that lead them to a web site displaying a lure document and are immediately\nprompted to install a malicious Google Chrome extension. Once gaining a foothold, the threat actors\nuse off-the-shelf tools to ensure persistence, including Remote Desktop Protocol (RDP) to maintain\naccess.\n \nNOTE:  NetScout AED/APS enterprise security products detect, and block activity related to STOLEN\nPENCIL using our ATLAS Intelligence Feed (AIF).\nKey Findings  \nA wide variety of phishing domains imply other targets, but those focused on academia were\nintended to install a malicious Chrome extension.\nA large number of the victims, across multiple universities, had expertise in biomedical\nengineering, possibly suggesting a motivation for the attackers targeting.\nPoor OPSEC led to users finding open web browsers in Korean, English-to-Korean translators open,\nand keyboards switched to Korean .\nThe threat actors use built-in Windows administration tools and commercial off-the-shelf\nsoftware to “live off the land”. The threat actor at the keyboard uses RDP to access compromised\nsystems rather than a backdoor or Remote Access Trojan (RAT).\nPost-exploitation persistence is maintained by harvesting passwords from a wide variety of sources\nsuch as process memory, web browsers, network sniffing, and keyloggers.\nThere is no evidence of data theft, leaving the motivation behind STOLEN PENCIL largely uncertain.\nSpear Phishing\nIn keeping with tried and true tactics, the operators behind the STOLEN PENCIL campaign used spear-phishing as their initial intrusion vector (left Figure 1). First reported by Twitter user @MD0ugh, a target of STOLEN PENCIL receives a spear-phishing message containing a link to one of several domains controlled by the threat actor. We’ve identified several domains used for phishing (below). client-message[.]com\nworld-paper[.]net\ndocsdriver[.]com\ngrsvps[.]com\ncoreytrevathan[.]com\ngworldtech[.]com\nIn addition to the Top-Level Domains (TLDs), we’ve uncovered a number of sub-domains used by the actors (below):\naswewd.docsdriver[.]com\nfacebook.docsdriver[.]com\nfalken.docsdriver[.]com\nfinder.docsdriver[.]com\ngovernment.docsdriver[.]com\nkeishancowan.docsdriver[.]com\nkorean-summit.docsdriver[.]com\nmofa.docsdriver[.]com\nnorthkorea.docsdriver[.]com\no365.docsdriver[.]com\nobservatoireplurilinguisnorthkorea.docsdriver[.]com\noodwd.docsdriver[.]com\ntwitter.docsdriver[.]com\nwhois.docsdriver[.]com\nMany of the subdomains contain basic phishing pages, consisting of saved HTML of common web\nlogin properties. Some of the pages contain the “MarkOfTheWeb” artifact inserted by the web browser\nwhen the threat actor clicked “Save As” on the page they intend to impersonate.  this\ntechnique, although we do not believe the campaigns are related. The more sophisticated phishing\npages targeting academia display a benign PDF in an IFRAME. It then redirects the user to install a “Font\nManager” extension from the Chrome Web Store, as seen in Figure 2.  \nFigure 2: HTML Source of Phishing Page  The malicious extensions, now removed from the Chrome\nWeb Store, contain reviews left by the threat actor using compromised Google+ accounts. The text of\nthe reviews were copy/pasted from other extensions and were all rated “five-stars”, even if the copied\ntext was negative. It’s likely the compromised accounts used to leave reviews were from individuals the\nthreat actors assume the target would know and trust.  It should be noted however, that some users\nreported deleting the extension immediately because it prevented the Chrome browser from\nfunctioning properly.  This could suggest mistakes or poorly written code that utilized too many\nresources to remain functional and stealthy, at least for some users. The malicious Chrome extensions\ndeclare permissions to run on every URL in the browser, as seen in Figure 3.\nFigure 3: manifest.json with <all_urls>  The extensions load JavaScript from a separate site, shown in\nFigure 4. The name of the loaded JavaScript file is jQuery.js. When retrieving this file at the time of our\nanalysis, the content was a legitimate jQuery file. We speculate that the attacker replaced the malicious\nJavaScript with a benign payload to deter analysis. Loading jQuery.js from an external site makes no\nsense, since the latest version of extension has a legitimate jQuery.js included in the extension bundle.\n \nFigure 4: Given the threat actor’s propensity for password theft, and the fact that the malicious Chrome\nextensions were situated to read data from every website, it's likely that the intent is to steal browser\ncookies and passwords.  Email forwarding was also observed on some compromised accounts. While\nGDPR requirements prevented us from pivoting on Registrant information, the actors reused IP space,\nreused a certificate, and the aforementioned domain mimicking technique allowed for some pivoting. \nA variety of infrastructure was discovered. Those IOCs are included below.\nToolset\nOnce gaining a foothold on a user’s system, the threat actors behind STOLEN PENCIL use Microsoft’s\nRemote Desktop Protocol (RDP) for remote point-and-click access.  This means a human is behind the\nkeyboard interacting with a compromised system, and not using a RAT (Remote Access Trojan) with a\ncommand-and-control site acting as a proxy between the threat actor and the compromised system.\nRDP access occurred daily from 06:00-09:00 UTC (01:00-04:00 EST).  In one case, we noted that the\nthreat actor changed the victim’s keyboard layout to Korean. A compromised or stolen certificate was\nused to sign several PE files used in STOLEN PENCIL for two sets of tools:\nMECHANICAL\nLogs keystrokes to %userprofile%\\appdata\\roaming\\apach.{txt,log} and also functions as a\n“cryptojacker” that replaces Ethereum wallet addresses with\n0x33883E87807d6e71fDc24968cefc9b0d10aC214E. This Ethereum wallet address currently has a\nzero balance and no transactions.\nGREASE\na tool to add a Windows administrator account with a specific username/password and enable\nRDP, circumventing any firewall rules. We’ve observed the following list of username/password\ncombinations, though the significance of “1215” is unknown:\nLocalAdmin/Security1215!\ndieadmin1/waldo1215!\ndnsadmin/waldo1215!\nDefaultAccounts/Security1215!\ndefaultes/1qaz2wsx#EDC\nThe certificate chain used in the majority of both MECHANICAL and GREASE samples is shown in Figure\n5.\nFigure 5: Certificate used to sign MECHANICAL/GREASE  While the threat actors did use a few tools to\nautomate intrusions, we also found a ZIP archive of tools that demonstrate their propensity for\npassword theft to propagate. Inside the archive we found the following tools:\nKPortScan – a GUI-based portscanner\nPsExec – a tool to remotely execute commands on Windows systems\nBatch files for enabling RDP and bypassing firewall rules\nProcdump – a tool to dump process memory, along with a batch file to dump the lsass process for\npassword extraction\nMimikatz – a tool to dump passwords and hashes\nThe Eternal suite of exploits, along with batch files for rapid scanning and exploitation\nNirsoft Mail PassView – a tool to dump saved mail passwords\nNirsoft Network Password Recovery – a tool to dump saved Windows password\nNirsoft Remote Desktop PassView – a tool to dump saved RDP passwords\nNirsoft SniffPass – a tool to sniff the network for passwords sent over insecure protocols\nNirsoft WebBrowserPassView – a tool to dump passwords stored in a variety of browsers\nClearly this toolset can be used to scavenge passwords stored in a wide array of locations. Using a\ncombination of stolen passwords, backdoor accounts, and a forced-open RDP service, the threat actors\nare likely to retain a foothold on a compromised system.\nRecommendations\nAdvise users not to click on any suspicious links in an e-mail, both at work and at home, even if\nthey are from people they trust.\nAdvise users to be wary of any prompts to install browser extensions, even if they are hosted on an\nofficial extension site.\nWatch for e-mails containing links to the phishing domains.\nLimit RDP access with a firewall to only those systems that require it. Monitor for suspicious RDP\nconnections where there should be none.\nLook for suspicious, newly created administrative accounts.\nConclusion\nWhile we were able to gain insight into the threat actor’s TTPs (Tools, Techniques, & Procedures)\nbehind STOLEN PENCIL, this is clearly just a small window into their activity. Their techniques are\nrelatively basic, and much of their toolset consists of off-the-shelf programs and living off the land. \nThis, along with the presence of the cryptojacker, is typical of DPRK tradecraft.  Additionally, the\noperators’ poor OPSEC exposes their Korean language, in both viewed websites and keyboard\nselections. They spent significant time and resources doing reconnaissance on their targets, as\nevidenced by the comments left on the Chrome extension page. Their main goal appears to be gaining\naccess to compromised accounts and systems via stolen credentials and holding on to it. We were not\nable to find any evidence of data theft – their motives for targeting academia remains murky.\nIOCs\nMECHANICAL hashes 9d1e11bb4ec34e82e09b4401cd37cf71 8b8a2b271ded23c40918f0a2c410571d\nGREASE hashes 2ec54216e79120ba9d6ed2640948ce43 6a127b94417e224a237c25d0155e95d6\nfd14c377bf19ed5603b761754c388d72 1d6ce0778cabecea9ac6b985435b268b\nab4a0b24f706e736af6052da540351d8 f082f689394ac71764bca90558b52c4e\necda8838823680a0dfc9295bdc2e31fa 1cdb3f1da5c45ac94257dbf306b53157\n2d8c16c1b00e565f3b99ff808287983e 5b32288e93c344ad5509e76967ce2b18\n4e0696d83fa1b0804f95b94fc7c5ec0b af84eb2462e0b47d9595c21cf0e623a5\n75dd30fd0c5cf23d4275576b43bbab2c 98de4176903c07b13dfa4849ec88686a\n09fabdc9aca558bb4ecf2219bb440d98 1bd173ee743b49cee0d5f89991fc7b91\ne5e8f74011167da1bf3247dae16ee605 0569606a0a57457872b54895cf642143\n52dbd041692e57790a4f976377adeade DOMAINS: bizsonet.ayar[.]biz bizsonet[.]com client-\nmessage[.]com client-screenfonts[.]com *.coreytrevathan[.]com  (possibly compromised legitimate\nsite) docsdriver[.]com grsvps[.]com *.gworldtech[.]com  (possibly compromised legitimate site)\nitservicedesk[.]org pqexport[.]com scaurri[.]com secozco[.]com sharedriver[.]pw sharedriver[.]us\ntempdomain8899[.]com world-paper[.]net zwfaxi[.]com IPs: 104.148.109[.]48 107.175.130[.]191\n132.148.240[.]198 134.73.90[.]114 172.81.132[.]211 173.248.170[.]149 5.196.169[.]223 74.208.247[.]127\n92.222.212[.]0  \nPOSTED IN\nAdvanced Persistent Threats , \nIndicators of Compromise , threat analysisSubscribe\nSign up now to receive the latest\nnotifications and updates from NETSCOUT's\nASERT.Home >ASERT Blog >STOLEN PENCIL Campaign Targets Academia\nwww.docsdriver[.]com\nRiskIQ discussed\n*EMAIL ADDRESS:\n*FIRST NAME:\n*LAST NAME:\n*COMPANY NAME:\nOpt-in to be contacted by NETSCOUT\nSystems. Inc. and its affiliates via email and\nphone with communications about our\nproducts and services. For more information\non how your data is used and stored, please\nreview our Privacy Policy .\nI AGREE\nSUBMIT\nSOLUTIONS\nPRODUCTS\nSUPPORT & SERVICES\nEDUCATION & EVENTS\nCOMPANY\nNEWS & MEDIA1-888-357-7667\nCONTACT US\nMYNETSCOUT\nCAREERS\nFOR INVESTORS\nPARTNERS\nBLOGTWITTER\nLINKEDIN\nINSTAGRAM\nFACEBOOK\nYOUTUBE\n TERMS & CONDITIONS  DATA PRIVACY AND TRUST CENTER  TRANSPARENCY IN SUPPLY CHAINS  PRIVACY POLICY  VENDOR PORTAL  \nCOOKIE PREFERENCES© 2020 NETSCOUT\nSOLUTIONS PRODUCTS SUPPORT & SERVICES EDUCATION & EVENTS COMPANY NEWS & MEDIA\n "
}