{
    "title": "super tuesday_ a patch tuesday we won_u2019t forget",
    "text": "Tools\nPlaybooks\nSpeaking Events\nAbout Us\nSuper Tuesday: A Patch Tuesday We Won’t Forget\n5,026\npeople reacted\n0\n3 min. read\nSometimes “Patch Tuesday” comes and goes with little excitement or fanfare; yesterday was not one of those\ndays. In just one day, Oracle released patches for 154 new vulnerabilities , Adobe issued updates for Flash  and\nColdFusion , and Microsoft released 24 patches  of their own. On top of the sheer volume of patches, we learned\nthat three of the Microsoft vulnerabilities were being exploited in targeted attack campaigns.\nSandworm\nThe first to drop was the Sandworm Campaign , a report from iSight partners, which described attacks on\nEuropean and American targets in the month of August using new versions of the BlackEnergy bot, but the group\nbehind the attacks has been operating since at least 2009. The biggest news here was the group’s exploitation of\na “new” vulnerability in Windows, CVE‐2014‐4114.  I’m putting “new” in quotes because the vulnerability was\ndiscussed at last‐month’s Virus Bulletin conference  by two researchers from ESET, but without a codename like\n“Sandworm” it did not garner very much attention.  CVE‐2014‐4114 exists because the Windows OLE system\nallows Office documents to download and execute files from remote resources (by design). Typically the\nexecution would only happen after the user accepts a prompt indicating they want to allow the action, but when\nthe file is a PowerPoint Show file (.pps or .ppsx) the execution occurs without any user interaction. Patches for\nthis vulnerability are available in MS14‐060 .\nThe result of the infection is installation of the BlackEnergy malware, which has been around since 2007 but has\nundergone some significant development, and was also detailed by the ESET researchers at VB last month.\n BlackEnergy’s command and control happens over HTTP, but many of the samples related to the Sandworm\ncampaign actually use encrypted HTTPS connections. This is yet another example of how malware uses\nencrypted channels to evade IPS systems and shines a spotlight on a good reason to consider enabling SSL\ndecryption  from unknown websites.\nThe iSight report included 10 IP addresses that have hosted Sandworm command and control servers. We dug\ninto our WildFire  system and found 24 executables from the last seven months that had contacted these servers.\nAll of these appear to be variants of the BlackEnergy bot that connect directly to one of the 10 IP addresses,\nrather than resolving domain names to locate their server’s IP.\nIn addition to CVE‐2014‐4114, iSight reported four additional vulnerabilities, which the Sandworm attackers have\nexploited in the past. Palo Alto Networks provides the following detection signatures for these vulnerabilities and\nfor the BlackEnergy malware.\nSignature Description Vulnerability\n36809 Windows OLE Remote Code Execution VulnerabilityCVE‐2014‐\n4114\n33566 Microsoft Office RTF Parsing Stack Buffer Overflow VulnerabilityCVE‐2010‐\n3333\n36193 Microsoft Windows MSCOMCTL OCX RCE Stack Buffer Overflow VulnerabilityCVE‐2012‐\n0158\n36192 Microsoft Windows MSCOMCTL OCX RCE Stack Buffer Overflow VulnerabilityCVE‐2012‐\n0158\n36160 Microsoft Windows MSCOMCTL OCX RCE Stack Buffer Overflow VulnerabilityCVE‐2012‐\n0158\n35835 Microsoft Windows MSCOMCTL OCX RCE Stack Buffer Overflow VulnerabilityCVE‐2012‐\n0158\n35506 Microsoft Windows MSCOMCTL OCX RCE Stack Buffer Overflow VulnerabilityCVE‐2012‐\n0158\n35069 Microsoft Windows MSCOMCTL OCX RCE Stack Buffer Overflow VulnerabilityCVE‐2012‐\n0158\n34896 Microsoft Windows MSCOMCTL OCX RCE Stack Buffer Overflow VulnerabilityCVE‐2012‐\n0158\n34766 Microsoft Windows MSCOMCTL OCX RCE Stack Buffer Overflow VulnerabilityCVE‐2012‐\n0158\n34753 Microsoft Windows MSCOMCTL OCX RCE Stack Buffer Overflow VulnerabilityCVE‐2012‐\n0158\n36208 Microsoft Word TIFF Image Integer Overflow VulnerabilityCVE‐2013‐\n3906\n36207 Microsoft Word TIFF Image Integer Overflow VulnerabilityCVE‐2013‐\n3906\n36415 Microsoft Word RTF File Potential Malformed FieldCVE‐2014‐\n1761\n36414 Microsoft Word RTF File Remote Code Execution VulnerabilityCVE‐2014‐\n1761\n36403 Microsoft Word RTF File Remote Code Execution VulnerabilityCVE‐2014‐\n1761\n13048 BlackEnergy.Gen Command and Control Traffic N/A\n12653 Bot: BlackEnergy Command and Control N/A\n13747 Bot: Win32.BlackEnergy.Botnet N/A\n \nCVE‐2014‐4113 and CVE‐2014‐4148\nWhile Sandworm received the most industry attention on Tuesday, two more vulnerabilities were disclosed with\nless detail. CVE‐2014‐4113 is a privilege escalation vulnerability, reported by both FireEye  and Crowdstrike .  In\nboth cases attackers have build the exploit into a Windows tool that allows them to execute other processes with\nSystem level access. Crowdstrike has attributed this tool to a Chinese cyber espionage group they have named\nHurricane Panda.\nLast but not least is CVE‐2014‐4148, which is likely the most dangerous of the bunch, and was reported by\nFireEye  after they noticed it used in a targeted attack using a Microsoft Office file against an “international\norganization.” This vulnerability exists in the True Type Font (TTF) subsystem located in the win32k.sys kernel‐\nmode driver. Exploitation of this vulnerability gives the attacker kernel‐mode access, which then allows attackers\nto bypass restrictions placed on non‐administrative users in most environments. Yesterday we released the\nfollowing signature to detect this vulnerability.\n \nSignature Description Vulnerability\n36787Microsoft Windows Kernel Mode Driver TrueType Font Parsing Remote Code\nExecution VulnerabilityCVE‐2014‐4148\n \n \nPatches are available for both of these vulnerabilities in MS14‐058  and we recommend everyone apply the patch\nto protect their systems. Thanks to Xin Ouyang and the entire Palo Alto Networks IPS team for making sure our\ncustomers are protected on this “Super” Patch Tuesday.\nGet updates from Palo Alto  Networks!\nSign up to receive the latest news, cyber threat intelligence and research from us\nBy Ryan Olson\nOctober 15, 2014 at 9:45 AM\nCategory: Threat Prevention , Unit 42\nTags: BlackEnergy , iSight , microsoft , Microsoft Security Bulletin , Patch Tuesday , Sandworm , vulnerability\nEmail address\nSubscribe\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\nBy submitting this form, you agree to our Terms of Use  and acknowledge\nour Privacy Statement .\n© 2020 Palo Alto Networks, Inc. All rights reserved.\nPopular Resources\nResource Center\nBlog\nCommunities\nTech Docs\nUnit 42\nSitemap\nLegal No ces\nPrivacy\nTerms of Use\nDocuments\nAccount\nManage Subscriptions\nReport a Vulnerability\nSearch Unit 42\nSHARE \n "
}