{
    "title": "Symantec_OrangeWorm",
    "text": "Questa è la copia cache di Google di https://symantec-blogs.broadcom.com/blogs/threat-intelligence/orangeworm-targets-healthcare-us-europe-asia.È un'istantanea della pagina visualizzata il 7 apr 202006:28:41 GMT.Nel frattempo la pagina corrente potrebbe essere stata modificata.Ulteriori informazioni.Versione completaVersione solo testoVisualizza sorgenteSuggerimento. Per trovare rapidamente il termine di ricerca su questa pagina, digita Ctrl+F o ⌘-F(Mac) e utilizza la barra di ricerca.BroadcomSymantec Enterprise BlogsMenuMain menuBlogs HomeThreat IntelligenceFeature StoriesExpert PerspectivesProduct InsightsSearchBroadcom HomeSymantec's Enterprise Security business will now operate as the SymantecEnterprise division of Broadcom. Click for details.Critical Attack Discovery and Intelligence TeamSymantecPosted: 23 Apr, 20184 Min ReadThreat IntelligenceSubscribeNew Orangeworm attack grouptargets the healthcare sector inthe U.S., Europe, and AsiaSymantec has identiﬁed a new attack groupdubbed Orangeworm deploying the Kwampirsbackdoor in a targeted attack campaignagainst the healthcare sector and relatedindustries.Symantec has identiﬁed a previously unknown group called Orangeworm thathas been observed installing a custom backdoor called Trojan.Kwampirswithin large international corporations that operate within the healthcaresector in the United States, Europe, and Asia.New Orangeworm attack group targets the heal... https://webcache.googleusercontent.com/searc...\n1 of 6 4/7/20, 10:17 AMFirst identiﬁed in January 2015, Orangeworm has also conducted targetedattacks against organizations in related industries as part of a larger supply-chain attack in order to reach their intended victims. Known victims includehealthcare providers, pharmaceuticals, IT solution providers for healthcareand equipment manufacturers that serve the healthcare industry, likely forthe purpose of corporate espionage.\"Orangeworm installs the Kwampirs custom backdoor in large ﬁrms in thehealthcare sector in the U.S., Europe & Asia. https://symc.ly/2K1oJjU\"Click to TweetSights set on healthcareBased on the list of known victims, Orangeworm does not select its targetsrandomly or conduct opportunistic hacking. Rather, the group appears tochoose its targets carefully and deliberately, conducting a good amount ofplanning before launching an attack.Figure 1. Nearly 40 percent of Orangeworm’s victims operate within thehealthcare industry Figure 1. Nearly 40 percent of Orangeworm’s victimsoperate within the healthcare industryAccording to Symantec telemetry, almost 40 percent of Orangeworm’sconﬁrmed victim organizations operate within the healthcare industry. TheKwampirs malware was found on machines which had software installed forthe use and control of high-tech imaging devices such as X-Ray and MRImachines. Additionally, Orangeworm was observed to have an interest inmachines used to assist patients in completing consent forms for requiredprocedures. The exact motives of the group are unclear.Figure 2. The biggest number of Orangeworm’s victims are located in theU.S.Figure 2. The biggest number of Orangeworm’s victims are located in theU.S.The biggest number of Orangeworm’s victims are located in the U.S.,accounting for 17 percent of the infection rate by region. While Orangewormhas impacted only a small set of victims in 2016 and 2017 according toSymantec telemetry, we have seen infections in multiple countries due to thenature of the victims operating large international corporations.The biggest number of Orangeworm’s victims are located in the U.S.,accounting for 17 percent of the infection rate by region.Healthcare providers caught in the crosshairsWe believe that these industries have also been targeted as part of a largersupply-chain attack in order for Orangeworm to get access to their intendedNew Orangeworm attack group targets the heal... https://webcache.googleusercontent.com/searc...\n2 of 6 4/7/20, 10:17 AMvictims related to healthcare. Orangeworm’s secondary targets includeManufacturing, Information Technology, Agriculture, and Logistics. Whilethese industries may appear to be unrelated, we found them to have multiplelinks to healthcare, such as large manufacturers that produce medicalimaging devices sold directly into healthcare ﬁrms, IT organizations thatprovide support services to medical clinics, and logistical organizations thatdeliver healthcare products.Post-compromise activitiesOnce Orangeworm has inﬁltrated a victim’s network, they deployTrojan.Kwampirs, a backdoor Trojan that provides the attackers with remoteaccess to the compromised computer.When executed, Kwampirs decrypts and extracts a copy of its main DLLpayload from its resource section. Before writing the payload to disk, itinserts a randomly generated string into the middle of the decrypted payloadin an attempt to evade hash-based detections.To ensure persistence, Kwampirs creates a service with the followingconﬁguration to ensure that the main payload is loaded into memory uponsystem reboot:The backdoor also collects some rudimentary information about thecompromised computer including some basic network adapter information,system version information, and language settings.Orangeworm likely uses this information to determine whether the system isused by a researcher or if the victim is a high-value target. OnceOrangeworm determines that a potential victim is of interest, it proceeds toaggressively copy the backdoor across open network shares to infect othercomputers.  It may copy itself to the following hidden ﬁle shares:ADMIN$C$WINDOWSD$WINDOWS E$WINDOWSInformation gatheringAt this point, the attackers proceed to gather as much additional informationabout the victim’s network as possible, including any information pertainingto recently accessed computers, network adapter information, availableNew Orangeworm attack group targets the heal... https://webcache.googleusercontent.com/searc...\n3 of 6 4/7/20, 10:17 AMnetwork shares, mapped drives, and ﬁles present on the compromisedcomputer.We have observed the attackers executing the following commands withinvictim environments:No concern about being discoveredKwampirs uses a fairly aggressive means to propagate itself once inside avictim's network by copying itself over network shares. While this method isconsidered somewhat old, it may still be viable for environments that runolder operating systems such as Windows XP . This method has likely provedeﬀective within the healthcare industry, which may run legacy systems onolder platforms designed for the medical community. Older systems likeWindows XP are much more likely to be prevalent within this industry.Additionally, once infected, the malware cycles through a large list ofcommand and control (C&C) servers embedded within the malware. Itappears while the list is extensive, not all of the C&Cs are active and continueto beacon until a successful connection is established. Despite modifying asmall part of itself while copying itself across the network as a means toevade detection, the operators have made no eﬀort to change the C&Ccommunication protocol since its ﬁrst inception.Both of these methods are considered particularly “noisy” and may indicatethat Orangeworm is not overly concerned with being discovered. The factthat little has changed with the internals of Kwampirs since its ﬁrst discoverymay also indicate that previous mitigation methods against the malware havebeen unsuccessful, and that the attackers have been able to reach theirintended targets despite defenders being aware of their presence within theirnetwork.Kwampirs uses a fairly aggressive means to propagate itself once inside avictim's network by copying itself over network shares.No hallmarks of a nation-state actorWhile Orangeworm is known to have been active for at least several years,we do not believe that the group bears any hallmarks of a state-sponsoredactor—it is likely the work of an individual or a small group of individuals.There are currently no technical or operational indicators to ascertain theorigin of the group.ProtectionSymantec customers are protected against Orangeworm and Symantec hasalso made eﬀorts to notify identiﬁed targets of its operations.New Orangeworm attack group targets the heal... https://webcache.googleusercontent.com/searc...\n4 of 6 4/7/20, 10:17 AMCustomers with Intelligence Services or WebFilter-enabled products areprotected against activity associated with the Orangeworm group. Theseproducts include:Web Security Service (WSS)ProxySGAdvanced Secure Gateway (ASG)Security AnalyticsContent AnalysisMalware AnalysisSSL VisibilityPacketShaperSymantec has the following speciﬁc detections in place for tools used byOrangeworm:Anti-virus (AV):Trojan.KwampirsIntrusion prevention system (IPS):System Infected: Trojan.Kwampirs ActivitySystem Infected: Trojan.Kwampirs Activity 2System Infected: Trojan.Kwampirs Activity 4Indicators of CompromiseFile AttachmentsIndicators of Compromise for OrangewormPDF556.65 KBAbout the AuthorCritical Attack Discovery and Intelligence TeamSymantecThe Critical Attack Discovery and Intelligence team is a group of securityexperts within Symantec whose mission is to investigate targeted attacks,drive enhanced protection in Symantec products, and oﬀer analysis that helpscustomers respond to attacks.Want to comment on this post?New Orangeworm attack group targets the heal... https://webcache.googleusercontent.com/searc...\n5 of 6 4/7/20, 10:17 AMWe encourage you to share your thoughts on your favorite social platform.Related Blog PostsPosted: 3 Apr, 20206 Min ReadCOVID-19 Outbreak Prompts Opportunistic Wave ofMalicious Email CampaignsPosted: 3 Apr, 20202 Min ReadMalicious Android Apps Exploit Coronavirus PanicPosted: 11 Mar, 202028 Min ReadMicrosoft Patch Tuesday – March 2020Posted: 12 Feb, 202024 Min ReadMicrosoft Patch Tuesday – February 2020BroadcomSymantec Enterprise Blogs SubscribePrivacy PolicyCookie PolicyData Processing and Data TransfersSupplier ResponsibilityTerms of UseSitemapCopyright © 2005-2020 Broadcom. All Rights Reserved. The term\"Broadcom\" refers to Broadcom Inc. and/or its subsidiaries.Get Symantec's Latest Blog Posts In YourInboxI accept the Terms of Use. Your privacy is important to us. Please see ourPrivacy Policy for more information.Subscribe SubmittedCloseNew Orangeworm attack group targets the heal... https://webcache.googleusercontent.com/searc...\n6 of 6 4/7/20, 10:17 AM"
}