{
    "title": "ta459_ group g0062 _ mitre att_ck®",
    "text": "JUST RELEASED: ATT&CK for Industrial Control Systems\nGROUPS\nOverview\nadmin@338\nAPT1\nAPT12\nAPT16\nAPT17\nAPT18\nAPT19\nAPT28\nAPT29\nAPT3\nAPT30\nAPT32\nAPT33\nAPT37\nAPT38\nAPT39\nAPT41\nAxiom\nBlackOasis\nBRONZE BUTLER\nCarbanak\nCharming Kitten\nCleaver\nCobalt Group\nCopyKittens\nDark Caracal\nDarkhotel\nDarkHydrus\nDeep Panda\nDragonfly\nDragonfly 2.0\nDragonOK\nDust Storm\nElderwood\nEquation\nFIN10\nFIN4\nFIN5\nFIN6\nFIN7\nFIN8\nGallmaker\nGamaredon Group\nGCMAN\nGorgon Group\nGroup5\nHoneybee\nKe3chang\nKimsuky\nLazarus Group\nLeafminer\nLeviathan\nLotus Blossom\nMachete\nMagic Hound\nmenuPass\nMoafee\nMolerats\nMuddyWater\nNaikon\nNEODYMIUM\nNight Dragon\nOilRig\nOrangeworm\nPatchwork\nPittyTiger\nPLATINUM\nPoseidon Group\nPROMETHIUM\nPutter Panda\nRancor\nRTM\nSandworm Team\nScarlet Mimic\nSilence\nSilverTerrier\nSoft Cell\nSowbug\nStealth Falcon\nStolen Pencil\nStrider\nSuckfly\nTA459\nTA505\nTaidoor\nTEMP.Veles\nThe White Company\nThreat Group-1314\nThreat Group-3390\nThrip\nTropic Trooper\nTurla\nWinnti Group\nWIRTEHome >Groups >TA459\nTA459\nTechniques Used\nDomain ID Name Use\nEnterprise T1203 Exploitation for Client Execution TA459  has exploited Microsoft Word vulnerability CVE-2017-0199 for execution.\nEnterprise T1086 PowerShell TA459  has used PowerShell for execution of a payload.\nEnterprise T1064 Scripting TA459  has a VBScript for execution.\nEnterprise T1193 Spearphishing Attachment TA459  has targeted victims using spearphishing emails with malicious Microsoft Word attachments.\nEnterprise T1204 User Execution TA459  has attempted to get victims to open malicious Microsoft Word attachment sent via spearphishing.\nSoftware\nID Name References Techniques\nS0032 gh0st RAT TA459  has\nused a Gh0st\nvariant known\nas\nPCrat/Gh0st.Command-Line Interface, Commonly Used Port, DLL Side-Loading, File Deletion, Indicator Removal on Host, Input Capture, New Service, Process Discovery, Registry Run\nKeys / Startup Folder, Remote File Copy, Rundll32, Screen Capture, Standard Cryptographic Protocol\nS0033 NetTraveler Application Window Discovery, Input Capture\nS0013 PlugX Command-Line Interface, Commonly Used Port, Custom Command and Control Protocol, Deobfuscate/Decode Files or Information, DLL Side-Loading, Execution through\nAPI, File and Directory Discovery, Input Capture, Masquerading, Modify Existing Service, Modify Registry, Multiband Communication, Network Share Discovery, New Service,\nProcess Discovery, Query Registry, Registry Run Keys / Startup Folder, Remote File Copy, Screen Capture, Standard Application Layer Protocol, Standard Non-Application\nLayer Protocol, System Network Connections Discovery, Trusted Developer Utilities, Virtualization/Sandbox Evasion, Web Service\nS0230 ZeroT Binary Padding, Bypass User Account Control, Data Obfuscation, Deobfuscate/Decode Files or Information, DLL Side-Loading, New Service, Obfuscated Files or\nInformation, Remote File Copy, Software Packing, Standard Application Layer Protocol, Standard Cryptographic Protocol, System Information Discovery, System Network\nConfiguration Discovery\nReferencesTA459  is a threat group believed to operate out of China that has targeted countries including Russia, Belarus, Mongolia, and others. [1]\nID: G0062\nContributors : Valerii Marchuk, Cybersecurity Help s.r.o.\nVersion : 1.0\nCreated: 18 April 2018\nLast Modified: 25 March 2019\nATT&CK  Navigator Layers  ®\n[1]\n[1]\n[1]\n[1]\n[1]\n[1]\n[1]\n[1]\n[1]\n1. Axel F. (2017, April 27). APT Targets Financial Analysts with CVE-2017-0199. Retrieved February 15,\n2018.\n© 2015-2020, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\nPrivacy Policy Terms of Use ATT&CK v6.3\n @MITREattack\nContact\nMatrices Groups Software Blog  Contribute Tactics  Techniques  Mitigations  Resources  \n "
}