{
    "title": "talos blog __ cisco talos intelligence group - comprehensive threat intelligence_ attack on critical infrastructure leverages template injection",
    "text": "Software\nReputation Center\nVulnerability Information\nMicrosoft Advisory Snort Rules  IP Blacklist Download\nAMP Naming Conventions\nTalos File Reputation\nAWBO Exercises  Library\nSupport Communities\nAbout\nCareers  Blog\nThreat Source Newsletter\nBeers with Talos PodcastCONNECT WITH US\n  \n© 2020  Cisco Systems, Inc. and/or its affiliates. All rights reserved. View our Privacy Policy  here. Subscribe via Email\nNEWER POST OLDER POST HOME\nSUBSCRIBE TO: POST COMMENTS (ATOM)FRIDAY, JULY 7, 2017\nSHARE THIS POSTContributors:  Sean Baird , Earl Carter , Erick Galinkin , Christopher Marczewski & Joe Marshall \nAttackers are continually trying to find new ways to target users with malware sent via email. Talos has\nidentified an email-based attack targeting the energy sector, including nuclear power, that puts a new spin on\nthe classic word document attachment phish. Typically, malicious Word documents that are sent as\nattachments to phishing emails will themselves contain a script or macro that executes malicious code. In this\ncase, there is no malicious code in the attachment itself. The attachment instead tries to download a template\nfile over an SMB connection so that the user's credentials can be silently harvested. In addition, this template\nfile could also potentially be used to download other malicious payloads to the victim's computer.\nSince at least May 2017, Talos has observed attackers targeting critical infrastructure and energy companies\naround the world, primarily in Europe and the United States. These attacks target both the critical infrastructure\nproviders, and the vendors those providers use to deliver critical services. Attacks on critical infrastructure are\nnot a new concern for security researchers, as adversaries are keen to understand critical infrastructure ICS\nnetworks for reasons unknown, but surely nefarious.\nOne objective of this most recent attack appears to be to harvest credentials of users who work within critical\ninfrastructure and manufacturing industries. Using a new twist on an old attack method, a clever adversary\nstole credentials from their victims by sending malicious word documents via email. These documents when\nopened, attempt to retrieve a template file from an attacker controlled external SMB server.\nIn the midst of recent attack trends and global campaigns, it has become easier to pass over simple\ntechniques that serve attackers' best interests for years. As Talos has recently observed, sometimes new\ntakes on reliable techniques can make them even more effective.\nWhile investigating a recently reported attack and pivoting on the data provided, we landed on several\ninteresting DOCX samples which were delivered as attachments in malicious spam emails. As shown below,\nthese documents often claimed to be environmental reports or resumés/CVs.\nApplying social engineering techniques to craft convincing documents to entice targets to open them is a\ntechnique frequently used by attackers. We have no evidence that these documents are anything other than\nmalicious. Additionally, we have no information to suggest that any entity mentioned in any of these documents\nhave themselves been subject to an attack as part of this campaign.\nOur first expectation was that we would find some malicious VBA macros or embedded scripting within the\nsample itself. Examination of the VBA code provided no such leads:\nWe confirmed this by running the sample against another similar tool:\nAgain, none of the usual indicators of an embedded binary that would contain such code appeared in our\nanalysis. The sample had been acquired from our sandbox by researching an IP address related to the attack,\nbut the server was no longer accepting such requests at the time of the sandbox run. While we investigated\nother leads, we set up an isolated environment with a server listening on TCP 80 to determine what the\ndocument was trying to obtain, if anything.\nAt the loading screen for Word, we noticed something interesting:\nThe document was trying to pull down a template file from a particular IP, but no connection over TCP 80 had\nyet reached our decoy server. Sure enough, our live capture showed a failed handshake over TCP 445 instead.\nIt was now time to manually parse the contents of the document for the IP address in question. Instead of\ncode, we found an instance of template injection:\nOur initial intelligence concerning the attack suggested that a malicious SMB server was being used to silently\nharvest user credentials. As conveyed in the sample, we can now see that an injected template was used to\nestablish such a connection to an external server over SMB. Still, this did not explain why the same sample had\nattempted a session over TCP 80. After further research, we determined that the sandbox VM had an\nestablished preference over SMB when it came to this connection type. In short, due to the network preference\nof the host, a WebDAV connection was attempted over an SMB session when requesting the template. This\nwas confirmed with another related sample when another external server was still listening on TCP 80 but no\nlonger serving the template.\nThe only entity left to move on from the template settings was the specific Relationship ID that was present in\nword/_rels/settings.xml.rels within the sample: rId1337. Researching this Relationship ID led us to the GitHub\npage of a phishing tool named Phishery  which happened to use the exact same ID in its template injection:\nSuprisingly, the same ID is found at the bottom of the aforementioned Go source:\nPhishery, however, does NOT rely on a malicious SMB server. Rather, the connection is handled over HTTPS,\nand the user credentials are harvested via Basic Authentication with a prompt for the credentials. Such a\nprompt was not needed nor seen for samples requesting the template over SMB. The fact that both this tool\nand the reported attack rely on template injection with the exact same Relationship ID suggests one of the\nfollowing:\n1. Mere coincidence (always a possibility);\n2. The attackers took notice of this tool and either modified it or developed their attack from scratch while\nsticking to the same concept used by the tool; or\n3. The attackers used the same Relationship ID to thwart analysis of the attack itself (remember: our first\ninclination was to follow-up on the failed connection attempts over TCP 80).\nAt this time, there is no evidence to confirm any of the three possibilities. However, the attackers' reliance on a\nsuccessful SMB session stemming from outbound traffic over TCP 445 further confirms that organizations are\nstill failing to properly block such egress traffic to public hosts. With no credential prompt needed for the SMB\nvariation, we can come to understand the simplicity and effectiveness of such a technique. If an attacker is\nable to compromise a host and run such a server internally, the situation becomes significantly more grave.\nFurthermore, since the attacker controlled SMB server was down when we analyzed these samples, it is not\npossible to determine the ultimate payloads (if any) that could have been dropped by the template being\ndownloaded. As we have seen with recent attacks, the intent of an attack is not always obvious. Forcing SMB\nrequests to an external server has been a known security vulnerability for many years. Without further\ninformation it is impossible to conclude what the true scope of this attack was or what malicious payloads\ncould have been involved.\nTalos responded to these attacks by reaching out to known affected customers and ensuring that they were\naware of and capable of responding to the threat. It also illustrates the importance of controlling your network\ntraffic and not allowing outbound protocols such as SMB except where specifically required for your\nenvironment. Additionally, a number of ClamAV signatures and email rules were written in order to ensure that\nthreats leveraging this Office template injection technique are blocked in the future.\nClamAV signatures created to identify this attack:\nDoc.Tool.Phishery-6331699-0\nDoc.Downloader.TemplateInjection-6332119-0\nDoc.Downloader.TemplateInjection-6332123-0\nAdditional ways our customers can detect and block this threat are listed below.\nAdvanced Malware Protection ( AMP ) blocks the malicious\nword documents used by these threat actors.\nCWS , WSA , and  Umbrella  can help identify outbound\nconnections used by these threat actors.\nEmail Security  can block malicious emails sent by threat\nactors as part of their campaign. \nAMP Threat Grid  helps identify malicious binaries and builds\nprotection into all Cisco Security products.\nDue to the nature in which we obtained intelligence related to these attacks, we are unable to share all of the\nIOCs related to this event; however, we wanted to share as much as possible in the spirit of transparency and\ncollaboration.\nMalicious Documents\nFilename: Report03-23-2017.docx\nSHA256: 93cd6696e150caf6106e6066b58107372dcf43377bf4420c848007c10ff80bc9\nFilename: Controls Engineer.docx\nSHA256: (1) b02508baf8567e62f3c0fd14833c82fb24e8ba4f0dc84aeb7690d9ea83385baa\n                (2) 3d6eadf0f0b3fb7f996e6eb3d540945c2d736822df1a37dcd0e25371fa2d75a0\n                (3) ac6c1df3895af63b864bb33bf30cb31059e247443ddb8f23517849362ec94f08\nRelated IP Addresses\n184[.]154[.]150[.]66\n5[.]153[.]58[.]45\n62[.]8[.]193[.]206\nPOSTED BY EARL CARTER  AT 4:34 PM  \nLABELS: SMB MALWARE ENERGY\n   Attack on Critical Infrastructure Leverages Template Injection\nEXECUTIVE SUMMARY\nBACKGROUND\nTECHNICAL INVESTIGATION\nSample email containing a malicious document\nOne DOCX sample used during this attack\nAnother DOCX sample used during this attack\nAnalysis of the document using oletools\nFurther analysis of the DOCX\nWord attempting to load a template\nInstance of template injection found in the document\nSandbox PCAP of the sample\nGitHub page of the Phishery tool\n\"rId1337\" found in the Phishery tool, line 105.\nCONCLUSION\nCOVERAGE\nIOCS\nEnter your comment...\nComment as:  \nGoogle Account\nPublishPublish \nPreviewPreview1 COMMENT:\nUNKNOWN JULY 10, 2017 AT 2:14 PM\nHi, I've been researching similar SMB exploits. The http traffic is likely due to the WEBDAV system\nattempting to fetch metadata. This occurs when UNC paths are loaded.\nReply\nPOST A COMMENT\nSearch Blog\nSUBSCRIBE TO OUR FEED\n Posts\n Comments\n►  2020 (62)\n►  2019 (277)\n►  2018 (198)\n▼  2017 (171)\n►  DECEMBER (9)\n►  NOVEMBER (11)\n►  OCTOBER (15)\n►  SEPTEMBER (17)\n►  AUGUST (16)\n▼  JULY (14)\nVulnerability Spotlight: FreeRDP Multiple\nVulnerab...\nThreat Round-up for July 14 - July 21\nVulnerability Spotlight: Multiple\nVulnerabilities ...\nVulnerabilities in ProcessMaker,\nWebFOCUS, and Ope...\nUnravelling .NET with the Help of\nWinDBG\nPyREBox, a Python Scriptable Reverse\nEngineering S...\nMemcached - A Story of Failed Patching &\nVulnerabl...\nMicrosoft Patch Tuesday - July 2017\nVulnerability Spotlight: Iceni Infix PDF\nEditor Me...\nAttack on Critical Infrastructure Leverages\nTempla...\nThreat Round-up for June 30 - July 07\nVulnerability Spotlight: TALOS-2017-\n0311,0319,0321...\nNew KONNI Campaign References North\nKorean Missile...\nThe MeDoc Connection\n►  JUNE (14)\n►  MAY (19)\n►  APRIL (17)\n►  MARCH (17)\n►  FEBRUARY (12)\n►  JANUARY (10)\n►  2016 (98)\n►  2015 (62)\n►  2014 (67)\n►  2013 (30)\n►  2012 (53)\n►  2011 (23)\n►  2010 (93)\n►  2009 (146)\n►  2008 (37)BLOG ARCHIVE\nRECOMMENDED BLOGS\nCISCO BLOG\nGlobal problem solving through STEM: What\nCisco’s nonprofit partners are doing to\nsupport learning at home\nSNORT BLOG\nSnort rule update for March 10, 2020 —\nMicrosoft Patch Tuesday\nCLAMAV® BLOG\nClamAV Bugzilla Upgrade Software  Vulnerability  Information  Reputation  Center  Library  Support  Careers  Blog  Podcasts  About\n "
}