{
    "title": "teamviewer confirms undisclosed breach from 2016",
    "text": "TeamViewer Confirms Undisclosed Breach\nFrom 2016\nTeamViewer confirmed today that it has been the victim of a cyber attack\nwhich was discovered during the autumn of 2016, but was never\ndisclosed. This attack is thought to be of Chinese origins and utilized the\nWinnti backdoor.\nThe company behind the highly popular TeamViewer remote desktop\nsoftware told German publisher Der Spiegel that the attack was\ndiscovered before the threat group was capable of doing any damage,\nwith experts and investigators failing to find any evidence of data being\nstolen during the security incident.\nAlso, no evidence was found that the hackers were able to compromise or\nsteal source code even though they had access to it, according to\nTeamViewer .468TeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n1 of 13 19-Mar-20, 16:19\nBackdoors which might have been planted during the 2016 attack have\nalso been removed after a data center overhaul and all systems\n\"completely checked, cleaned up and repositioned\" at the end of 2016\naccording to the Der Spiegel report.\nWhen asked by BleepingComputer about when and how the breach was\ndiscovered, TeamViewer said they detected the attack before any major\ndamage was done.\n\"Like many technology leaders, TeamViewer is frequently confronted\nwith attacks by cybercriminals. For this reason, we continuously\ninvest in the advancement of our IT security and cooperate closely\nwith globally renowned experts and institutions in this field.\nIn autumn 2016, TeamViewer was target of a cyber-attack.  Our\nsystems detected the suspicious activities in time to prevent any\nmajor damage.  An expert team of internal and external cyber\nsecurity researchers, working together closely with the responsible\nauthorities, successfully fended off the attack.\"\nSeeing that the hackers were not able to steal any data during the attack,\nTeamViewer decided not to publish a security breach notification to\ninform the users of the incident.\nRegarding the reasons behind the decision to not disclose the breach, a\nTeamViewer spokesperson further told BleepingComputer that based on\nconsultation with relevant authorities and advisors, it was decided that it\nwas not necessary to disclose the attack.\nREAD MORE Breach\nTOP ARTICLES 1/5\nMost Ransomware Gets Executed Three Days After InitialTeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n2 of 13 19-Mar-20, 16:19\nIndependent experts conducted a thorough investigation using all IT\nforensic resources available and found no evidence that the security\nof our users or their IT systems was affected in any way.\nTogether with the relevant authorities and our security advisors, we\ncame to the joint conclusion that informing our users was not\nnecessary and would have been counterproductive to the effective\nprosecution of the attackers. Against this backdrop, we decided not\nto disclose the incident publicly in the interest of the global\nfight against cybercrime and thus also in the interest of our users.\nAttackers have also used the Winnti malware against ThyssenKrupp in\n2016 and Bayer in 2018, with ThyssenKrupp CERT investigators\nmonitoring their activity and discovering that the hackers were only\ninterested in stealing technical trade secrets.\nIn the case of the attack against the largest drugmaker from Germany,\ninvestigators from the DCSO cybersecurity group — set up by Bayer with\nhelp from Allianz, BASF and Volkswagen — were also able to keep an eye\non the group's activity since the initial infiltration in early-2018 until\nMarch 2019 and also concluded that the hackers were not able to steal\nany data.\nService outage due to DoS attack during the\nsummer of 2016\nOn June 1, 2016, TeamViewer issued a press release acknowledging\na service outage caused by a denial-of-service attack (DoS) which targeted\nthe TeamViewer DNS server infrastructure. \nThis statement followed multiple user reports claiming that attackers\ntook control of their computers using TeamViewer and using their PayPal\naccounts to either make online purchases or steal money — a list was also\ncreated to track all the reported incidents.TeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n3 of 13 19-Mar-20, 16:19Some of the victims also claimed that the attackers successfully\ncompromised their TeamViewer accounts even though they used unique\nvery long passwords or had Two-Factor Authentication enabled, leading\nthem to believe that TeamViewer's computing systems were hacked [1, 2,\n3].\nHowever, in their press release, TeamViewer blamed the account hacks\nreported by its users on \"Careless use of account credentials remains to\nbe a key problem for all internet services. This particularly includes the\nuse of the same password across multiple user accounts with various\ninternet services.\"\nTeamViewer also mentioned the possibility of some users having\nunintentionally downloaded and installed programs infected with\nmalware which could have allowed attackers to \"virtually do anything\nwith that particular system – depending on how intricate the malware is,\nit can capture the entire system, seize or manipulate information, and so\nforth.\"\nAfter the user uproar caused by the \"careless\" word used in the June 1\npress release, Teamviewer apologized for using the word through public\nrelation manager, Axel Schmidt.\nTeamViewer also stated that the hacks reported by users might have had\nsomething to do with the Backdoor. TeamViewer malware besides the\ninitial mention of stolen password credentials.\nWhen asked if there is any connection between the account hacks\nreported in 2016 and the just disclosed breach, TeamViewer told\nBleepingComputer that there is no connection.\nNo. The cyber-attack on TeamViewer is in no way connected to this.\nThe corresponding reports are presumably related to a theft of large\namounts of data from popular internet services (e.g.  LinkedIn) in the\nsame year.  If affected users had been using identical passwords forTeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n4 of 13 19-Mar-20, 16:19third-party services, such as TeamViewer, it was possible for\nattackers to abuse them for unauthorized access attempts.\nTeamViewer generally recommends using unique passwords for different\nservices and setting up a two-factor authentication to effectively prevent\nthis kind of attack.\nThe Winnti Umbrella\nWhile there is no attribution for the hacking group behind the 2016\nattack TeamViewer just confirmed, multiple hacking groups collectively\nknown by experts as the Winnti Umbrella according to ProtectWise 401\nTRG, have been using the Winnti malware during their attacks.\nThe groups come under various names (i.e.,Winnti Group, PassCV,\nAPT17, Axiom, LEAD, BARIUM, Wicked Panda, and GREF) but\nWinnti Group is the first known to have used the Winnti backdoor during\ntheir campaigns.\nAs Kaspersky's GReAT full report on the Winnti Group from 2013 says,\n\"The main objective of the group is to steal source code of online game\nprojects as well as digital certificates of legitimate software vendors.\"\nBARIUM, another Winnti Umbrella threat group, which mainly targets\nsoftware and gaming companies [1, 2] and is still active as shown by its\ninvolvement in Operation ShadowHammer could be the most probable\ncandidate for this attack.\nKaspersky also found evidence that connected the methods and tools\nused as part of Operation ShadowHammer with the ones employed in the\nsupply chain attacks against CCleaner and NetSarang from 2017, with the\nthreat actor behind the latter already having been identified as\nBARIUM by ESET, Microsoft, and other security researchers.\nChinese Hackers Use New Malware to Backdoor Microsoft SQL Servers\nWinnti Group Uses New PortReuse Malware Against Asian Manufacturer\nChinese Cyberspies Appear to be Preparing Supply-Chain Attacks\nVirgin Media Data Breach Exposes Info of 900,000 Customers\nCarnival Cruise Line Operator Discloses Potential Data BreachTeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n5 of 13 19-Mar-20, 16:19Not a member yet? Register NowTeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n6 of 13 19-Mar-20, 16:19Full technical\ndocumentation\nAd CloudockitTeamViewer\nApologizes but still\nsay they were not\nCompromised\nbleepingcomputer.comRansomware\nRecovery Experts\nAd Fast Data RecoveryHere's a List of 29\nDifferent Types of\nUSB Attacks\nbleepingcomputer.com\nHardware Security\nModules\nAd futurex.comChinese Cyberspies\nAppear to be\nPreparing Supply-\nChain Attacks\nbleepingcomputer.comFinding & Enabling\nHidden Features in\nWindows 10 Using\nMach2\nbleepingcomputer.comEquifax Confirms\nHackers Used Apache\nStruts Vulnerability to\nBreach Its Servers\nbleepingcomputer.comTeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n7 of 13 19-Mar-20, 16:19Ransomware Gangs to\nStop Attacking Health\nOrgs During Pandemic\nMicrosoft Scales Back\nOffice 365 Features to\nHandle High LoadsTeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n8 of 13 19-Mar-20, 16:19To receive periodic\nupdates and news\nfrom\nBleepingComputer,\nplease use the form\nbelow.TeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n9 of 13 19-Mar-20, 16:19\nTeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n10 of 13 19-Mar-20, 16:19TeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n11 of 13 19-Mar-20, 16:19TeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n12 of 13 19-Mar-20, 16:19\nTeamViewer Confirms Undisclosed Breach From 2016 https://www.bleepingcomputer.com/news/security/teamviewer-confirms...\n13 of 13 19-Mar-20, 16:19"
}