{
    "title": "the leafminer cyber espionage group targets middle eastsecurity affairs",
    "text": "UK printing company Doxzoo exposed US and UK military docs   MUST READ\nCopyright 2015 Security Affairs by Pierluigi Paganini All Right Reserved. Back to top \nSponsored Content\nDigging the Deep Web: Exploring the dark side of the\nweb\nYoroi Blog\nYoroi Blog\nSponsored Content\nSponsored Content\nSponsored Content\nSponsored ContentLeafminer cyber espionage group targets Middle East\nJuly 27, 2018  By Pierluigi Paganini\nSHARE ON             \nPierluigi Paganini\nPierluigi Paganini is member of the ENISA (European Union Agency for Network\nand Information Security) Threat Landscape Stakeholder Group and Cyber G7\nGroup, he is also a Security Evangelist, Security Analyst and Freelance Writer.\nEditor-in-Chief at \"Cyber Defense Magazine\", Pierluigi is a cyber security expert\nwith over 20 years experience in the field, he is Certified Ethical Hacker at EC\nCouncil in London. The passion for writing and a strong belief that security is\nfounded on sharing and awareness led Pierluigi to find the security blog\n\"Security Affairs\" recently named a Top National Security Resource for US.\nPierluigi is a member of the \"The Hacker News\" team and he is a writer for some\nmajor publications in the field such as Cyber War Zone, ICTTF, Infosec Island,\nInfosec Institute, The Hacker News Magazine and for many other Security\nmagazines. Author of the Books \"The Deep Dark Web\" and “Digital Virtual\nCurrency and Bitcoin”.\nUK printing company Doxzoo\nexposed US and UK military docs\nMarch 20, 2020  By Pierluigi PaganiniRussia-linked APT28 has been\nscanning vulnerable email servers in\nthe last year\nMarch 20, 2020  By Pierluigi PaganiniHackers belonging an Iran-linked APT group tracked\nas ‘Leafminer’ have targeted government and various\norganizations in the Middle East.\nAn Iran-linked APT group tracked as ‘Leafminer’ has targeted government and businesses in the\nMiddle.\nAccording to the experts from Symantec, the Leafminer group has been active at least since early\n2017.\n“Symantec has uncovered the operations of a threat actor named Leafminer that is targeting a broad list of\ngovernment organizations and business verticals in various regions in the Middle East since at least early 2017. ”\nreads the analysis  published by Symantec.\nThe experts detected malicious code and hacking tools associated with the cyber espionage group on\n44 systems in Saudi Arabia, Lebanon, Israel, Kuwait and other countries.\nThe extent of the campaigns conducted by the group could be wider, the researchers uncovered a list,\nwritten in Iran’s Farsi language, of 809 targets whose systems were scanned by the attackers.\nThe list groups each entry with organization of interest by geography and industry, in includes\ntargets in the United Arab Emirates, Qatar, Bahrain, Egypt, and Afghanistan.\nMost of the targets were in the financial, government and energy sectors.\nThe hackers used publicly available tools and custom-malware in their attacks.\n“On a broad level, it has followed the recent trend among targeted attack groups for “ living off the land ”—using a\nmixture of publicly available tools alongside its own custom malware.” continues the report.\n“More specifically, it mimicked Dragonfly’s use of a watering hole to harvest network credentials. It also\ncapitalized on the Shadow Brokers release of Inception Framework  tools, making use of the leaked Fuzzbunch\nframework by developing its own exploit payloads for it.”\nResearchers discovered that hackers used three main techniques for initial intrusion of target\nnetworks:\nCompromised web servers used for watering hole attacks\nScans/exploits for vulnerabilities of network services\nDictionary attacks against logins of network services\nWhile analyzing the attacks conducted by the group, the experts discovered a download URL for a\nmalware payload used to compromise the victims. The URL pointed out to a compromised web server\non the domain e-qht[.]az that had been used to distribute Leafminer malware, payloads, and tools\nwithin the group and make them available for download from victim machines.\n“As of early June 2018, the server hosted 112 files in a subdirectory that could be accessed through a public web\nshell planted by the attackers. In addition to malware and tools, the served files also included uploads of log files\nseemingly originating from vulnerability scans and post-compromise tools.” continues the report.\n“The web shell is a modification of the PhpSpy backdoor and references the author MagicCoder while linking to\nthe (deleted) domain magiccoder.ir. Researching the hacker handle MagicCoder results in references to the Iranian\nhacking forum Ashiyane as well as defacements by the Iranian hacker group Sun Army.”\nSymantec discovered two custom malware used by the Leafminer group, tracked\nas Trojan.Imecab  and Backdoor.Sorgu , the former provides persistent access with a hardcoded\npassword, the latter implements classic backdoor features.\nThe group also leveraged a modified version of the popular Mimikatz post-exploitation tool. To avoid\ndetection, the group used a technique dubbed Process Doppelgänging , discovered in December 2017\nby researchers from Ensilo security firm.\nThe technique is a fileless code injection method that exploits a built-in Windows function and an\nundocumented implementation of the Windows process loader.\n“However, Leafminer’s eagerness to learn from others suggests some inexperience on the part of the attackers, a\nconclusion that’s supported by the group’s poor operational security. It made a major blunder in leaving a staging\nserver publicly accessible, exposing the group’s entire arsenal of tools,” concludes Symantec.\nPierluigi Paganini\n(Securi ty Affairs  – Leafminer, hacking )\n cyber espionage Hacking Iran Leafminer Pierluigi Paganini Security Affairs\nYOU MIGHT ALSO LIKEShare this...\nPREVIOUS ARTICLE\nUS-CERT warns of ongoing cyber attacks\naimed at ERP applications\n NEXT ARTICLE\nDutch brothers sentenced to community\nservice for involvement in CoinVault\nransomware distributionHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  \nTerrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact meHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  Terrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\nAlways Enabled Necessary \n "
}