{
    "title": "the siesta campaign_ a new targeted attack awakens - trendlabs security intelligence blog",
    "text": "Trend Micro About TrendLabs Security Intelligence Blog\nHome    »   Malware    »   The Siesta Campaign: A New Targeted Attack Awakens\nSecurity Predictions for 2020\nCybersecurity in 2020 will be viewed\nthrough many lenses — from differing\nattacker motivations and cybercriminal\narsenal to technological developments\nand global threat intelligence — only so\ndefenders can keep up with the broad\nrange of threats.\nRead our security predictions for 2020.\nBusiness Process Compromise\nAttackers are starting to invest in long-\nterm operations that target specific\nprocesses enterprises rely on. They\nscout for vulnerable practices,\nsusceptible systems and operational\nloopholes that they can leverage or\nabuse. To learn more, read our Security 101:\nBusiness Process Compromise.\nRecent Posts\nOpenSMTPD Vulnerability (CVE-2020-8794) Can\nLead to Root Privilege Escalation and Remote\nCode Execution\nOperation Overtrap Targets Japanese Online\nBanking Users Via Bottle Exploit Kit and Brand-\nNew Cinobi Banking Trojan\nMarch Patch Tuesday: LNK, Microsoft Word\nVulnerabilities Get Fixes, SMBv3 Patch Follows\nBusting Ghostcat: An Analysis of the Apache\nTomcat Vulnerability (CVE-2020-1938 and CNVD-\n2020-10487)\nDissecting Geost: Exposing the Anatomy of the\nAndroid Trojan Targeting Russian Banks\nPopular Posts\nLokiBot Impersonates Popular Game Launcher\nand Drops Compiled C# Code File\nMisconfigured Container Abused to Deliver\nCryptocurrency-mining Malware\nDissecting Geost: Exposing the Anatomy of the\nAndroid Trojan Targeting Russian Banks\nOutlaw Updates Kit to Kill Older Miner Versions,\nTargets More Systems\nFebruary Patch Tuesday: Fixes for Critical LNK,\nRDP, Trident Vulnerabilities\nStay Updated\nEmail Subscription\nYour email here\nSubscribe\nPrivacy Statement Legal Policies Copyright © 2020 Trend Micro Incorporated. All rights reserved.HOME AND HOME OFFICE  | FOR BUSINESS  | SECURITY INTELLIGENCE  | ABOUT TREND MICRO\nAsia Pacific Region (APAC): Australia  / New Zealand , 中国, 日本, 대한민국 , 台灣 Latin America Region (LAR): Brasil , México  North America Region (NABU): United States , Canada  \nEurope, Middle East, & Africa Region (EMEA): France , Deutschland / Österreich / Schweiz , Italia, Россия , España , United Kingdom / IrelandThe Siesta Campaign: A New Targeted Attack Awakens\nPosted on: March 6, 2014  at 3:11 pm Posted in: Malware , Targeted Attacks\nAuthor:  Maharlito Aquino (Threat Research)\nTags: Malware siesta targeted attacksIn the past few weeks, we have received several reports of targeted attacks that exploited various\napplication vulnerabilities to infiltrate various organizations. Similar to the Safe Campaign , the\ncampaigns we noted went seemingly unnoticed and under the radar. The attackers orchestrating\nthe campaign we call the Siesta Campaign used multicomponent malware to target certain\ninstitutions that fall under the following industries:\nConsumer goods and services\nEnergy\nFinance\nHealthcare\nMedia and telecommunications\nPublic administration\nSecurity and defense\nTransport and traffic\nThreat actors don’t always rely on complex attack vectors to infiltrate an organization’s network.\nAttackers can also make use of basic social engineering techniques for their victims to take the\nbait, such as in our case study below.\nThe Siesta Campaign: A Case Study\nWe are currently investigating an incident that involved attackers sending out spear-phishing\nemails addressed to executives of an undisclosed company. These emails were sent from spoofed\nemail addresses of personnel within the organization. Instead of using attachments and document\nexploits, this specific campaign served their malware through a legitimate-looking file download\nlink.\nTo lure the target into downloading the file, the attacker serves the archive under a URL path\nnamed after the target organization’s name as cited below:\nhttp://{malicious domain}/{organization name}/{legitimate archive name}.zip\nThis archive contains an executable (TROJ_SLOTH) disguised as a PDF document. When\nexecuted, it drops and opens a valid PDF file, which was most probably taken from the target\norganization’s website.\nAlong with this valid PDF file, another malicious component is also dropped and executed in the\nbackground.\nThis backdoor component is named google{BLOCKED}.exe . (Due to the ongoing investigation, we\nare unfortunately unable to share hashes and filenames at this time.) This backdoor connects to\nhttp://www.micro{BLOCKED}. com/index.html , which are its command-and-control (C&C) servers.\nTrend Micro identifies these samples as BKDR_SLOTH.B.\nAt this point, the malware begins waiting for additional commands from the attacker. The encrypted\ncommands that are accepted are:\nSleep:\nCommands the backdoor to sleep for specified number of minutes\nWe have received a sleep command of “sleep:120” during our analysis which means that\nthe malware will wait for 2hrs before establishing a connection again to the C&C server\nDownload: <download_url>\nCommands the backdoor to download and execute a file (most probably another Win32\nexecutable) from a specified URL\nThe C&C servers used in this campaign are found to be newly registered and also short-lived,\nmaking it difficult for us to track the malware’s behavior.\nBased on our research, we found 2 variants of the malware used in this campaign. Although not\nexactly alike, the behaviors are nearly identical.\nOne of the similar samples is a file named Questionaire Concerning the Spread of Superbugs\nFebruary 2014.exe  (SHA1: 014542eafb792b98196954373b3fd13e60cb94fe). This sample drops\nthe file UIODsevr.exe , its backdoor component which behaves similarly as BKDR_SLOTH.B with\nthe addition of communicating to its C&C at skys{BLOCKED}com . These samples are identified by\nTrend Micro as BKDR_SLOTH.A .\nBoth variants excessively use Sleep  calls, which renders the malware dormant for varying periods\nof time, hence the campaign name “ Siesta”  (which means to take a short nap in Spanish).\nCommands are being served through HTML pages using different keywords as listed below:\nVariant 1\nprefix: “>SC<”\nVariant 2\nprefix: “longDesc=”\nsuffix: “.txt”\nListed below are the backdoor commands we were able to see from our analysis:\nVariant 1\n“run1” – open a remote shell\n“run2” – pipe shell commands from URL1\n“run3” – pipe shell commands from URL2\n“http” – pipe shell commands from C2\n“x_” – sleep for specified number of minutes\nVariant 2\n“sleep:” – sleep for specified number of minutes\n“download:” – download and execute another executable from C2\nAttribution\nAttribution of campaigns and attack methods can often be difficult. We were able to identify this\nnew campaign through inspecting hashes, C&Cs, registrants, commands, and additional\ninformation.\nFigure 1. Attribution Graph (click the thumbnail for full view)\nDuring the course of our investigation into this new campaign, we investigated the malware\ndropped. We quickly noticed the registrant of sky{BLOCKED}.com  is also the same registrant as\nmicro{BLOCKED}.com  and ifued{BLOCKED}.net . This individual used the name Li Ning and others\nwith an email address of xiaomao{BLOCKED}@163.com . This individual also recently registered\n79 additional domains. There are a total of roughly 17,000 domains registered with this same\nemail address.\nFigure 2.  Domains registered under the name Li Ning, based on Whois data\nConclusion\nEarly detection is crucial in preventing targeted attacks from exfiltrating confidential company data.\nOrganizations and large enterprises need an advanced threat protection platform like Trend\nMicro™ Deep Discovery, which can mitigate the risks posed by targeted attacks through its various\nsecurity technologies and global threat intelligence. At the heart of our Custom Defense solution is\nDeep Discovery which provides real-time local and global intelligence across the attack life cycle.\nThis can help IT administrators understand the nature of the attack they are dealing with.\nTrend Micro blocks all related threats, emails and URLs associated with these attacks. As always,\nwe advise users to exercise caution when opening emails and links. For more details on various\ntargeted attacks, as well as best practices for enterprises, you may visit our Threat Intelligence\nResources on Targeted Attacks .\nWith additional insights and analysis from Kervin Alintanahin, Dove Chiu, and Kyle Wilhoit.\nLearn how to protect Enterprises, Small Businesses, and Home Users from ransomware:\nENTERPRISE SMALL BUSINESS HOME\n\n» » »\nHome Categories\nSearch:\n "
}