{
    "title": "the miniduke mystery_ pdf 0-day government spy assembler 0x29a micro backdoor _ securelist",
    "text": "(or, how many cool words can you fit into one title)\nOn Feb 12th 2013, FireEye announced  the discovery of an Adobe Reader 0-day exploit which is used to drop a previously\nunknown, advanced piece of malware. We called this new malware ?ItaDuke because it reminded us of Duqu and because\nof the ancient Italian comments in the shellcode copied from Dante Alighieri-s ?Divine Comedy.\nSince the original announcement, we have observed several new attacks  using the same exploit (CVE-2013-0640) which\ndrop other malware. Between these, we’ve observed a couple of incidents which are so unusual in many ways that we-ve\ndecided to analyse them in depth.\nTogether with our partner CrySyS Lab, we-ve performed a detailed analysis of these unusual incidents which suggest a new,\npreviously unknown threat actor. For the CrySyS Lab analysis, please read [here] . For our analysis, please read below.\nKey findings include:\n• The MiniDuke attackers are still active at this time  and have created malware as recently as February 20, 2013. To\ncompromise the victims, the attackers used extremely effective social engineering techniques which involved sending\nmalicious PDF documents to their targets. The PDFs were highly relevant and well-crafted content that fabricated human\nrights seminar information (ASEM) and Ukraine-s foreign policy and NATO membership plans.\nThese malicious PDF files were rigged with exploits attacking Adobe Reader versions 9, 10 and 11, bypassing its sandbox.\n• Once the system is exploited, a very small downloader is dropped onto the victim-s disc that-s only 20KB in size. This\ndownloader is unique per system and contains a customized backdoor written in Assembler . When loaded at system boot,\nthe downloader uses a set of mathematical calculations to determine the computer-s unique fingerprint, and in turn uses\nthis data to uniquely encrypt its communications later.\n• If the target system meets the pre-defined requirements, the malware will use Twitter (unbeknownst to the user) and\nstart looking for specific tweets from pre-made accounts . These accounts were created by MiniDuke-s Command and\nControl (C2) operators and the tweets maintain specific tags labeling encrypted URLs for the backdoors.\nThese URLs provide access to the C2s, which then provide potential commands and encrypted transfers of additional\nbackdoors onto the system via GIF files .\n• Based on the analysis, it appears that the MiniDuke-s creators provide a dynamic backup system that also can fly under the\nradar – if Twitter isn-t working or the accounts are down, the malware can use Google Search to find the encrypted strings\nto the next C2 . This model is flexible and enables the operators to constantly change how their backdoors retrieve further\ncommands or malcode as needed.\n• Once the infected system locates the C2, it receives encrypted backdoors that are obfuscated within GIF files  and\ndisguised as pictures that appear on a victim-s machine.\nIN THE SAME CATEGORY\nChafer used Remexi malware to spy on\nIran-based foreign diplomatic entities\nGreyEnergy’s overlap with Zebrocy\nA Zebrocy Go Downloader\nAPT review of the year\nDarkPulsar FAQ\nAPT REPORTS\nThe MiniDuke Mystery: PDF 0-day\nGovernment Spy Assembler 0x29A\nMicro Backdoor\nBy GReAT  on February 27, 2013. 6:00 pm\nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\n English\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPRCompanyAccount GET IN TOUCHSolutions for: Home Products  Small Business 1-50 employees Medium Business 51-999 employees Enterprise 1000+ employees\n Share post on:\nTHERE IS 1 COMMENT\nOnce they are downloaded to the machine, they can fetch a larger backdoor which carries out the cyberespionage\nactivities, through functions such as copy file, move file, remove file, make directory, kill process and of course, download\nand execute new malware and lateral movement tools.\n• The final stage backdoor connects to two servers, one in Panama and one in Turkey  to receive the instructions from the\nattackers.\n• The attackers left a small clue in the code, in the form of the number 666  (0x29A hex) before one of the decryption\nsubroutines:\n• By analysing the logs from the command servers, we have observed 59 unique victims in 23 countries :\nBelgium, Brazil, Bulgaria, Czech Republic, Georgia, Germany, Hungary, Ireland, Israel, Japan, Latvia, Lebanon, Lithuania,\nMontenegro, Portugal, Romania, Russian Federation, Slovenia, Spain, Turkey, Ukraine, United Kingdom and United States.\nFor the detailed analysis and information on how to protect against the attack, please read:\n[The MiniDuke Mystery: PDF 0-day Government Spy Assembler 0x29A Micro Backdoor.PDF]\nADOBE  ADOBE PDF  DATA ENCRYPTION  OBFUSCATION  TARGETED ATTACKS  \nVULNERABILITIES AND EXPLOITS\nRelated Posts\njaguar3217\nPosted on March 13, 2017. 6:44 pm\nIs this really the number of the beast?\nIs the feed logo like GIF image thing cursed?\nREPLY\nLEAVE A REPLY\nYour email address will not be published.  Required fields are marked *\nEnter your comment here\nName *\nEmail *\nSave my name, email, and website in this browser for the next time I comment.\n \nSUBMIT\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\n  \nNotify me when new comments are added.\n© 2020 AO Kaspersky Lab.  All Rights Reserved. \nRegistered trademarks and service marks are the property of their respective owners.\nContact us  | Privacy Policy  | License AgreementEmail\n I agree to provide my email address to “AO Kaspersky\nLab” to receive information about new posts on the\nsite. I understand that I can withdraw this consent at\nany time via e-mail by clicking the “unsubscribe” link\nthat I find at the bottom of any e-mail sent to me for\nthe purposes mentioned above.SUBSCRIBE\nMokes and Buerak\ndistributed under the guise\nof security certificates\nKBOT: sometimes they\ncome back\nOperation AppleJeus Sequel\nWe use cookies to make your experience of our websites better. By using and further navigating this website you accept this. Detailed\ninformation about the use of cookies on this website is available by clicking on more information .ACCEPT AND CLOSE\n "
}