{
    "title": "the tibetan alliance of chicago hit by cyber waterholing attack _ forcepoint",
    "text": ":Blogs :The Tibetan Alliance of Chicago hit by cyber waterholing attackThis website uses cookies. By continuing to browse this website, you accept our use of cookies and our Cookie Policy .\nHome\nMore articles in X-Labs\nBotconf 2019 – “The Cereals Botnet”\npresentation slides and review\nRobert Neumann\n2020 Forcepoint Cybersecurity\nPredictions and Trends\nCarl Leonard\nRobert Neumann\nThe persuasiveness of a\nremote jobOUR BLOG\nThe Tibetan Alliance of Chicago hit by\ncyber waterholing attack\nFRIDAY, AUG 16, 2013\nFForcepoint\nTags Cyber Attack  Cyber Crime\nAbout the Author\nForcepointWebsense Security Labs™ ThreatSeeker® Intelligence Cloud  has detected that the website of the Tibetan Alliance\nof Chicago has been compromised to serve malicious code.\nIn the last two days, the BBC  website reported news about a waterholing attack against the Central Tibetan\nAdministration website. Over the last two years, attacks like these have targetted pro-Tibet websites and other human\nrights organizations around the world. A waterholing attack is one that targets users of speciﬁc websites with the aim to\ninstall malware on their systems (usually using a backdoor approach) to collect documents, email contacts, social contacts,\nand passwords. The frequency of these attacks prompted Websense Security Labs to check our collective threat\nintelligence for any other websites that are considered pro-Tibet to see if they are aﬀected by this kind of attack.\nIn this blog we're going to analyze the Tibetan Alliance of Chicago website and illustrate how waterholing attacks are\nconducted.\nOne of the trends with targeted attacks in the last few years is that any installed malware binaries connect to dynamic DNS\nwebsites. One of the most interesting aspects of this speciﬁc attack is that a successful exploit downloads a binary that\nconnects to a small Dynamic DNS service oﬀered by none other than a German-based security appliances and services\ncompany, which reaﬃrms the notion that perpetrators pick and choose the parts of their attack infrastructure.\nAlthough the website does not have a high Alexa rank, we thought it was worth consideration, because our analysis\nconcluded that it wasn't a scattered attack, but a targeted injection to infect the users of that website. The website has\nbeen injected with two malicious iFrames as shown below:\nWe started to investigate the content of these two links above. The ﬁrst (hxxp://78.129.252.195/images/Adobe/index.html)\ncontains another iFrame that leads to a Firefox plugin named \"Adobe Flash Player.xpi,\" although at the time of the analysis,\nthe plugin wasn't available:\nWhen we used Threatseeker to search for other instances of \"Adobe Flash Player xpi,\" we detected other malicious\nwebsites, so we deduced that the aim of this iFrame was to try to install a malicious plugin using social engineering\ntechniques. The second link (hxxp://78.129.252.195/index.html) caught our attention, because it seems to be malicious\ncode exploiting the vulnerability CVE-2012-4969  as shown below:\nThe code highlighted above shows another iframe that leads to hxxp://78.129.252.195/yRrztX.html with the following\ncontent: \nFrom this, we could see the code used to trigger the Internet Explorer vulnerability addressed as CVE-2012-4969  and\nspotted in other targeted attacks by a security researcher here  in September 2012. The code within the page \"index.html\"\nuses the \"heap spray\" mechanism to run shellcode if the exploiting attempt succeeds. The following is the snippet of code\nthat has been assigned the shellcode:\nOnce the shellcode is executed, it downloads and runs a malicious ﬁle on the compromised system. The shellcode appears\nto be using the Windows default user-agent 'wininet' to retrieve the malicious ﬁle, which in itself can be considered\nsuspicious, because we don't normally see many legitimate HTTP requests that use this agent. We do see this user-agent\nbeing used by legitimate software, but it's not predominant.\nFollowing is the Fiddler's session where you can see the binary ﬁle that was downloaded:\nAnalyzing the dynamic behavior of the malicious executable, you can detect a ﬁrst call to the command-and-control point\nat mail.ﬁrewall-gateway.com located in the United Kingdom:\nWe conducted a quick investigation about the domain \"ﬁrewall-gateway.com,\" and it appears to be mantained by the\nGerman service provider, Securepoint, that specializes in provisioning secure VPN endpoints and other kinds of network\nservices oﬀerings. This is what we saw from the WHOIS record:\n: \nIn one of Securepoint's support forums, the announcement of the availability of a dynamic DNS service is still shown. The\nservice appears to be available at this  address. We believe it's an attempt to remain covert, because it is not by chance\nthat the perpetrators chose their command-and-control point to be reached through a dynamic DNS service associated\nwith a security company.\nThe detection rate of the binary ﬁle seems very low as reported by Virustotal. From a brief static analysis of the malicious\nbinary ﬁle, you can detect a list of strings used to check the presences of Antivirus on the impacted system:\nThe binary ﬁle has a low AV rate detection rate, as reported by this Virustotal report .\nIn this blog we gave a brief example of what seems to be a waterholing attack that is aimed for a speciﬁc crowd, in this case,\npro-Tibet users. We believe that the complexity of such attacks lies in direct relation to the security measures that are\nemployed by the potential targets, in this case the attack isn't that complex but probably just enough to fulﬁll its ultimate\npurpose.\nWebsense customers are protected from injected websites and the diﬀerent stages of this threat with our Advanced\nClassiﬁcation Engine - ACE .\nShare\nF\nSTAY UP TO SPEED\nJoin Our Mailing ListFEEDBACK\nReport a Vulnerability\nContact UsCareers\nServices\nFree Trials\nTerms & Conditions Legal and Privacy © 2020 Forcepoint\nData & IP Cloud & Network Insider Threat Our Platform Industries Resources Schedule a Demo\n "
}