{
    "title": "the epic turla operation _ securelist",
    "text": "Share post on:\nTHERE ARE 3 COMMENTS\n Technical Appendix with IOCs\nExecutive Summary\nOver the last 10 months, Kaspersky Lab researchers have analyzed a massive cyber-espionage operation which we call “Epic\nTurla”. The attackers behind Epic Turla have infected several hundred computers in more than 45 countries, including\ngovernment institutions, embassies, military, education, research and pharmaceutical companies.\nThe attacks are known to have used at least two zero-day exploits:\nCVE-2013-5065  – Privilege escalation vulnerability in Windows XP and Windows 2003\nCVE-2013-3346  – Arbitrary code-execution vulnerability in Adobe Reader\nWe also observed exploits against older (patched) vulnerabilities, social engineering techniques and watering hole strategies\nin these attacks. The primary backdoor used in the Epic attacks is also known as “WorldCupSec”, “TadjMakhal”, “Wipbot” or\n“Tavdig”.\nWhen G-Data published on Turla/Uroburos  back in February, several questions remained unanswered. One big unknown was\nthe infection vector for Turla (aka Snake or Uroburos). Our analysis indicates that victims are infected via a sophisticated\nmulti-stage attack, which begins with the Epic Turla. In time, as the attackers gain confidence, this is upgraded to more\nsophisticated backdoors, such as the Carbon/Cobra system. Sometimes, both backdoors are run in tandem, and used to\n“rescue” each other if communications are lost with one of the backdoors.\nOnce the attackers obtain the necessary credentials without the victim noticing, they deploy the rootkit and other extreme\npersistence mechanisms.\nThe attacks are still ongoing as of July 2014, actively targeting users in Europe and the Middle East.\nNote: A full analysis of the Epic attacks is available to the Kaspersky Intelligent Services subscribers.\nContact: intelreports@kaspersky.com\nThe Epic Turla attacks\nThe attacks in this campaign fall into several different categories depending on the vector used in the initial compromise:\nSpearphishing e-mails with Adobe PDF exploits (CVE-2013-3346 + CVE-2013-5065)\nSocial engineering to trick the user into running malware installers with “.SCR” extension, sometimes packed with RAR\nWatering hole attacks using Java exploits (CVE-2012-1723), Flash exploits (unknown) or Internet Explorer 6,7,8 exploits\n(unknown)\nWatering hole attacks that rely on social engineering to trick the user into running fake “Flash Player” malware installers\nThe attackers use both direct spearphishing and watering hole attacks to infect their victims. Watering holes (waterholes) are\nwebsites of interest to the victims that have been compromised by the attackers and injected to serve malicious code.\nSo far we haven’t been able to locate any e-mail used against the victims, only the attachments. The PDF attachments do\nnot show any “lure” to the victim when opened, however, the SCR packages sometime show a clean PDF upon successful\ninstallation.\nSome of known attachment names used in the spearphishing attacks are:\nﺟﻧﻳﻑ ﺅﺗﻣﺭ.rar (translation from Arabic: “Geneva conference.rar”)\nNATO position on Syria.scr\nNote_№107-41D.pdf\nTalking Points.scr\nborder_security_protocol.rar\nSecurity protocol.scr\nProgram.scr\nIn some cases, these filenames can provide clues about the type of victims the attackers are targeting.\nThe watering hole attacks\nCurrently, the Epic attackers run a vast network of watering holes that target visitors with surgical precision.\nSome of the injected websites include:\nThe website of the City Hall of Pinor, Spain\nA site promoting entrepreneurship in the border area of Romania\nPalestinian Authority Ministry of Foreign Affairs\nIn total, we observed more than 100 injected websites. Currently, the largest number of injected sites is in Romania.\nHere’s a statistic on the injected websites:\nThe distribution is obviously not random, and it reflects some of the interests of the attackers. For instance, in Romania\nmany of the infected sites are in the Mures region, while many of the Spanish infected sites belong to local governments\n(City Hall).\nMost of the infected sites use the TYPO3 CMS (see: http://typo3.org/ ), which could indicate the attackers are abusing a\nspecific vulnerability in this publishing platform.\nInjected websites load a remote JavaScript into the victim’s browser:\nThe script “sitenavigatoin.js” is a Pinlady-style browser and plugin detection script, which in turn, redirects to a PHP script\nsometimes called main.php or wreq.php. Sometimes, the attackers register the .JPG extension with the PHP handler on the\nserver, using “JPG” files to run PHP scripts:\nProfiling script\nThe main exploitation script “wreq.php”, “main.php” or “main.jpg” performs a numbers of tasks. We have located several\nversions of this script which attempt various exploitation mechanisms.\nOne version of this script attempts to exploit Internet Explorer versions 6, 7 and 8:\nInternet Explorer exploitation script\nUnfortunately, the Internet Explorer exploits have not yet been retrieved.\nAnother more recent version attempts to exploit Oracle Sun Java and Adobe Flash Player:\nJava and Flash Player exploitation scripts\nAlthough the Flash Player exploits couldn’t be retrieved, we did manage to obtain the Java exploits:\nName MD5\nallj.html 536eca0defc14eff0a38b64c74e03c79\nallj.jar f41077c4734ef27dec41c89223136cf8\nallj64.html 15060a4b998d8e288589d31ccd230f86\nallj64.jar e481f5ea90d684e5986e70e6338539b4\nlstj.jar 21cbc17b28126b88b954b3b123958b46\nlstj.html acae4a875cd160c015adfdea57bd62c4\nThe Java files exploit a popular vulnerability, CVE-2012-1723 , in various configurations.\nThe payload dropped by these Java exploits is the following:\nMD5: d7ca9cf72753df7392bfeea834bcf992\nThe Java exploit use a special loader that attempts to inject the final Epic backdoor payload into explorer.exe. The backdoor\nextracted from the Java exploits has the following C&C hardcoded inside:\nwww.arshinmalalan[.]com/themes/v6/templates/css/in.php\nThis C&C is still online at the moment although it redirects to a currently suspended page at\n“hxxp://busandcoachdirectory.com[.]au “. For a full list of C&C servers, please see the Appendix .\nThe Epic Turla attackers are extremely dynamic in using exploits or different methods depending on what is available at the\nmoment. Most recently, we observed them using yet another technique coupled with watering hole attacks.  This takes\nadvantage of social engineering to trick the user into running a fake Flash Player (MD5:\n030f5fdb78bfc1ce7b459d3cc2cf1877):\nIn at least one case, they tried to trick the user into downloading and running a fake Microsoft Security Essentials app (MD5:\n89b0f1a3a667e5cd43f5670e12dba411):\nThe fake application is signed by a valid digital certificate from Sysprint AG:\nSerial number: ​00 c0 a3 9e 33 ec 8b ea 47 72 de 4b dc b7 49 bb 95\nThumbprint: ​24 21 58 64 f1 28 97 2b 26 22 17 2d ee 62 82 46 07 99 ca 46\nValid signature from Sysprint AG on Epic dropper\nThis file was distributed from the Ministry of Foreign Affairs of Tajikistan’s website, at “ hxxp://mfa[.]tj/upload/security.php “.\nThe file is a .NET application that contains an encrypted resource. This drops the malicious file with the MD5\n7731d42b043865559258464fe1c98513 .\nThis is an Epic backdoor which connects to the following C&Cs, with a generic internal ID of 1156fd22-3443-4344-c4ffff :\nhxxp://homaxcompany[.]com/components/com_sitemap/  \nhxxp://www.hadilotfi[.]com/wp-content/themes/profile/\nA full list with all the C&C server URLs that we recovered from the samples can be found in the technical Appendix .\nThe Epic command-and-control infrastructure\nThe Epic backdoors are commanded by a huge network of hacked servers that deliver   command and control functionality.\nThe huge network commanded by the Epic Turla attackers serves multiple purposes. For instance, the motherships function\nas both exploitation sites and command and control panels for the malware.\nHere’s how the big picture looks like:\nEpic Turla lifecycle\nThe first level of command and control proxies generally talk to a second level of proxies, which in turn, talk to the\n“mothership” server. The mothership server is generally a VPS, which runs the Control panel software used to interact with\nthe victims. The attackers operate the mothership using a network of proxies and VPN servers for anonymity reasons. The\nmothership also work as the exploitation servers used in the watering hole attacks, delivering Java, IE or fake applications to\nthe victim.\nWe were able to get a copy of one of the motherships, which provided some insight into the operation.\nIt runs a control panel which is password protected:\nEpic mothership control panel login\nOnce logged into the Control panel, the attackers can see a general overview of the system including the number of\ninteresting potential targets:\nEpic control panel status overview\nA very interesting file on the servers is task.css , where the attackers define the IP ranges they are interested in. To change\nthe file, they are using the “Task editor” from the menu. Depending on the “tasks”, they will decide whether to infect the\nvisitors or not. In this case, we found they targeted two ranges belonging to:\n“Country A” – Federal Government Network\n“Country B” – Government Telecommunications and Informatics Services Network\nIt should be noted though, the fact that the attackers were targeting these ranges doesn’t necessarily mean they also got\ninfected. Some other unknown IPs were also observed in the targeting schedules.\nThere is also an “ except.css ” file where attackers log the reasons they didn’t try to exploit certain visitors. There are three\npossible values:\nTRY\nDON’T TRY -> Version of the browser and OS does not meet the conditions\nDON’T TRY -> (2012-09-19 10:02:04) – checktime < 60\nThese are the “don’t meet the conditions” reasons observed in the logs:\nWindows 7 or 2008 R2\nMSIE 8.0\nMozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.1; WOW64; Trident/4.0; SLCC2; .NET CLR 2.0.50727; .NET CLR\n3.5.30729; .NET CLR 3.0.30729; .NET CLR 1.1.4322; .NET4.0C; .NET4.0E)\nAdobe Shockwave 11.5.1.601\nAdobe Flash 10.3.181.14\nAdobe Reader 10.1.0.0\nWin Media Player 12.0.7601.17514\nQuick Time null\nMS Word null\nJava null\nThe Epic / Tavdig / Wipbot backdoor\nFor this first stage of the attack, the threat actor uses a custom backdoor. In some cases, the backdoor is packaged together\nwith the CVE-2013-5065 EoP exploit and heavily obfuscated. This makes the analysis more difficult.\nThe CVE-2013-5065 exploit allows the backdoor to achieve administrator privileges on the system and run unrestricted.\nThis exploit only works on unpatched Microsoft Windows XP systems.\nOther known detection names for the backdoor is Trojan.Wipbot (Symantec) or Tavdig.\nThe main backdoor is about 60KB in size and implements a C&C protocol on top of normal HTTP requests. The\ncommunication protocol uses \n  requests in the C&C replies, which the malware decrypts and processes.\nThe replies are sent back to the C&C through the same channel.\nThe malware behavior is defined by a configuration block. The configuration block usually contains two hard-coded C&C\nURLs. He have also seen one case where the configuration block contains just one URL. The configuration can also be\nupdated on the fly by the attackers, via the C&C.\nThe backdoor attempts to identify the following processes and, if found, it will terminate itself:\ntcpdump.exe\nwindump.exe\nethereal.exe\nwireshark.exe\nettercap.exe\nsnoop.exe\ndsniff.exe\nIt contains an internal unique ID, which is used to identify the victim to the C&C. Most samples, especially old ones, have the\nID 1156fd22-3443-4344-c4ffff . Once a victim is confirmed as “interesting”, the attackers upload another Epic backdoor\nwhich has a unique ID used to control this specific victim.\nDuring the first C&C call, the backdoor sends a pack with the victim’s system information. All further information sent to the\nC&C is encrypted with a public key framework, making decryption impossible. The commands from the C&C are encrypted\nin a simpler manner and can be decrypted if intercepted because the secret key is hardcoded in the malware.\nThrough monitoring, we were able to capture a large amount of commands sent to the victims by the attackers, providing\nan unique view into this operation. Here’s a look at one of the encrypted server replies:\nOnce a victim is infected and “checks in” with the server, the attackers send a template of commands:\nNext, the attackers try to move through the victim’s network using pre-defined or collected passwords:\nListing all .doc files recursively is also a common “theme”:\nIn total, we have decoded several hundreds of these command packages delivered to the victims, providing an unique\ninsight into the inner workings of the attackers.\nIn addition to generic searches, some very specific lookups have been observed as well.  These include searches for:\n*NATO*.msg\neu energy dialogue*.*\nEU*.msg\nBudapest*.msg\nIn this case, the attackers were interested to find e-mails related to “NATO”, “Energy Dialogue within European Union” and\nso on.\nFor some of the C&C servers, the attackers implemented RSA encryption for the C&C logs, which makes it impossible to\ndecrypt them. This scheme was implemented in April 2014.\nLateral movement and upgrade to more\nsophisticated backdoors\nOnce a victim is compromised, the attackers upload several tools that are used for lateral movement.\nOne such tool observed in the attacks and saved as “ C:Documents and SettingsAll usersStart\nMenuProgramsStartupwinsvclg.exe ” is:\nName: winsvclg.exe  \nMD5: a3cbf6179d437909eb532b7319b3dafe  \nCompiled: Tue Oct 02 13:51:50 2012\nThis is a keylogger tool that creates %temp%~DFD3O8.tmp. Note: the filename can change across victims. On one Central\nAsian government’s Ministry of Foreign Affairs victim system, the filename used was “ adobe32updt.exe “.\nIn addition to these custom tools, we observed the usage of standard administration utilities. For instance, another tool\noften uploaded by the attackers to the victim’s machine is “winrs.exe”:\nName: winrs.exe  \nMD5: 1369fee289fe7798a02cde100a5e91d8\nThis is an UPX packed binary, which contains the genuine “dnsquery.exe” tool from Microsoft, unpacked MD5: \nc0c03b71684eb0545ef9182f5f9928ca .\nIn several cases, an interesting update has been observed —  a malware from a different, yet related family.\nSize: 275,968 bytes  \nMD5: e9580b6b13822090db018c320e80865f  \nCompiled: Thu Nov 08 11:05:35 2012\nanother example:\nSize: 218,112 bytes  \nMD5: 071d3b60ebec2095165b6879e41211f2  \nCompiled: Thu Nov 08 11:04:39 2012\nThis backdoor is more sophisticated and belongs to the next level of cyber-espionage tools called the “Carbon system” or\nCobra by the Turla attackers. Several plugins for the “Carbon system” are known to exist.\nDecoded configuration for e9580b6b13822090db018c320e80865f\nNote: the command and control servers www.losguayaberos[.]com  and thebesttothbrushes[.]com  have been sinkholed by\nKaspersky Lab.\nOther packages delivered to the victims include:\nMD5: c7617251d523f3bc4189d53df1985ca9  \nMD5: 0f76ef2e6572befdc2ca1ca2ab15e5a1\nThese top level packages deploy both updated Epic backdoors and Turla Carbon system backdoors to confirmed victims,\neffectively linking the Epic and Turla Carbon operations together.\nThe Turla Carbon dropper from these packages has the following properties:\nMD5: cb1b68d9971c2353c2d6a8119c49b51f\nThis is called internally by the authors “Carbon System”, part of the “Cobra” project, as it can be seen from the debug path\ninside:\nThis acts as a dropper for the following modules, both 32 and 64 bit:\nMD5 Resource number\n4c1017de62ea4788c7c8058a8f825a2d 101\n43e896ede6fe025ee90f7f27c6d376a4 102\ne6d1dcc6c2601e592f2b03f35b06fa8f 104\n554450c1ecb925693fedbb9e56702646 105\ndf230db9bddf200b24d8744ad84d80e8 161\n91a5594343b47462ebd6266a9c40abbe 162\n244505129d96be57134cb00f27d4359c 164\n4ae7e6011b550372d2a73ab3b4d67096 165\nThe Carbon system is in essence an extensible platform, very similar to other attack platforms such as the Tilded platform  or\nthe Flame platform . The plugins for the Carbon system can be easily recognized as they always feature at least two exports\nnamed:\nModuleStart\nModuleStop\nCarbon system plugin with characteristic exports\nSeveral Epic backdoors appear to have been designed to work as Carbon system plugins as well – they require a specialized\nloader to start in victim systems that do not have the Carbon system deployed.\nSome modules have artifacts which indicate the Carbon system is already at version 3.x, although the exact Carbon system\nversion is very rarely seen in samples:\nThe author of the Carbon module above can be also seen in the code, as “gilg”, which also authored several other Turla\nmodules.\nWe are planning to cover the Turla Carbon system with more details in a future report.\nLanguage artifacts\nThe payload recovered from one of the mothership servers (at newsforum.servehttp[.]com/wordpress/wp-\nincludes/css/img/upload.php , MD5: 4dc22c1695d1f275c3b6e503a1b171f5 , Compiled: Thu Sep 06 14:09:55 2012)\ncontains two modules, a loader/injector and a backdoor. Internally, the backdoor is named “Zagruzchik.dll”:\nThe word “Zagruzchik” means “boot loader” in Russian.\nThe Control panel for the Epic motherships also sets the language to codepage “1251”:\nCodepage 1251 is commonly used to render Cyrillic characters.\nThere are other indications that the attackers are not native English language speakers:\nPassword it´s wrong!\nCount successful more MAX\nFile is not exists\nFile is exists for edit\nThe sample e9580b6b13822090db018c320e80865f  that was delivered to several Epic victims as an upgraded backdoor,\nhas the compilation code page language set to “LANG_RUSSIAN”.\nThe threat actor behind the “Epic” operation uses mainly hacked servers to host their proxies. The hacked servers are\ncontrolled through the use of a PHP webshell. This shell is password protected; the password is checked against an MD5\nhash:\nThe MD5 “ af3e8be26c63c4dd066935629cf9bac8 ” has been solved by Kaspersky Lab as the password “kenpachi”. In\nFebruary 2014 we observed the Miniduke  threat actor using the same backdoor on their hacked servers, although using a\nmuch stronger password.\nOnce again, it is also interesting to point out the usage of Codepage 1251 in the webshell, which is used to render Cyrillic\ncharacters.\nThere appears to be several links between Turla and Miniduke, but we will leave that for a future blogpost.\nVictim statistics\nOn some of the C&C servers used in the Epic attacks, we were able to identify detailed victim statistics, which were saved\nfor debugging purposes by the attackers.\nThis is the country distribution for the top 20 affected countries by victim’s IP:\nAccording to the public information available for the victims’ IPs, targets of “Epic” belong to the following categories:\nGovernment\n Ministry of interior (EU country)\n Ministry of trade and commerce (EU country)\n Ministry of foreign/external affairs (Asian country, EU country)\n Intelligence (Middle East, EU Country)\nEmbassies\nMilitary (EU country)\nEducation\nResearch (Middle East)\nPharmaceutical companies\nUnknown (impossible to determine based on IP/existing data)\nSummary\nWhen G-Data published their Turla paper, there were few details publicly available on how victims get infected with this\nmalware campaign. Our analysis indicates this is a sophisticated multi-stage infection; which begins with Epic Turla. This is\nused to gain a foothold and validate the high profile victim. If the victim is interesting, they get upgraded to the Turla Carbon\nsystem.\nMost recently, we observed this attack against a Kaspersky Lab user on August 5, 2014, indicating the operation remains\nfresh and ongoing.\nNote: A full analysis of the Epic attacks is available to the Kaspersky Intelligent Services customers.\nContact: intelreports@kaspersky.com\nWe would like to add the following at the end of the blogpost, right before the detection names:\nFurther reading\nIf you’d like to read more about Turla/Uroburos, here’s a few recommendations:\nG-Data’s paper “Uroburos Highly complex espionage software with Russian roots”\nBAE Systems analysis of “The Snake campaign”\n“Uroburos: the snake rootkit” , technical analysis by deresz and tecamac\n“TR-25 Analysis – Turla / Pfinet / Snake/ Uroburos”  by CIRCL.LU\nKaspersky products’ detection names for all the malware samples described in this post :\nBackdoor.Win32.Turla.an\nBackdoor.Win32.Turla.ao\nExploit.JS.CVE-2013-2729.a\nExploit.JS.Pdfka.gkx\nExploit.Java.CVE-2012-1723.eh\nExploit.Java.CVE-2012-1723.ou\nExploit.Java.CVE-2012-1723.ov\nExploit.Java.CVE-2012-1723.ow\nExploit.Java.CVE-2012-4681.at\nExploit.Java.CVE-2012-4681.au\nExploit.MSExcel.CVE-2009-3129.u\nHEUR:Exploit.Java.CVE-2012-1723.gen\nHEUR:Exploit.Java.CVE-2012-4681.gen\nHEUR:Exploit.Java.Generic\nHEUR:Exploit.Script.Generic\nHEUR:Trojan.Script.Generic\nHEUR:Trojan.Win32.Epiccosplay.gen\nHEUR:Trojan.Win32.Generic\nHackTool.Win32.Agent.vhs\nHackTool.Win64.Agent.b\nRootkit.Win32.Turla.d\nTrojan-Dropper.Win32.Dapato.dwua\nTrojan-Dropper.Win32.Demp.rib\nTrojan-Dropper.Win32.Injector.jtxs\nTrojan-Dropper.Win32.Injector.jtxt\nTrojan-Dropper.Win32.Injector.jznj\nTrojan-Dropper.Win32.Injector.jznk\nTrojan-Dropper.Win32.Injector.khqw\nTrojan-Dropper.Win32.Injector.kkkc\nTrojan-Dropper.Win32.Turla.b\nTrojan-Dropper.Win32.Turla.d\nTrojan.HTML.Epiccosplay.a\nTrojan.Win32.Agent.iber\nTrojan.Win32.Agent.ibgm\nTrojan.Win32.Agentb.adzu\nTrojan.Win32.Inject.iujx\nTrojan.Win32.Nus.g\nTrojan.Win32.Nus.h\n Technical Appendix with IOCs\nAPT CYBER ESPIONAGE  SOCIAL ENGINEERING  TURLA  VULNERABILITIES AND EXPLOITS  \nWATERING HOLE ATTACKS\nRelated Posts\ntrue dia\nPosted on August 9, 2014. 5:53 am\n“word “Zagruzchik” means “boot loader” in Russian”\n” attackers are not native English language speakers”\n“File is not exists” ” Codepage 1251 ″\nLOL, are you shure?\nRussians only can set language to russian…. ?\nAnd my english it’s not sogood?\nTHATS sound really dumbish.\nREPLY\nSăndel\nPosted on December 9, 2014. 8:46 am\nWell… If you ask me, your English is rather shaggy.\nBut you’re right. One doesn’t have to be Russian or Ukrainian or Moldovan to set CP1251.\nсалют\n/Алексеи .\nREPLY\nAndré Spindler\nPosted on August 16, 2014. 10:51 am\nHello.\nYou tell abaout more than 100 websites being infected. And say that most of them use TYPO3 CMS.\nSo I expect You have checked all websites to verify this. But obviously you have missed something:\nYou only name some few websites in detail, the first one is the website for City Hall in Pinor. I have checked this. It uses\nTYPO3, that’s right. But it uses TYPO3 version 4.1. Support for 4.1 was dropped years ago. Now we have 6.2.\nObviously you don’t know that. So You can’t tell about a specific vulnerability in this publishing platform.\nYou have mentioned three affected websites. I was only able to find one online. And this outdated version could not be\nused as an example that TYPO3 has a specific vulnerability. Unto now this version has MANY. Addionally this also means\nthat there is a PHP version 5.2 or earlier is in use (PHP4). Seems like the complete server has been set up years ago and is\nnot up to date. So it also can be a vulnerability in Apache, PHP, TYPO3, FTP and a lot more services and software.\nI checked I site. And it didn’t prove the fact it is a TYPO3 vulnerability. Will I get this also on the more of 100 other sites,\ntoo?\nREPLY\nLEAVE A REPLY\nYour email address will not be published.  Required fields are marked *\nEnter your comment here\nName *\nEmail *\nSave my name, email, and website in this browser for the next time I comment.\n \nSUBMIT\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\n APT REPORTS\nThe Epic Turla Operation\nSolving some of the mysteries of Snake/Uroburos\nBy GReAT  on August 7, 2014. 1:55 pm\n \nNotify me when new comments are added.\nIN THE SAME CATEGORY\nChafer used Remexi malware to spy on\nIran-based foreign diplomatic entities\nGreyEnergy’s overlap with Zebrocy\nA Zebrocy Go Downloader\nAPT review of the year\nDarkPulsar FAQ\n© 2020 AO Kaspersky Lab.  All Rights Reserved. \nRegistered trademarks and service marks are the property of their respective owners.\nContact us  | Privacy Policy  | License AgreementEmail\n I agree to provide my email address to “AO Kaspersky Lab” to\nreceive information about new posts on the site. I understand\nthat I can withdraw this consent at any time via e-mail by\nclicking the “unsubscribe” link that I find at the bottom of any e-\nmail sent to me for the purposes mentioned above.\nSUBSCRIBE\nHunting APTs with YARA\n Mokes and Buerak\ndistributed under the guise\nof security certificates\nHappy New Fear! Gift-\nwrapped spam and phishing\nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\n English\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPR GET IN TOUCH\n "
}