{
    "title": "the return of the charming kitten - certfa lab",
    "text": " Home  About  Contact\nThe Return of The Charming Kitten\nA review of the latest wave of organized phishing attacks by Iranian state-backed hackers\nCertfa Lab · 2018.12.13\nAbstract\nPhishing attacks are the most common form of infiltration used by Iranian state-backed hackers to gain access\ninto accounts. \n Certfa  reviews the latest campaign of phishing attacks that has been carried out and dubbed as\n“The Return of The Charming Kitten”.\nIn this campaign, hackers have targeted individuals who are involved in economic and military sanctions\nagainst the Islamic Republic of Iran as well as politicians, civil and human rights activists and journalists around\nthe world.\nOur review in Certfa demonstrates that the hackers - knowing that their victims use two-step verification -\ntarget verification codes and also their email accounts such as Yahoo! and Gmail. As a result, Certfa believes\nthe safest existing way to confront these attacks is using Security Keys such as YubiKey.\nIntroduction\nIn early October 2018, MD0ugh, a Twitter user1, revealed phishing attacks of a group of Iranian hackers\nagainst US financial institution infrastructure. According to this user, these attacks could possibly be a reaction\nto new sanctions against Iran.\nThe account mentioned a domain with the address accounts[-]support[.]services for the first time. This domain\nis linked to a group of hackers who are supported by the Iranian government, and that we believe have close\nties with the Islamic Revolutionary Guard Corps (IRGC). ClearSky2 has previously published detailed reports\non their activities.\nA month after these attacks, the administrators of accounts-support[.]services expanded their activities and\nstarted targeting civil and human rights activists, political figures and also Iranian and Western journalists.\nMethods of Attacks\nOur investigation illustrates that the attackers are utilising different methods to carry out their attacks. These\nmethods can be put into two categories:\n1. Phishing attacks through unknown email or social media and messaging accounts\n2. Phishing attacks through email or social media and messaging accounts of public figures, which have been\nhacked by the attackers\nWe have also found that the hackers have collected information on their targets prior to the phishing attack.\nThe hackers design specific plans for each target based on the level of targets’ cyber knowledge, their\ncontacts, activities, working time, and their geographic situation.\nWe also noticed that, unlike in previous phishing campaigns, in some cases the hackers did not change the\npassword of their victims’ accounts in these latest attacks. This allows them to remain undetected and monitor\na victim’s communications via their email in real time.\nFake alerts of unauthorised access\nAccording to the samples of phishing attacks, the main trick used by these hackers to deceive their targets is\nthat of sending fake alerts through email addresses such as notifications.mailservices@gmail[.]com,\nnoreply.customermails@gmail[.]com, customer]email-delivery[.]info etc. stating that unauthorised individuals\nhave tried to access their accounts.\nFigure 1. Illustration of safe and secure looking fake links\nBy using this method, attackers pretend that the email provider has sent security alerts to the targets and they\nshould immediately review and restrict suspicious accesses. More details are available in the “Destination\nLink” section.\nFake file sharing on Google Drive\nSending links with titles such as share files from Google Drive has been one of the most common tricks that\nhackers have used in recent years. A unique point of these attacks in comparison with the previous ones is\nthat they use Google Site3, which allows the hackers to show a fake download page of Google Drive, which\ntricks the users into thinking it’s a real Google Drive page.\nFigure 2. A fake page of Google Drive file sharing page\nFor example, the hacker had used hxxps://sites.google[.]com/view/sharingdrivesystem to deceive the users\nand convince them the page is the authentic Google Drive as users can see google.com in the address bar of\ntheir browsers. Certfa has reported this link and similar links to Google and Google has now terminated them.\nBy creating websites with the same design and look of Google Drive file sharing page, hackers pretend to be\nsharing a file with the user, which they should download and run it on their devices. They use hacked Twitter,\nFacebook and Telegram accounts to send these links and target new users. The truth is there is not any file\nand the hackers use this page to direct their targets to the fake Google login page, which the users enter their\ncredential details including 2 factor authentication.\nThe Attack Structure\nMost of these attacks are currently occurring through phishing emails. As a result, it would be useful to take a\nlook the original content in recent phishing campaigns.\nFigure 3. An example of codes of phishing email sent to the user\n1. Destination link\n1.1. Trusted Stage:  Internet users around the world consider Google’s main domain (google.com) to be a safe\nand secure address. The attackers misuse this fact and create fake pages on sites.google.com (which is a\nsubdomain of Google) to deceive their targets. Google’s Site service gives its users an ability to show various\ncontents on it. The attackers use this ability to send fake alerts and redirect their targets to insecure websites\nor embedded phishing pages as a iframe on those pages.\nFigure 4. How attackers misuse site.google.com\n1.2. Untrusted Stage:  Since Google can quickly recognise and eliminate suspicious and malicious links on\nsites.google.com, the hackers use their own website. The links of phishing websites have similar patterns to a\nprevious phishing campaign which was launched in the past years. For example, attackers use words such as\n“management”, “customize”, “service”, “identification”, “session”, “confirm” etc. in the domains name and\nphishing URLs to deceive users who want to verify their website addresses.\n2. Clickable image in emails\nThe hackers use an image, instead of texts, in the body of their emails, to bypass Google’s security and anti-\nphishing system. For this purpose, attackers have also used third party services such as Firefox Screenshot4\nto host their email images.\nFigure 5. An example of a planted image of fake alarm in a phishing email\n3. Hidden tracking image on emails\nThe attackers use a separate hidden image in the body of the email to notify them when their targets open the\nemail. This trick helps the hackers to act immediately after the target opens the email and clicks on the\nphishing link.\nPhishing Pages\nApart from the content structure of the emails and phishing links, we are sure that attackers use a customized\nplatform to create and store users’ credential details. We have also noticed that they have designed the\nphishing pages for both desktop and mobile versions of Google and Yahoo! mail services and they might use\nother services in the future.\nAn interesting technique they have used in recent attacks was once their target enters their username and\npassword, attackers check those credentials on-the-fly and if that information was given correctly, they then\nask for 2-step verification code.\nIn other words, they check victims’ usernames and passwords in realtime on their own servers, and even if 2\nfactor authentication such as text message, authenticator app or one-tap login are enabled they can trick\ntargets and steal that information too.\nFigures 6 to 9 demonstrate some examples of the phishing pages, which have been sent to the targets by the\nIranian hackers.\nFigure 6. A fake page for entering password of Gmail accounts\nFigure 7. A fake page for entering 2-step verification code for Gmail accounts\nFigure 8. A fake page for entering password of Yahoo! accounts\nFigure 9. A fake page for entering 2-step verification code for Yahoo! accounts\nHacker’s Footprints\nOur primary reviews of the phishing websites linked to this campaign show that hackers have set up a\nremarkable number of domains. Our latest findings show that for this phishing campaign in a relatively short\nperiod of time, (September to November 2018), they have used more than 20 domain names. The number of\nphishing domains has increased at the time of writing this report. Closer investigation of these servers revealed\nhow their network of domain names have been used in recent attacks.\nFigure 10. Deep data of the attackers’ network in this phishing campaign, which gathered by Certfa5\nMoreover, our technical reviews reveal that the individuals, who are involved in this campaign used Virtual\nPrivate Networks (VPNs) and proxies with Dutch and French IP addresses to hide their original location. In\nspite of their efforts, we have uncovered enough evidence to prove that the attackers were using their real IP\naddresses (i.e 89.198.179[.]103 and 31.2.213[.]18 from Iran during the preparation phase of their campaign).\nAlso, some domain names and servers of this campaign are very similar to the methods, techniques and\ntargets that been used by Charming Kitten, a group of hackers who are linked to the Iranian government.\nConsequently, we believe Charming Kitten and the Iranian hacker(s) belonging to this group have returned and\nlaunched new cyber attacks against various people around the world and with more focus on Israeli and\nAmerican citizens.\nConclusion\nPhishing attacks are the most popular method of stealing data and hacking account amongst Iranian hackers,\nbut the most significant fact about this campaign is its timing. This campaign launched weeks before 4\nNovember 2018 which is when the U.S. imposed new sanctions on Iran. This campaign tries to collect\ninformation by infiltrating the accounts of non-Iranian political figures and authorities who work on economic\nand military sanctions against Iran.\nIn other words, hackers who are supported by the Iranian government pick their targets according to policies\nand international interests for the Iranian government and also where Iran wants to have impact indirectly.\nA a result, we propose a series of recommendations to tech companies, policymakers, civil society actors and\ninternet users to effectively lessen the threat of this type of attack and even thwart them.\nOur recommendations to tech companies and policy makers:\nStop using 2 factor authentication by text plain message/SMS.\nStart using Security Keys (i.e. YubiKey) for 2 factor authentication for high ranking individuals who have\nsensitive jobs or activities.\nDo not use one-tap login verification process.\nOur recommendations to civil society and the Iranian diaspora media:\nInform employees and colleagues about any phishing threats and encourage them to use Security Keys\nsuch as Yubikey for 2 factor authentication and activate Google’s Advanced Protection Program.\nAlways use company and institution email accounts instead of personal email for sensitive\ncommunications. Change Sender Policy Framework or SPF6 settings according to the communication\npolicy of the company/organisation such as restricting receiving emails from outside of the working\nnetwork. For example, G Suite allows admins to block receiving emails from unauthorised address or\ndomains7.\nEncourage the public to enable 2 factor authentication on their account by mobile apps such as Google\nAuthenticator.\nOur recommendations to users:\nDo not click on unknown links. For reviewing suspicious activities on your account or change the\npassword, instead of clicking on any link, you can go to your “My Account” settings from your email\ndirectly which is more safer.\nUse email encryption such PGP for sensitive emails which prevent hackers reading your emails in the first\nplace.\nDo not store classified and sensitive information as a plain text in your mailbox.\nHTTPS being before a domain names in a URL does not mean that the content of a website is secure or\ntrusted - it’s just a secure extension of the HTTP protocol. Do not forget many phishing websites are\ncurrently operating under HTTPS protocol too.\nIOCs\n178.162.132[.]65\n190.2.154[.]34\n190.2.154[.]35\n190.2.154[.]36\n190.2.154[.]38\n46.166.151[.]211\n51.38.87[.]64\n51.38.87[.]65\n51.68.185[.]96\n51.38.107[.]113\n95.211.189[.]45\n95.211.189[.]46\n95.211.189[.]47\n213.227.139[.]148\n54.37.241[.]221\n54.38.144[.]250\n54.38.144[.]251\n54.38.144[.]252\n85.17.127[.]172\n85.17.127[.]173\n85.17.127[.]174\n85.17.127[.]175\n89.198.179[.]103\n31.2.213[.]18\naccounts-support[.]services\nbroadcast-news[.]info\nbroadcastnews[.]pro\ncom-identifier-servicelog[.]info\ncom-identifier-servicelog[.]name\ncom-identifier-userservicelog[.]com\nconfirm-session-identification[.]info\nconfirm-session-identifier[.]info\nconfirmation-service[.]info\ncustomer-recovery[.]info\ncustomize-identity[.]info\ndocument-share[.]info\ndocument.support-recoverycustomers[.]services\ndocumentofficupdate[.]info\ndocuments.accounts-support[.]services\ndocumentsfilesharing[.]cloud\nemail-delivery[.]info\nmobile-sessionid.customize-identity[.]info\nmobiles-sessionid.customize-identity[.]info\nmy-scribdinc[.]online\nmyyahoo.ddns[.]net\nnotificationapp[.]info\nonlinemessenger.com-identifier-servicelog[.]name\npodcastmedia[.]online\nrecoveryusercustomer[.]info\nsession-management[.]info\nsupport-recoverycustomers[.]services\ncontinue-session-identifier[.]info\nmobilecontinue[.]network\nsession-identifier-webservice.mobilecontinue[.]network\ncom-messengersaccount[.]name\ninvitation-to-messenger[.]space\nconfirm-identification[.]name\nmobilecontinue[.]network\nmobile.confirm-identification[.]name\nservices.confirm-identification[.]name\nmobile-messengerplus[.]network\nconfirm.mobile-messengerplus[.]network\ncom-messengercenters[.]name\nsecuremail.mobile-messengerplus[.]network\ndocuments.mobile-messengerplus[.]network\nconfirm-identity[.]net\nidentifier-sessions-mailactivityid[.]site\nactivatecodeoption.ddns[.]net\nbroadcastpopuer.ddns[.]net\nbooks.com-identifier-servicelog[.]name\nmb.sessions-identifier-memberemailid[.]network\nsessions-identifier-memberemailid[.]network\nsessions.mobile-messengerplus[.]network\nconfirm-verification-process[.]systems\naccounts.confirm-verification-process[.]systems\nbroadcastnews.ddns[.]net\naccount-profile-users[.]info\nus2-mail-login-profile[.]site\nus2.login-users-account[.]site\nlogin-users-account[.]site\nlive.account-profile-users[.]info\nsignin.account-profile-users[.]info\naol.account-profile-users[.]info\nusers-account[.]site\nFootnotes:\n1. \nhttps://s.certfa.com/q1514c  \nhttps://s.certfa.com/eNnnag  \nhttps://s.certfa.com/ur93p2  \n⇆\n2. ClearSkye Cyber Security (2018), “Charming Kitten, Iranian cyber espionage against human rights activists, academic researchers and media outlets\n- and the HBO hacker connection”. Accessed November 15, 2018. \n https://s.certfa.com/1ulIxk  \n⇆\n3. Sites. Accessed November 23, 2018. \n https://sites.google.com/  \n⇆\n4. Firefox Screenshots. Accessed November 15, 2018. \n https://screenshots.firefox.com/  \n⇆\n5. VirusTotal Graph. Accessed November 25, 2018. \n https://s.certfa.com/OgQUSC  \n⇆\n6. Sender Policy Framework or SPF is an email authentication method to detect forged sender addresses in emails. SPF allows the recipient to check\nthat an email claiming to come from a specific domain comes from an IP address authorized by that domain’s administrators. \n ⇆\n7. G Suite Administrator Help (2018), “Restrict messages to authorized addresses or domains”. Accessed November 29, 2018.\nhttps://support.google.com/a/answer/2640542?hl=en  \n⇆\nCharming Kitten  APT  Iran  Phishing\nAll rights reserved. \n© 2020 CERTFA.  \nPowered by Digital Impact Lab LLC.\n "
}