{
    "title": "the destruction of apt3 – intrusion truth",
    "text": "Twelve months have passed since this blog exposed Wu Yingzhuo, Dong Hao,\ntheir company ‘Boyusec’ and the Chinese Ministry of State Security (MSS) as\nbeing behind APT3. APT3 was, at the time, one of the most damaging APT attacks\nto hit Western companies. One year on, we take a look back at what happened\nafter our publication.\nThe disappearance of APT3\nWe published our explosive analysis  in April and May 2017. It was the first time\nthat the Chinese Intelligence Services had been conclusively linked to an APT\nand followed similar revelations , years previously, linking People’s Liberation\nArmy (PLA) Unit 61398 to APT1.\nThe Boyusec website went offline the morning after the exposure and it hasn’t\nbeen back online since.\nThe morning after, on boyusec.com\nBoyusec disappeared into the shadows without making any effort to contact us\nor to refute any of the conclusions of our analysis. These were not the actions of\ninnocent individuals.\nWhere did these guys run off to? Perhaps not proud of their work as APT3?\n#buckeye  #gothicpanda  #apt3  #boyusec  #cyber  pic.twitter.com/0lIzSIzxjd\n— Intrusion Truth (@intrusion_truth) May 10, 2017\nCorroboration by the community\nA fortnight after our publication, a series of articles appeared online drawing on\nour work and corroborating it. Our analysis formed the basis of articles by, among\nothers, Security Week , Dark Reading , Recorded Future , Threat Post  and Security\nLab. The Information Security community agreed with our conclusion that\nBoyusec and MSS were behind the APT3 attacks.  “There has been a lot of\naccumulated evidence that these guys are tied to the state”  John Hultquist, Director\nof Analysis at FireEye, said to Foreign Policy magazine .\nThreat Post coverage based on Intrusion Truth analysis\nUS Government charges Wu and Dong\nBut the story doesn’t quite end there. Six months after our publications the US\nJustice Department unsealed indictments against Wu Yingzhuo, Dong Hao and\nXia Lei for computer hacking, theft of trade secrets, conspiracy and identity\ntheft. They had been prepared in September 2017.\nThree US victims were identified in the indictment – Trimble, Siemens and\nMoody’s Analytics – one for each of the ‘co-conspirators’.\nThe destruction of APT3\n \n  \n  \nintrusiontruth\n in \nAPT3\n May 22, 2018\n\n748 Words\n Menu\n \n APT3 is Boyusec, a Chinese Intelligence Contractor\nWho was behind this unprecedented Cyber attack on Western infrastructure?\nBlog at WordPress.com.\nThe indictment document released by the US Government\nThough the indictments didn’t mention the Chinese Government, Justice\nDepartment spokesman Wyn Hornbuckle said that prosecutors only “included the\nallegations that we are prepared to prove in court with admissible evidence” .\nWu, Dong and Xia are no longer able to travel internationally without fear of\narrest and trial. The maximum sentence for their crimes? 20 years.\nContractors vs employees\nThe Chinese Intelligence Service, MSS, had perhaps tried to be more careful than\ntheir military colleagues in the People’s Liberation Army. They used commercial\nhackers rather than government employees, probably thinking that it lent them\nsome additional deniability. But, given that the company involved was identified\nas MSS-tasked in any case, that choice may have been a mistake.\nAs private citizens, Wu, Dong and Xia are vulnerable to action by other countries\nthat may choose to treat them as common criminals rather than government\nofficials. The three have already been charged by the US government and now\nrisk being arrested, deported, tried and imprisoned.\nWhat happened to APT3?\nThis blog has been contacted by several InfoSec professionals who had been\nfollowing APT3. Without exception they reported a complete cessation of APT3\nactivity in May 2017. Following the US indictment announcement in November\n2017, the Wall Street Journal also reported that Boyusec had been disbanded .\nThe Wall Street Journal claims that Boyusec was disbanded in late 2017\nIn addition to the evidence above, the press release announcing the American\nindictments against Wu, Dong and Xia refers to May 2017 as the final date of\ntheir activity. Our conclusion? It seems that APT3 is no more.\nWhat’s next?\nThe ‘P’ in APT stands for Persistent. But this episode goes to show that Chinese\nAPT hackers will only persist whilst their activity remains anonymous. APT3 was\none of the biggest APT threats to Western companies, yet it was completely\nsilenced by shining a light on its activities and exposing the identities of those\nbehind the group to the world.\nAnalysts working with this blog are continuing their efforts to identify the\nindividuals, companies and state institutions behind the damaging attacks that\nhit the West. We have accumulated evidence on several groups over the last\ntwelve months and hope to share some of it soon.\nShare this:\nTwitter\n Facebook  \nAPT3 is Boyusec, a Chinese\nIntelligence ContractorWho is behind this Chinese\nespionage group stealing our\nintellectual property?APT10 was managed by the\nTianjin bureau of the Chinese\nMinistry of State Security\n\nClose and acceptPrivacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. \nTo find out more, including how to control cookies, see here: Cookie Policy\n "
}