{
    "title": "the epic turla (snake_uroburos) attacks _ virus definition _ kaspersky",
    "text": "VIRUS DEFINITION\nVirus Type:  Advanced Persistent Threat (APT)\nWhat is Epic Turla?\nTurla, also known as Snake or Uroburos is one of the most sophisticated ongoing cyber-\nespionage campaigns. The latest Kaspersky Lab research on this operation reveals that Epic is\nthe initial stage of the Turla victim infection mechanism.\nTargets of “Epic” belong to the following categories: government entities (Ministry of Interior,\nMinistry of Trade and Commerce, Ministry of Foreign/External affairs, intelligence agencies),\nembassies, military, research and education organizations and pharmaceutical companies.\nMost of the victims are located in the Middle East and Europe, however, we observed \nvictims in other regions as well, including in the USA. In total, Kaspersky Lab experts counted\nseveral hundred victim IPs distributed in more than 45 countries, with France at the top of\nthe list.\nThe attacks detected in this operation fall into several different categories depending on the\ninitial infection vector used in compromising the victim:\nThreat Details\nThe attackers use both direct spear-phishing e-mails and watering hole attacks to infect\nvictims. Watering holes are websites commonly visited by potential victims. These websites\nare compromised in advance by the attackers and injected to serve malicious code.\nDepending on the visitor’s IP address (for instance, a government organization’s IP), the\nattackers serve Java or browser exploits, signed fake Adobe Flash Player software or a fake\nversion of Microsoft Security Essentials.\nIn total, we have observed more than 100 injected websites. The choice of the websites\nreﬂects speciﬁc interest of attackers. For example, many of infected Spanish websites belong\nto local governments.\nOnce the user is infected , the Epic backdoor immediately connects to the command-and-\ncontrol (C&C) server to send a pack with the victim’s system information. The backdoor is\nalso known as “WorldCupSec”, “TadjMakhal”, “Wipbot” or “Tadvig”.\nOnce a system is compromised,  the attackers receive brief summary information from the\nvictim, and based on that, they deliver pre-conﬁgured batch ﬁles containing a series of\ncommands for execution. In addition to these, the attackers upload custom lateral\nmovement tools. These include a speciﬁc keylogger tool, a RAR archiver and standard\nutilities like a DNS query tool from Microsoft.  \nHow do I know if I’m infected by the Epic Turla\nThe best way to determine if you’ve been a victim of the Epic Turla is to identify if there has\nbeen an intrusion. Threat identiﬁcation can be done with a strong antivirus product such as\nKaspersky Lab solutions.\nKaspersky Lab products will detect the following modules of the Epic Turla:\nBackdoor.Win32.Turla.an \nBackdoor.Win32.Turla.ao \nExploit.JS.CVE-2013-2729.a \nExploit.JS.Pdfka.gkx \nExploit.Java.CVE-2012-1723.eh \nExploit.Java.CVE-2012-1723.ou \nExploit.Java.CVE-2012-1723.ov \nExploit.Java.CVE-2012-1723.ow \nExploit.Java.CVE-2012-4681.at \nExploit.Java.CVE-2012-4681.au \nExploit.MSExcel.CVE-2009-3129.u \nHEUR:Exploit.Java.CVE-2012-1723.gen \nHEUR:Exploit.Java.CVE-2012-4681.gen \nHEUR:Exploit.Java.Generic \nHEUR:Exploit.Script.Generic \nHEUR:Trojan.Script.Generic \nHEUR:Trojan.Win32.Epiccosplay.gen \nHEUR:Trojan.Win32.Generic \nHackTool.Win32.Agent.vhs \nHackTool.Win64.Agent.b \nRootkit.Win32.Turla.d \nTrojan-Dropper.Win32.Dapato.dwua \nTrojan-Dropper.Win32.Demp.rib \nTrojan-Dropper.Win32.Injector.jtxs \nTrojan-Dropper.Win32.Injector.jtxt \nTrojan-Dropper.Win32.Injector.jznj \nTrojan-Dropper.Win32.Injector.jznk \nTrojan-Dropper.Win32.Injector.khqw \nTrojan-Dropper.Win32.Injector.kkkc \nTrojan-Dropper.Win32.Turla.b \nTrojan-Dropper.Win32.Turla.d \nTrojan.HTML.Epiccosplay.a \nTrojan.Win32.Agent.iber \nTrojan.Win32.Agent.ibgm \nTrojan.Win32.Agentb.adzu \nTrojan.Win32.Inject.iujx \nTrojan.Win32.Nus.g \nTrojan.Win32.Nus.h\nHow can I protect myself against The Epic Turla\nA security solution should be turned on at all times and all its components should be active.\nThe solution’s databases should also be up to date\nOther related articles and links related to Malware Threats\nFeatured Articles\nWhat’s the Difference between a Virus\nand a Worm?\nTop 7 Mobile Security Threats in 2020\nMalware & Computer Virus Facts &\nFAQs\nTop 10 Most Notorious Hackers of All\nTime\nInternet Safety for Kids: How to\nProtect Your Child from the Top 7\nDangers They Face Online\nSpear-phishing e-mails with Adobe PDF exploits (CVE-2013-3346 + CVE-2013-5065)\nSocial engineering to trick the user into running malware installers with “.SCR” extension,\nsometimes packed with RAR\nWatering hole attacks using Java exploits (CVE-2012-1723), Adobe Flash exploits\n(unknown) or Internet Explorer 6, 7, 8 exploits (unknown)\nWatering hole attacks that rely on social engineering to trick the user into running fake\n“Flash Player” malware installers\nKeep operating system and all third party applications, notably Java, Microsoft Oﬃce and\nAdobe Reader updated\nDo not install software from untrusted sources, for instance when prompted by a\nrandom page\nBe wary of e-mails from unknown sources containing suspicious attachments or links\nThe Onion Ransomware (Encryption Trojan)\nCrouching Yeti Malware Threat\nKaspersky Internet Security\nProtecting You, Your Family & More\nGet the Power to Protect. Discover how our award-winning\nsecurity helps protect what matters most to you.Get FREE Tools\nOur FREE security tools and more can help you\ncheck all is as it should be… on your PC, Mac or\nmobile device.We’re Here to Help\nHelping you stay safe is what we’re about –\nso, if you need to contact us, get answers to\nsome FAQs or access our technical support\nteam, click here .\nWho We Are\nFind out why we’re so committed to helping people stay safe…\nonline and beyond.Get Your Free Trial\nTry Before You Buy. In just a few clicks, you can get a\nFREE trial of one of our products – so you can put our\ntechnologies through their paces.Renew your license\nSave up to 30% when you renew your license\nor upgrade to another Kaspersky product\nStay in Touch\nHome Products\nKaspersky Anti-Virus\nKaspersky Android Antivirus\nKaspersky Internet Security\nKaspersky Total Security\nKaspersky Security Cloud\nKaspersky VPN Secure Connection\nKaspersky Security Cloud - Free\nAll ProductsSmall Business Products\n(1-50 EMPLOYEES)\nKaspersky Small Oﬃce Security\nKaspersky Endpoint Security Cloud\nAll ProductsMedium Business Products\n(51-999 EMPLOYEES)\nKaspersky Endpoint Security Cloud\nKaspersky Endpoint Security for\nBusiness Select\nKaspersky Endpoint Security for\nBusiness Advanced\nAll ProductsEnterprise Solutions\n(1000+ EMPLOYEES)\nCybersecurity Services\nThreat Management and Defense\nEndpoint Security\nHybrid Cloud Security\nAll Solutions\n© 2020  AO Kaspersky Lab. All Rights Reserved. • Privacy Policy  • Anti-Corruption Policy  • Licence Agreement B2C  \n• Licence Agreement B2B\nContact Us\nAbout Us\nPartners\nBlog\nResource Center\nPress Releases\nSitemap\nGlobal\nThe Epic Turla (snake/Uroburos) attacks\nProducts\nRenew\nDownloads\nSupport\nResource Center\nBlogKaspersky\nWe use cookies to make your experience of our websites better. By using and further navigating this website you accept this. Detailed\ninformation about the use of cookies on this website is available by clicking on more information .ACCEPT AND CLOSE\n "
}