{
    "title": "third-party software was entry point for background-check system hack - nextgov",
    "text": "Lawmakers Pressure Trump\nTo Issue Federal Telework\nExecutive Order\nThrift Savings Plan Wants\nHelp Protecting Federal\nEmployees’ Retirement From\nOutside Cyber Threats\nPentagon Seeks Pitches For\n5G-Enabled Virtual Reality\nProjects\nNew Security Clearance\nOffice Gets First Permanent\nLeader\nGovernment And Tech\nConferences Alter Plans Due\nTo Coronavirus\nSign Up For Our Nextgov\nNewsletters!\nThird-Party Software Was Entry Point for\nBackground-Check System Hack\nWK1003MIKE/SHUTTERSTOCK.COM\nResearchers At Oak Ridge\nNational Lab Tap Into\nSupercomputing To Help\nCombat Coronavirus \nEXCLUSIVE: Pentagon To\nTake Corrective Action On\nJEDI\nNIH Uses Urgent Award\nVehicle For The First Time To\nAddress Coronavirus\nOutbreak\nFormer DHS Acting Inspector\nGeneral Indicted For Stealing\nDatabase With Personnel\nInformation\nYou Might Be Buying A Hand\nSanitizer That Won’t Work For\nCoronavirus\nNextgov Special Report:\nSecuring The Government\nCloud\nHealthy Living Natural Foods Store Probing\nPossible Payment System Hack\nResearchers At Oak Ridge\nNational Lab Tap Into\nSupercomputing To Help\nCombat Coronavirus \nEXCLUSIVE: Pentagon To\nTake Corrective Action On\nJEDI\nNIH Uses Urgent Award\nVehicle For The First Time To\nAddress Coronavirus\nOutbreak\nFormer DHS Acting Inspector\nGeneral Indicted For Stealing\nDatabase With Personnel\nInformation\nYou Might Be Buying A Hand\nSanitizer That Won’t Work For\nCoronavirus\nNextgov Special Report:\nSecuring The Government\nCloud\nHackers Rig Ratings of Pro-Putin Videos\nand Spy on Iranian Expat Living in the US\nRussian President Vladimir Putin attends a forum of independent regional and local mass media in St. Petersburg,\nRussia. ALEXEI DRUZHININ/AP FILE PHOTO\nResearchers At Oak Ridge\nNational Lab Tap Into\nSupercomputing To Help\nCombat Coronavirus \nEXCLUSIVE: Pentagon To\nTake Corrective Action On\nJEDI\nNIH Uses Urgent Award\nVehicle For The First Time To\nAddress Coronavirus\nOutbreak\nFormer DHS Acting Inspector\nGeneral Indicted For Stealing\nDatabase With Personnel\nInformation\nYou Might Be Buying A Hand\nSanitizer That Won’t Work For\nCoronavirus\nNextgov Special Report:\nSecuring The Government\nCloud\nBy Aliya Sternstein ,\nSenior CorrespondentMAY 10, 2015\nIntruders piggybacked on a vulnerability in an\nenterprise resource planning application.\nHackers broke into third-party software in 2013 to open personal records on federal\nemployees and contractors with access to classified intelligence, according to the\ngovernment's largest private employee investigation provider.\nThat software apparently was an SAP enterprise resource planning application. It’s unclear\nif there was a fix available for the program flaw at the time of the attack. It’s also not clear\nwhether SAP—which was responsible for maintaining the application—or USIS would have\nbeen responsible for patching the flaw.  \nBut in the end, sensitive details on tens of thousands of national security personnel were\nexposed in March 2014.\nAssailants infiltrated USIS by piggybacking on an “exploit,” a glitch that can be abused by\nhackers, that was “present in a widely used and highly-regarded enterprise resource\nplanning (‘ERP’) software package,” an internal investigation obtained by Nextgov found. \nUSIS officials declined to explicitly name the software application, saying they would let\nthe report, compiled by Stroz Friedberg, a digital forensics firm retained by USIS, speak for\nitself. \nThe report, written in December 2014, noted: “Forensic evidence shows the cyberattacker\ngained access to USIS systems through an exploit in a system managed by a third party,\nand from there migrated to company managed systems. . . . Our findings were largely\ninformed by a variety of logs, including, firewall logs, security event logs, VPN\nlogs, and SAP application trace logs.”\nA September 2014 letter from Stroz reported, \"The initial attack vector was a vulnerability in\nan application server, housed in a connected, but separate network, managed by a third\nparty not affiliated with USIS.” The reference to “SAP application trace logs” in the report\nindicates the third party was SAP.\nDuring the period of the hacking operation, which began in 2013 and was exposed in June\n2014, 20 to 30 new critical vulnerabilities were identified in SAP’s enterprise resource\nplanning software.\nThe number of SAP vulnerabilities \"would have given attackers many options to\ntarget SAP directly,” based on how USIS deployed the ERP tool, said Richard Barger, chief\nintelligence officer at ThreatConnect, a firm that tracks cyber threats. Barger is a former\nArmy intelligence analyst.\nIt is unclear which vulnerability the intruders exploited. Defects in programs used by the\ngovernment and contractors sometimes aren’t fixed for years after software developers\nannounce a weakness.\nReferencing the Stroz report, USIS spokeswoman Ellen Davis said, \"the third-party\ncontractor was hacked and the hacker was then able to navigate into the USIS network via\nthe third party’s network.\"\nStroz officials deferred comment to USIS. \nSAP, a major IT contractor with 50,000 customer organizations worldwide, would neither\nconfirm nor deny allegations that assailants reached USIS through one of its systems. SAP\nspokesman Mat Small said in an email, \"Since we don’t comment on the specifics of any\ncustomer engagement without their explicit consent, SAP is unable to make a statement\non the situation.”\nAddressing SAP’s response to security vulnerabilities, he added, \"No company is more\ncommitted to data privacy and security than SAP, and we respond rapidly, vigorously and\nthoroughly when potential security risks are identified.”\nThe targeting of middlemen and downstream suppliers has become common in\nsophisticated hacking campaigns, according to researchers. \nThe top three sectors victimized by cyber espionage last year were professional services\nfirms, which typically support large organizations; manufacturing; and government,\naccording to an annual Verizon data breach investigations study  released last month.\nComputer snoops have learned it is easier to compromise “the partner and the third party\ndealing with that intellectual property than the source of the intellectual property itself,\" Jay\nJacobs, a Verizon senior analyst and study co-author, said at the time of the study’s\npublication.\nAnd PWC's most recent State of Cybercrime Survey  found that only 22 percent of U.S.\norganizations plan incident response strategies with outside suppliers.\n\"Not all companies recognize that supply chain vendors and business partners . . . can have\nlower—even nonexistent—cybersecurity policies and practices, a situation that can\nincrease cybercrime risks across any entity that partner or supplier touches,” according to\nthe survey, which came out a year ago.\n(Image via wk1003mike / Shutterstock.com )\nShare This:\nNEXT STORY:  Healthy Living Natural Foods Store Probing Possible Payment\nSystem Hack\nMAY 8, 2015\nFood and Beverage // United States\nTHREATWATCH\nThe Vermont-based grocery market on May 8 notified customers of a potential security\nbreach after some customers found unauthorized charges to their credit cards late last\nyear.\nHealthy Living Vice President Eli Lesser-Goldsmith said the business learned of the\nincident on March 25.\n\"At this point,\" Healthy Living doesn't believe its IT systems were the source of the breach,\nhe said.\n\"Because we have not yet been able to confirm that there was a data security breach, we\nhave not yet determined what remedial steps will need to be taken, if any, to prevent future\nbreaches,\" Lesser-Goldsmith said. \"We recommend that customers closely monitor their\naccount statements for unauthorized charges.\"\nOriginal Report:\nwww.burlingtonfreepress.com/story/money/2015/05/08/healthy-living-possibly-ta...\nShare This:\nNEXT STORY:  Hackers Rig Ratings of Pro-Putin Videos and Spy on Iranian\nExpat Living in the US\nBy Aliya Sternstein ,\nSenior CorrespondentMAY 8, 2015\nJust another week in ThreatWatch, our regularly\nupdated index of noteworthy data breaches.\nIn case you missed our coverage this week in ThreatWatch , Nextgov’s  regularly updated\nindex of cyber breaches:\nCanadian Woman Allegedly Harassed Kids through Hacked Webcams, Showed Victims\n‘Extreme Porn’\nValérie Gignac, of Quebec, apparently took control of people's computers remotely, to peer\nat and bully them. The 27-year-old is believed to have created a botnet -- or infected a series\nof computers with malware that turns them into zombie machines, commanding them to\nperform tasks without the owner's knowledge. \nHackers Launch Campaign of Intimidation against Iranian Expat Writer\nThe opinionated Iranian author Roya Hakakian, who has spent 30 years living in the United\nStates, was subjected to cyber espionage starting last February. “The common bond\namong all Hakakian’s outspoken work for the past decade is that she wrote it in English,”\nthe Daily Beast reports. Once Hakakian’s work was published in Farsi, “she seems to have\ntripped a wire that alerted the Iranian cyber hounds.”\nWeb Scrape of Buried Twitter Financials Technically Amounts to a Hack\nFinancial-intelligence firm Selerity took credit for publishing Twitter's earnings\nannouncement before NASDAQ's closing bell. Web-crawling bots run by Selerity uncovered\nthe financial report -- an abysmal $162 million first-quarter loss -- buried deep in Twitter's\npublic investor relations page.\nHackers Manipulated Ratings of Pro-Russian Videos\nHacktivists and/or cybercrooks compromised the computers of victims to invisibly load\npropaganda videos and ads, upping click-views, and thus the popularity, of party line\npromos and commercial products.\nShare This:\nNEXT STORY:  Canadian Woman Allegedly Harassed Kids through Hacked\nWebcams, Showed Victims ‘Extreme Porn’Most Popular\nGet the latest federal technology\nnews delivered to your inbox.\nFeatured eBooks\nRecommended For YouWhy Singapore's Coronavirus\nResponse Worked—and What\nWe Can All Learn1\nSenators Call on Agencies to\nPost Contingency Plans for\nPublic2\nGovernment’s Maximum\nTelework Policy Overlooks\nContractors3\nCBP Intercepts First Package of Counterfeit\nCOVID-19 Test Kits\nSenators Call on Agencies to Post\nContingency Plans for Public\nRegulators Say Maritime Industry’s\nPandemic Plans Can Skip Cybersecurity\nDetails\nMost Popular\nGet the latest federal technology\nnews delivered to your inbox.\nFeatured eBooks\nRecommended For YouWhy Singapore's Coronavirus\nResponse Worked—and What\nWe Can All Learn1\nSenators Call on Agencies to\nPost Contingency Plans for\nPublic2\nGovernment’s Maximum\nTelework Policy Overlooks\nContractors3\nCBP Intercepts First Package of Counterfeit\nCOVID-19 Test Kits\nSenators Call on Agencies to Post\nContingency Plans for Public\nRegulators Say Maritime Industry’s\nPandemic Plans Can Skip Cybersecurity\nDetails\nCYBERSECURITY EMERGING TECH ARTIFICIAL INTELLIGENCE IT MODERNIZATION CIO BRIEFING POLICY IDEASSUBSCRIBE // EVENTS // ABOUT\nTRENDING //CORONAVIRUS //BIOMETRICS //QUANTUM COMPUTING //ELECTION SECURITY //5G\n "
}