{
    "title": "threat group-3390_ tg-3390_ emissary panda_ bronze union_ apt27_ iron tiger_ luckymouse_ group g0027 _ mitre att_ck®",
    "text": "JUST RELEASED: ATT&CK for Industrial Control Systems\nGROUPS\nOverview\nadmin@338\nAPT1\nAPT12\nAPT16\nAPT17\nAPT18\nAPT19\nAPT28\nAPT29\nAPT3\nAPT30\nAPT32\nAPT33\nAPT37\nAPT38\nAPT39\nAPT41\nAxiom\nBlackOasis\nBRONZE BUTLER\nCarbanak\nCharming Kitten\nCleaver\nCobalt Group\nCopyKittens\nDark Caracal\nDarkhotel\nDarkHydrus\nDeep Panda\nDragonfly\nDragonfly 2.0\nDragonOK\nDust Storm\nElderwood\nEquation\nFIN10\nFIN4\nFIN5\nFIN6\nFIN7\nFIN8\nGallmaker\nGamaredon Group\nGCMAN\nGorgon Group\nGroup5\nHoneybee\nKe3chang\nKimsuky\nLazarus Group\nLeafminer\nLeviathan\nLotus Blossom\nMachete\nMagic Hound\nmenuPass\nMoafee\nMolerats\nMuddyWater\nNaikon\nNEODYMIUM\nNight Dragon\nOilRig\nOrangeworm\nPatchwork\nPittyTiger\nPLATINUM\nPoseidon Group\nPROMETHIUM\nPutter Panda\nRancor\nRTM\nSandworm Team\nScarlet Mimic\nSilence\nSilverTerrier\nSoft Cell\nSowbug\nStealth Falcon\nStolen Pencil\nStrider\nSuckfly\nTA459\nTA505\nTaidoor\nTEMP.Veles\nThe White Company\nThreat Group-1314\nThreat Group-3390\nThrip\nTropic Trooper\nTurla\nWinnti Group\nWIRTEHome >Groups >Threat Group-3390\nThreat Group-3390\nAssociated Group Descriptions\nName Description\nTG-3390   \nEmissary Panda    \nBRONZE UNION  \nAPT27   \nIron Tiger\nLuckyMouse  \nTechniques Used\nDomain ID Name Use\nEnterprise T1087 Account Discovery Threat Group-3390  has used net user  to conduct internal discovery of systems.\nEnterprise T1119 Automated Collection Threat Group-3390  ran a command to compile an archive of file types of interest from the victim user's directories.\nEnterprise T1088 Bypass User Account Control A Threat Group-3390  tool can use a public UAC bypass method to elevate privileges.\nEnterprise T1059 Command-Line Interface Threat Group-3390  has used command-line interfaces for execution.\nEnterprise T1043 Commonly Used Port C2 traffic for most Threat Group-3390  tools occurs over Port Numbers 53, 80, and 443.\nEnterprise T1003 Credential Dumping Threat Group-3390  actors have used gsecdump  and a modified version of Mimikatz  called Wrapikatz to dump credentials. They have also dumped\ncredentials from domain controllers.\nEnterprise T1002 Data Compressed Threat Group-3390  has used RAR to compress, encrypt, and password-protect files prior to exfiltration.\nEnterprise T1022 Data Encrypted Threat Group-3390  has used RAR to compress, encrypt, and password-protect files prior to exfiltration.\nEnterprise T1005 Data from Local System Threat Group-3390  ran a command to compile an archive of file types of interest from the victim user's directories.\nEnterprise T1074 Data Staged Threat Group-3390  has staged encrypted archives for exfiltration on Internet-facing servers that had previously been compromised with China Chopper .\nEnterprise T1030 Data Transfer Size Limits Threat Group-3390  actors have split RAR files for exfiltration into parts.\nEnterprise T1140 Deobfuscate/Decode Files or\nInformationDuring execution, Threat Group-3390  malware deobfuscates and decompresses code that was encoded with Metasploit’s shikata_ga_nai encoder as well as\ncompressed with LZNT1 compression.\nEnterprise T1089 Disabling Security Tools Threat Group-3390  has used appcmd.exe to disable logging on a victim server.\nEnterprise T1038 DLL Search Order Hijacking Threat Group-3390  has performed DLL search order hijacking to execute their payload.\nEnterprise T1073 DLL Side-Loading Threat Group-3390  has used DLL side-loading, including by using legitimate Kaspersky antivirus variants in which the DLL acts as a stub loader that loads\nand executes the shell code.\nEnterprise T1189 Drive-by Compromise Threat Group-3390  has extensively used strategic web compromises to target victims.\nEnterprise T1203 Exploitation for Client\nExecutionThreat Group-3390  has exploited the Microsoft SharePoint vulnerability CVE-2019-0604.\nEnterprise T1068 Exploitation for Privilege\nEscalationThreat Group-3390  has used CVE-2014-6324 to escalate privileges.\nEnterprise T1210 Exploitation of Remote\nServicesThreat Group-3390  has exploited MS17-101 to move laterally to other systems on the network. \nEnterprise T1133 External Remote Services Threat Group-3390  actors look for and use VPN profiles during an operation to access the network using external VPN services.\nEnterprise T1107 File Deletion Threat Group-3390  has deleted existing logs and exfiltrated file archives from a victim.\nEnterprise T1056 Input Capture Threat Group-3390  actors installed a credential logger on Microsoft Exchange servers. Threat Group-3390  also leveraged the reconnaissance framework,\nScanBox, to capture keystrokes.\nEnterprise T1112 Modify Registry A Threat Group-3390  tool can create a new Registry key under HKEY_CURRENT_USER\\Software\\Classes\\ .\nEnterprise T1046 Network Service Scanning Threat Group-3390  actors use the Hunter tool to conduct network service discovery for vulnerable systems.\nEnterprise T1126 Network Share Connection\nRemovalThreat Group-3390  has detached network shares after exfiltrating files, likely to evade detection.\nEnterprise T1050 New Service A Threat Group-3390  tool can create a new service, naming it after the config information, to gain persistence.\nEnterprise T1027 Obfuscated Files or\nInformationA Threat Group-3390  tool can encrypt payloads using XOR. Threat Group-3390  malware is also obfuscated using Metasploit’s shikata_ga_nai encoder as well\nas compressed with LZNT1 compression.\nEnterprise T1086 PowerShell Threat Group-3390  has used PowerShell for execution.\nEnterprise T1055 Process Injection A Threat Group-3390  tool can spawn svchost.exe and inject the payload into that process.\nEnterprise T1012 Query Registry A Threat Group-3390  tool can read and decrypt stored Registry values.\nEnterprise T1108 Redundant Access Threat Group-3390  has deployed backup web shells and obtained OWA account credentials during intrusions that it subsequently used to attempt to regain\naccess when evicted from a victim network.\nEnterprise T1060 Registry Run Keys / Startup\nFolderA Threat Group-3390  tool can add the binary’s path to the Registry key Software\\Microsoft\\Windows\\CurrentVersion\\Run  to add persistence.\nEnterprise T1105 Remote File Copy After re-establishing access to a victim network, Threat Group-3390  actors download tools including gsecdump  and WCE that are staged temporarily on\nwebsites that were previously compromised but never used.\nEnterprise T1018 Remote System Discovery Threat Group-3390  has used the net view  command.\nEnterprise T1053 Scheduled Task Threat Group-3390  actors use at to schedule tasks to run self-extracting RAR archives, which install HTTPBrowser  or PlugX  on other victims on a network.\nEnterprise T1071 Standard Application Layer\nProtocolThreat Group-3390  malware has used HTTP for C2.\nEnterprise T1016 System Network\nConfiguration DiscoveryThreat Group-3390  actors use nbtscan to discover vulnerable systems.\nEnterprise T1049 System Network Connections\nDiscoveryThreat Group-3390  has used net use  to conduct internal discovery of systems. The group has also used quser.exe to identify existing RDP sessions on a\nvictim.\nEnterprise T1078 Valid Accounts Threat Group-3390  actors obtain legitimate credentials using a variety of methods and use them to further lateral movement on victim networks.\nEnterprise T1100 Web Shell Threat Group-3390  has used a variety of Web shells.\nEnterprise T1047 Windows Management\nInstrumentationA Threat Group-3390  tool can use WMI to execute a binary.\nEnterprise T1028 Windows Remote\nManagementThreat Group-3390  has used WinRM to enable remote execution.\nSoftware\nID Name References Techniques\nS0073 ASPXSpy Threat Group-3390\nhas used a\nmodified version\nof ASPXSpy called\nASPXTool.Web Shell\nS0020 China\nChopperBrute Force, Command-Line Interface, Data from Local System, File and Directory Discovery, Network Service Scanning, Remote File Copy, Scripting, Software\nPacking, Standard Application Layer Protocol, Timestomp, Web Shell\nS0032 gh0st RAT Command-Line Interface, Commonly Used Port, DLL Side-Loading, File Deletion, Indicator Removal on Host, Input Capture, New Service, Process Discovery, Registry\nRun Keys / Startup Folder, Remote File Copy, Rundll32, Screen Capture, Standard Cryptographic Protocol\nS0008 gsecdump Credential Dumping\nS0070 HTTPBrowser Command-Line Interface, Commonly Used Port, DLL Search Order Hijacking, DLL Side-Loading, File and Directory Discovery, File Deletion, Input Capture,\nMasquerading, Obfuscated Files or Information, Registry Run Keys / Startup Folder, Remote File Copy, Standard Application Layer Protocol\nS0398 HyperBro DLL Side-Loading, Execution through API, File Deletion, Process Injection, Remote File Copy, Screen Capture, Service Execution, Standard Application Layer Protocol,\nSystem Service Discovery\nS0357 Impacket Credential Dumping, Kerberoasting, LLMNR/NBT-NS Poisoning and Relay, Network Sniffing, Service Execution, Windows Management Instrumentation\nS0100 ipconfig System Network Configuration Discovery\nS0002 Mimikatz Threat Group-3390\nhas used a\nmodified version\nof Mimikatz called\nWrapikatz.Account Manipulation, Credential Dumping, Credentials in Files, DCShadow, Pass the Hash, Pass the Ticket, Private Keys, Security Support Provider, SID-History\nInjection\nS0039 Net Account Discovery, Create Account, Network Share Connection Removal, Network Share Discovery, Password Policy Discovery, Permission Groups Discovery, Remote\nSystem Discovery, Service Execution, System Network Connections Discovery, System Service Discovery, System Time Discovery, Windows Admin Shares\nS0072 OwaAuth Data Encrypted, DLL Side-Loading, File and Directory Discovery, Input Capture, Masquerading, Standard Application Layer Protocol, Timestomp, Web Shell\nS0013 PlugX Command-Line Interface, Commonly Used Port, Custom Command and Control Protocol, Deobfuscate/Decode Files or Information, DLL Side-Loading, Execution\nthrough API, File and Directory Discovery, Input Capture, Masquerading, Modify Existing Service, Modify Registry, Multiband Communication, Network Share\nDiscovery, New Service, Process Discovery, Query Registry, Registry Run Keys / Startup Folder, Remote File Copy, Screen Capture, Standard Application Layer\nProtocol, Standard Non-Application Layer Protocol, System Network Connections Discovery, Trusted Developer Utilities, Virtualization/Sandbox Evasion, Web Service\nS0006 pwdump Credential Dumping\nS0005 Windows\nCredential\nEditorCredential Dumping\nS0412 ZxShell Access Token Manipulation, Command-Line Interface, Commonly Used Port, Connection Proxy, Create Account, Disabling Security Tools, Endpoint Denial of Service,\nFile and Directory Discovery, File Deletion, Hooking, Indicator Removal on Host, Input Capture, Network Service Scanning, New Service, Process Discovery, Process\nInjection, Query Registry, Remote Desktop Protocol, Remote File Copy, Remote Services, Rundll32, Screen Capture, Standard Application Layer Protocol, System\nInformation Discovery, System Owner/User Discovery, System Service Discovery, Uncommonly Used Port, Video Capture\nReferencesThreat Group-3390  is a Chinese threat group that has extensively used strategic Web compromises to target victims.  The group has been\nactive since at least 2010 and has targeted organizations in the aerospace, government, defense, technology, energy, and manufacturing\nsectors.  [1]\n[2][3]ID: G0027\nAssociated Groups : TG-3390, Emissary Panda, BRONZE\nUNION, APT27, Iron Tiger, LuckyMouse\nVersion : 1.2\nCreated: 31 May 2017\nLast Modified: 15 October 2019\n[1][4][6]\n[8][4][3][6][5]\n[2][4]\n[4][3][6]\n[6]\n[3][6]\nATT&CK  Navigator Layers  ®\n[2]\n[2]\n[4]\n[2][5]\n[1]\n[1][2]\n[2]\n[2]\n[2]\n[2]\n[1]\n[3]\n[2]\n[4]\n[1][2][3][5]\n[1][3]\n[5]\n[2]\n[5]\n[1]\n[2]\n[1][6][3]\n[4]\n[1][5]\n[2]\n[4]\n[4][3][5]\n[2]\n[4][3]\n[4]\n[2]\n[4]\n[1]\n[4]\n[1]\n[3]\n[1]\n[2]\n[1]\n[5]\n[4]\n[2]\n[1]\n[1] [2] [4] [5]\n[7]\n[1]\n[1] [2] [4]\n[5] [3] [6]\n[5]\n[2]\n[2][4]\n[2]\n[1] [2]\n[1] [2] [4]\n[5]\n[1]\n[7]\n1. Dell SecureWorks Counter Threat Unit Threat Intelligence. (2015, August 5). Threat Group-3390\nTargets Organizations for Cyberespionage. Retrieved August 18, 2018.\n2. Counter Threat Unit Research Team. (2017, June 27). BRONZE UNION Cyberespionage Persists\nDespite Disclosures. Retrieved July 13, 2017.\n3. Legezo, D. (2018, June 13). LuckyMouse hits national data center to organize country-level\nwaterholing campaign. Retrieved August 18, 2018.\n4. Pantazopoulos, N., Henry T. (2018, May 18). Emissary Panda – A potential new malicious tool.\nRetrieved June 25, 2018.5. Falcone, R. and Lancaster, T.. (2019, May 28). Emissary Panda Attacks Middle East Government\nSharepoint Servers. Retrieved July 9, 2019.\n6. Khandelwal, S. (2018, June 14). Chinese Hackers Carried Out Country-Level Watering Hole Attack.\nRetrieved August 18, 2018.\n7. Counter Threat Unit Research Team. (2019, February 27). A Peek into BRONZE UNION’s Toolbox.\nRetrieved September 24, 2019.\n8. Gallagher, S.. (2015, August 5). Newly discovered Chinese hacking group hacked 100+ websites to\nuse as “watering holes”. Retrieved January 25, 2016.\n© 2015-2020, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\nPrivacy Policy Terms of Use ATT&CK v6.3\n @MITREattack\nContact\nMatrices Groups Software Blog  Contribute Tactics  Techniques  Mitigations  Resources  \n "
}