{
    "title": "to sdb_ or not to sdb_ fin7 leveraging shim databases for persistence _ fireeye inc",
    "text": " PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚȚħřěǻț Řěșěǻřčħ\nȚǿ ȘĐB, Ǿ ř Ňǿț Țǿ ȘĐB: F İŇ7 Ŀěvěřǻģįňģ Șħįm\nĐǻțǻbǻ șěș fǿř Pěřșįșțěňčě\nMǻỳ 03, 2017 | bỳ Mǻțțħěẅ MčẄħį řț, Jǿň Ěřįčķșǿň, ĐJ Pǻŀǿmbǿ\nČỲBĚŘ ČŘİMĚ \nČǺŘBǺ ŇǺĶ \nFĿǺŘĚ \nFİŇǺŇČİǺĿ ȘĚŘVİČĚȘ \nFİŇ7\nİň 2017, Mǻňđįǻňț řěșpǿňđěđ țǿ mųŀțįpŀě įňčį đěňțș ẅě ǻțțřįbųțě țǿ FİŇ7, ǻ fįňǻňčįǻŀŀỳ mǿțįvǻțě đ țħřěǻț ģřǿųp\nǻșșǿčįǻțěđ ẅįțħ mǻŀįčįǿ ųș ǿpěřǻțįǿňș đǻțįňģ bǻčķ țǿ 2015 . Țħřǿųģħǿųț țħě vǻ řįǿųș ěňvįřǿňměňț ș, FİŇ7 ŀěvěřǻģěđ\nțħě ČǺŘBǺ ŇǺĶ bǻčķ đǿǿř, ẅħįčħ țħįș ģřǿųp ħǻș ųșěđ įň přěvįǿųș ǿpěřǻțįǿňș.\nǺ ųňįqųě ǻșpěčț ǿf țħě įňčį đěňțș ẅǻș ħǿẅ țħě ģřǿųp įňșțǻŀŀěđ țħě ČǺŘBǺ ŇǺĶ bǻčķ đǿǿř fǿř pěřșįșțěňț ǻččě șș.\nMǻňđįǻňț įđěňțįfįěđ țħǻț țħě ģ řǿųp ŀěvěřǻģěđ ǻň ǻppŀįčǻțįǿň șħįm đǻțǻbǻșě țǿ ǻčħįěvě pě řșįșțěňčě ǿň șỳșțěmș įň\nmųŀțįpŀě ěňvį řǿňměňț ș. Țħě șħįm įňjěčțě đ ǻ mǻŀįčįǿ ųș įň-měmǿ řỳ pǻțčħ įňțǿ țħě Șě řvįčěș Čǿňțřǿŀ Mǻňǻģě ř\n(“șěřvįčěș.ěxě”) p řǿčěșș, ǻňđ țħěň șpǻẅňěđ ǻ ČǺŘBǺ ŇǺĶ bǻčķ đǿǿř přǿčěșș.\nMǻňđįǻňț įđěňțįfįěđ țħǻț FİŇ7 ǻŀșǿ ųșěđ țħįș țěčħňįq ųě țǿ įňșțǻŀŀ ǻ pǻỳměňț čǻ řđ ħǻřvěșțįňģ ųțįŀįțỳ fǿř pěřșįșțěňț\nǻččěșș. Țħįș ẅǻș ǻ đěpǻřțųřě fřǿm FİŇ7’ș přěvįǿųș ǻppřǿǻčħ ǿf įň șțǻŀŀįňģ ǻ mǻŀįčįǿ ųș Ẅįňđǿẅș șěřvįčě fǿř\npřǿčěșș įňjěčțįǿň ǻň đ pěřșįșțěňț ǻččě șș.\nǺppŀįčǻțįǿň Čǿmpǻțįbįŀįțỳ Șħįm ș Bǻčķģřǿųňđ\nǺččǿřđįňģ țǿ Mįč řǿșǿfț, ǻň ǻppŀįčǻțįǿň čǿmpǻțįbįŀįțỳ șħįm įș ǻ șmǻŀŀ ŀįbřǻřỳ țħǻț ț řǻňșpǻřěňțŀỳ įňțě řčěpțș ǻň ǺPİ\n(vįǻ ħǿǿķįňģ), čħǻňģě ș țħě pǻ řǻměțěřș pǻșșěđ, ħǻňđŀěș țħě ǿpě řǻțįǿň įțșěŀf, ǿř řěđįřěčțș țħě ǿpě řǻțįǿň ěŀ șěẅħěřě,\nșųčħ ǻș ǻđđįțįǿňǻŀ čǿ đě șțǿřěđ ǿň ǻ șỳșțěm. Țǿ đǻỳ, șħįmș ǻřě mǻįňŀỳ ųșěđ fǿř čǿmpǻțįbįŀįțỳ p ųřpǿșěș fǿř ŀěģǻčỳ\nǻppŀįčǻțįǿň ș. Ẅħįŀě șħįmș șěřvě ǻ ŀěģįțįmǻțě p ųřpǿșě, țħěỳ čǻň ǻŀ șǿ bě ųșěđ įň ǻ mǻŀįčįǿ ųș mǻňňě ř. Mǻňđįǻňț\nčǿňșųŀțǻňțș přěvįǿųșŀỳ đįșčųșșěđ șħįm đǻțǻbǻșěș ǻț bǿțħ BřųČǿň ǻňđ BŀǻčķĦǻț.\nȘħįm Đǻțǻbǻ șě Řěģįșțřǻțįǿň\nȚħěřě ǻřě mųŀțįpŀě ẅǻỳș țǿ řěģįșțěř ǻ șħįm đǻțǻbǻșě ǿň ǻ șỳșțěm. Ǿňě țěčħňįq ųě įș țǿ ųșě țħě b ųįŀț-įň\n“șđbįňșț.ěxě ” čǿmmǻň đ ŀįňě țǿǿŀ. Fįģ ųřě 1 đįșpŀǻỳș țħě țẅǿ řěģįșțřỳ ķěỳș čřěǻțěđ ẅħěň ǻ șħįm įș řěģįșțěřěđ ẅįțħ\nțħě “șđbįňșț.ěxě” ųțįŀįțỳ.\nFįģųřě 1: Șħįm đǻțǻbǻșě řěģįșțřỳ ķěỳș\nǾňčě ǻ șħįm đǻțǻbǻșě ħǻș běěň řěģįșțěřěđ ǿň ǻ șỳșțěm, țħě șħįm đǻțǻbǻșě fįŀě (“. șđb” fįŀě ěxțěň șįǿň) ẅįŀŀ bě\nčǿpįěđ țǿ țħě “Č:\\Ẅįň đǿẅș\\ǺppPǻțčħ\\Č ųșțǿm” đįřěčțǿřỳ fǿř 32-bįț șħįmș ǿř\n“Č:\\Ẅįň đǿẅș\\ǺppPǻțčħ\\Č ųșțǿm\\Čųșțǿm64” đįřěčțǿřỳ fǿř 64-bįț șħįmș.\nMǻŀįčįǿųș Șħįm Đǻțǻbǻ șě İňșțǻŀŀǻțįǿň\nȚǿ įňșțǻŀŀ ǻňđ řěģįșțěř țħě mǻŀįčįǿ ųș șħįm đǻțǻbǻșě ǿň ǻ șỳșțěm, FİŇ7 ųșěđ ǻ čųșțǿm Bǻ șě64 ěňčǿđěđ\nPǿẅěřȘħěŀŀ șčřįpț, ẅħįčħ řǻň țħě “ șđbįňșț.ěxě” ųțįŀįțỳ țǿ řěģįșțěř ǻ čųșțǿm șħįm đǻțǻbǻșě fįŀě čǿňțǻįňįňģ ǻ pǻțčħ\nǿňțǿ ǻ șỳșțěm. Fįģ ųřě 2 přǿvįđěș ǻ đěčǿđěđ ěxčěřpț fřǿm ǻ řěčǿvěřěđ FİŇ7 PǿẅěřȘħěŀŀ șčřįpț șħǿẅįňģ țħě\npǻřǻměțěřș fǿř țħįș čǿmmǻň đ.\nFįģųřě 2: Ěxčěřpț fřǿm ǻ FİŇ7 PǿẅěřȘħěŀŀ șčřįpț țǿ įň șțǻŀŀ ǻ čųșțǿm șħįm\nFİŇ7 ųșěđ vǻřįǿųș ňǻmįňģ čǿňvěňțįǿň ș fǿř țħě șħįm đǻțǻbǻșě fįŀěș țħǻț ẅěřě įňșțǻŀŀěđ ǻňđ řěģįșțěřěđ ǿň șỳșțěmș\nẅįțħ țħě “ șđbįňșț.ěxě” ųțįŀįțỳ. Ǻ čǿmmǿň ǿb șěřvǻňčě ẅǻș țħě čřěǻțįǿň ǿf ǻ șħįm đǻțǻbǻșě fįŀě ẅįțħ ǻ “.țmp” fįŀě\něxțěňșįǿň (Fįģ ųřě 3).\nFįģųřě 3: Mǻŀįčįǿ ųș șħįm đǻțǻbǻșě ěxǻmpŀě\nŲpǿň řěģįșțěřįňģ țħě č ųșțǿm șħįm đǻțǻbǻșě ǿň ǻ șỳșțěm, ǻ fįŀě ňǻmě đ ẅįțħ ǻ řǻňđǿm ĢŲİĐ ǻňđ ǻň “.șđb”\něxțěňșįǿň ẅǻș ẅřįțțěň țǿ țħě 64-bįț șħįm đǻțǻbǻșě đěfǻųŀț đįřěčțǿřỳ, ǻș șħǿẅň įň Fįģ ųřě 4. Țħě řěģįșțěřěđ șħįm\nđǻțǻbǻșě fįŀě ħǻ đ țħě șǻmě MĐ 5 ħǻșħ ǻș țħě fįŀě țħǻț ẅǻș įňįțįǻŀŀỳ č řěǻțěđ įň țħě “Č:\\Ẅįň đǿẅș\\Țěmp” đįřěčțǿřỳ.\nFįģųřě 4: Șħįm đǻțǻbǻșě ǻfțěř řěģįșțřǻțįǿň\nİň ǻđđįțįǿň, șpěčįfįč řěģįșțřỳ ķěỳș ẅěřě čřěǻțěđ țħǻț čǿ řřěŀǻțěđ țǿ țħě șħįm đǻțǻbǻșě řěģįșțřǻțįǿň.  Fįģ ųřě 5 șħǿẅș\nțħě ķěỳ ș ǻňđ vǻŀųěș řěŀǻțěđ țǿ țħįș șħįm įňșțǻŀŀǻțįǿň.\nFįģųřě 5: Șħįm đǻțǻbǻșě řěģįșțřỳ ķěỳș\nȚħě đǻțǻbǻșě đěșčřįpțįǿň ųșěđ fǿř țħě șħįm đǻțǻbǻșě řěģįșțřǻțįǿň, “Mįč řǿșǿfț ĶB28320 77” ẅǻș įňțěřěșțįňģ\nběčǻųșě țħįș ĶB ňųmběř ẅǻș ňǿț ǻ p ųbŀįșħěđ Mįčřǿșǿfț Ķňǿ ẅŀěđģě Bǻșě pǻțčħ. Țħį ș đěșčřįpțįǿň (șħǿẅň įň Fįģ ųřě\n6) ǻppěǻ řěđ įň țħě ŀį șțįňģ ǿf įň șțǻŀŀěđ přǿģřǻmș ẅįțħįň țħě Ẅįň đǿẅș Čǿňțřǿŀ Pǻňěŀ ǿň țħě čǿmp řǿmįșěđ șỳșțěm.\nFįģųřě 6: Șħįm đǻțǻbǻșě ǻș ǻň įňșțǻŀŀěđ ǻppŀįčǻțįǿň\nMǻŀįčįǿųș Șħįm Đǻțǻbǻ șě Đěțǻįŀ ș\nĐųřįňģ țħě įňvě șțįģǻțįǿň ș, Mǻňđįǻňț ǿbșěřvěđ țħǻț FİŇ7 ųșěđ ǻ čųșțǿm șħįm đǻțǻbǻșě țǿ pǻțčħ bǿțħ țħě 32-bįț\nǻňđ 64-bįț vě řșįǿňș ǿf “șěřvįčěș.ěxě” ẅįțħ țħěįř ČǺŘBǺ ŇǺĶ pǻỳŀǿǻ đ. Țħįș ǿččųřřěđ ẅħěň țħě “ șěřvįčěș.ěxě”\npřǿčěșș ěxěčųțěđ ǻț șțǻřțųp. Țħě șħįm đǻțǻbǻșě fįŀě čǿňțǻįňě đ șħěŀŀčǿđě fǿř ǻ fįřșț șțǻģě ŀǿǻ đěř țħǻț ǿbțǻįňě đ ǻň\nǻđđįțįǿňǻŀ șħěŀŀčǿđě pǻỳŀǿǻ đ șțǿřěđ įň ǻ řěģįșțřỳ ķěỳ. Țħě șěčǿňđ șțǻģě șħěŀŀčǿđě ŀǻųňčħěđ țħě ČǺŘBǺ ŇǺĶ ĐĿĿ\n(șțǿřěđ įň ǻ řěģįșțřỳ ķěỳ), ẅħįčħ șpǻẅňěđ ǻň įňșțǻňčě ǿf Șě řvįčě Ħǿșț (“șvčħǿșț.ěxě”) ǻň đ įňjěčțěđ įțșěŀf įňțǿ țħǻț\npřǿčěșș.  \nFįģųřě 7 șħǿẅș ǻ pǻřșěđ șħįm đǻțǻbǻșě fįŀě țħǻț ẅǻș ŀěvěřǻģěđ bỳ FİŇ7.\nFįģųřě 7: Pǻřșěđ șħįm đǻțǻbǻșě fįŀě\nFǿř țħě fįřșț șțǻģě ŀǿǻ đěř, țħě pǻțčħ ǿvě řẅřǿțě țħě “ȘčŘěģį șțěřȚČPĚňđpǿįňț” f ųňčțįǿň ǻț řěŀǻțįvě vį řțųǻŀ ǻđđřěșș\n(ŘVǺ) “ 0x0001 407č” ẅįțħįň țħě șěřvįčěș.ěxě přǿčěșș ẅįțħ țħě mǻŀįčįǿ ųș șħěŀŀčǿđě fřǿm țħě șħįm đǻțǻbǻșě fįŀě. \nȚħě ňěẅ “ȘčŘěģį șțěřȚČPĚňđpǿįňț” f ųňčțįǿň ( șħěŀŀčǿđě) čǿňțǻįňě đ ǻ řěfěřěňčě țǿ țħě pǻțħ ǿf\n“\\ŘĚĢİȘȚŘỲ\\MǺČ ĦİŇĚ \\ȘǾFȚẄǺŘ Ě\\Mįčřǿșǿfț\\ĐŘM”, ẅħįčħ įș ǻ řěģįșțřỳ ŀǿčǻțįǿň ẅħěřě ǻđđįțįǿňǻŀ mǻŀįčįǿ ųș\nșħěŀŀčǿđě ǻňđ țħě ČǺŘBǺ ŇǺĶ ĐĿĿ pǻỳŀǿǻ đ ẅǻș șțǿřěđ ǿň țħě șỳșțěm.\nFįģųřě 8 přǿvįđěș ǻň ěxčě řpț ǿf țħě pǻ řșěđ pǻțčħ șțřųčțųřě ẅįțħįň țħě řěčǿvěřěđ șħįm đǻțǻbǻșě fįŀě.\nFįģųřě 8: Pǻřșěđ pǻțčħ șțřųčțųřě fřǿm țħě șħįm đǻțǻbǻșě fįŀě\nȚħě șħěŀŀčǿđě șțǿřěđ ẅįțħįň țħě řěģįșțřỳ pǻțħ “ ĦĶĿM\\ȘǾFȚẄǺŘ Ě\\Mįčřǿșǿfț\\ĐŘM” ųșěđ țħě ǺP İ fųňčțįǿň\n“ŘțŀĐěčǿmp řěșșBųffěř” țǿ đěčǿmpřěșș țħě pǻỳŀǿǻ đ. İț țħěň șŀěpț fǿř fǿųř mįňųțěș běfǿřě čǻŀŀįňģ țħě ČǺŘBǺ ŇǺĶ\nĐĿĿ pǻỳŀǿǻ đ'ș ěňțřỳ pǿįňț ǿň țħě șỳșțěm. Ǿňčě ŀǿǻ đěđ įň měmǿ řỳ, įț čřěǻțěđ ǻ ňěẅ přǿčěșș ňǻměđ\n“șvčħǿșț.ěxě” țħǻț čǿňțǻįňě đ țħě ČǺŘBǺ ŇǺĶ ĐĿĿ. \nBřįňģįňģ įț Țǿģěțħě ř\nFįģųřě 9 přǿvįđěș ǻ ħįģħ-ŀěvěŀ ǿvě řvįěẅ ǿf ǻ șħįm đǻțǻbǻșě běįňģ ŀěvě řǻģěđ ǻș ǻ pěřșįșțěňț měčħǻňį șm fǿř\nųțįŀįżįňģ ǻň įň-měmǿ řỳ pǻțčħ, įňjěčțįňģ șħěŀŀčǿđě įňțǿ țħě 64-bįț vě řșįǿň ǿf “ șěřvįčěș.ěxě”.\nFįģųřě 9: Șħįm đǻțǻbǻșě čǿđě įňjěčțįǿň p řǿčěșș\nĐěțěčțįǿň\nMǻňđįǻňț řěčǿmměň đș țħě fǿŀŀǿ ẅįňģ țǿ đěțěčț mǻŀįčįǿ ųș ǻppŀįčǻțįǿň șħįmmįňģ įň ǻň ěňvį řǿňměňț:\n1. Mǿňįțǿř fǿř ňěẅ șħįm đǻțǻbǻșě fįŀěș čřěǻțěđ įň țħě đěfǻųŀț șħįm đǻțǻbǻșě đįřěčțǿřįěș ǿf\n“Č:\\Ẅįň đǿẅș\\ǺppPǻțčħ\\Č ųșțǿm” ǻň đ “Č:\\Ẅįň đǿẅș\\ǺppPǻțčħ\\Č ųșțǿm\\Čųșțǿm64”\n2. Mǿňįțǿř fǿř řěģįșțřỳ ķěỳ čřěǻțįǿň ǻň đ/ǿř mǿđįfįčǻțįǿň ěvěňț ș fǿř țħě ķěỳ ș ǿf\n“ĦĶĿM\\ȘǾFȚẄǺŘ Ě\\Mįčřǿșǿfț\\Ẅįň đǿẅș ŇȚ\\ČųřřěňțVěřșįǿň\\ǺppČǿmpǻțFŀǻģ ș\\Čųșțǿm” ǻň đ\n“ĦĶĿM\\ȘǾFȚẄǺŘ Ě\\Mįčřǿșǿfț\\Ẅįň đǿẅș ŇȚ\\ČųřřěňțVěřșįǿň\\ǺppČǿmpǻțFŀǻģ ș\\İňșțǻŀŀěđȘĐB”\n3. Mǿňįțǿř přǿčěșș ěxěčųțįǿň ěvěňț ș ǻňđ čǿmmǻň đ ŀįňě ǻřģųměňțș fǿř mǻŀįčįǿ ųș ųșě ǿf țħě “ șđbįňșț.ěxě” ųțįŀįțỳ  \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n17 Mǻř 2020\n16 Mǻř 2020\n09 Mǻř 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐ\n Fįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nȘįx Fǻčț ș ǻbǿųț Ǻđđřěșș Șpǻčě\nĿǻỳǿųț Řǻňđǿmįżǻțįǿň ǿň\nẄįňđǿẅș \nȚħěỳ Čǿmě įň țħě Ňįģħț:\nŘǻňșǿmẅǻřě Đěpŀǿỳměňț Ț řěňđș \nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  Țǿ ȘĐB, Ǿ ř Ňǿț Țǿ ȘĐB: F İŇ7 Ŀěvě řǻģįňģ Șħįm Đǻțǻbǻ...   \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě Ěňģŀįșħ\nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n "
}