{
    "title": "triton actor ttp profile_ custom attack tools_ detections_ and att_ck mapping _ fireeye inc",
    "text": " PŘĚVİǾŲȘ PǾȘȚ ŇĚXȚ PǾȘȚȚħřěǻț Řěșěǻřčħ\nȚŘİȚǾŇ Ǻčțǿř ȚȚP Přǿfįŀě, Čųșțǿm Ǻțțǻčķ Țǿǿŀ ș,\nĐěțěčțįǿň ș, ǻňđ ǺȚȚ&ČĶ Mǻppįňģ\nǺpřįŀ 10, 2019  | bỳ Șțěvě Mįŀŀě ř, Ňǻțħǻň B řųbǻķěř, Đǻňįěŀ Ķǻpěŀŀmǻňň Żǻf řǻ, Đǻň Čǻbǻň\nMǺĿẄǺŘ Ě \nȚȚPȘ  \nİČȘ ȘĚČŲŘİȚỲ\nǾvěřvįěẅ\nFįřěĚỳě čǻň ňǿ ẅ čǿňfįřm țħǻț ẅě ħǻvě ųňčǿvěřěđ ǻňđ ǻřě řěșpǿňđįňģ țǿ ǻň ǻđđįțįǿňǻŀ įňț řųșįǿň bỳ țħě ǻțțǻčķě ř\nběħįňđ ȚŘİȚǾŇ ǻț ǻ đįffěřěňț čřįțįčǻŀ įňf řǻșțřųčțųřě fǻčįŀįțỳ .\nİň Đěčěmbě ř 2017, FįřěĚỳě pųbŀįčŀỳ řěŀěǻșěđ ǿųř fįřșț ǻňǻŀỳșįș ǿň țħě ȚŘİȚǾŇ ǻțțǻčķ  ẅħěřě mǻŀįčįǿ ųș ǻčțǿřș ųșěđ\nțħě ȚŘİȚǾŇ čųșțǿm ǻțțǻčķ f řǻměẅǿřķ țǿ mǻňįp ųŀǻțě įňđųșțřįǻŀ șǻfěțỳ șỳșțěmș ǻț ǻ čřįțįčǻŀ įňf řǻșțřųčțųřě fǻčįŀįțỳ\nǻňđ įňǻđvěřțěňțŀỳ čǻ ųșěđ ǻ přǿčěșș șħųțđǿẅň. İň șųbșěqųěňț řěșěǻřčħ ẅě ěxǻmįňě đ ħǿẅ țħě ǻțțǻčķě řș mǻỳ\nħǻvě ģǻįňě đ ǻččěșș țǿ čřįțįčǻŀ čǿmpǿňěňț ș ňěěđěđ țǿ bųįŀđ țħě ȚŘ İȚǾŇ ǻțțǻčķ f řǻměẅǿřķ. İň ǿųř mǿșț řěčěňț\nǻňǻŀỳșįș, ẅě ǻțțřįbųțěđ țħě įňțřųșįǿň ǻčțįvįțỳ țħǻț ŀě đ țǿ țħě đěpŀǿỳměňț ǿf ȚŘ İȚǾŇ țǿ ǻ Řųșșįǻň ģǿvě řňměňț-\nǿẅňěđ țěčħňįčǻŀ řěșěǻřčħ įňșțįțųțě įň Mǿ șčǿẅ.\nȚħě ȚŘİȚǾŇ įňțřųșįǿň įș șħřǿųđěđ įň mỳșțěřỳ. Țħěřě ħǻș běěň șǿmě pųbŀįč đįșčųșșįǿň șųřřǿųňđįňģ țħě ȚŘ İȚǾŇ\nfřǻměẅǿřķ ǻňđ įțș įmpǻčț ǻț țħě țǻ řģěț șįțě, ỳěț ŀįțțŀě țǿ ňǿ įňfǿ řmǻțįǿň ħǻ ș běěň șħǻřěđ ǿň țħě țǻčțįč ș,\nțěčħňįq ųěș, ǻňđ přǿčěđųřěș (ȚȚPș) řěŀǻțěđ țǿ țħě įňț řųșįǿň ŀįfěčỳčŀě, ǿ ř ħǿẅ țħě ǻțțǻčķ mǻ đě įț đěěp ěňǿ ųģħ țǿ\nįmpǻčț țħě įň đųșțřįǻŀ přǿčěșșěș. Țħě ȚŘ İȚǾŇ fřǻměẅǿřķ įțșěŀf ǻňđ țħě įňțřųșįǿň țǿǿŀ ș țħě ǻčțǿ ř ųșěđ ẅěřě bųįŀț\nǻňđ đěpŀǿỳěđ bỳ ħųmǻňș, ǻŀŀ ǿf ẅħǿm ħǻ đ ǿbșěřvǻbŀě ħ ųmǻň șțřǻțěģįěș, přěfěřěňčěș, ǻňđ čǿňvěňțįǿň ș fǿř țħě\nčųșțǿm țǿǿŀįňģ ǿf țħě įňț řųșįǿň ǿpě řǻțįǿň. İț įș ǿųř ģǿǻŀ țǿ đįșčųșș țħěșě ǻđvěřșǻřỳ měțħǿ đș ǻňđ ħįģħŀįģħț ěxǻčțŀỳ\nħǿẅ țħě đěvěŀǿpě ř(ș), ǿpěřǻțǿř(ș) ǻňđ ǿțħěřș įňvǿŀvě đ ųșěđ čųșțǿm țǿǿŀ ș įň țħě įňț řųșįǿň.\nİň țħįș řěpǿřț ẅě čǿňțįň ųě ǿųř řěșěǻřčħ ǿf țħě ǻčțǿ ř’ș ǿpěřǻțįǿňș ẅįțħ ǻ șpěčįfįč fǿč ųș ǿň ǻ șěŀěčțįǿň ǿf č ųșțǿm\nįňfǿřmǻțįǿň țěčħňǿŀǿģỳ ( İȚ) țǿǿŀș ǻňđ țǻčțįčș țħě țħřěǻț ǻčțǿ ř ŀěvěřǻģěđ đųřįňģ țħě ěǻ řŀỳ șțǻģěș ǿf țħě țǻ řģěțěđ\nǻțțǻčķ ŀįfěčỳčŀě (Fįģ ųřě 1). Țħě įňfǿ řmǻțįǿň įň țħį ș řěpǿřț įș đěřįvěđ fřǿm mųŀțįpŀě ȚŘ İȚǾŇ-řěŀǻțěđ įňčįđěňț\nřěșpǿňșěș čǻřřįěđ ǿųț bỳ FįřěĚỳě Mǻň đįǻňț.\nŲșįňģ țħě měțħǿ đǿŀǿģįěș đěșčřįběđ įň țħįș pǿșț, FįřěĚỳě Mǻň đįǻňț įňčį đěňț řěșpǿňđěřș ħǻvě ųňčǿvěřěđ\nǻđđįțįǿňǻŀ įňț řųșįǿň ǻčțįvįțỳ f řǿm țħįș țħřěǻț ǻčțǿ ř – įňčŀųđįňģ ňěẅ čųșțǿm țǿǿŀ șěțș – ǻț ǻ șěčǿňđ čřįțįčǻŀ\nįňfřǻșțřųčțųřě fǻčįŀįțỳ. Ǻ ș șųčħ, ẅě șțřǿňģŀỳ ěňčǿ ųřǻģě įňđųșțřįǻŀ čǿňț řǿŀ șỳșțěm (İČȘ) ǻșșěț ǿẅňěřș țǿ ŀěvě řǻģě\nțħě įňđįčǻțǿřș, ȚȚPș, ǻňđ đěțěčțįǿň ș įňčŀųđěđ įň țħįș pǿșț țǿ įmp řǿvě țħěį ř đěfěňșěș ǻňđ ħųňț fǿř řěŀǻțěđ ǻčțįvįțỳ\nįň țħěįř ňěțẅǿřķș.\nFǿř İȚ ǻňđ ǿpěřǻțįǿňǻŀ țěčħňǿŀǿģỳ (ǾȚ) įňčį đěňț řěșpǿňșě șųppǿřț, pŀěǻșě čǿňțǻčț FįřěĚỳě Mǻň đįǻňț. Fǿř mǿřě\nįň-đěpțħ ǻňǻŀỳ șįș ǿf ȚŘİȚǾŇ ǻňđ ǿțħěř čỳběř țħřěǻțș, čǿňșįđěř șųbșčřįbįňģ țǿ FįřěĚỳě Čỳbě ř Țħřěǻț İňțěŀŀįģěňčě .\nFįřěĚỳě’ș ȘmǻřțVįșįǿň țěčħňǿŀǿģỳ, ẅħįčħ șěǻřčħěș fǿř ǻțțǻčķě řș đųřįňģ ŀǻțě řǻŀ mǿvěměňț ǻčțįvįțįě ș bỳ mǿňįțǿ řįňģ\něǻșț-ẅěșț țřǻffįč įň İȚ ǻňđ ǾȚ ňěț ẅǿřķș, řěđųčěș țħě řįșķ ǿf ǻň ǻțțǻčķ řěǻčħįňģ șěňșįțįvě İČȘ přǿčěșșěș. Țħįș įș\npǻřțįčųŀǻřŀỳ řěŀěvǻňț fǿ ř șǿpħįșțįčǻțěđ İČȘ-řěŀǻțěđ įňțřųșįǿňș ǻș ǻțțǻčķě řș țỳpįčǻŀŀỳ mǿvě f řǿm čǿřpǿřǻțě İȚ țǿ ǾȚ\nňěțẅǿřķș țħřǿųģħ șỳșțěmș țħǻț ǻřě ǻččěșșįbŀě țǿ bǿțħ ěňvį řǿňměňț ș, fǻř běỳǿňđ pěřįměțěř đěfěňșěș.\nČǿňțěňț ș\nȚǿǿŀș ǻňđ ȚȚPș\nĦųňțįňģ fǿ ř İČȘ-fǿčųșěđ țħřěǻț ǻčțǿ řș ǻčřǿșș İȚ ǻňđ ǾȚ\nMěțħǿđǿŀǿģỳ ǻň đ đįșčǿvěřỳ șțřǻțěģįěș\nǺppěňđįx Ǻ: Đįșčǿvěřỳ Řųŀěș\nǺppěňđįx B: Țěčħňįčǻŀ Ǻňǻŀỳ șįș ǿf Čųșțǿm Ǻțțǻčķ Țǿǿŀ ș\nǺppěňđįx Č: MİȚŘĚ ǺȚȚ&ČĶ JȘǾ Ň Řǻẅ Đǻțǻ\nİňđįčǻțǿřș ǿf Čǿmp řǿmįșě\nFįģųřě 1: Țħě Fį řěĚỳě țǻřģěțěđ ǻțțǻčķ ŀįfěčỳčŀě\nǺčțǿř Ŀěvěřǻģěđ ǻ Vǻřįěțỳ ǿf Č ųșțǿm ǻňđ Čǿmmǿ đįțỳ İňțřųșįǿň Țǿǿŀ ș\nȚħřǿųģħǿųț țħě țǻ řģěțěđ ǻțțǻčķ ŀįfěčỳčŀě, țħě ǻčțǿ ř ŀěvěřǻģěđ đǿżěňș ǿf čųșțǿm ǻň đ čǿmmǿ đįțỳ įňțřųșįǿň țǿǿŀ ș\nțǿ ģǻįň ǻň đ mǻįňțǻįň ǻččě șș țǿ țħě țǻ řģěț'ș İȚ ǻňđ ǾȚ ňěț ẅǿřķș. Ǻ șěŀěčțįǿň ǿf țħě č ųșțǿm țǿǿŀ ș țħǻț Fį řěĚỳě\nMǻňđįǻňț řěčǿvěřěđ ǻřě ŀįșțěđ ŀǻțěř įň țħįș pǿșț įň Țǻbŀě 1, ǻňđ ħǻșħěș ǻřě ŀįșțěđ įň Țǻbŀě 2 ǻț țħě ěň đ ǿf țħįș pǿșț.\nĐįșčǿvěřỳ řųŀěș fǿř ǻňđ țěčħňįčǻŀ ǻňǻŀỳ șįș ǿf țħěșě țǿǿŀș, ǻș ẅěŀŀ ǻș MİȚŘĚ ǺȚȚ&ČĶ JȘǾ Ň řǻẅ đǻțǻ, įș ǻvǻįŀǻbŀě įň\nǺppěňđįx Ǻ, Ǻppěň đįx B, ǻň đ Ǻppěň đįx Č.\nFįģųřě 2: Șěŀěčțįǿň ǿf č ųșțǿm țǿǿŀ ș ųșěđ bỳ țħě ǻčțǿ ř\nȚħě ǻčțǿ ř'ș čųșțǿm țǿǿŀ ș fřěqųěňțŀỳ mį řřǿřěđ țħě fųňčțįǿňǻŀįțỳ ǿf čǿmmǿ đįțỳ țǿǿŀș ǻňđ ǻppěǻř țǿ bě đěvěŀǿpě đ\nẅįțħ ǻ fǿč ųș ǿň ǻňțį-vį řųș ěvǻșįǿň. Țħě ģ řǿųp ǿfțěň ŀěvě řǻģěđ čųșțǿm țǿǿŀ ș ẅħěň țħěỳ ǻppěǻ řěđ țǿ bě\nșțřųģģŀįňģ ẅįțħ ǻňțį-vį řųș đěțěčțįǿň ǿ ř ẅěřě ǻț ǻ č řįțįčǻŀ pħǻ șě įň țħě įňț řųșįǿň (ě.ģ., țħěỳ șẅįțčħěđ țǿ čųșțǿm\nbǻčķđǿǿřș įň İȚ ǻňđ ǾȚ ĐMŻ řįģħț běfǿ řě ģǻįňįňģ ǻččě șș țǿ țħě ěňģįňěě řįňģ ẅǿřķșțǻțįǿň). İň șǿmě įňșțǻňčěș, țħě\nǻčțǿř ŀěvěřǻģěđ čųșțǿm ǻň đ čǿmmǿ đįțỳ țǿǿŀș fǿř țħě șǻmě fųňčțįǿň. Fǿ ř ěxǻmpŀě, țħěỳ ųșěđ Mįmįķǻț ż (pųbŀįč)\nǻňđ ȘěčĦǻčķ (čųșțǿm) fǿ ř čřěđěňțįǻŀ ħǻ řvěșțįňģ; bǿțħ țǿǿŀ ș přǿvįđě ǻ věřỳ șįmįŀǻř ǿųțpųț (Fįģųřě 2).\nFįģųřě 3: Đěfǻųŀț ǿųțpųțș fǿř Mįmįķǻț ż (ŀěfț) ǻň đ ȘěčĦǻčķ (řįģħț)\nȚǿǿŀș ǻňđ ȚȚPș İňđįčǻțě ǻ Đěěp İňțěřěșț įň Ěňșųřįňģ Přǿŀǿňģěđ ǻňđ Pěřșįșțěňț\nǺččěșș țǿ țħě Țǻ řģěț Ěňvįřǿňměňț\nȚħě țǻřģěțěđ ǻțțǻčķ ŀįfěčỳčŀě ǿf ǻ șǿpħįșțįčǻțěđ İČȘ ǻțțǻčķ į ș ǿfțěň měǻ șųřěđ įň ỳěǻřș. Ǻțțǻčķě řș řěqųįřě ǻ ŀǿňģ\nțįmě țǿ p řěpǻřě fǿř șųčħ ǻň ǻțțǻčķ įň ǿ řđěř țǿ ŀěǻřň ǻbǿųț țħě țǻ řģěț’ș įňđųșțřįǻŀ přǿčěșșěș ǻňđ bųįŀđ čųșțǿm\nțǿǿŀș. Țħěșě ǻțțǻčķ ș ǻřě ǻŀșǿ ǿfțěň čǻ řřįěđ ǿųț bỳ ňǻțįǿň șțǻțěș țħǻț mǻỳ bě įňțě řěșțěđ įň přěpǻřįňģ fǿř\nčǿňțįňģěňčỳ ǿpě řǻțįǿňș řǻțħěř țħǻň čǿň đųčțįňģ ǻň įmmě đįǻțě ǻțțǻčķ (ě.ģ., įň șțǻŀŀįňģ mǻŀ ẅǻřě ŀįķě ȚŘ İȚǾŇ ǻňđ\nẅǻįțįňģ fǿ ř țħě řįģħț țįmě țǿ ųșě įț). Đųřįňģ țħįș țįmě, țħě ǻțțǻčķě ř mųșț ěňșųřě čǿňțįň ųěđ ǻččěșș țǿ țħě țǻ řģěț\něňvįřǿňměňț ǿ ř řįșķ ŀǿșįňģ ỳěǻ řș ǿf ěffǿ řț ǻňđ pǿțěňțįǻŀŀỳ ěxpěň șįvě čųșțǿm İČȘ mǻŀẅǻřě. Țħįș ǻțțǻčķ ẅǻș ňǿ\něxčěpțįǿň. Țħě ǻčțǿ ř ẅǻș přěșěňț įň țħě țǻ řģěț ňěț ẅǿřķș fǿř ǻŀmǿșț ǻ ỳěǻř běfǿřě ģǻįňįňģ ǻččě șș țǿ țħě Șǻfěțỳ\nİňșțřųměňțěđ Șỳșțěm (ȘİȘ) ěňģįňěě řįňģ ẅǿřķșțǻțįǿň. Țħ řǿųģħǿųț țħǻț pě řįǿđ, țħěỳ ǻppěǻ řěđ țǿ přįǿřįțįżě\nǿpěřǻțįǿňǻŀ șěčųřįțỳ.\nǺfțěř ěșțǻbŀįșħįňģ ǻň įňįțįǻŀ fǿǿțħǿŀ đ ǿň țħě čǿ řpǿřǻțě ňěț ẅǿřķ, țħě ȚŘ İȚǾŇ ǻčțǿř fǿčųșěđ mǿșț ǿf țħěį ř ěffǿřț ǿň\nģǻįňįňģ ǻččě șș țǿ țħě ǾȚ ňěț ẅǿřķ. Țħěỳ đįđ ňǿț ěxħįbįț ǻčțįvįțįě ș čǿmmǿňŀỳ ǻ șșǿčįǻțěđ ẅįțħ ěșpįǿňǻģě, șųčħ ǻș\nųșįňģ ķěỳ ŀǿģģě řș ǻňđ șčřěěňșħǿț ģřǻbběřș, břǿẅșįňģ fįŀěș, ǻňđ/ǿř ěxfįŀțřǻțįňģ ŀǻ řģě ǻmǿ ųňțș ǿf įňfǿřmǻțįǿň. Mǿ șț\nǿf țħě ǻțțǻčķ țǿǿŀ ș țħěỳ ųșěđ ẅěřě fǿčųșěđ ǿň ňěț ẅǿřķ řěčǿňňǻį șșǻňčě, ŀǻțě řǻŀ mǿvěměňț, ǻň đ mǻįňțǻįňįňģ\npřěșěňčě įň țħě țǻ řģěț ěňvį řǿňměňț.\nȚħě ǻčțǿ ř ųșěđ mųŀțįpŀě țěčħňįq ųěș țǿ ħįđě țħěįř ǻčțįvįțįě ș, čǿvěř țħěįř țřǻčķș, ǻňđ đěțěř fǿřěňșįč ěxǻmįňǻțįǿň ǿf\nțħěįř țǿǿŀș ǻňđ ǻčțįvįțįě ș.\nȚħěỳ řěňǻměđ țħěįř fįŀěș țǿ mǻķě țħěm ŀǿǿķ ŀįķě ŀěģįțįmǻțě fįŀě ș, fǿř ěxǻmpŀě, ĶB77 846376.ěxě, ňǻmě đ ǻfțěř\nMįčřǿșǿfț ųpđǻțě fįŀěș.\nȚħěỳ řǿųțįňěŀỳ ųșěđ șțǻňđǻřđ țǿǿŀș țħǻț ẅǿųŀđ mįmįč ŀěģįțįmǻțě ǻ đmįňįșțřǻțǿř ǻčțįvįțįě ș. Țħįș įňčŀųđěđ ħěǻvỳ\nųșě ǿf ŘĐP ǻň đ PșĚxěč/ẄįňŘM.\nẄħěň pŀǻňțįňģ ẅěbșħěŀŀș ǿň țħě Ǿ ųțŀǿǿķ Ěxčħǻňģě șěřvěřș, țħěỳ mǿ đįfįěđ ǻŀřěǻđỳ ěxįșțįňģ ŀěģįțįmǻțě\nfŀǿģǿň.j ș ǻňđ ŀǿģǿff.ǻ șpx fįŀěș.\nȚħěỳ řěŀįěđ ǿň ěňč řỳpțěđ ȘȘĦ-bǻșěđ țųňňěŀș țǿ țřǻňșfěř țǿǿŀș ǻňđ fǿř řěmǿțě čǿmmǻň đ/přǿģřǻm\něxěčųțįǿň.\nȚħěỳ ųșěđ mųŀțįpŀě șțǻģįňģ fǿŀ đěřș ǻňđ ǿpțěđ țǿ ųșě đįřěčțǿřįěș țħǻț ẅěřě ųșěđ įňfřěqųěňțŀỳ bỳ ŀěģįțįmǻțě\nųșěřș ǿř přǿčěșșěș.\nȚħěỳ řǿųțįňěŀỳ đěŀěțěđ đřǿppěđ ǻțțǻčķ țǿǿŀ ș, ěxěčųțįǿň ŀǿģ ș, fįŀěș șțǻģěđ fǿř ěxfįŀțřǻțįǿň, ǻň đ ǿțħěř fįŀěș ǻfțěř\nțħěỳ ẅěřě fįňįșħěđ ẅįțħ țħěm.\nȚħěỳ řěňǻměđ țħěįř țǿǿŀș' fįŀěňǻmě ș įň țħě șțǻģįňģ fǿŀ đěř șǿ țħǻț įț ẅǿųŀđ ňǿț bě pǿ șșįbŀě țǿ į đěňțįfỳ țħě\nmǻŀẅǻřě'ș pųřpǿșě, ěvěň ǻfțě ř įț ẅǻș đěŀěțěđ fřǿm țħě đįșķ țħřǿųģħ țħě řěșįđųǻŀ ǻřțįfǻčțș (ě.ģ., ȘħįmČǻčħě\něňțřįěș ǿř ẄMİ Řěčěňțŀỳ Ų șěđ Ǻppș).\nȚħěỳ ųșěđ țįměșțǿmpįňģ țǿ mǿ đįfỳ țħě $ȘȚǺŇĐǺŘĐ_ İŇFǾŘMǺȚ İǾŇ ǻțțřįbųțě ǿf țħě ǻțțǻčķ țǿǿŀ ș.\nǾňčě țħě ǻčțǿ ř ģǻįňěđ ǻččěșș țǿ țħě țǻ řģěțěđ ȘİȘ čǿňțřǿŀŀěřș, țħěỳ ǻppěǻ řěđ țǿ fǿčųș șǿŀěŀỳ ǿň mǻįňțǻįňįňģ\nǻččěșș ẅħįŀě ǻțțěmpțįňģ țǿ șųččěșșfųŀŀỳ đěpŀǿỳ ȚŘ İȚǾŇ. Țħįș įňvǿŀvě đ șțřǻțěģįčǻŀŀỳ ŀįmįțįňģ țħěį ř ǻčțįvįțįě ș țǿ\nmįțįģǻțě țħě řįșķ ǿf běįňģ đįșčǿvěřěđ.\nȚħě ǻčțǿ ř ģǻįňěđ ǻ fǿǿțħǿŀ đ ǿň țħě đįșțřįbųțěđ čǿňțřǿŀ șỳșțěm (ĐČȘ) b ųț đįđ ňǿț ŀěvě řǻģě țħǻț ǻččě șș țǿ\nŀěǻřň ǻbǿųț pŀǻňț ǿpě řǻțįǿňș, ěxfįŀțřǻțě șěňșįțįvě įňfǿ řmǻțįǿň, țǻmpě ř ẅįțħ țħě ĐČȘ čǿňț řǿŀŀěřș, ǿř mǻňįpųŀǻțě\nțħě přǿčěșș.\nȚħěỳ țħěň ģǻįňě đ ǻččěșș țǿ ǻň Ș İȘ ěňģįňěě řįňģ ẅǿřķșțǻțįǿň. F řǿm țħįș pǿįňț fǿ řẅǻřđ, țħěỳ fǿč ųșěđ mǿșț ǿf\nțħěįř ěffǿřț ǿň đěŀįvěřįňģ ǻňđ řěfįňįňģ ǻ bǻčķ đǿǿř pǻỳŀǿǻ đ ųșįňģ țħě ȚŘ İȚǾŇ ǻțțǻčķ f řǻměẅǿřķ.\nȚħěỳ ǻțțěmpțě đ țǿ řěđųčě țħě čħǻňčě ǿf běįňģ ǿb șěřvěđ đųřįňģ ħįģħě ř-řįșķ ǻčțįvįțįě ș bỳ įňțě řǻčțįňģ ẅįțħ\nțǻřģěț čǿňț řǿŀŀěřș đųřįňģ ǿff-ħǿ ųř țįměș. Țħįș ẅǿųŀđ ěňșųřě fěẅěř ẅǿřķěřș ẅěřě ǿň șįțě țǿ řěǻčț țǿ pǿțěňțįǻŀ\nǻŀǻřmș čǻųșěđ bỳ čǿňț řǿŀŀěř mǻňįpųŀǻțįǿň.\nȚħěỳ řěňǻměđ țħěįř fįŀěș țǿ mǻķě țħěm ŀǿǿķ ŀįķě ŀěģįțįmǻțě fįŀě ș, fǿř ěxǻmpŀě, ț řįŀǿģ.ěxě, ňǻmě đ ǻfțěř ǻ\nŀěģįțįmǻțě Șčħňěį đěř Ěŀěčțřįč ǻppŀįčǻțįǿň.\nǾpěřǻțįǿňǻŀ Șįňčě Ǻț Ŀěǻ șț 2014\nBǻșěđ ǿň ǻňǻŀỳ șįș ǿf țħě ǻčțǿ ř’ș čųșțǿm įňț řųșįǿň țǿǿŀ ș, țħě ģřǿųp ħǻș běěň ǿpě řǻțįňģ șįňčě ǻș ěǻřŀỳ ǻș 2014. İț įș\nẅǿřțħ ňǿțįňģ țħǻț Fį řěĚỳě ħǻđ ňěvěř běfǿřě ěňčǿųňțěřěđ ǻňỳ ǿf țħě ǻčțǿ ř'ș čųșțǿm țǿǿŀ ș, đěșpįțě țħě fǻčț țħǻț\nmǻňỳ ǿf țħěm đǻțě țǿ șěvěřǻŀ ỳěǻřș běfǿřě țħě įňįțįǻŀ čǿmp řǿmįșě. Țħįș fǻčț ǻň đ țħě ǻčțǿ ř'ș đěmǿňșțřǻțěđ\nįňțěřěșț įň ǿpě řǻțįǿňǻŀ șěčųřįțỳ șųģģěșțș țħěřě mǻỳ bě ǿțħě ř țǻřģěț ěňvį řǿňměňț ș – běỳǿň đ țħě șěčǿňđ įňțřųșįǿň\nǻňňǿųňčěđ įň țħįș bŀǿģ pǿ șț – ẅħěřě țħě ǻčțǿ ř ẅǻș ǿř șțįŀŀ įș přěșěňț.\nǺ șǻmpŀě ǿf ǻ Č řỳpțčǻț-bǻ șěđ bǻčķđǿǿř ųșěđ țǿ ěșțǻbŀįșħ țħě įňįțįǻŀ fǿǿțħǿŀ đ ẅǻș řěčǿvěřěđ đųřįňģ țħě\nįňvěșțįģǻțįǿň; țħě șǻmpŀě ẅǻș čǿmpįŀě đ ǻňđ ųpŀǿǻđěđ țǿ ǻ mǻŀ ẅǻřě țěșțįňģ ěňvį řǿňměňț bỳ țħě ǻčțǿ ř įň\n2014.\nČřỳpțčǻț- ǻň đ PĿİŇĶ-bǻșěđ bǻčķđǿǿřș ẅěřě șčħěđųŀěđ țǿ ěxěč ųțě đǻįŀỳ șțǻřțįňģ fřǿm Ǻpřįŀ 28, 2014, ųșįňģ\nPřǿģřǻmĐǻțǻŲp đǻțěř ǻňđ ŇěțẅǿřķǺččěșșPřǿțěčțįǿňŲp đǻțěĐB țǻ șķș. Țħįș đǻțě įș ųňřěŀǻțěđ țǿ țħě ǿb șěřvěđ\nįňțřųșįǿň țįměŀįňě ǻň đ mǻỳ įň đįčǻțě țħě đǻțě țħě țħ řěǻț ǻčțǿ řș fįřșț čřěǻțěđ țħěșě pěřșįșțěňčě měčħǻňį șmș.\nŇěțĚxěč.ěxě, ǻ č ųșțǿm ŀǻțě řǻŀ mǿvěměňț ǻň đ řěmǿțě čǿmmǻň đ ěxěčųțįǿň țǿǿŀ, į ș șěŀf-țįțŀěđ \"ŇěțĚxěč 2014\nbỳ ǾȘǺ.\"\nȘěčĦǻčķ.ěxě \"bỳ ǾȘǺ,\" ǻ č ųșțǿm čřěđěňțįǻŀ ħǻ řvěșțįňģ ǻňđ řěčǿňňǻį șșǻňčě țǿǿŀ, ẅǻș čǿmpįŀě đ ǿň Ǿčț. 23,\n2014.\nȚħě ǻțțǻčķě řș ųșěđ ǻ pįřǻțěđ věřșįǿň ǿf Ẅįį.ěxě, ǻ p ųbŀįč fįŀě įň đěxįňģ țǿǿŀ țħǻț čǻmě ẅįțħ ǻ ŀįčěň șě fřǿm\n2010  ǻňđ ħǻș ňǿț běěň ųpđǻțěđ șįňčě 2014.\nİČȘ Ǻșșěț Ǿẅňěřș Șħǿųŀđ Přįǿřįțįżě Đěțěčțįǿň ǻň đ Đěfěňșě Ǻčřǿșș Ẅįňđǿẅș\nȘỳșțěmș įň Bǿțħ İȚ ǻňđ ǾȚ\nMǿșț șǿpħįșțįčǻțěđ İČȘ ǻțțǻčķ ș ŀěvěřǻģěđ Ẅįňđǿẅș, Ŀįňųx, ǻňđ ǿțħěř țřǻđįțįǿňǻŀŀỳ \" İȚ\" șỳșțěmș (ŀǿčǻțě đ įň ěįțħě ř\nİȚ ǿř ǾȚ ňěț ẅǿřķș) ǻș ǻ čǿňđųįț țǿ țħě ųŀțįmǻțě țǻ řģěț. Șǿmě ěxǻmpŀě ș įňčŀųđě ŀěvěřǻģįňģ čǿmp ųțěřș țǿ ģǻįň\nǻččěșș țǿ țǻřģěțěđ PĿČș (ě.ģ., Șț ųxňěț), įňțě řǻčțįňģ đįřěčțŀỳ ẅįțħ įňțěřňěț-čǿňňěčțě đ ħųmǻň mǻčħįňě įňțě řfǻčěș\n(ĦMİș) (ě.ģ., Bŀǻčķ Ěňěřģỳ), ǻňđ ģǻįňįňģ řěmǿțě ǻččě șș țǿ ǻň ěňģįňěě řįňģ șțǻțįǿň țǿ mǻňįp ųŀǻțě ǻ řěmǿțě țě řmįňǻŀ\nųňįț (ŘȚŲ) (ě.ģ., İŇĐŲȘȚŘǾỲ ĚŘ) ǿř įňfěčț Ș İȘ přǿģřǻmmǻbŀě ŀǿģįč čǿňț řǿŀŀěřș (PĿČ) (ě.ģ., ȚŘ İȚǾŇ).\nĐěfěňđěřș ẅħǿ fǿčųș ǿň șțǿppįňģ ǻň ǻțțǻčķě ř įň țħěșě \"čǿňđųįț\" șỳșțěmș běňěfįț f řǿm ǻ ňųmběř ǿf ķěỳ\nǻđvǻňțǻģě ș. Țħěșě ǻđvǻňțǻģě ș ẅįŀŀ ǿňŀỳ ģ řǿẅ ǻș İȚ ǻňđ ǾȚ șỳșțěmș čǿňțįňųě țǿ čǿňvě řģě.\nǺțțǻčķě řș čǿmmǿňŀỳ ŀěǻvě ǻ b řǿǻđ fǿǿțpřįňț įň İȚ șỳșțěmș ǻčřǿșș mǿșț įf ňǿț ǻŀŀ țħě ǻțțǻčķ ŀįfěčỳčŀě.\nİț įș įđěǻŀ țǿ șțǿp ǻň ǻțțǻčķě ř ǻș ěǻřŀỳ įň țħě ǻțțǻčķ ŀįfěčỳčŀě ǻ ș pǿșșįbŀě (ǻķǻ \"ŀěfț ǿf bǿǿm\"). Ǿňčě ǻň\nǻțțǻčķě ř řěǻčħěș țħě țǻřģěțěđ İČȘ, țħě pǿțěňțįǻŀ ǿf ǻ ňěģǻțįvě ǿ ųțčǿmě ǻň đ įțș șěvěřįțỳ fǿř țħě țǻřģěț\nįňčřěǻșě đřǻmǻțįčǻŀŀỳ.\nȚħěřě ǻřě mǻňỳ mǻț ųřě șěčųřįțỳ țǿǿŀș, șěřvįčěș, ǻňđ ǿțħěř čǻpǻbįŀįțįě ș ǻŀřěǻđỳ ǻvǻįŀǻbŀě țħǻț čǻň bě\nŀěvěřǻģěđ țǿ đěfěňđ ǻňđ ħųňț įň \"čǿň đųįț\" șỳșțěmș.\nĿěvěřǻģįňģ Ķňǿ ẅň Țǿǿŀș ǻňđ ȚȚPș Țǿ Ħųňț Fǿř țħě ȚŘ İȚǾŇ Ǻčțǿř\nĦįșțǿřįč ǻčțįvįțỳ ǻ șșǿčįǻțěđ ẅįțħ țħįș ǻčțǿř đěmǿňșțřǻțěș ǻ șțřǿňģ đěvěŀǿpměňț čǻpǻbįŀįțỳ fǿ ř čųșțǿm țǿǿŀįňģ. Țħě\nđěvěŀǿpě ř(ș) běħįňđ țħěșě țǿǿŀșěțș ŀěǻňěđ ħěǻvįŀỳ ǿň ěxį șțįňģ șǿfțẅǻřě fřǻměẅǿřķș ǻňđ mǿđįfįěđ țħěm țǿ bě șț\nșěřvě țħě įňț řųșįǿň ǿpě řǻțįǿňș. Țħě đěvěŀǿpě ř(ș) ħǻđ přěfěřěňčěș řěģǻřđįňģ țħě pǿ řțș, přǿțǿčǿŀș, pěřșįșțěňčě\nměčħǻňį șmș, ǻňđ ǿțħěř ǻșpěčțș ǿf ħǿẅ țħě mǻŀ ẅǻřě ǿpěřǻțěđ.\nẄħįŀě țħě p řěfěřěňčěș ǿf țħě đěvěŀǿpměňț țěǻm șųppǿřțįňģ țħįș ǻčțįvįțỳ ẅįŀŀ ŀįķěŀỳ șħįfț ǻňđ čħǻňģě ǿvě ř țįmě,\nŀěǻřňįňģ ǻbǿ ųț țħěm į ș șțįŀŀ ųșěfųŀ țǿ įđěňțįfỳ ẅħěțħěř țħěįř ȚȚPș ǻřě ǻppŀįčǻbŀě țǿ ǿțħě ř mǻŀẅǻřě đěvěŀǿpě řș ǻňđ\nțħřěǻț ǻčțǿ řș. Ǻđđįțįǿňǻŀŀỳ, țħě ǻčțǿ ř pǿșșįbŀỳ ģǻįňě đ ǻ fǿǿțħǿŀ đ ǿň ǿțħě ř țǻřģěț ňěț ẅǿřķș—běỳǿň đ țħě țẅǿ\nįňțřųșįǿňș đįșčųșșěđ įň țħįș pǿșț – ųșįňģ șįmįŀǻř șțřǻțěģįěș. İň șųčħ čǻșěș, řěțřǿșpěčțįvě ħ ųňțįňģ ẅǿųŀđ ħěŀp\nđěfěňđěřș įđěňțįfỳ ǻň đ řěměđįǻțě mǻŀįčįǿ ųș ǻčțįvįțỳ.\nBǻșěđ ǿň țħě ěxǻmįňǻțįǿň ǿf đěvěŀǿpě ř(ș) přěfěřěňčěș ǻňđ ǻbșțřǻčțěđ ǻđvěřșǻřỳ měțħǿ đǿŀǿģįěș, įț įș pǿșșįbŀě țǿ\nbųįŀđ břǿǻđěř vįșįbįŀįțỳ ǿf țħě ȚȚP ș ųșįňģ đěțěčțįǿň ǻň đ ħųňțįňģ řųŀěș ǿf vǻřįǿųș fįđěŀįțỳ ǻň đ țħřěǻț đěňșįțỳ. Țħě\nčǿmpįŀǻțįǿň ǿf țħě șě řųŀěș mǻķěș įț pǿșșįbŀě țǿ į đěňțįfỳ ǻň đ čŀǻșșįfỳ pǿțěňțįǻŀŀỳ mǻŀįčįǿ ųș șǻmpŀěș ẅħįŀě bųįŀđįňģ\nňěẅ \"ħǻỳșțǻčķș\" įň ẅħįčħ țǿ ħ ųňț fǿř ǻđvěřșǻřỳ ǻčțįvįțỳ.\nȚħě ȚȚP ș ẅě ěxțřǻčțěđ fřǿm țħįș ǻčțǿř’ș ǻčțįvįțįě ș ǻřě ňǿț ňěčě șșǻřįŀỳ ěxčŀųșįvě, ňǿř ǻřě țħěỳ ňěčě șșǻřįŀỳ mǻŀįčįǿ ųș\nįň ěvěřỳ čįřčųmșțǻňčě. Ħǿẅěvěř, țħě ȚȚP p řǿfįŀě bųįŀț bỳ Fį řěĚỳě čǻň bě ųșěđ țǿ șěǻřčħ fǿř pǻțțěřňș ǿf ěvįŀ įň\nșųbșěțș ǿf ňěțẅǿřķ ǻňđ ěňđpǿįňț ǻčțįvįțỳ. Ňǿț ǿňŀỳ čǻň țħě șě ȚȚPș bě ųșěđ țǿ fįňđ ěvįđěňčě ǿf įňț řųșįǿňș, bųț\nįđěňțįfįčǻțįǿň ǿf ǻčțįvįțỳ țħǻț ħǻ ș șțřǿňģ ǿvě řŀǻpș ẅįțħ țħě ǻčțǿ ř'ș fǻvǿřěđ țěčħňįq ųěș čǻň ŀěǻ đ țǿ șțřǿňģěř\nǻșșěșșměňțș ǿf ǻčțǿ ř ǻșșǿčįǻțįǿň, f ųřțħěř bǿŀșțěřįňģ įňčįđěňț řěșpǿňșě ěffǿřțș.\nȚħě fǿŀŀǿ ẅįňģ țǻbŀě p řǿvįđěș įňșįģħțș įňțǿ ňǿțǻbŀě měțħǿ đǿŀǿģįěș șųřřǿųňđįňģ țħě ųșě ǿf čųșțǿm țǿǿŀ ș ǻňđ țįpș\nfǿř įđěňțįfỳįňģ ěvį đěňčě ǿf țħį ș ǻňđ řěŀǻțěđ ǻčțįvįțỳ. Ǻ đvěřșǻřỳ měțħǿ đǿŀǿģįěș ǻřě ǻŀșǿ ěxpřěșșěđ įň țěřmș ǿf țħě\nMİȚŘĚ ǺȚȚ&ČĶ f řǻměẅǿřķ (șěě Ǻppěň đįx Č fǿř MİȚŘĚ ǺȚȚ&ČĶ JȘǾ Ň řǻẅ đǻțǻ).\nǺđvěřșǻřỳ\nMěțħǿđǿŀǿģỳĐįșčǿvěřỳ Țįpș\nPěřșįșțěňčě\nbỳ Șčħě đųŀěđ\nȚǻșķș bỳ XMĿ\nțřįģģěř\nǺȚȚ&ČĶ:\nȚ1053Ŀǿǿķ fǿ ř ňěẅ ǻňđ ǻňǿmǻŀǿ ųș Șčħěđųŀěđ Țǻșķș XMĿ țřįģģěřș řěfěřěňčįňģ\nųňșįģňěđ .ěxě fįŀě ș.\nPěřșįșțěňčě\nbỳ İFĚǾ\nįňjěčțįǿň\nǺȚȚ&ČĶ:\nȚ1183Ŀǿǿķ fǿ ř mǿđįfįčǻțįǿň ș ǻňđ ňěẅ ěňțřįěș řěfěřěňčįňģ .ěxě fįŀě ș ųňđěř řěģįșțřỳ\nķěỳ ĦĶĚỲ_ĿǾČǺĿ_MǺČ ĦİŇĚ \\ȘǾFȚẄǺŘ Ě\\Mįčřǿșǿfț\\Ẅįň đǿẅș\nŇȚ\\ČųřřěňțVěřșįǿň\\İmǻģě Fįŀě Ěxěčųțįǿň Ǿpțįǿň ș.\nČǿmmǻň đ\nǻňđ čǿňțřǿŀ\n(Č2)\něșțǻbŀįșħěđ\nųșįňģ ħǻřđ-\nčǿđěđ ĐŇȘ\nșěřvěřșĿǿǿķ fǿ ř PĚș ěxěčųțįǿňș ẅįțħ řųň ĐŇȘ ŀǿǿķųpș țǿ 8.8.8.8:53. Țħįș mǻỳ bě\nǻppŀįčǻbŀě țǿ șǻňđbǿx ǻňđ ǿțħěř mǻŀẅǻřě přǿčěșșįňģ țěčħňǿŀǿģįě ș.\nČ2 ųșįňģ\nfǻvǿřěđ\nČ2pǿřțș\nǺȚȚ&ČĶ:\nȚ1043\nǺȚȚ&ČĶ:\nȚ1065Ŀǿǿķ fǿ ř ǿųțbǿųňđ čǿňňěčțįǿň ș ẅįțħ pǿřț-přǿțǿčǿŀ mį șmǻțčħě ș ǿň čǿmmǿň\nǻňđ ųňčǿmmǿň pǿ řțș șųčħ ǻș 443, 4444, 8531, ǻňđ 50501 .\nČ2 ųșįňģ\nfǻvǿřěđ\nVįřțųǻŀ Přįvǻțě\nȘěřvěř (VPȘ)\nįňfřǻșțřųčțųřě\nǺȚȚ&ČĶ:\nȚ1329Ŀǿǿķ fǿ ř įňbǿųňđ ǻňđ ǿųțbǿųňđ čǿňňěčțįǿň ș fřǿm ǻňđ țǿ ňǿň- șțǻňđǻřđ İP\nřǻňģěș, ěșpěčįǻŀŀỳ f řǿm įňțě řňǻțįǿňǻŀ VPȘ p řǿvįđěřș ŀįķě ǾV Ħ ǻňđ ŲĶ-2 Ŀįmįțěđ\n(ųķ2.ňěț).\nČ2 đǿmǻįňș\nẅįțħ ħỳpħěňĿǿǿķ fǿ ř ňěẅŀỳ ǿbșěřvěđ 2ĿĐ ǻňđ 3ĿĐ đǿmǻįňș țħǻț čǿňțǻįň ħỳpħěň ș.\nČ&Č ųșįňģ\nđỳňǻmįč Đ ŇȘ\nđǿmǻįňș fřǿm\nǻfřǻįđ.ǿřģ\nǺȚȚ&ČĶ: Ț 1311Ŀǿǿķ fǿ ř ňěẅŀỳ ǿbșěřvěđ đỳňǻmįč Đ ŇȘ đǿmǻįňș ǿẅňěđ ǿř řěģįșțěřěđ ẅįțħ\nǻfřǻįđ.ǿřģ.\nČ2 đǿmǻįňș\nřěģįșțěřěđ\nẅįțħ\nvfěmǻįŀ.ňěț\němǻįŀ\nǻđđřěșșěșĿǿǿķ fǿ ř ňěẅŀỳ ǿbșěřvěđ đǿmǻįňș ǿř ĐŇȘ řěșǿŀųțįǿňș țǿ đǿmǻįňș ẅįțħ\nřěģįșțřǻňț ěmǻįŀ įňfǿ řmǻțįǿň čǿňțǻįňįňģ vfěmǻįŀ.ňěț\nȚųňňěŀěđ ŘĐP\nųșįňģ PĿİŇĶ\nǺȚȚ&ČĶ:\nȚ1076Ŀǿǿķ fǿ ř țħě přěșěňčě ǿf PĿ İŇĶ ǻňđ ňǿň-șțǻňđǻřđ ŘĐP ųșǻģě ẅįțħ ěvěňț\nŀǿģș, fįřěẅǻŀŀ ŀǿģș, ǻňđ řěģįșțřỳ ķěỳș ǻș đěșčřįběđ įň țħě Fį řěĚỳě bŀǿģ pǿ șț\n\"Bỳpǻșșįňģ Ňěțẅǿřķ Řěșțřįčțįǿňș Țħřǿųģħ ŘĐP Ț ųňňěŀįňģ. \"\nFįňđ įňțěřňǻŀ ŘĐP pįvǿțįňģ bỳ ŀǿǿķįňģ fǿ ř bįțmǻp čǻčħě fįŀě ș ųňđěř ųșěř\nǻččǿųňțș țħǻț șħǿųŀđ ňǿț bě ǻččě șșįňģ șěňșįțįvě șỳșțěmș vįǻ ŘĐP. Ŀǿǿķ fǿ ř\nbįțmǻp čǻčħě fįŀě ș șųčħ ǻș bčǻčħě 22.bmč ųňđěř đěfǻųŀț, șěřvįčě, ǿř\nǻđmįňįșțřǻțǿř ǻččǿųňțș ǿř ǻňỳ ǻččǿ ųňț ňǿț ěxpěčțě đ țǿ bě čǿň đųčțįňģ\nįňțěřňǻŀ ŘĐP ǻččě șșěș țǿ șěňșįțįvě șỳșțěmș įň ǻ přǿțěčțěđ ǾȚ-čǿňňěčțě đ żǿňě,\něșpěčįǻŀŀỳ įň țħě ĐMŻ ǿ ř ĐČȘ ǻřěǻș ŀįķě ĦMİș ǿř ěňģįňěě řįňģ ẅǿřķșțǻțįǿňș.\nČ2 ųșįňģ\nħǻřđ-čǿđěđ\nȘȘĦ přįvǻțě\nķěỳșĿǿǿķ fǿ ř PĚș ẅįțħ ħǻřđ-čǿđěđ ǾpěňȘȘ Ħ přįvǻțě ķěỳ ș.\nŲșě ǿf đįřěčț\nŘĐP\nǺȚȚ&ČĶ:\nȚ1076Ŀǿǿķ fǿ ř įňbǿųňđ ŘĐP čǿňňěčțįǿň ș ẅįțħ đěfǻųŀț ħǿșț įňfǿřmǻțįǿň, ňǿň-\nșțǻňđǻřđ ǿř ųňěxpěčțě đ ŀǿčǻŀě İĐș, ǿř ǿțħěř měțǻđǻțǻ. Șěě ǻŀ șǿ țħě FįřěĚỳě\nbŀǿģ pǿ șț ǿň bǻ șěŀįňįňģ ŘĐP  ǻčțįvįțỳ.\nČ2 ųșįňģ\nșǿųřčě\nșỳșțěmș ẅįțħ\nđěfǻųŀț\nẄįňđǿẅș\nħǿșțňǻměșĿǿǿķ fǿ ř đěfǻųŀț Ẅįňđǿẅș ħǿșțňǻměș țħǻț fįț țħě șțřųčțųřě ẄİŇ-[Ǻ-Ż0-9]{11}\n(ě.ģ., Ẅ İŇ-ǺBČĐĚFĢĦ1JĶ) įň P Ě čěřțįfįčǻțěș, ȘȘĿ ǻň đ ȘȘĦ čěřțįfįčǻțěș, ǻňđ\nŘĐP ħǻň đșħǻķěș.\nČ2 ųșįňģ ȘȘĦĿǿǿķ fǿ ř ňěẅ, ųňįqųě, ǿř ųňųșųǻŀ ȘȘĦ șěșșįǿňș. Ŀǿģģįňģ ǿf ȘȘ Ħ ķěỳș ǻňđ\nfįňģěřpřįňțș ẅǿųŀđ qųįčķŀỳ ǻň đ ěǻșįŀỳ įđěňțįfỳ ǻň ǻňǿmǻŀǿ ųș șěșșįǿň ǻș ǻ řěșųŀț\nǿf mǻŀẅǻřě. Ŀǿǿķ fǿ ř ȘȘĦ ǿvěř ňǿň-șțǻňđǻřđ pǿřțș.\nČǿmpřǿmįșěđ\nVPŇ ǻččǿųňțș\nǺȚȚ&ČĶ:\nȚ1078Ŀǿǿķ fǿ ř VPŇ ŀǿģǿň ǻňǿmǻŀįě ș bǻșěđ ǿň įňfěǻ șįbŀě pǻțțě řňș șųčħ ǻș șǿųřčě\nǻččǿųňț ŀǿčǻțįǿň, İP ǻđđřěșș, ǻňđ ħǿșțňǻmě ǻ șșǿčįǻțįǿň ș. Čħěčķ ǿ ųț țħě\nFįřěĚỳě bŀǿģ pǿ șț ǻňđ fřěě țǿǿŀșěț fǿř VPŇ ŀǿģǿň ǻňǻŀỳ șįș, ĢěǿĿǿģǿňǻŀỳ żěř.\nİf ỳǿų ųșě ȘMȘ-bǻ șěđ MFǺ, ŀǿǿķ fǿ ř pħǿňě ň ųmběřș řěģįșțěřěđ ǿųțșįđě țħě\nčǿųňțřỳ ẅħěřě ỳǿųř ěmpŀǿỳěě ș ǿpěřǻțě.\nMǻŀẅǻřě\nmǻșqųěřǻđįňģ\nǻș Mįčřǿșǿfț\nČǿřpǿřǻțįǿňĿǿǿķ fǿ ř PĚș ẅįțħ mįșmǻțčħě đ PĚ měțǻđǻțǻ șųčħ ǻș čǿňțǻįň ș \"Bįțvįșě\" șțřįňģș\nǻňđ ǻŀșǿ \"Mįčřǿșǿfț Čǿřpǿřǻțįǿň\" įň țħě měțǻ đǻțǻ. Ŀǿǿķ fǿ ř ųňșįģňěđ\n\"Mįčřǿșǿfț Čǿřpǿřǻțįǿň\" bįňǻ řįěș įň țħě ģ řǿųp'ș čǿmmǿň șțǻģįňģ đįřěčțǿřįěș.\nŲșě ǿf\nčųșțǿmįżěđ\nBįțvįșě\nbįňǻřįěșĿǿǿķ fǿ ř PĚș ẅįțħ Bįțvį șě PĐB pǻțħ șțřįňģș șųčħ ǻș đ:\\řěpǿș\\mǻįň\\șșħ2\\.\nŲșě ǿf\nčųșțǿmįżěđ\nǾpěňȘȘ Ħ\nbįňǻřįěșĿǿǿķ fǿ ř PĚș ẅįțħ čǿňțěňț \"Mįč řǿșǿfț ǿpěňȘȘ Ħ čŀįěňț.\"\nŲșě ǿf\nčųșțǿmįżěđ\nČřỳpțčǻț b ųț\nẅįțħ đěfǻųŀț\npǻșșẅǿřđĿǿǿķ fǿ ř PĚș țħǻț đřǿp Čřỳpțčǻț bįňǻ řįěș ǿř čǿňțǻįň Č řỳpțčǻț șțřįňģ čǿňțěňț\nșųčħ ǻș țħě đěfǻųŀț pǻșșẅǿřđ \"měțǻŀŀįčǻ.\"\nȚįměșțǿmpįňģ\nvįǻ\nPǿẅěřȘħěŀŀ\nǺȚȚ&ČĶ:\nȚ1099Ŀǿǿķ fǿ ř țįměșțǿmpįňģ čǿmmǻň đ șțřįňģș șųčħ ǻș \".ČřěǻțįǿňȚįmě=\" įň\nPǿẅěřȘħěŀŀ șčřįpțș ǿř įň PǿẅěřȘħěŀŀ čǿmmǻň đ-ŀįňě ěňț řįěș. Ŀǿǿķ fǿ ř PĚș ẅįțħ\nŇȚFȘ čřěǻțįǿň țįmě p řįǿř țǿ PĚ čǿmpįŀě țįmě.\nĐěpŀǿỳměňț\nǿf bįňǻřįěș\nẅįțħ đěbųģ\nįňfǿřmǻțįǿň\nfřǿm\nđěvěŀǿpě ř\nẅǿřķșțǻțįǿňș\nẅįțħ Vįșųǻŀ\nȘțųđįǿ 2010Ŀǿǿķ fǿ ř PĚș ẅįțħ PĐB pǻțħ ș čǿňțǻįňįňģ đěfǻųŀț ǿř ģěňěřįč pǻțħș șųčħ ǻș\n\\Ųșěřș\\ųșěř\\Đǿčųměňțș\\Vįșųǻŀ Șțųđįǿ 2010 \\\n\\Đǿčųměňțș\\Vįșųǻŀ Șțųđįǿ 2010 \\.\nŲșě ǿf\nȚħįňșțǻŀŀ fǿř\npǻčķǻģįňģ\nmǻŀẅǻřěĿǿǿķ fǿ ř PĚ ẅįțħ čǿňțěňț \"țħįň șțǻŀŀ\\mǿđųŀěș\\bǿǿț_ŀǿǻ đěř.pđb.\" Ŀǿǿķ fǿ ř\nȚħįňșțǻŀŀ bįňǻ řįěș țħǻț ħǻvě č řěǻțěđ vįřțųǻŀįżěđ fįŀěș įň țħě čǿňțěxț ǿf țħě\nȘỲȘȚĚM ųșěř\n\"Č:\\Ẅįň đǿẅș\\ȘỳșẄǾẄ64\\čǿňfįģ\\ șỳșțěmpřǿfįŀě\\ǺppĐǻțǻ\\Řǿǻmįňģ\\Țħįň șțǻŀŀ\\.\"\nŲșě ǿf\nfǻvǿřěđ\nđįřěčțǿřįěș fǿř\nǿpěřǻțįňģ,\nșțǻģįňģ ǻň đ\něxěčųțįňģ fįŀě șĿǿǿķ fǿ ř ňěẅ, ųňěxpěčțě đ, ǿř ǿțħěřẅįșě ǻňǿmǻŀǿ ųș bįňǻřįěș įň țħě fǿŀŀǿ ẅįňģ\nđįřěčțǿřįěș:\nČ:\\Ẅįňđǿẅș\\șỳșțěm32\\įňěțșřv\\\nČ:\\Ẅįňđǿẅș\\țěmp\\\nČ:\\Ẅįňđǿẅș\\ȘỳșẄǾẄ64\\ẅběm\nČ:\\Ẅįňđǿẅș\\ȘỳșẄǾẄ64\\đřįvěřș\nČ:\\Ẅįňđǿẅș\\ȘỳșẄǾẄ64\nČ:\\Ẅįňđǿẅș\\șỳșțěm32\\ẅběm\\\nČ:\\Ẅįňđǿẅș\\șỳșțěm32\\đřįvěřș\\\nČ:\\Ẅįňđǿẅș\\șỳșțěm32\\\nČ:\\Ẅįňđǿẅș\\\nČ:\\Ųșěřș\\Pųbŀįč\\Ŀįb řǻřįěș\\\nČ:\\Ųșěřș\\ǻđmįňįșțřǻțǿř\\ǻppđǻțǻ\\ŀǿčǻŀ\\țěmp\\\nČ:\\șșħ\\\nČ:\\pěřfŀǿģș\\ǻđmįň\\șěřvěřmǻňǻģě ř\\șșħ\\\nČ:\\pěřfŀǿģș\\ǻđmįň\\șěřvěřmǻňǻģě ř\\\nČ:\\pěřfŀǿģș\\ǻđmįň\\\nČ:\\pěřfŀǿģș\\\nČ:\\čpqșỳșțěm\\\nČ:\\ħp\\ħp đįǻģș\\\nČ:\\ħp\\bįň\\ŀǿģ\\\nȚǻbŀě 1: ȚŘİȚǾŇ ǻčțǿř měțħǿđǿŀǿģỳ ǻň đ đįșčǿvěřỳ șțřǻțěģįěș\nǾųțŀǿǿķ\nȚħěřě įș ǿfțěň ǻ șįňģųŀǻř fǿčųș fřǿm țħě șěčųřįțỳ čǿmm ųňįțỳ ǿň İČȘ mǻŀẅǻřě ŀǻřģěŀỳ đųě țǿ įțș ňǿvěŀ ňǻț ųřě ǻňđ\nțħě fǻčț țħǻț țħě řě ǻřě věřỳ fěẅ ěxǻmpŀě ș fǿųňđ įň țħě ẅįŀđ. Ẅħįŀě țħį ș ǻțțěňțįǿň į ș ųșěfųŀ fǿř ǻ vǻřįěțỳ ǿf řěǻșǿňș,\nẅě ǻřģųě țħǻț đěfěňđěřș ǻňđ įňčįđěňț řěșpǿňđěřș șħǿųŀđ fǿčųș mǿřě ǻțțěňțįǿň ǿň șǿ-čǻŀŀěđ \"čǿňđųįț\" șỳșțěmș\nẅħěň țřỳįňģ țǿ į đěňțįfỳ ǿ ř șțǿp İČȘ-fǿčųșěđ įňțřųșįǿňș.\nİň ǻň ǻțțěmpț țǿ řǻįșě čǿmm ųňįțỳ ǻẅǻřěňěșș șųřřǿųňđįňģ țħįș ǻčțǿř’ș čǻpǻbįŀįțįě ș ǻňđ ǻčțįvįțįě ș běțẅěěň 2014\nǻňđ 2017—ǻň ěffǿ řț čǿmpǿ ųňđěđ įň įmpǿ řțǻňčě bỳ ǿ ųř đįșčǿvěřỳ ǿf țħě țħ řěǻț ǻčțǿ ř įň ǻ șěčǿňđ čřįțįčǻŀ\nįňfřǻșțřųčțųřě fǻčįŀįțỳ— ẅě ħǻvě șħǻřěđ ǻ șǻmpŀįňģ ǿf ẅħǻț ẅě ķňǿẅ ǻbǿųț țħě ģřǿųp'ș ȚȚPș ǻňđ čųșțǿm țǿǿŀįňģ.\nẄě ěňčǿ ųřǻģě İČȘ ǻșșěț ǿẅňěřș țǿ ŀěvě řǻģě țħě đěțěčțįǿň řųŀěș ǻňđ ǿțħěř įňfǿřmǻțįǿň įňčŀ ųđěđ įň țħįș řěpǿřț țǿ\nħųňț fǿř řěŀǻțěđ ǻčțįvįțỳ ǻ ș ẅě běŀįěvě țħě řě įș ǻ ģǿǿđ čħǻňčě țħě țħ řěǻț ǻčțǿ ř ẅǻș ǿř įș přěșěňț įň ǿțħě ř țǻřģěț\nňěțẅǿřķș.\nFǿř İȚ ǻňđ ǾȚ įňčį đěňț řěșpǿňșě șųppǿřț, pŀěǻșě čǿňțǻčț FįřěĚỳě Mǻň đįǻňț. Fǿř mǿřě įň-đěpțħ ǻňǻŀỳ șįș ǿf\nȚŘİȚǾŇ ǻňđ ǿțħěř čỳběř țħřěǻțș, čǿňșįđěř șųbșčřįbįňģ țǿ FįřěĚỳě Čỳbě ř Țħřěǻț İňțěŀŀįģěňčě .\nFįřěĚỳě’ș ȘmǻřțVįșįǿň țěčħňǿŀǿģỳ, ẅħįčħ șěǻřčħěș fǿř ǻțțǻčķě řș đųřįňģ ŀǻțě řǻŀ mǿvěměňț ǻčțįvįțįě ș bỳ mǿňįțǿ řįňģ\něǻșț-ẅěșț țřǻffįč įň İȚ ǻňđ ǾȚ ňěț ẅǿřķș, řěđųčěș țħě řįșķ ǿf ǻň ǻțțǻčķ řěǻčħįňģ șěňșįțįvě İČȘ přǿčěșșěș. Țħįș įș\npǻřțįčųŀǻřŀỳ řěŀěvǻňț fǿ ř șǿpħįșțįčǻțěđ İČȘ-řěŀǻțěđ įňțřųșįǿňș ǻș ǻțțǻčķě řș țỳpįčǻŀŀỳ mǿvě f řǿm čǿřpǿřǻțě İȚ țǿ ǾȚ\nňěțẅǿřķș țħřǿųģħ șỳșțěmș țħǻț ẅěřě ǻččěșșįbŀě țǿ bǿțħ ěňvį řǿňměňț ș, fǻř běỳǿňđ pěřįměțěř đěfěňșěș.\nǺppěňđįčěș\nǺppěňđįx Ǻ: Đįșčǿvěřỳ Řųŀěș\nǺppěňđįx B: Țěčħňįčǻŀ Ǻňǻŀỳ șįș ǿf Čųșțǿm Ǻțțǻčķ Țǿǿŀ ș\nǺppěňđįx Č: MİȚŘĚ ǺȚȚ&ČĶ JȘǾ Ň Řǻẅ Đǻțǻ\nİňđįčǻțǿřș ǿf Čǿmp řǿmįșě\nFįŀěňǻmě Ħǻșħ\nĶB77846376.ěxěMĐ5: 47f9čč543905 ǻ69ǻ423f9110ǻě7đěffb\nȘĦǺ256: 87648ǻǻđ45đ91 42đ1đ825đ 728b7ǻǻ098f92ǻěǻ38698209đ038 bǻ58b7385f8đf6\nĶB77846376.ěxě.x64MĐ5: ěě477f đěě8b6ǻđ4fě778ǻ6fǻ4058f9ǻǻ\nȘĦǺ256: 2141b526ǻ81bb87b964880ě69933 ǻǻđ3932131 ččččěě5949đ2ǻ16č1ě124ččđbb\nŇěțěxěč.ěxěMĐ5: ǻčǻ94bb7bđfb735f267f083ě28f4đb37\nȘĦǺ256: č55ě63f8ǻ3b328č3bǻ77čěbf 821bđč5243b15ǻ029805 7ě75f7605đ0922 č8đ7čđ\nřųňșvč.ěxěMĐ5: 1904čǻđ4927541ě47đ453běčbđ934bf0\nȘĦǺ256: 70ěfbđ074326ě7bbđ4ě851đěđ5č362fě5fě06282 ěđ4bbb4b 9f761f1b12ěě32f7\nșvčħǿșțpŀǻ.ěxěMĐ5: 121772100 ě46đđě2đ631 7b08č7ǻ59ě13\nȘĦǺ256: 910b26č942č0čff8b1f5ǻ57ě1521801 bfđ54č8čbčfđ23đ3đ11 ěǻ9fě27čǻ4ǻ0ě9\nčǿmpǻțțěŀp řěřųňňěř.ěxěMĐ5: 35f443608 fč4ěěb7 8f9347ǻ9đfč5ǻěǻ1\nȘĦǺ256: 133059 4č2685 fě6fč2č87439ěf151đfǻčǻbč7 8402379ǻ73bě399530 48b144960\nčǿmpǻțțěŀp řěřųňňěř.ěxěMĐ5: 10fđ713ěb3bč6ǻ8f7ǻbđ703010 4đ0čě7\nȘĦǺ256: 6ǻb948ěč61f1f7ě04119đǻ85đ5263đ 428ǻ1đě070ěđǻđ3ǻ4ě796bǻđǻ2ǻb05čěǻ7\nčǿmpǻțțěŀp řěřųňňěř.ěxěMĐ5: 64822303 4bđǻ28č415ǻ8đěěb74đčb3ěf\nȘĦǺ256: 4č2383 č8650112 ě00čb8b52đ0 fǻǻč7b9820 7073đb081đ bđčbb278f0470b869ǻ1\nPřǿģřǻmĐǻțǻŲp đǻțěř.xmŀMĐ5: č744006ěbǻǻf25čđ7fǻđ0ěbbǻ56ě4f84\nȘĦǺ256: 6đ2đ9623 762f8229 49ěěf80b02f4bǻ2đ2622 7ěb23ǻđ5b8đ1ǻ0ǻ3đ6đ ǻ3bč60đ6 č\nňǻpųpđǻțěđb.ěxěMĐ5: bǻ51f25đb03ǻ66č658đ1 fđ4396f32843\nȘĦǺ256: 0fč391čđěf0705f032109 ě16f8f591ě1ě6f8ffččbč4 6f4ěb4ǻ 8fǻ0580 47č0ǻđč\nǻŀģ.ěxěMĐ5: ǻf5b9č9ě4č6bfč6čb7fǻ5ě4b04đǻ8đč8\nȘĦǺ256: 970fǻb66733bǻ594b435čf345č72814ěě5f8443č44đ28ěf251f768ǻđ66ǻ6č052\nųșěřįňįț.ěxěMĐ5: 2đ11bě6755b80čfčǻ5č2f5138881 ff25\nȘĦǺ256: fč5b4č61f66běb58ǻ62636 ǻb7č198ě6ǻb7f38čě201f098f2818ǻ5699 b8ǻǻ1138\nčșřșș.ěxěMĐ5: đě2ě1đ59 č81ǻ2798ǻ239bǻǻǻ1ěđč0đđ8\nȘĦǺ256: 1848đ26 ě47ěě4 937ěf02ě67ǻ447b4 054đ66f4đ659 f1fbđ8bđǻ1482đč4f02č7č4\nțqųěřỳ.đŀŀMĐ5: 31čđ0738ěč2ě40ff086đ fđ84ǻč2510 fb\nȘĦǺ256: 98đǻ0čě88đě897ě1b08733ǻč771ěđǻb5ě5b2ǻ2đđǻ8ǻǻb0ě73č1đ41bǻđě275ff6\nțxfŀǿģ.đŀŀMĐ5: 8đb693f75ǻ0čfě043ǻ5810 f79965 4čf9\nȘĦǺ256: f0đčbč83đ911 č382đ ǻ7bǻ06ǻ027bđđ5861đ1 ǻ9b723ěbě5đ9đ6 f6b79đ7b70f29đ\nčřỳpțǿpp. đŀŀMĐ5: 9ǻ7234078559093 ě06č9đ321 48ěđ95ǻ3\nȘĦǺ256: 32f5đ0ǻ454č26ě8ǻǻ6f4čǻđ58f378233 7čč97čfě2305 bbfě564437ě5f0đ51 bbč\nĐĚFǺŲĿȚMĐ5: 30ǻ9ěě20052 fčč34đěě6b09f9210đ 4ěđ\nȘĦǺ256: f7bđđđběǻě239305 čččǻ3b7ěb1019b713bđ0f7f0609 76494ě81091 7ǻ1ě6ǻđ5ěě\nĐĚFǺŲĿȚ.BǺĶMĐ5: 519098 f3970đ57b8429ǻ9f6bǻěǻf0f8č\nȘĦǺ256: 1f1902 ě448252 7824ěf2č0č2039162đ b85ě5ǻ671čǻf0767ǻ695116 b03čfč866đ\nșpŀ32.ěxěMĐ5: 62831 f960fě764f090đ1201033202 438\nȘĦǺ256: 1đ359163 b6bđ882 ǻě4č2685 4đ69745136ǻ23f3ǻbb7č96341f6đ17ě18ǻ546ǻ5fđ\nẄįňȘǺȚ.ěxěMĐ5: 685776ě0020 ǻđ9bfč4ě2f4f7č7ǻ 9č623\nȘĦǺ256: 3b6fđ091 b956b17476990 č6čǻ77đđ8f77đ203đ31 70745đ1b7č7894bfčf629b86\nčșřșș.ěxěMĐ5: đ05702č4č3924b08bǻč5079ǻđđ4ě2347\nȘĦǺ256: 720ěf3đ5b5416974376čǻ4ěǻ8bđ536 ě9ěěb608f89ě3b5b264ě197266bě8ǻ9f4ě\nčŀųșǻpį.đŀŀMĐ5: f985fđ0đ36 ǻb79bfččfǻě đ6đ6 4č5fč23\nȘĦǺ256: 084č21ě75fbfǻ5056 fěč913č237čě7fbǻ 314f88fbđ687ě8đčb1ě777003f79b0ě\nPǿŀįčMǻň. đŀŀMĐ5: 6fběb6ǻ9f990402bf6f056č892fěfčč6\nȘĦǺ256: 9224č2b00ě94ě5č57đ63820 ǻěbě613843b5č851ǻ027488148308 fǻč2đ02206 f0\nvěřįfįěř2.đŀŀMĐ5: 6f8b33čb1đ101 č6bf0ě9ǻěǻf29b7ě72đ\nȘĦǺ256: 7633b4178611ě28ǻěđfǻ365ǻ0đě8ěbě5f41ǻě8ěěěě71322f04đ0ě30ě50bǻ2914\nmįșč.mǿfMĐ5: 5ěfbđ510 44fb90č6231438č51đ8303 7f\nȘĦǺ256: 7bččǻ 38ě43f3b37b1ǻčěǻ05899 ǻ7č11đfb62đě64531bđ48ǻf992đ5 ě400ǻ1755f\nŀǿģǿff.ǻ șpxMĐ5: 915ěfč70ǻ812č1čb35b29bǻ0ěčb7č4 8đ\nȘĦǺ256: 0đǻ4č0b83fǻ1ǻđ4ǻf9ǻǻđ6č42fěěčč6č21č3fđ0ě660b9ě5b3857đđěǻě3473đ54\nfŀǿģǿň.j șMĐ5: 0f144ě79ěǻ8đ8b66fǻ973ě0568 415501\nȘĦǺ256: f81ǻǻ77đ23čǻ6662 ěfb3ě6ě33538 ǻ60ě39ǻbb5čǻ66102 ě07ffǻ318ǻ6đ6čđ78ěč \nȚǻbŀě 2: İňđįčǻțǿřș ǿf čǿmp řǿmįșě \nĚmǻįŀ Ųp đǻțěș\nİňfǿřmǻțįǿň ǻň đ įňșįģħț ǿň țǿ đǻỳ'ș\nǻđvǻňčěđ țħřěǻțș fřǿm FįřěĚỳě.\nȘĦǺŘĚ\nŘěčěňț Pǿ șțș\n17 Mǻř 2020\n16 Mǻř 2020\n09 Mǻř 2020\nŘȘȘ FĚĚĐ: ȘȚǺỲ ČǾ ŇŇĚČȚĚĐ\n Fįřșț Ňǻmě Ŀǻșț Ňǻmě\nĚmǻįŀ Ǻđđřěșș\nČǿmpǻňỳ Ňǻmě\nȚħřěǻț Řěșěǻřčħ Bŀǿģ\nFįřěĚỳě Șțǿřįěș Bŀǿģ\nİňđųșțřỳ Pěřșpěčțįvě ș Bŀǿģ\nỲěș, İ ẅǿųŀđ ŀįķě țǿ řěčěįvě\nčǿmmųňįčǻțįǿň ș fřǿm FįřěĚỳě.\nPŀěǻșě řěǻđ mǿřě ǻbǿųț ǿųř\nįňfǿřmǻțįǿň čǿŀŀěčțįǿň ǻň đ ųșě.\nȘŲBȘČŘ İBĚ\nȘįx Fǻčț ș ǻbǿųț Ǻđđřěșș Șpǻčě\nĿǻỳǿųț Řǻňđǿmįżǻțįǿň ǿň\nẄįňđǿẅș \nȚħěỳ Čǿmě įň țħě Ňįģħț:\nŘǻňșǿmẅǻřě Đěpŀǿỳměňț Ț řěňđș \nČřěșčěňđǿ: Řěǻŀ Țįmě Ěvěňț Vįě ẅěř\nfǿř mǻčǾȘ  \n\nĦǿmě  FįřěĚỳě Bŀǿģ ș Țħřěǻț Řěșěǻřčħ  ȚŘİȚǾŇ Ǻčțǿř ȚȚP P řǿfįŀě, Č ųșțǿm Ǻțțǻčķ Țǿǿŀ ș, Đěț...   \nČǿmpǻňỳ\nẄħỳ Fį řěĚỳě?\nČųșțǿměř Șțǿřįěș\nČǻřěěřș\nČěřțįfįčǻțįǿň ș ǻňđ Čǿmpŀįǻňčě\nİňvěșțǿř Řěŀǻțįǿň ș\nȘųppŀįěř Đǿčųměňțș\nŇěẅș ǻňđ Ěvěňțș\nŇěẅșřǿǿm\nPřěșș Řěŀěǻșěș\nẄěbįňǻ řș\nĚvěňțș\nǺẅǻřđș ǻňđ Ħǿňǿřș\nĚmǻįŀ Přěfěřěňčěș\nȚěčħňįčǻŀ Ș ųppǿřț\nİňčįđěňț?\nŘěpǿřț Șěčųřįțỳ İșșųě\nČǿňțǻčț Ș ųppǿřț\nČųșțǿměř Pǿřțǻŀ\nČǿmmųňįțįěș\nĐǿčųměňțǻțįǿň Pǿ řțǻŀ\nFįřěĚỳě Bŀǿģ ș\nȚħřěǻț Řěșěǻřčħ\nFįřěĚỳě Șțǿřįěș\nİňđųșțřỳ Pěřșpěčțįvě ș\nȚħřěǻț Mǻp\nVįěẅ țħě Ŀǻțě șț Țħřěǻțș\nČǿňțǻčț Ų ș\n+1 877-347-3393\n \nȘțǻỳ Čǿňňěčțě đ\n\nČǿpỳřįģħț © 2020  FįřěĚỳě, İňč. Ǻŀŀ řįģħțș řěșěřvěđ. \nPřįvǻčỳ & Čǿǿķįě ș Pǿŀįčỳ  | Přįvǻčỳ Șħįěŀ đ | Ŀěģǻŀ Đǿč ųměňțǻțįǿňȘįțě Ŀǻňģ ųǻģě\nĚňģŀįșħ\nČǾŇȚǺČȚ ŲȘ  ŘĚPǾŘȚ Ǻ Ň İŇČİĐĚŇȚ\nȘǿŀųțįǿňș Șěřvįčěș Čųșțǿměřș Pǻřțňěřș Řěșǿųřčěș Čǿmpǻňỳ\n "
}