{
    "title": "tropic trooper apt targets taiwanese government and the energy sectorsecurity affairs",
    "text": "Adobe releases out-of-band patches for critical issues in Acrobat Reader,  MUST READ\nCopyright 2015 Security Affairs by Pierluigi Paganini All Right Reserved. Back to top\n\nSponsored Content\nDigging the Deep Web: Exploring the dark side of the\nweb\nYoroi Blog\nYoroi Blog\nSponsored Content\nSponsored Content\nSponsored Content\nSponsored ContentTropic Trooper APT targets Taiwanese Government\nand companies in the energy sector\nNovember 23, 2016  By Pierluigi Paganini\nSHARE ON       \nPierluigi Paganini\nPierluigi Paganini is member of the ENISA (European Union Agency for Network\nand Information Security) Threat Landscape Stakeholder Group and Cyber G7\nGroup, he is also a Security Evangelist, Security Analyst and Freelance Writer.\nEditor-in-Chief at \"Cyber Defense Magazine\", Pierluigi is a cyber security expert\nwith over 20 years experience in the field, he is Certified Ethical Hacker at EC\nCouncil in London. The passion for writing and a strong belief that security is\nfounded on sharing and awareness led Pierluigi to find the security blog\n\"Security Affairs\" recently named a Top National Security Resource for US.\nPierluigi is a member of the \"The Hacker News\" team and he is a writer for some\nmajor publications in the field such as Cyber War Zone, ICTTF, Infosec Island,\nInfosec Institute, The Hacker News Magazine and for many other Security\nmagazines. Author of the Books \"The Deep Dark Web\" and “Digital Virtual\nCurrency and Bitcoin”.The Tropic Trooper APT continues to target Asia, this time\ngovernment Taiwanese organizations and companies in the\nenergy sector.\nThe Tropic Trooper APT that has been active at least since 2012, it was first spotted last year by\nsecurity experts at Trend Micro when it targeted government ministries and heavy industries in\nTaiwan and the military in the Philippines.\nNow researchers from Palo Alto Networks targeted the secretary general of Taiwan’s Executive Yuan\nand a fossil fuel provider with a strain of malware called Yahoyah. The attackers leverage an exploit\nfor the CVE 2012-0158  vulnerability, the same flaw was exploited by many other APT groups,\nincluding Lotus Blossom , NetTraveller , and The Four Element Sword  ATP.\nPalo Alto Networks discovered that the group used Poison Ivy for his campaigns, a circumstance that\nemerged in the analysis of TrendMicro.\n“The attacks in this case  are associated with a campaign called Tropic Trooper , which has been active since at\nleast 2011 and is known for heavily targeting Taiwan. One of the attacks used their known Yahoyah  malware,\nbut the other attack deployed the widely available Poison Ivy RAT.” state the report  published by Palo Alto\nNetworks. “This confirms the actors are using Poison Ivy as part of their toolkit, something speculated in the\noriginal Trend Micro report but not confirmed by them. Further analysis uncovered a handful of ties indicating the\nactors may also be using the PCShare malware family, which has not been previously tied to the group.” \nThe hackers launched a spear-phishing campaign to trick victims into opening specially crafted decoy\ndocuments. The Excel file sent to the Executive Yuan purports to come from a staff member at the\nDemocratic Progressive Party, the document is related to political issues.\nAfter infecting the target machine, the malware displays to the victim a clean document that contains\nthe content of interest.\n“All of the text uses Traditional Chinese, in contrast to Simplified Chinese, which is the official written language of\nthe People’s Republic of China. Traditional Chinese is used in Taiwan, Hong Kong, Macau, and many overseas\nChinese communities.  The overarching theme of the spreadsheet is documenting protestor activity and/or\nprogressive reform attempts in progress across Taiwan and the tone of the spreadsheet suggests it was compiled\nby progressive supporters.” continues the report.\nIf you are interested in more info on Tropic Trooper APT , including IoC for its malware give a look at\nthe report .\nPierluigi Paganini\n(Security Affairs  – Tropic Trooper APT, cyber espionage)\nShare this...\n\nPREVIOUS ARTICLE\nCredit cards stolen from Madison Square\nGarden venues in the last year\n NEXT ARTICLE\nRegistral Function of the State Mexico\n(FREM) hacked. Shad0wS3C is back \nHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  \nTerrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact meHome  Cyber Crime  Cyber warfare  APT  Data Breach  Deep Web  Digital ID  Hacking  Hacktivism  Intelligence  Internet of Things  Laws and regulations  Malware  Mobile  Reports  Security  Social Networks  Terrorism  ICS-SCADA  EXTENDED COOKIE POLICY  Contact me\n "
}