{
    "title": "tropic trooper_ keyboy_ group g0081 _ mitre att_ck®",
    "text": "JUST RELEASED: ATT&CK for Industrial Control Systems\nGROUPS\nOverview\nadmin@338\nAPT1\nAPT12\nAPT16\nAPT17\nAPT18\nAPT19\nAPT28\nAPT29\nAPT3\nAPT30\nAPT32\nAPT33\nAPT37\nAPT38\nAPT39\nAPT41\nAxiom\nBlackOasis\nBRONZE BUTLER\nCarbanak\nCharming Kitten\nCleaver\nCobalt Group\nCopyKittens\nDark Caracal\nDarkhotel\nDarkHydrus\nDeep Panda\nDragonfly\nDragonfly 2.0\nDragonOK\nDust Storm\nElderwood\nEquation\nFIN10\nFIN4\nFIN5\nFIN6\nFIN7\nFIN8\nGallmaker\nGamaredon Group\nGCMAN\nGorgon Group\nGroup5\nHoneybee\nKe3chang\nKimsuky\nLazarus Group\nLeafminer\nLeviathan\nLotus Blossom\nMachete\nMagic Hound\nmenuPass\nMoafee\nMolerats\nMuddyWater\nNaikon\nNEODYMIUM\nNight Dragon\nOilRig\nOrangeworm\nPatchwork\nPittyTiger\nPLATINUM\nPoseidon Group\nPROMETHIUM\nPutter Panda\nRancor\nRTM\nSandworm Team\nScarlet Mimic\nSilence\nSilverTerrier\nSoft Cell\nSowbug\nStealth Falcon\nStolen Pencil\nStrider\nSuckfly\nTA459\nTA505\nTaidoor\nTEMP.Veles\nThe White Company\nThreat Group-1314\nThreat Group-3390\nThrip\nTropic Trooper\nTurla\nWinnti Group\nWIRTE\nHome\n>Groups\n>Tropic Trooper\nTropic Trooper\nAssociated Group Descriptions\nName Description\nKeyBoy\nTechniques Used\nDomain ID Name Use\nEnterprise T1043 Commonly Used Port Tropic Trooper  can use ports 443 and 53 for C2 communications via malware called TClient.\nEnterprise T1140 Deobfuscate/Decode Files or\nInformationTropic Trooper  used shellcode with an XOR algorithm to decrypt a payload.\nEnterprise T1073 DLL Side-Loading Tropic Trooper  has been known to side-load DLLs using a valid version of Windows Address Book executable with one of their tools.\nEnterprise T1203 Exploitation for Client Execution Tropic Trooper  has executed commands through Microsoft security vulnerabilities, including CVE-2017-11882, CVE-2018-0802, and CVE-2012-0158.\nEnterprise T1158 Hidden Files and Directories Tropic Trooper  has created a hidden directory under C:\\ProgramData\\Apple\\Updates\\ .\nEnterprise T1046 Network Service Scanning Tropic Trooper  used pr to scan for open ports on target systems.\nEnterprise T1135 Network Share Discovery Tropic Trooper  used netview  to scan target systems for shared resources.\nEnterprise T1050 New Service Tropic Trooper  installs a service pointing to a malicious DLL dropped to disk.\nEnterprise T1027 Obfuscated Files or Information Tropic Trooper  has encrypted configuration files.\nEnterprise T1057 Process Discovery Tropic Trooper  enumerates the running processes on the system.\nEnterprise T1055 Process Injection Tropic Trooper  has injected a DLL backdoor into a file dllhost.exe.\nEnterprise T1063 Security Software Discovery Tropic Trooper  searches for anti-virus software running on the system.\nEnterprise T1193 Spearphishing Attachment Tropic Trooper  sent spearphishing emails that contained malicious Microsoft Office attachments.\nEnterprise T1032 Standard Cryptographic Protocol Tropic Trooper  uses SSL to connect to C2 servers.\nEnterprise T1082 System Information Discovery Tropic Trooper  has detected a target system’s OS version.\nEnterprise T1033 System Owner/User Discovery Tropic Trooper  used letmein  to scan for saved usernames on the target system.\nEnterprise T1221 Template Injection Tropic Trooper  delivered malicious documents with the XLSX extension, typically used by OpenXML documents, but the file itself was actually an OLE\n(XLS) document.\nEnterprise T1004 Winlogon Helper DLL Tropic Trooper  creates the Registry key HKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell  and sets the value to establish\npersistence.\nSoftware\nID Name References Techniques\nS0190 BITSAdmin BITS Jobs, Exfiltration Over Alternative Protocol, Remote File Copy\nS0387 KeyBoy Command-Line Interface, Commonly Used Port, Credentials from Web Browsers, Custom Cryptographic Protocol, Dynamic Data Exchange, Exploitation for Client Execution, File\nand Directory Discovery, Hidden Window, Input Capture, New Service, Obfuscated Files or Information, PowerShell, Remote File Copy, Screen Capture, Scripting, System\nInformation Discovery, System Network Configuration Discovery, Timestomp, Winlogon Helper DLL\nS0012 PoisonIvy Application Window Discovery, Command-Line Interface, Data from Local System, Data Staged, Input Capture, Modify Existing Service, Modify Registry, New Service,\nObfuscated Files or Information, Process Injection, Registry Run Keys / Startup Folder, Remote File Copy, Rootkit, Standard Cryptographic Protocol, Uncommonly Used Port\nS0388 Yahoyah Deobfuscate/Decode Files or Information, Obfuscated Files or Information, Remote File Copy, Security Software Discovery, Standard Application Layer Protocol, System\nInformation Discovery\nReferencesTropic Trooper  is an unaffiliated threat group that has led targeted campaigns against targets in Taiwan, the Philippines, and Hong Kong. Tropic\nTrooper  focuses on targeting government, healthcare, transportation, and high-tech industries and has been active since 2011.[1][2]\nID: G0081\nAssociated Groups : KeyBoy\nContributors : Edward Millington, Bart Parys\nVersion : 1.2\nCreated: 29 January 2019\nLast Modified: 14 October 2019\n[2][1]\nATT&CK  Navigator Layers  ®\n[1]\n[2]\n[5]\n[1][2]\n[1]\n[3]\n[3]\n[6]\n[1]\n[2]\n[1]\n[2]\n[2][3][4]\n[1]\n[3]\n[3]\n[2]\n[2]\n[1]\n[2] [4]\n[2]\n[3]\n1. Horejsi, J., et al. (2018, March 14). Tropic Trooper’s New Strategy. Retrieved November 9, 2018.\n2. Ray, V. (2016, November 22). Tropic Trooper Targets Taiwanese Government and Fossil Fuel Provider With Poison Ivy. Retrieved November 9, 2018.\n3. Alintanahin, K. (2015). Operation Tropic Trooper: Relying on Tried-and-Tested Flaws to Infiltrate Secret Keepers. Retrieved June 14, 2019.\n4. Alexander, G., et al. (2018, August 8). Familiar Feeling: A Malware Campaign Targeting the Tibetan Diaspora Resurfaces. Retrieved June 17, 2019.\n5. Hulcoop, A., et al. (2016, November 17). It’s Parliamentary KeyBoy and the targeting of the Tibetan Community. Retrieved June 13, 2019.\n6. Parys, B. (2017, February 11). The KeyBoys are back in town. Retrieved June 13, 2019.\n© 2015-2020, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation.\nPrivacy Policy\nTerms of Use\nATT&CK v6.3\n @MITREattack\nContact\n "
}