{
    "title": "twin zero-day attacks_ promethium and neodymium target individuals in europe - microsoft security",
    "text": " \n  \n  \n  \n  \n  \nTargeted attacks are typically carried out against individuals to obtain intellectual property and other\nvaluable data from target organizations. These individuals are either directly in possession of the targeted\ninformation or are able to connect to networks where the information resides. Microsoft researchers have\nencountered twin threat activity groups that appear to target individuals for reasons that are quite\nuncommon.\nUnlike many activity groups, which typically gather information for monetary gain or economic\nespionage, PROMETHIUM and NEODYMIUM appear to launch campaigns simply to gather information\nabout certain individuals. These activity groups are also unusual in that they use the same zero‐day\nexploit to launch attacks at around the same time in the same region. Their targets, however, appear to be\nindividuals that do not share common affiliations.\nActivity group profiles\nPROMETHIUM  is an activity group that has been active as early as 2012. The group primarily uses\nTruvasys , a first‐stage malware that has been in circulation for several years. Truvasys has been involved in\nseveral attack campaigns, where it has masqueraded as one of server common computer utilities,\nincluding WinUtils, TrueCrypt, WinRAR, or SanDisk. In each of the campaigns, Truvasys malware evolved\nwith additional features— this shows a close relationship between the activity groups behind the\ncampaigns and the developers of the malware.\nNEODYMIUM  is an activity group that is known to use a backdoor malware detected by Microsoft as\nWingbird . This backdoor’s characteristics closely match FinFisher, a government‐grade commercial\nsurveillance package. Data about Wingbird activity indicate that it is typically used to attack individual\ncomputers instead of networks.\nSimilarly timed attacks\nIn early May 2016, both PROMETHIUM and NEODYMIUM started conducting attack campaigns against\nspecific individuals in Europe. They both used an exploit for CVE‐2016‐4117 , a vulnerability in Adobe\nFlash Player that, at the time, was both unknown and unpatched.\nPROMETHIUM distributed links through instant messengers, pointing recipients to malicious documents\nthat invoked the exploit code to launch Truvasys on victim computers. Meanwhile, NEODYMIUM used\nwell‐tailored spear‐phishing emails with attachments that delivered the exploit code, ultimately leading to\nWingbird’s installation on victim computers.\nWhile the use of the same exploit code could be attributed to coincidence, the timing of the campaigns\nand the geographic location of victims lend credence to the theory that the campaigns are somehow\nrelated.\nStopping exploits in Windows 10\nPROMETHIUM and NEODYMIUM both used a zero‐day exploit that executed code to download a\nmalicious payload. Protected view , a security feature introduced in Microsoft Office 2010, can prevent the\nmalicious Flash code from loading when the document is opened. Control Flow Guard , a security feature\nthat is turned on by default in Windows 10 and Microsoft Office 365  64‐bit, can stop attempts to exploit\nmemory corruption vulnerabilities. In addition, Credential Guard , an optional feature introduced in\nWindows 10, can stop Wingbird’s use of the system file, lsass.exe , to load a malicious DLL.\nDetecting suspicious behaviors with\nWindows Defender Advanced Threat\nProtection\nWindows Defender Advanced Threat Protection  ﴾Windows Defender ATP ﴿is a new built‐in service that\nships natively with Windows 10 and helps enterprises to detect, investigate and respond to advanced\ntargeted attacks. When activated, it captures behavioral signals from endpoints and then uses cloud‐\nbased machine learning analytics and threat intelligence to flag attack‐related activities.\nWingbird, the advanced malware used by NEODYMIUM, has several behaviors that trigger alerts in\nWindows Defender ATP. Windows Defender ATP has multiple behavioral and machine learning detection\nrules that can catch various elements of the malware kill chain. As a result, it can generically detect,\nwithout any signature, a NEODYMIUM attack in the following stages:\nZero‐day exploits causing Microsoft Office to generate and execute malicious files\nZero‐day exploits attempting to grant malicious executables higher privileges\nMalicious files trying to delete themselves\nMalicious files attempting the DLL side‐loading technique, in which legitimate DLLs in non‐\nstandard folders are replaced by malicious ones so that malicious files are loaded by the\noperating system or by installed applications\nMalicious files injecting code into legitimate processes\nIn the example below, Windows Defender ATP alerts administrators that something is amiss. It notifies\nthem that an Office document has dropped an executable file in one of their computers— activity that is\nvery likely part of an attack.\nAdditionally, Windows Defender ATP and Office 365  ATP leverage rules based on IOCs and threat\nintelligence specific to PROMETHIUM and NEODYMIUM. Alerts from these rules work alongside concise\nbriefs and in‐depth profiles provided in the Windows Defender ATP console to help administrators\naddress breach attempts by these activity groups.\nFor more information about Windows Defender ATP service in Windows 10, check out its features and\ncapabilities  and read more about why a post‐breach detection approach is a key component of any\nenterprise security stack.\nDetails about PROMETHIUM and NEODYMIUM along with indicators of compromise can be found in the\nMicrosoft Security Intelligence Report volume 21 .\nTo test how Windows Defender ATP can help your organization detect, investigate, and respond to\nadvanced attacks, sign up for a free trial .\n \nWindows Defender ATP team\n \n \n \n \nTalk to us\nQuestions, concerns, or insights on this story? Join discussions at the Microsoft community  and Windows\nDefender Security Intelligence .\nFollow us on Twitter @WDSecurity  and Facebook Windows Defender Security Intelligence .\n \nFiled under:\nCybersecurity , Security Intelligence , Security Response\nGet started with Microsoft Security\nMicrosoft is a leader in cybersecurity, and we embrace our responsibility to\nmake the world a safer place.\n \nWhat's new\nSurface Pro X\nSurface Laptop 3\nSurface Pro 7\nWindows 10 apps\nOffice appsMicrosoft Store\nAccount profile\nDownload Center\nMicrosoft Store support\nReturns\nOrder tracking\nStore locations\nBuy online, pick up in store\nIn‐store eventsEducation\nMicrosoft in education\nOffice for students\nOffice 365  for schools\nDeals for students & parents\nMicrosoft Azure in educationEnterprise\nAzure\nAppSource\nAutomotive\nGovernment\nHealthcare\nManufacturing\nFinancial services\nRetailDeveloper\nMicrosoft Visual Studio\nWindows Dev Center\nDeveloper Network\nTechNet\nMicrosoft developer program\nChannel 9\nOffice Dev Center\nMicrosoft GarageCompany\nCareers\nAbout Microsoft\nCompany news\nPrivacy at Microsoft\nInvestors\nDiversity and inclusion\nAccessibility\nSecurity\nEnglish ﴾United States﴿ Sitemap  Contact Microsoft  Privacy & cookies  Terms of use  Trademarks  Safety & eco  About our ads  © Microsoft 2020You may also like these articles\nGet all the news, updates, and more at @MSFTSecurity\n     Sign in |Security Search  \nDecember 14, 2016\nTwin zero‐day attacks: PROMETHIUM and\nNEODYMIUM target individuals in Europe\nMicrosoft Defender ATP Research Team\nRead more \nRead more \nRead more \nLEARN MORE Solutions  Products  Operations & Intelligence  Partners  Resources  Trust Center  All Microsoft \n "
}