{
    "title": "vietnamese bank blocks $1 million swift heist",
    "text": "TRENDING:\nAround the Network  ISMG Network USA Sign in Register CyberEd.io Membership\nTopics   News   Training   Resources   Events   Jobs  \n• ISMG at RSAC 2020 - View Coverage from the Conference Floor • Live Webinar | Ensuring Faster Payments Do NOT Equate to Faster Fraud\nYou might also be interested in …  Data Loss Prevention (DLP)  , Fraud Management & Cybercrime  , Governance & Risk Management\nVietnamese Bank Blocks $1 Million SWIFT\nHeist\nAttempted Heist Reportedly Targeted TPBank's SWIFT Software With Trojanized PDF Reader\nMathew J. Schwartz  (euroinfosec ) • May 16, 2016     \nA Vietnamese bank says it foiled a plot to transfer $1.36 million out of its accounts - via the\ninterbank SWIFT messaging system - in the fourth quarter of 2015 as part of a suspected\nmalware  attack launched by fraudsters (see SWIFT Warns Banks: Coordinated Malware Attacks\nUnderway ).\nSee Also:  Active Deception to Combat Advanced Threats\nTien Phong Commercial Joint Stock Bank, based in Hanoi, on May 15 said in a statement to\nReuters  that it detected the suspicious transfer requests quickly enough to contact receiving\nbanks and put a stop to the transfers. The attempted attack \"did not cause any losses,\"\nTPBank's statement reportedly said. \"It had no impact on the SWIFT system in particular\nand the transaction system between the bank and customers in general.\"\nSWIFT, which stands for the Society for Worldwide Interbank Financial Telecommunication,\nis a Brussels-based cooperative, owned by 3,000 banks, that was founded in 1973, and\nwhich maintains a messaging system used by 11,000 banks.\nThe State Bank of Vietnam - the country's central bank - is probing the attack after having\nreceived related information from TPBank on May 16, spokeswoman Le Thi Thuy Sen tells\nBloomberg .\nTPBank and the State Bank of Vietnam couldn't be immediately reached for comment on\nthose reports.\nSWIFT declined to comment on those reports, except to point to a May 13 security alert\nthat it sent to its customers, warning them of \"a highly adaptive campaign targeting banks'\npayment endpoints.\" That warning said an unnamed Vietnamese bank had also been\ntargeted by the same attackers who attempted to transfer $1 billion out of the central bank\nof Bangladesh's account at the Federal Reserve of New York.\nIn the Bangladesh Bank case, the attackers successfully transferred $100 million to\noverseas accounts, of which $81 million is still missing . Investigators say the stolen funds\nwere laundered via casinos in the Philippines. SWIFT says the attack was carried out in part\nafter attackers used malware  to infect a PDF reader used by bank employees.\nTPBank Blames Third-Party Vendor\nTPBank's statement said the fraudulent transfer requests were made using an unnamed\nthird-party vendor with which the bank had contracted, to allow it to interface with the\nSWIFT network. The bank said that in the wake of the fraudulent transfer requests, it\nstopped working with the third-party provider and now has a more secure system which\ndirectly interfaces with the SWIFT platform.\nTPBank told Reuters  that the attack against it might have been carried out using the\nTrojanized PDF reader detailed in SWIFT's customer alert.\nSWIFT: 'Small Number' of Similar Cases\nIn its May 13 customer alert, SWIFT warned that beyond Bangladesh Bank, it was aware of a\n\"small number\" of similar cases at other banks, involving attackers successfully infecting an\nunnamed PDF reader used at victim banks, which could be used to alter statements and\ndisguise fraudulent transfers. Its alert did not name TPBank.\nBritish defense contractor BAE Systems  on May 13 released research saying that \"a\ncommercial bank in Vietnam ... also appears to have been targeted in a similar fashion\nusing tailored malware, but based off a common code base\" (see Bangladesh Bank Attackers\nHacked SWIFT Software ).\nThreat-intelligence firm iSight Partners says there is at least one more victim that has not\nyet been publicly disclosed. \"We believe that at least three financial institutions in the region\nwere affected by these actors, and in two instances, malware was deployed that had\nfunctionality specifically associated with SWIFT fraud,\" the firm says in a research note that\nalso names the PDF reader targeted by attackers.\n\"The malware used to target the Vietnamese bank replaces Foxit's popular PDF reader\nsoftware to mask records of SWIFT transactions when read,\" iSight Partners says. \"When\nreports are read through the PDF reader, SWIFT records are altered to remove traces of\nfraudulent transactions.\"\nThe Lazarus Group Connection\nBased on its digital forensic investigation , BAE Systems said the malware appeared to be\ntied to the Lazarus Group, as detailed in a February report into Operation Blockbuster that\nwas coordinated by anti-fraud and analytics firm Novetta. BAE Systems said the group also\nappeared to use a code compiler named Kordllbot , and to have focused its attacks on\norganizations in South Korea and the United States.\nThe Novetta report said the Lazarus Group \"has been active since at least 2009, and\npotentially as early as 2007, and was responsible for the November 2014 destructive wiper\nattack against Sony Pictures Entertainment.\"\nBAE Systems said that it did not have enough evidence to incontrovertibly attribute the\nBangladesh and Vietnamese bank hacks to the same group that hacked Sony. But it said\ncurrently available evidence strongly suggests a connection. \"We believe that the same\ncoder is central to these attacks,\" it said. \"Who the coder is, who they work for, and what\ntheir motivation is for conducting these attacks cannot be determined from the digital\nevidence alone.\"\nWho's Responsible for Securing SWIFT?\nThe bank hacking campaign has revealed uneven information security practices at some\nSWIFT-using banks. In the wake of the February theft from Bangladesh Bank, which came to\nlight in March, bank officials publicly said the Federal Reserve Bank of New York and SWIFT\nwere at least partially to blame. But the New York Fed fired back, saying that it had honored\nvalid SWIFT requests, and SWIFT said that the attackers had been able to gain access to\nBangladesh Bank's back-end systems and submit what appeared to be legitimate SWIFT\nmessages.\nA subsequent Bangladesh police investigation reportedly concluded that a SWIFT\ntechnician left exploitable loopholes  after connecting the bank to SWIFT's network, to\nfacilitate real-time payments. But other reports suggested that the bank lacked robust\npasswords and authentication controls, or even firewalls (see SWIFT to Banks: Get Your\nSecurity Act Together ).\nOn May 10, representatives from SWIFT, Bangladesh Bank and New York Fed met to discuss\nthe attack and related investigations, and issued a joint statement pledging greater\ncooperation.\nSWIFT has also continued to urge all customers to conduct a top-to-bottom review of their\nsecurity defenses. \"Please remember that as a SWIFT user you are responsible for the\nsecurity of your own systems interfacing with the SWIFT network and your related\nenvironment - starting with basic password protection practices - in much the same way as\nyou are responsible for your other security considerations,\" its May 13 security alert reads.\n\"Whilst we issue, and have recently reminded you about, security best practice\nrecommendations, these are just a baseline and general advice.\"\nAbout the Author\n Twitter\n Facebook\n LinkedIn Credit Eligible  Get Permission\nData Loss Prevention (DLP) Endpoint Security Forensics Fraud Management & Cybercrime\nGovernance & Risk Management Network Firewalls, Network Access Control\nNext-Generation Technologies & Secure Development Security Operations\n\n Twitter\n Facebook\n LinkedIn Credit Eligible  Get Permission\n Previous\nFFIEC's New Mobile Security Guidance: An AssessmentNext \nApple Nixes iOS Security Tool From Noted Researcher\nMathew J. Schwartz\nExecutive Editor, DataBreachToday & Europe\nSchwartz is an award-winning journalist with two decades of experience in magazines,\nnewspapers and electronic media. He has covered the information security and\nprivacy sector throughout his career. Before joining Information Security Media Group\nin 2014, where he now serves as the executive editor, DataBreachToday and for\nEuropean news coverage, Schwartz was the information security beat reporter for\nInformationWeek and a frequent contributor to DarkReading, among other\npublications. He lives in Scotland.\n  \nCase Study: A View of Deception\nTechnology in Security Testing\nDeception-Based Threat\nDetection: Shifting Power to the\nDefenders\nMaintaining Continuous\nCompliance with GDPRFollow us on TwitterGET DAILY EMAIL UPDATES\nCovering topics in risk management, compliance,\nfraud, and information security.\nBy submitting this form you agree to our Privacy &\nGDPR Statement\nRESOURCES\nLATEST NEWS\nLATEST TWEETS AND MENTIONSSubmit\nTop 5 Log Sources You Should\nBe Ingesting but Probably\nAren't\n451 Research Report: Tackling\nthe Visibility Gap in\nInformation Security\nThree Steps to Securing\nEnterprise Data on Cloud\nPlatforms\nGoing Selectively Active for\nComprehensive OT Visibility\nAre Your Internet Assets\nBehaving?\nNew TrickBot Variant Targets\nTelecoms in US, Asia: Report\nGovernance & Risk Management\nResearcher: Microsoft Edge\nLeast Private of 6 Browsers\nThe Changing DDoS\nLandscape\nTips on Ransomware Defense\nStrategies\nLiving and Working Amid\nCOVID-19 Crisis\nFarzalSays\nResearcher: Microsoft Edge Least Private\nof 6 Browsers - https://t.co/84hua5iqpG\nhttps://t.co/eGcUrzml7Y  Researcher…\nhttps://t.co/kslEZ9Of3v\nless than a minute ago. Retweet\nCorderyUK\nRT @armstrongjp : Good to chat with\n@DataBreachToday  with @euroinfosec\nchatting about #COVID19  & #infosec\nissues with #workingfromhome  https…\nabout a minute ago. Retweet\narmstrongjp\nGood to chat with @DataBreachToday\nwith @euroinfosec  chatting about\n#COVID19  & #infosec  issues with…\nhttps://t.co/dlstaklpT1\n3 minutes ago. Retweet\nkellerschroeder\nAt a time when companies are\ntemporarily closing doors & limiting\naccess, the cyber crime community is\nramping up &… https://t.co/iUVS7H6F87\n4 minutes ago. Retweet\ncybersec_feeds\nRT @MicroFocusJobs : DOD Warns of\nCyber Risks as Employees Work From\nHome due to #COVID19  pandemic,\nreports @DataBreachToday : |\n#CyberSecuri …\n6 minutes ago. Retweet\nLiving and Working Amid COVID-19\nCrisis\nCOVID-19 Response: 5 Tips for Securing\nRemote Workplace\nNDR in the Cloud\n COVID-19 Fueling Phishing, Other\nAttacks on Healthcare Sector\nExplore\nNews\nTraining\nResources\nEvents\nJobsAbout\nEditorial\nBoard of Advisers\nPress\nAdvertise\nContactResource Centers\nDDoS Resource Center\nFFIEC Authentication Guidance\nGDPR\nHIPAA Omnibus Rule\nRansomware\nSecurity IntelligenceFollow Us\n\nNewsletter\nBy submitting this form you agree to our Privacy & GDPR\nStatementSign up\n© 2020 Information Security Media Group, Corp.  | About ISMG  | Privacy & GDPR Statement  | CCPA: Do Not Sell My Personal Data\n| Sitemap  | Advertise\nEmail address\nEmail\nOur website uses cookies. Cookies enable us to provide the best experience possible and help us understand how visitors use our website. By browsing bankinfosecurity.com, you agree to our use of cookies.\n "
}