{
    "title": "vietnam_s neighbors_ asean_ targeted by hackers_ report - reuters",
    "text": "TECHNOLOGY NEWS NOVEMBER 7, 2017 / 9:44 AM / 2 YEARS AGO\nVietnam's neighbors, ASEAN, targeted by\nhackers: report\n4 MIN READ\nSINGAPORE (Reuters) - A hacking group previously linked to the Vietnamese\ngovernment or working on its behalf has broken into the computers of neighboring\ncountries as well as a grouping of Southeast Asian nations, according to cybersecurity\ncompany Volexity.\nSteven Adair, founder and CEO, said the hacking group was still active, and had\ncompromised the website of the Association of Southeast Asian Nations (ASEAN)\nover several high-profile summit meetings. ASEAN is holding another summit of\nregional leaders in the Philippines capital Manila this week.\nIn May, cybersecurity company FireEye reported that the group, which it calls APT32\nand is also known as OceanLotus, was actively targeting foreign multinationals and\ndissidents in Vietnam. FireEye said at the time the group’s activity was “of interest to\nthe nation of Vietnam.”\nAdair told Reuters he had no basis to definitely say who was behind the group but said\nits capabilities rivalled those of most other advanced persistent threat (APT) groups, a\nterm often used to refer to hacker groups that are believed to have state support.\n“What we can say is that this is a very well resourced attacker that is able to conduct\nseveral simultaneous attack campaigns.”\nVietnamese officials did not immediately respond to requests for comment. But Hanoi\nhas in the past denied accusations of cyber-attacks against organizations or individuals,\nand said it would prosecute any cases.\nAdair said it was not clear how much information the group had stolen. “We do not\nreally have anything on the scale of data theft, but we can tell you the scale and reach of\nthe sites they have compromised is very far reaching,” he said.\nVolexity said in a report that the group had compromised websites of ministries or\ngovernment agencies in Laos, Cambodia and the Philippines so they would load\nmalicious code onto the computers of targeted victims.\nThis code would then direct them to a Google page which asked for their permission to\naccess their Google account. If the user agrees, the hackers then have access to their\ncontacts and emails. \nThe ministries included Cambodia’s ministries of foreign affairs, the environment, the\ncivil service and social affairs, as well as its national police. In the Philippines it had\ncompromised the websites of the armed forces and the office of the president.\nThree ASEAN websites, and the websites of dozens of Vietnamese non-government\ngroups, individuals and media, were similarly targeted. The group also infected\nwebsites belonging to several Chinese oil companies.\nOfficials at ASEAN’s headquarters in Jakarta were not immediately available for\ncomment.\nKirt Chanthearith, a spokesman for the Cambodian national police, said the police\nwebsite was hacked about six months ago but he did not know who was responsible. “It\nwas hacked and we lost some data”, he said, without giving further details.\nA hooded man holds laptop computer as cyber code is projected on him in this illustration picture taken\non May 13, 2017. REUTERS/Kacper Pempel/IllustrationADVERTISEMENT\nTRENDING\nSpecial Report: 'All is well'. In\nItaly, triage and lies for virus\npatients\n'D' word rears head as\ncoronavirus-hit markets brace\nfor recession\nGermany tries to halt U.S.\ninterest in firm working on\ncoronavirus vaccine\nAustralian researchers map\nimmune response to coronavirus\nAnother black Monday as\ncoronavirus response upends\nWall StreetDirectory of sites Login Contact Support\nBusiness Markets World Politics TV More\nDiscover Thomson Reuters\n Officials in Thailand said they were not aware of any hacking of government or police\nwebsites.\nIn Manila, Allan Cabanlong, executive director of the Cybercrime Investigation and\nCoordination Centre, said there was no damage to government web sites in the\nPhilippines but authorities were taking preventive measures.\n“We’ve taken measures like cyber hygiene programs,” he told Reuters. “We are\nconducting due diligence in the Philippines and we are clearing our network.”\nReporting by Jeremy Wagstaff; Additional reporting by Chansy Chhorn in PHNOM PENH, Matthew Tostevin in\nHANOI, Patpicha Tanakasempipat and Suphanida Thakral in BANGKOK, Agustinus Beo Da Costa in JAKARTA and\nNeil Jerome Morales in MANILA; Editing by Raju Gopalakrishnan\nOur Standards: The Thomson Reuters Trust Principles.\nMORE FROM REUTERS\nAnother black Monday as coronavirus response upends\nWall Street\n16 Mar\nU.S. Labor Department allows unemployment benefits for\nCoronavirus\n12 Mar\nAfter Trump boasts about rally, Wall\nStreet tanks again\n16 Mar\nBritain backs Putin idea of five-way\nsummit of world powers - UK...\n13 Mar\nSpecial Report: 'All is well'. In Italy,\ntriage and lies for virus...\n16 Mar\nMORE FROM REUTERS\nREUTERS NEWS NOW\nSubscribe to our daily curated newsletter to\nreceive the latest exclusive Reuters coverage\ndelivered to your inbox.\nEnter email address\nSubmit\n Apps Newsletters Advertise with Us Advertising Guidelines Cookies Terms of Use Privacy\nAll quotes delayed a minimum of 15 minutes. See here for a complete list  of exchanges and delays.\n© 2020  Reuters. All Rights Reserved.MORE FROM REUTERS\nGermany tries to halt U.S. interest in firm working on\ncoronavirus...\n15 Mar\nPompeo conveyed 'strong U.S. objections' to Beijing over\nCOVID-19...\n17 Mar\nAustralian researchers map immune\nresponse to coronavirus\n17 Mar\nFear and loathing bloom as American\ntempers fray in coronavirus crisis\n17 Mar\nCoronavirus causes historic market\ndrop, global scramble to contain...\n17 Mar\n "
}