{
    "title": "virus bulletin 2019_ japanese attacks highlight savvy apt strategy _ threatpost",
    "text": "/ / / /\n Cloud Security Malware Vulnerabilities InfoSec Insider Podcasts\n  Search\nGoogle Adds Password Checkup Feature to Chrome Browser\n Virus Bulletin 2019: Geost Android Botnet Goes After Millions of Euros\nVirus Bulletin 2019: Japanese Attacks\nHighlight Savvy APT Strategy\nAuthor:\nOctober 2, 2019\n/ 12:47 pm\n2 minute read\n Write a comment\nShare this article:Tara Seals\nMultiyear campaigns stretching back to at least 2014 have been seen\nusing zero-days in region-specific software.\nLONDON — Three separate, multi-year APT campaigns targeting region-specific software\nshowcase a savvy technique of leveraging zero-day vulnerabilities in niche software in order\nto infect victims with malware.\nAccording to researchers at JPCERT in Japan, speaking at Virus Bulletin 2019, both the\nAPT17 and Bronze Butler threat groups have carried out ongoing campaigns that use the\nsame techniques, swapping out exploits as new exploits are developed. The targets of the\nattacks are generally Japanese government agencies and vertical organizations, including\neducation organizations, researchers said, with the most recent malicious activity seen in\nApril 2019.\nAccording to JPCERT researchers Tomoaki Tani and Shusei Tomonaga, the regional\nsoftware targeted by the APTs includes Sanshiro (a spreadsheet application similar to\nMicrosoft Excel, which was discontinued in 2014 but still used across Japan); Ichitaro (a\nword processing, software similar to Microsoft Word); and SkySea Client View (an\nenterprise asset-management tool).\nWhen it comes to Sanshiro, major campaigns from APT17 leveraged a zero-day exploit for\nan arbitrary code execution vulnerability (CVE-2014-0810), spread in malicious documents\nattached to spearphishing emails. It began its routine when the user opened the software;\nand the endgame was the delivery of the PlugX remote access trojan (RAT).\n“This exploit was shared in several campaigns, and perhaps the actor was the same in all of\nthem,” said Tani, speaking in a Wednesday session at Virus Bulletin 2019. “Further analysis\nshowed that PlugX was used in other attacks, with each sample resolving to the same\ncommand-and-control server address.”\nA similar effort targeted Ichitaro, which was used in a multi-year campaign starting in 2014\ndubbed Blue Termite. It affected more than 100 organizations across Japan; here, another\nzero-day code-execution exploit (CVE-2014-7247) was used in spearphishing campaigns to\nspread a triumvirate of malware: PlugX and two bots, Emdivi and Agtid. The bots can upload\nand download files from the victim’s computer.\nJPCERT also observed attacks likely carried out by an APT called Bronze Butler, making use\nof the SkySea Client View software, which is an asset-management software. It contains a\nvulnerability (CVE-2016-7836) that was exploited as a zero-day campaign in 2016 – and it\nwas seen continuing through February 2019. It was used to execute the NodeRAT\nmultiplatform backdoor malware, which is written in JavaScript and runs on Node.js; and\nthe Wali downloader application.\nThis attack is linked, researchers suspect, to an April 2019 effort targeting a vulnerability in\nthe Virus Buster Corporate Edition from Trend Micro, which is popular in Japan.\nIn all cases, the campaigns were aimed at infiltrating target networks, moving laterally and\nstealing data, in classic APT fashion.\nThe takeaway from the research is that APT groups are actively targeting niche attack\nsurfaces in hopes of flying under the radar of defenders. While these particular attacks\noccurred in Japan, the same approach would prove effective elsewhere, according to Tani.\n“Targeted attacks against Japanese organizations exploited three different vulnerabilities in\nsoftware that’s used only in Japan,” Tani concluded. “Nonetheless, these APT groups\ninvestigated this software and leveraged them for attacks. Unlike more popular software, it is\noften the case that countermeasures against vulnerabilities in such regional attacks are not\nwell-prepared. Attackers understand this and aim for such weak points.”\nWhat are the top cyber security issues associated with privileged account access and\ncredential governance? Experts from Thycotic will discuss during our upcoming free\nThreatpost webinar , “Hackers and Security Pros: Where They Agree & Disagree When It\nA Practical Guide to Zero-Trust\nSecurity\nJanuary 15, 2020  2\n7 Tips for Maximizing Your SOC\nDecember 31, 2019  5\nMean Time to Hardening: The Next-\nGen Security Metric\nDecember 30, 2019  4\nCombining AI and Playbooks to\nPredict Cyberattacks\nDecember 26, 2019  1\nThe Case for Cyber-Risk Prospectuses\nDecember 24, 2019  1\nNewsletter\nSubscribe to Threatpost Today  \nJoin thousands of people who receive the\nlatest breaking cybersecurity news every day.\nSubscribe now\nTwitter\nAs the threat of \ncontinues to spread, businesses are\nsending employees home to work\nremotely - But wit… \n7 mins ago\nFollow @threatpost\n#coronavirus\nhttps://t.co/DCvZKitL4DINFOSEC INSIDER\n Leave A Comment\nSend Comment\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\n \nThis site uses Akismet to reduce spam. Learn how your comment data is processed .Comes to Your Privileged Access Security.” Click here to register .\nWrite a comment Share this article:\nGovernment\n Hacks\n Vulnerabilities\nMicrosoft Zero-Day Actively\nExploited, Patch Forthcoming\nCVE-2020-0674 is a critical flaw for\nmost Internet Explorer versions,\nallowing remote code execution and\ncomplete takeover.\nJanuary 21, 2020  4\nNews Wrap: Hotel Robot\nHacks, FTC Stalkerware\nCrackdown\nFrom hacking hotel room robots to\ncrackdowns on stalkerware apps,\nThreatpost editors break down this\nweek’s top news stories.\nOctober 25, 2019\nBedside Hotel Robot Hacked\nto Stream In-Room Video\nAn unsecured NFC tag opens a door to\ntrivial exploitation of robots inside\nJapanese hotels.\nOctober 23, 2019\nWrite a reply...\nYour name\n Your email\nSave my name, email, and website in this browser for the next time I comment.\nNotify me when new comments are added.\nThe First Stop For Security News Home\n About Us\n Contact Us\n Advertise With Us\n RSS Feeds\nCopyright © 2020 Threatpost Privacy Policy Terms and Conditions Advertise\n Black Hat Breaking News Cloud Security Critical Infrastructure Cryptography Facebook\nGovernment Hacks IoT Malware Mobile Security Podcasts Privacy RSAC\nSecurity Analyst Summit Videos Vulnerabilities Web Security\nSUGGESTED ARTICLES\nDISCUSSION\nTOPICS\nSubscribe to our newsletter, Threatpost Today ! Get the latest breaking news delivered daily to your inbox. Subscribe now\nWe use cookies to make your experience of our websites better. By using and further navigating this website you accept this. Detailed information about the use of cookies on this website is available by clicking on more information .\n ACCEPT AND CLOSE\n "
}