{
    "title": "virus bulletin __ curious tale of 8.t used by multiple campaigns against south asia",
    "text": "Curious tale of 8.t used by multiple campaigns against\nSouth Asia\nThursday 3 October 15:00 - 15:30, Red room\nNiranjan Jayanand  (Microsoft) \nIvan Macalintal  (Microsoft) \nDebalina Ghosh  (Microsoft)\nThis presentation will cover the long-running attack campaigns targeting South Asian officials mainly working in the\ngovernment, oil, media and maritime sectors as well as defence contractors, universities (particularly those with military\nresearch ties) and legal organizations. The main motivation behind these attacks is espionage aligned with commercial and\nSouth China Sea issues for intellectual property theft and military espionage.\nAttackers use multi-stage attack techniques to target their victims during their campaigns. During the reconnaissance stage,\nthey collect lots of information such as the software and applications that are vulnerable at the customer end. Over the past\nfew years, attackers have been using poisoned Microsoft Office documents as one of their preferred infection vectors for\ncybercrime and cyber espionage attacks. It doesn’t take long for malware authors to integrate novel techniques into their own\nexploit kits and attack ordinary users. Attackers quickly adopt most of these application CVEs.\nIn the campaigns we analysed, it was identified that multiple APT groups (namely Leviathon, Goblin Panda, Winnti and\nSidewinder) targeted South Asian countries using the Microsoft Office vulnerabilities CVE-2017-11882, CVE-2017-0199 and CVE-\n2017-8759. From fellow researchers’ APT research, it was also identified that a unique object dimension present in RTF\nphishing files was weaponized with CVE-2017-11882 and CVE-2018-0802, which appear to be utilized by numerous Asian APT\ngroups. The identified RTFs all share a unique object height and width, which determine how the object will be rendered in\nMicrosoft Word. We used this to expand our research to track APT groups.\nOnce the victim executes the poisoned Microsoft Office files, the shellcode that decrypts the final payload in memory was\nidentified to use one constant file name, ‘8.t’, across all the campaigns. Some of the identified payloads are NewCore RAT,\nHawkball backdoor, Fucobha, QCRat, PlugX, htpRAT and an unnamed RAT. Most of these remote administration tools relied on\nthe DLL side ‑loading technique to survive on reboot. It is very rare to see possibly different APT groups using the same\nshellcode name and two different shellcode decryption logics to drop and execute final RAT payloads on victim machines,\nacross different identified APT campaigns. It was also identified that attackers came back to target almost the same victim\norganizations in South Asian countries over this time. At a certain time, the APT groups likely had an infrastructure overlap.\nAttackers continued using the same trends and traits with minimum modification to target the same victims, regions and\nsectors, which makes us belief that they may have shared TTPs, code and infrastructure to steal intellectual data from victim\norganizations. Many filenames and attacker command-and-control domains collected during the investigation used themes\nrelated to the victim country current affairs or organizations.\n \nNiranjan Jayanand\nNiranjan Jayanand has over 11 years of experience in anti-malware and security companies including\nSymantec  and McAfee  and has recently joined  Microsoft . Niranjan is an experienced principal threat\nintelligence analyst with sound knowledge of threat group tracking, reverse engineering, Yara , generic\nantivirus signature creation and threat report writing for customers. He has authored over 60 proactive APT\nreports on attacks hitting the MENA region and South Asian countries. He has good experience working on\nPRC origin attacks and Iranian groups. Among the attacks investigated , most of them were identified when\nthe attack was on going and customers were alerted at the earliest. In the past Niranjan has worked on\nmultiple customer escalations on outbreaks that have infected many machines, and helped them remediate\ninfections. In his free time, Niranjan loves travel, spending time with his family and pets. He is very active\nwith a number of charity groups in South India and finding out ways on how he can help others.\n \nDebalina Ghosh\nDebalina Ghosh is a Threat Intelligence Analyst at Microsoft  and is based out of Hyderabad. She graduated in\n2018 and has been a part of the Threat Intel team ever since March 2019. Debalina has a background in the\noffensive side of security, and holds a GPEN certification from SANS, she also holds eCPPT and eJPT\ncertification from eLearnSecurity. Debalina currently works on telemetry hunting and attribution of threat\nactors. She hunts for new TTPs across various online platforms and collects sources for the same.  During\nher time at university Debalina led the Cyber Security Club for two years. She plays a lot of Capture the Flag\n(CTF) competitions and won the Winja Capture the Flag, which was held at NullCon. She also won the\nBlackHat Asia Scholarship 2018, which was hosted in Singapore. She has also participated at HackIM CTF\nNullCon and was ranked in the TOP 20. In her free time, Debalina travels and likes to spend time with\nanimals.\n \nIvan Macalintal\nIvan Macalintal has spent more than 16 years in the anti-malware and security industry and progressed\nfrom an-timalware engineer, analyst and researcher roles to founding and leading operations and threat\nresearch teams as well multiple high-impact projects, processes and services for global industry partners\nand customers, in Trend Micro  for more than a decade, and now in Microsoft  for more than four years.\nIvan is passionate about:\n1) Threat analysis and research, connecting the dots and spotting the needles in the haystack of threat\nintelligence from advanced persistent threats, targeted attacks, cybercrime campaigns and other threats\ntargeting data confidentiality, integrity and availability;\n2) Reverse-engineering, static and dynamic code analysis, Internet forensics, open source intelligence;\n3) Industry, partner and customer engagements;\n4) Global and regional cross-functional and cross-cultural project and people management for anti-\nmalware, cyber-threat solutions research, planning, and deployment; \n5) Correlation and consolidation of big data to protect customers and to further research new emerging\nthreats.\nIvan has published numerous impactful and newsworthy blog articles and presented at various industry\nconferences: Virus Bulletin, Association of Antivirus Asia Researchers (AVAR), the High Technology Crime\nInvestigation Association (HTCIA), B-Sides, Digital Crimes Consortium (DCC), Microsoft TechEd North\nAmerica and the Microsoft Security Response Alliance (MSRA) summit, and has been a well-travelled SME,\nconsultant and resource for management and executive teams for customer and threat-marketing related\nprojects and goals.\nDuring his free time, he leads efforts in diversity and inclusion and is involved in projects for non-profit\ncommunity building. He is also starting to write mystery novels, forever searching for the perfect cup of\ncoffee and enjoys simply spending time with family and friends to 'make a life, not just a living'.Selena Larson  (Dragos)\nLuca Nagy  (Sophos)\nSpeaker TBA  (NHTCU)BACK TO VB2019 PROGRAMME PAGE\nOther VB2019 papers\nKeynote: Nexus between OT\nand IT threat intelligence\nExploring Emotet, an\nelaborate everyday enigma\nCall the shots! Let’s fight\ncrime together\nAbout us\nContact us\nAdvisory board\nPress information\nSecurity events calendar\nVirus Bulletin newsletterTesting\nVB100\nVBSpam\nVBWeb\nConsultancy services\nSpammers' CompendiumVB2019 (London)\nVB2018 (Montreal)\nVB2017 (Madrid)\nVB2016 (Denver)\nVB2015 (Prague)\nOlder conferences\n \n  \n  \n  \n©1989-2020 Virus Bulletin.        Privacy policy         Cookies         Terms and Conditions\nSearch site...\nNewsletter VB Conference VB Testing Bulletin Blog\n "
}