{
    "title": "virus bulletin __ vb2019 paper_ kimsuky group_ tracking the king of the spear€phishing",
    "text": "VB2019 paper: Kimsuky group: tracking the king of the\nspear phishing\nJaeki Kim, Kyoung-Ju Kwak & Min-Chang Jang\nFinancial Security Institute, Republic of Korea\n \nTable of contents\nAbstract\nThe Kimsuky group is a threat group that is known to have been behind the KHNP  (Korea Hydro & Nuclear Power ) cyber\nterrorism attacks of 2014 and is still active in 2019.\nSince 2018, we have been profiling and tracking spear-phishing emails and malicious code related to the Kimsuky group.\nThe spear-phishing emails used by the group have been determined to have the purpose of stealing web portal account\ninformation and delivering malicious code. The main targets are government and military officials, as well as journalists.\nWe have analysed the changing behaviour of the Kimsuky group through ongoing tracking of the IoCs related to Kimsuky,\nincluding simple account hijacking.\nIn this paper, we present the results of an analysis not only of the malware used by the Kimsuky group but also of server-side\nsamples (tools and templates that send out spear-phishing emails, like a phishing rod) which we recently investigated.\nWe have also confirmed that the C&C server used for the earlier attack continues to be used for various purposes, such as\ndistribution of malicious code, logging of infections, and sending phishing mail.\n \n1. Introduction\nIn September 2013, Kaspersky Lab  announced an APT attack targeting major Korean agencies [ 1]. According to the data, the\nKimsuky group was using malicious Hangul  documents, like other attack groups targeting Korea, and the attack featured\nremote control tools (such as Team Viewer ) and communication channel configuration using webmail. In February and March\n2014, attacks that seemed to have been carried out by the same group against Korean public institutions continued to occur\n[2].\nIn December 2014, an attempt was made to destroy PC disks by sending 5,986 spear-phishing emails to 3,571 employees of\nKorea Hydro & Nuclear Power Co., Ltd . However, only eight PCs were infected with malware, of which five hard disks were\ninitialized.\nThe malware used in this spear-phishing attack was similar in structure and operation to the malware used by the Kimsuky\ngroup, and the Hangul  word processor vulnerability used in the malware was the same as that used in the Kimsuky malware.\nFrom these results, we inferred that the focus of the Kimsuky group was on social confusion and monitoring of North Korean\ndefectors and politicians, rather than acquiring money.\nIn June 2015, a number of web portal email accounts were hacked, sending emails with malicious Hangul  document files and\nphishing emails to steal portal account credentials. In January 2016, a large number of emails with malicious attachments were\nsent under the guise of ‘Office of National Security at the Blue House’ to government research institutes. Analysis by related\norganizations identified the malicious attachment as Kimsuky malware [ 3].\n \n2. Related cases\nIn January 2019, an email suspected to be carrying malicious code was sent to dozens of journalists, most of whom were\ncovering South Korea’s ministry in charge of relations with North Korea, prompting an investigation into the incident. The\nemail, which was entitled ‘TF reference info’ and had a compressed file attached, was sent to more than 70 reporters, most of\nwhom were members of the unification ministry’s press corps. It was sent through a private email address from a person\nnamed ‘Yoon Hong-geun’. The ministry suspected that it contained malicious code designed for hacking [ 4]. This issue was\nknown variously as Operation Cobra Venom [ 5], Operation Kitty Phishing [ 6] and Operation Kabar Cobra [ 7].\n \n3. Toolset characteristics\nIn the process of tracking the Kimsuky group, we were able to acquire the mail-sending tools and malware used in various\nspear-phishing attacks. The attack tools used by the Kimsuky group can be broadly categorized into server-side toolkits and\nmalware.\n \nServer-side toolkits\nMailer (shape & core), beaconer, phisher, logger\nThe Kimsuky group created a mailing toolkit for attack and used it repeatedly. We found that, when constructing phishing\npages for account takeover, they reused the existing source code of the original site and specific arguments in the URL.\nFigure 1: Daum portal phishing page.\n \nMalware\nDropper (malicious or camouflaged HWP documents), script, infostealer\nThe malware used by the Kimsuky group in recent spear-phishing attacks includes a dropper that is a malicious or\ncamouflaged HWP file; a malicious script, which logs and downloads additional malware to the C&C server; and an infostealer.\nSome infostealers have a module that downloads additional malware.\nExamples of the flow of malware used in spear-phishing attacks are shown in Figure 2.\nFigure 2: The flow of malware used in spear-phishing attacks.\nA classification of the attack tools used by the Kimsuky group is shown in Table 1.\nName No. Type Details\nMailer\n(shape)1 Mailer Mailer (just shape)\nMailer (core) 2 Mailer Mailer (actual function) \n1) Attachment of malware \n2) Link to phishing page for account hijack\nBeaconer 3 Web beacon Beacon to check whether mail is being viewed\nPhisher 4 Account stealer,\nphishingPhishing toolkit(lod) phishing page for account stealing\nLogger 5 Logging, phishing Logging of phishing target information\nMalicious\nHWP6 Dropper, spear phishing Malicious HWP documents\nCamouflaged\nHWP7 Dropper, spear phishing Camouflaged HWP documents (e.g. sfx, exe)\nScript 8 Downloader, logging Downloads additional malware and logs (e.g. *.vbs, *.wsf, *.jse, *.ps1)\nInfostealer 9 C&C, DLL, downloader,\nFTP loggingSteals information from infected target and downloads additional\nmalware (in some cases using FTP)\nTable 1: Kimsuky toolset.\n \n4. Tracking malware and monitoring C&C servers\nAttacker ≠ defender: OpSec failures\nThe attacker and defender are on different sides [ 8]. In addition, an attacker who continues to attack does not have a good\nunderstanding of defence. There can be a difference between an attacking position and a defending position.\nAfter all, attackers are also in the position of developing malware and server-side toolkits.\nAttackers who develop various attack tools are in the same position as those in general development. While working within a\nlimited timeframe and with limited resources, information leakage and vulnerabilities can occur naturally due to code reuse or\nC&C server operation mistakes.\nIn the course of investigating and analysing the C&C server, several security weaknesses were discovered, which provided us\nwith good information for investigation and tracking. We will look at the following cases of OpSec failure:\n1. Directory listing\n2. Leaked FTP access information\n3. File download vulnerability\n \nOpSec failure case 1: Directory listing\nCase 1.1: After DOKKAEBI campaign: H-DS (distribution) type\nName No. Type Details\nMalicious HWP 6 Dropper, spear-phishing Malicious HWP documents\nScript 8 Downloader, logging Downloads additional malware and logs (e.g. \n*.vbs, *.wsf, *.jse, *.ps1)\nTable 2: Related toolset.\nFigure 3: Profiling of malicious Hangul files.\nFollowing the DOKKAEBI campaign, malicious Hangul  documents were continuously analysed [ 9]. During this process, we\ntracked a C&C server (suppcrt-seourity[.]esy.es) and malware related to malicious Hangul  documents.\nThe file name of the malicious Hangul  sample uploaded to VirusTotal  on 23 May 2018 (shown in Figure 4) is ‘ 종전선언 .hwp’\n(‘Declaration of war end’) [ 10].\nFigure 4: Malicious Hangul sample 종전선언 .hwp.\nThe overall flow of the sample is as follows [ 11].\nFigure 5: Sample flow.\nName No. Type MD5\n‘Second Road to Go: Building a Peace System for\nUnification’1 Initial\ndropper8332be776617364c16868c1ad6b4efe7\ncore.dll (OneDll.dll) 2 DLL\n(dropper)4de21c3af64b3b605446278de92dfff4\nfontchk.jse 3 Script f22db1e3ea74af791e34ad5aa0297664\nbrid.ige (zerodll.dll) 4 DLL 2FB20830564AC781AFB7D5F422BECFC9\nTable 3: Malware.\nThe malware fontchk.jse records the infection information (date, time, IP address, MAC address, etc.) in the path\n[C&C]/update/fonts/log.txt , as shown in Figure 6. In this way, the files (including the malware) and log files that exist on\nthe C&C server can easily be obtained.\nFigure 6: Fontchk.jse records the infection information in the path [C&C]/update/fonts/log.txt.\nSince a lot of resources are required to build and verify (check the actual operation of) the C&C servers used by attackers, we\nmonitor them continuously, based on the assumption that they are likely to be recycled (reused) rather than being used once\nand then destroyed.\nA new log was recorded on the C&C server on 2018-07-10 (D+49), leading us to conduct further investigation and analysis.\nFigure 7: New infection log.\nThe C&C server leaked its directory listing and didn’t have proper access control, so it was possible to check the remaining logs\nfollowing an infection.\nFigure 8: MAC address look-up [ 12].\nPreviously, we analysed C&C servers, and we saw that the MAC address is used as the directory path. Using this information, we\nwere able to obtain additional malware by using the MAC address written in the infection log.\nName No. Type MD5 Details\nzerobase 1 Binary 53ac231e8091abcd0978124f9268b4e4 XOR encoding \nHanyangUpload_script.dll  2 DLL 8b59ea1ee28e0123da82801abc0cce4d XOR decoding - 0x09FD8477 \ncac.wsf  3 Script fa2ffcd70fba43dd0653a0ec87863d8a File upload to C&C server \nTable 4: Malware obtained using MAC address C485088EXXXX.\nFigure 9: Tracking the C&C server and discovering new malware zerobase (not found in VirusTotal).\nWe confirmed that zerobase  (MD5: 53ac231e8091abcd0978124f9268b4e4) had four-byte XOR encoding (key: 0x09FD8477),\nand a PE file was obtained through decoding, as shown in Figure 10.\nFigure 10: The file had four-byte XOR encoding (key: 0x09FD8477) a PE file was obtained through decoding.\nThe original DLL name identified in the four-byte XOR-decoded malware is H anyangUpload_script.dll .\nFigure 11: HanyangUpload_script.dll.\nThe function of the malware (HanyangUpload_script.dll) is as follows:\n1. Collect information from infected computers.\nFigure 12: Collecting information.\n2. Scan specific files.\nFigure 13: Scanning files.\n3. Upload files ( AllList_[MAC Address]_YYMMDD_HHMMSS ) to the C&C server using a script ( cac.wsf )\n \nFigure 14: Uploading files to C&C server.\nCase 1.2: Malware camouflaged as HWP documents\nName No. Type Details\nMailer (shape) 1 Mailer Mailer (just shape)\nMailer (core) 2 Mailer Mailer (actual function) \n1) Attachment of malware \n2) Link to phishing page for account hijack\nBeaconer 3 Web beacon Beacon to check whether mail is being viewed\nCamouflaged\nHWP7 Dropper, spear\nphishingCamouflaged HWP documents (e.g. sfx, exe)\nScript 8 Downloader,\nloggingDownloads additional malware and logs (e.g. *.vbs, *.wsf, *.jse, *.ps1)\nInfostealer 9 C&C, DLL, FTP Steals information from infected target and downloads additional malware (in\nsome cases using FTP)\nTable 5: Related toolset.\nAmong the tools described above, this malware is camouflaged as an HWP document [ 13].\nFigure 15: Malware camouflaged as an HWP document.\nName No. Type MD5 Details\n111.scr 1 SFX 10a120f573874c2af6b9172a26fdc597 Camouflaged as HWP documents\n1.hwp 2 HWP ae5ddda3749dcd72bc6cf6d658c5e31c Normal HWP\n1.vbs 2 Script 0718bfc5957758d22af02e726cb25fe3 Base64 decoding ⇒ ps1\nPowershell 3 Script fa2ffcd70fba43dd0653a0ec87863d8a Additional malware download (C&C: primary-\nhelp[.]esy.es)\nTable 6: Malware.\nAt the time of analysing the malware, additional malware was downloaded from the C&C server.\nFigure 16: Additional malware being downloaded from the C&C server.\nAs in the previous case, we continued to monitor the server, based on the assumption that the attacker would reuse the C&C\nserver they had built.\nAs a result of our continued monitoring, we confirmed that a new file was uploaded to the C&C server on 2019-04-01 (D+42)\nand conducted further investigation and analysis.\nFigure 17: Mailer (shape): mail.php.\nThe C&C server ( primary‐help[.]esy.es ) is also a directory listing as shown in Figure 8.\nWe checked that the new files, mail.php and mail_ok.php, were uploaded to the C&C server.\nFigure 18: The new files were uploaded to the C&C server.\nWe confirmed that these files are tools for sending mail (i.e. mailers).\nIf we enter the sender and receiver information (name/email), title and contents and select ‘COMMIT’, then we can confirm that\nmail.php is a mailer – the actual operation is performed by mail_ok.php.\nFigure 19: Mail.php is a mailer. The actual operation is performed by mail_ok.php.\nWhen using the mailer, the mail was indeed sent the normal way, but with new malware attached.\nFigure 20: The mail was sent normally and new malware was attached.\nIn addition, we confirmed that the web beacon was applied to check whether the mail was read, using reading.php  defined\nin the <img>  tag in the mail sent by the mailer.\nFigure 21: The web beacon was applied to check whether the mail was read.\n \nOpSec failure case 2: Leaked FTP access information\nName No. Type Details\nMailer\n(shape)1 Mailer Mailer (just shape)\nMailer\n(core)2 Mailer Mailer (actual function) \n1) Attachment of malware \n2) Link to phishing page for account hijack\nBeaconer 3 Web beacon Beacon to check whether mail is being viewed\nPhisher 4 Account stealer,\nphishingPhishing toolkit(lod) phishing page for account stealing\nLogger 5 Logging, phishing Logging of phishing target information\nScript 8 Downloader,\nloggingDownloads additional malware and logs (e.g. *.vbs, *.wsf, *.jse, *.ps1)\nInfostealer 9 C&C, DLL, FTP Steals information from infected target and downloads additional malware (in\nsome cases using FTP)\nTable 7: Related toolset.\nAmong infostealers used by the Kimsuky group, some samples have been found that use FTP to download additional malware\nafter logging infected targets to the C&C [ 14, 15].\nThe malware uses the Hostinger  free hosting service as a C&C server, and there is a security weakness in that the account\n(u428325809 ) and password (victory123!@#) used for FTP communication are exposed in plain text.\nFigure 22: The account (u428325809 ) and password (victory123!@#) used for FTP communication are exposed in plain text.\nThe same (or similar) FTP account information was identified in the other malware found after this malware (2019-04-03).\nMD5: f38a8ba888c5732236a5e0653826a267\n MD5: 0b65e3f7a40261232dd93f472933fb72\nFigure 23: The same or similar FTP account information was used.\nC&C Date Login ID Password Details\nuser-daum-center[.]pe.hu @2019/04/03 u859027282 victory123!@# Same password (1)\nuser-protect-center[.]pe.hu @2019/04/09 u428325809 victory123!@# Same password (1)\nnid-protect-team[.]pe.hu @2019/04/17 u621356999 victory123!@# Same password (1)\noeks39402[.]890m.com @2019/05/15 u487458083 rhdwn111 Same password (2) same UID\nnid-management-team[.]890m.com @2019/05/16 u142759695 victory123!@# Same password (1)\nnaiei-aldiel[.]16mb.com @2019/05/27 u487458083 Victorious!@# Similar password (1) same UID\nvkcxvkweo[.]96.lt @2019/06/07 u487458083 rhdwn111 Same password (2) same UID\nTable 8: Leaked FTP authentication information.\nThe FTP account information used in the malware can expose the C&C server to attacks. The string ‘ victory ’ used in the\npassword has also been found in the b374k webshell used by the Kimsuky group.\nFigure 24: The b374k webshell.\n \nOpSec failure case 3: File download vulnerability\nName No. Type Details\nMailer\n(shape)1 Mailer Mailer (just shape)\nMailer\n(core)2 Mailer Mailer (actual function) \n1) Attachment of malware \n2) Link to phishing page for account\nMalicious\nHWP6 Dropper, spear\nphishingMalicious HWP documents\nScript 8 Downloader,\nloggingDownloads additional malware and logs (e.g. *.vbs, *.wsf, *.jse, *.ps1)\nInfostealer 9 C&C, DLL, FTP Steals information from infected target and downloads additional malware (in\nsome cases using FTP)\nTable 9: Related toolsets.\nWe captured the situation where the mailer and attachments used the same C&C server ( member‐authorize[.]com ) when\nthe Kimsuky group also sent attachments with spear-phishing emails.\nFigure 25: The mailer and attachments used the same C&C server (member-authorize[.]com).\nThe C&C server had directory listings enabled, and there was a file download vulnerability in download.php , the file used to\ndownloaded the .hwp attachment.\nFigure 26: Index of the /security/downloads directory on the C&C server.\nName No. Type MD5 Details\n1234.eml 0 EML b90ed8fe3160ce49d69d000b1005c0c5 Spear-phishing email\n20190312_Japanrelated\ndaily trends(FN).hwp1 HWP abafa0cbfbe18afe6dd635d14e7d03d3 Malicious Hangul documents\n(malicious postscript)\nPowershell 2 Script 6d73e394762022f3cc426b0a37c4e694 GET ddlove[.]kr/bbs/data/1\n1.wsf  3 Script e3dcfd19a6054f7b436b09e8ea9f37a5 (a) Set var (b) Check Extract Util –\nWinRAR / ALZip (c) Check response\n(d) Save file & extract (e) or Save file\n& decode (f) Execute file \nRomanic.fm 4 Encoded\nPE 9d453684e78ae95b0833c16ef8df6c4f Base64 encoding \nRomanic.ft  4 RAR da2eefeb7ff5a13c0d890d4ccc0e35e1 Extract P/W: 201811 \nFreedom.dll 5 PE 05075cb9a05d0cce7263842c43f5cf8b Export name: GrapHouse Check Env\n(32/64) 64bit :\n/bbs/data/font/exts.fmt Process\nHollowing (explorer.exe) - [SND]:\n/register.php?\nWORD=com_XXXXXXXX&NOTE=-\n[GET]: /bbs/data/ariaK[T]_XXXXXXXX\n- [DEL]: /join.php?file= \nariaK_XXXXXXXX  6 Encoded\nPE e8d9d604615bd85862dce00bd8121b92 XOR TABLE encoding \nOnlyFileList.dll 7 PE cd5bee99bcae12da1d92cd252f30bd86 Export name: GrapHouse\nFileUpload( AllList_[MAC\nAddress ]_YYMMDD_HHMMSS) to\nC&C server \nTable 10: Malware.\nThe attacker has built a mailer in the path of the name of each phishing target.\nFigure 27: Phishing targets include Daum, KINU and Naver.\nThe mailer was found on the C&C server just as in the first OpSec failure case.\nFigure 28: Mailer found on the C&C server.\n \nRelationships analysis\nIn the process of tracking the Kimsuky group attack, we analysed the relationships of a large quantity of data, and investigated\nC&C servers located in South Korea through an investigation agency. Figure 29 show the associations that were found between\nthe toolsets and C&C servers classified in our research.\nFigure 29: Relationships between C&C servers and toolsets.\nSome of the results of analysing the relationships between toolsets and C&C servers used by the Kimsuky group in spear-\nphishing attacks are as follows.\ngyjmc[.]com (KR) → member-authorize[.]com (HOSTINGER) →\nddlovke[.]kr (KR) → military[.]co.kr (KR) ← suppcrt-seourity[.]esy.es(HOSTINGER)\nFigure 30 shows a graphical representation of the relationships.\nFigure 30: Graphical representation of the Kimsuky relationships.\nThrough its reuse of resources, we were able to track the attack performed by the Kimsuky group.\n \nConclusion\nDue to the particular circumstances of South Korea, the Kimsuky group continuously conducts malicious acts by abusing (or\ncamouflaging) documents created in Hangul  and phishing for email account credentials in order to hijack accounts. Similar\nattacks have continued.\nHowever, in the process of tracking the Kimsuky group, we have obtained various pieces of important information through\ncases of OpSec failure on the part of the attackers.\nThe information obtained in this way can be used to infer to what extent the next attack will proceed, and, if such a new spear-\nphishing attack occurs, the appropriate proactive response can be taken by analysing correlations with various indicators\nfound in previous attacks.\nWe will continue to strive to prevent the future spread of spear-phishing attacks by the Kimsuky group, and we hope that this\npaper will help in responding to threats in many areas including domestic.\n \nReferences\n[1] The Kimsuky Operation: a North Korean APT? https://securelist.com/the-kimsuky-operation-a-north-koreanapt/57915/ .\n[2] http://asec.ahnlab.com/993 .\n[3] http://www.hani.co.kr/arti/PRINT/730395.html .\n[4] South Korean reporters get malware emails; North Korea suspected.\nhttp://www.koreatimes.co.kr/www/nation/2019/01/356_261573.html .\n[5] Operation Cobra Venom. https://blog.alyac.co.kr/2066 .\n[6] The Double Life of SectorA05 Nesting in Agora (Operation Kitty Phishing).\nhttps://threatrecon.nshc.net/2019/01/30/operation-kitty-phishing/ .\n[7] Operation Kabar Cobra. https://global.ahnlab.com/global/upload/download/techreport/[Analysis_Report]Operation\nKabar Cobra (1).pdf .\n[8] Writing Secure Code - The Attacker’s Advantage and the Defender’s Dilemma (2002).\nhttps://www.oreilly.com/library/view/writing-secure-code/0735617228/ .\n[9] DOKKAEBI: Documents of Korean and Evil Binary. https://www.virusbulletin.com/conference/vb2018/abstracts/dokkaebi-\ndocuments-korean-and-evil-binary .\n[10] VirusTotal (5f2ac8672e19310bd532c47d209272bd75075696dea6ffcc47d1d37f18aff141).\nhttps://www.virustotal.com/gui/file/5f2ac8672e19310bd532c47d209272bd75075696dea6ffcc47d1d37f18aff141/de .\n[11] Hybrid-Analysis (8332be776617364c16868c1ad6b4efe7).\nhttps://www.hybridanalysis.com/sample/5f2ac8672e19310bd532c47d209272bd75075696dea6ffcc47d1d37f18aff141?\nenvironmentId=110 .\n[12] OUI Lookup. https://ip.rst.im/oui/C48508 .\n[13] VirusTotal (f7d2780bc7bb24d7525012a566a37c5baeeba79e0d199120c9f3ccaf5ae3448c).\nhttps://www.virustotal.com/gui/file/f7d2780bc7bb24d7525012a566a37c5baeeba79e0d199120c9f3ccaf5ae3448c/d .\n[14] Twitter @anyrun. https://twitter.com/anyrun_app/status/1115513990711521280 .\n[15] Anyrun. https://app.any.run/tasks/680af12b-e8c3 .\n \nLatest articles:\nVB2019 paper: Why\ncompanies need to focus\non a problem they don't\nknow they have\nThere is a type of crime, breach of\ncompany policy, misuse of company\nassets and security threat that is often\noverlooked: as one in 500 employees\nuse their work computer to handle\nchild sexual abuse material. This crime\nand misuse of company assets…\nVB2019 paper: Defeating\nAPT10 compiler-level\nobfuscations\nCompiler-level obfuscations, like\nopaque predicates and control flow\nflattening, are starting to be observed\nin the wild and are likely to become a\nchallenge for malware analysts and\nresearchers. This paper explains how\nto de-obfuscate the code of an…\nVB2019 paper: Attribution\nis in the object: using RTF\nobject dimensions to\ntrack APT phishing\nweaponizers\nAnomali Labs has conducted an in-\ndepth study of the unique object\ndimensions present in weaponized\nRTF exploits used in phishing attacks.\nThrough this research we have found\nthat the developers of malicious RTF\nweaponizers leave behind a unique…\nVB2019 paper: Kimsuky\ngroup: tracking the king\nof the spear phishing\nThe Kimsuky group is a threat group\nthat is known to have been behind the\nKHNP (Korea Hydro & Nuclear Power)\ncyber terrorism attacks of 2014 and is\nstill active in 2019. This paper presents\nthe results of an analysis not only of\nthe malware used by…\nVB2019 paper: Play\nfuzzing machine –\nhunting iOS/macOS\nkernel vulnerabilities\nautomatically and smartly\nSince iOS 10, Apple has released the\nunpacked/decrypted kernel cache\n(*.ipsw), but the system source code, in\nparticular the kernel and driver part,\nremain close-sourced. What is more,\nsymbol info in the binary (kernel\ncache) has been greatly…\nBULLETIN ARCHIVE\nAbout us\nContact us\nAdvisory board\nPress information\nSecurity events calendar\nVirus Bulletin newsletterTesting\nVB100\nVBSpam\nVBWeb\nConsultancy services\nSpammers' CompendiumVB2019 (London)\nVB2018 (Montreal)\nVB2017 (Madrid)\nVB2016 (Denver)\nVB2015 (Prague)\nOlder conferences\n \n  \n  \n  \n©1989-2020 Virus Bulletin.        Privacy policy         Cookies         Terms and Conditions\nSearch site...\nNewsletter VB Conference VB Testing Bulletin Blog\n "
}