{
    "title": "visa warns of point-of-sale attacks from fin8 hackers - security boulevard",
    "text": "Friday, March 20, 2020\nJoin the Community\nAdd your blog to Security Bloggers\nNetwork\nWrite for Security Boulevard\nBloggers Meetup and Awards\nAsk a Question\nEmail: info@securityboulevard.comUseful Links\nAbout\nMedia Kit\nSponsors Info\nCopyright\nTOS\nPrivacy Policy\nDMCA Compliance StatementOther Mediaops Sites\nContainer Journal\nDevOps.com\nDevOps Connect\nDevOps Institute\nCopyright © 2020 MediaOps Inc.  All rights reserved.   Cyber Threat Intelligence: Lack of Training, Tools, Oversight\nHome Security Bloggers Network  Webinars  Chat Library Related Sites  Media Kit\n← Security Analytics and Big Data: 4 Keys To An Effective Approach NIST 800-171: Change of Characters in Passwords →Home  » Cybersecurity  » SBN News  » Visa Warns of Point-of-Sale Attacks from FIN8 Hackers\n Visa Warns of Point-of-Sale Attacks from FIN8 Hackers\nby Silviu STAHIE on December 16, 2019\nCriminal hacking group FIN8, known for a flurry of attacks in 2017 followed by a period of silence in 2018 until re-emerging\nearlier this year, has recently carried out three attacks against point-of-sale (POS) systems, including two against North American\nfuel dispenser merchants, Visa Payment Fraud Disruption said.\nVisa said the attacks on fuel dispenser merchants aimed to steal credit card data directly from the POS systems. As is usually the\ncase, the hacker’s success was due to a mix of human mistakes and lack of proper security protocols.\nTo steal credit card data, hackers need to go through a number of steps. In the FIN8 attack, it started with an employee opening a\nphishing email, which installed a Remote Access Trojan (RAT) on the merchant network and granted the threat actors network\naccess.\n“The actors then conducted reconnaissance of the corporate network, and obtained and utilized credentials to move laterally\ninto the POS environment,” reads  the Visa Payment Fraud Disruption report.\n“There was also a lack of network segmentation between the Cardholder Data Environment (CDE) and corporate network, which\nenabled lateral movement. Once the POS environment was successfully accessed, a Random Access Memory (RAM) scraper was\ndeployed on the POS system to harvest payment card data.”\nThe RAM scraper is a piece of software that can be used in a variety of ways, depending on what it’s designed to do. It can be used\nas a keylogger and can even send the data collected directly to the hackers.\nA third attack against the network of a compromised North American hospitality merchant was also attributed FIN8, which is\nknown for spearphishing attacks against the restaurant, hotel and hospitality sectors. The third attack used most of the same\ntechniques, including a new shellcode backdoor based on the RM3 variant of the Ursnif (aka Gozi/Gozi-ISFB) modular banking\nmalware.\nBesides the improper employee training which lead to the one of them falling for phishing email, the hack was successful\nbecause the merchants lacked secure acceptance technology (e.g. EMV Chip, Point-to-Point Encryption, Tokenization, etc.) and\ndidn’t comply with PCI DSS.\nVisa warns any merchant that uses POS systems to secure their networks, to install and update security solutions, and most\nimportantly, to pay close attention to phishing emails.\nRecent Articles By Author\nLatest Firefox Version Unveils and Fixes an AirPod Vulnerability\nTwo-Thirds of Healthcare Organizations Have Suffered a Security Incident\nSome VPN Apps Secretly Gather Anonymized User Data\nMore from Silviu STAHIE\n*** This is a Security Bloggers Network syndicated blog from HOTforSecurity  authored by Silviu STAHIE . Read the original post\nat: https://hotforsecurity.bitdefender.com/blog/visa-warns-of-point-of-sale-attacks-from-fin8-hackers-21938.html\nFIN8, FIN8 phishing , Industry News , POS hack , POS malware , Visa, VISA POS\nMON\n23The State of Open Source\nSecurity\nMarch 23 @ 1:00 pm  - 2:00 pm\nTUE\n31Protect Yourself from Cyber\nAttacks Through Proper Third-\nParty Risk Management\nMarch 31 @ 11:00 am  - 12:00 pm\nAPR\n09Integrate Security Early and\nOften For Successful DevSecOps\nApril 9 @ 1:00 pm  - 2:00 pm\nSubscribe to our Newsletters\nMost Read on the Boulevard\nUpcoming Webinars \nDownload Free eBook\nRecent Security Boulevard Chats\nIndustry Spotlight \nThe\nCoronavirus Pandemic\nand the Death of the VPN\nTop 5 Open Source\nServerless Security Tools\n5 Good Reasons to\nOutsource Security\nTesting\nTop Stories \nReport: 97% of Firms\nCompromised Right Now.\nReally?\nCOVID-19 Fears Bring\nGoogle Chrome Dev to\nScreeching Halt\nContrast Security\nAdvances DevSecOps\nSecurity Humor \nGet breaking news, free eBooks and\nupcoming events delivered to your\ninbox.\nYour Email\nView Security Boulevard Privacy Policy\nSubscribe Now\n7 Linux Distros for Security Testing\nWhy Traditional Security Is Failing Us\nZeroNorth Raises $10M to Advance Risk\nOrchestration\nStorage Is Your Data Lifecycle Weak Spot\nSupply Chain Security Amid Coronavirus\nFallout\nNine Network Security Topics Grabbing\nHeadlines in Q1 2020\nCOVID-19 Cybersecurity Impact, Hacking the\nHackers, Whisper App Data Leak\nCloud, DevSecOps and Network Security,\nAll Together?\nSecurity-as-Code with Tim Jefferson,\nBarracuda Networks\nASRTM with Rohit Sethi, Security\nCompass\nDeception: Art or Science, Ofer Israeli,\nIllusive Networks\nTips to Secure IoT and Connected\nSystems w/ DigiCert\nXKCD ‘Coronavirus Research’\n  \nANALYTICS APPSEC CISO CLOUD DEVOPS GRC IDENTITY INCIDENT RESPONSE IOT / ICS THREATS / BREACHES MORE HUMOR \n "
}