{
    "title": "watering hole attack hits us department of labor website _ threatpost",
    "text": "/ / / /\n Cloud Security Malware Vulnerabilities InfoSec Insider Podcasts\n  Search\nInternet Companies Get Passing Grades on Privacy Advocacy and Transparency\n Nearly Nine in Ten Websites Contain One Serious Vulnerability\nWatering Hole Attack Claims US\nDepartment of Labor Website\nAuthor:\nMay 1, 2013 / 4:30 pm\n2 minute read\nShare this article:Michael Mimoso\n\nThe United States Department of Labor website was hacked in a\nwatering hole attack. The website was redirecting visitors to a malicious\nsite hosting the Poison Ivy remote access Trojan.\nThe United States Department of Labor website is the latest high-profile government site to\nfall victim to a watering hole attack. Researchers at a number of security companies\nreported today that the site was hosting malware and redirecting visitors to a site hosting the\nPoison Ivy remote access Trojan.\nThe malware has since been removed and law enforcement is investigating.\nThe attackers inserted javascript onto the DoL’s Site Exposure Matrices (SEM) website that\nsent visitors to another site hosting an exploit for CVE 2012-4792  targeting Windows XP\nusers running Internet Explorer versions 6-8. The vulnerability, a user-after free memory\nvulnerability in the browser, enables attackers to remotely run code on a compromised\nmachine. This has been exploited in the wild since December and was patched earlier this\nyear by Microsoft .\n“This profile fits the enterprise user machine profile typical of large enterprise and\ngovernment agencies,” said Invincea founder and CEO Anup Ghosh.\nThe DoL’s SEM site is a repository of data on toxic substances present at facilities run by the\nDepartment of Energy.\nThe malware drops an executable called conime[.]exe onto the infected computer and\nopens remote connections on ports 443 and 53, Invincea said, adding there were two\nredirects present on the DoL page sending visitors to dol[.]ns01[.]us. Once the user is\nredirected, a file is executed, ports are opened and registry changes are made to maintain\npersistence on the machine. Ghosh said that one of the command and control servers had\nalready been blacklisted by Google.\nAlien Vault Lab manager Jaime Blasco said the attacker also collects a bit of system\ninformation including whether a number of antivirus programs, Flash, Java, and Microsoft\nOffice are running, and sends that data to the remote server. Blasco added that the\ncommand and control protocol used in the attack matches that of a Chinese espionage\ngang known as DeepPanda; other characteristics of this attack match those used against a\nThai human rights nongovernment organization website.\nWatering hole attacks  have been used primarily by state-sponsored attackers to spy on rival\ngovernments, dissident citizen groups and manufacturing organizations. Rather than rely on\nspear phishing, attackers infect websites of common interest to their targets, generally with\njavascript via an iframe that redirects the victim to a site hosting espionage malware. Some\nhigh-profile watering hole attacks have been carried out this year against the Council on\nForeign Relations website  and a popular iOS mobile developer forum  that snared a number\nof victims at Facebook, Apple and Twitter.\nIn this case, it’s likely the targets were Department of Labor employees and other federal\nemployees tied to the DoL and Department of Energy.\n“It is important to note that most websites are vulnerable to exploit. As a result, exploiting\nlegitimate websites have become a common vector for penetrating enterprise networks\nand individual machines,” Ghosh said. “The Department of Labor is no exception.”\nShare this article:\nMalware\nSpear-Phishing Attack Lures\nVictims With ‘HIV Results’\nAttackers are purporting to send victims\nHIV test results – but in reality are\nconvincing them to download the\nKoadic RAT.\nMarch 10, 2020\nDouble Vision: Stealthy\nMalware Dropper Delivers\nDual RATs\nA lengthy, multi-stage infection process\nleads to a duo of payloads, bent on\nstealing data.\nNovember 14, 2019\nEx-Twitter Employees Spied\non Saudi Dissidents: DoJ\nThe DoJ charges former Twitter\nemployees for allegedly accessing\nthousands of accounts on behalf of\nSaudi Arabia.\nNovember 7, 2019\nA Practical Guide to Zero-Trust\nSecurity\nJanuary 15, 2020  2\n7 Tips for Maximizing Your SOC\nDecember 31, 2019  5\nMean Time to Hardening: The Next-\nGen Security Metric\nDecember 30, 2019  4\nCombining AI and Playbooks to\nPredict Cyberattacks\nDecember 26, 2019  1\nThe Case for Cyber-Risk Prospectuses\nDecember 24, 2019  1\nNewsletter\nSubscribe to Threatpost Today  \nJoin thousands of people who receive the\nlatest breaking cybersecurity news every day.\nSubscribe now\nTwitter\nA poll of Threatpost readers shows\nthat  preparedness is uneven\nas organizations make an\nunprecedented tra… \n11 hours ago\nFollow @threatpost\n#security\nhttps://t.co/HHY7XHNF0W\nThe First Stop For Security News Home\n About Us\n Contact Us\n Advertise With Us\n RSS FeedsCopyright © 2020 Threatpost Privacy Policy Terms and Conditions Advertise\nBlack Hat Breaking News Cloud Security Critical Infrastructure Cryptography Facebook\nSUGGESTED ARTICLES\nDISCUSSIONINFOSEC INSIDER\nSubscribe to our newsletter, Threatpost Today ! Get the latest breaking news delivered daily to your inbox. Subscribe now\n "
}