{
    "title": "what we can learn from the bangladesh central bank cyber heist - trendlabs security intelligence blog",
    "text": "Trend Micro About TrendLabs Security Intelligence Blog\nHome    »   Malware    »   What We Can Learn From the Bangladesh Central Bank Cyber Heist\nSecurity Predictions for 2020\nCybersecurity in 2020 will be viewed\nthrough many lenses — from differing\nattacker motivations and cybercriminal\narsenal to technological developments\nand global threat intelligence — only so\ndefenders can keep up with the broad\nrange of threats.\nRead our security predictions for 2020.\nBusiness Process Compromise\nAttackers are starting to invest in long-\nterm operations that target specific\nprocesses enterprises rely on. They\nscout for vulnerable practices,\nsusceptible systems and operational\nloopholes that they can leverage or\nabuse. To learn more, read our Security 101:\nBusiness Process Compromise.\nRecent Posts\nOpenSMTPD Vulnerability (CVE-2020-8794) Can\nLead to Root Privilege Escalation and Remote\nCode Execution\nOperation Overtrap Targets Japanese Online\nBanking Users Via Bottle Exploit Kit and Brand-\nNew Cinobi Banking Trojan\nMarch Patch Tuesday: LNK, Microsoft Word\nVulnerabilities Get Fixes, SMBv3 Patch Follows\nBusting Ghostcat: An Analysis of the Apache\nTomcat Vulnerability (CVE-2020-1938 and CNVD-\n2020-10487)\nDissecting Geost: Exposing the Anatomy of the\nAndroid Trojan Targeting Russian Banks\nPopular Posts\nLokiBot Impersonates Popular Game Launcher\nand Drops Compiled C# Code File\nMisconfigured Container Abused to Deliver\nCryptocurrency-mining Malware\nDissecting Geost: Exposing the Anatomy of the\nAndroid Trojan Targeting Russian Banks\nOutlaw Updates Kit to Kill Older Miner Versions,\nTargets More Systems\nFebruary Patch Tuesday: Fixes for Critical LNK,\nRDP, Trident Vulnerabilities\nStay Updated\nEmail Subscription\nYour email here\nSubscribe\nPrivacy Statement Legal Policies Copyright © 2020 Trend Micro Incorporated. All rights reserved.HOME AND HOME OFFICE  | FOR BUSINESS  | SECURITY INTELLIGENCE  | ABOUT TREND MICRO\nAsia Pacific Region (APAC): Australia  / New Zealand , 中国, 日本, 대한민국 , 台灣 Latin America Region (LAR): Brasil , México  North America Region (NABU): United States , Canada  \nEurope, Middle East, & Africa Region (EMEA): France , Deutschland / Österreich / Schweiz , Italia, Россия , España , United Kingdom / Ireland\nWhat We Can Learn From the Bangladesh Central Bank\nCyber Heist\nPosted on: March 15, 2016  at 8:30 pm Posted in: Malware , Targeted Attacks\nAuthor:  Martin Roesler (Director, Threat Research)\nTags: cybercrime cybercrime undergroundThe reported hacking of Bangladesh’s central bank accounts\nwith the U.S. Federal Reserve once again shows how bad the\nimpact of cyber attacks to organizations, enterprises or even\nnation-states can be. Peel off all the other layers in this\nnarrative for a moment—the amount of money stolen, the\nalleged players, the politics—and at its core, we have the same\ntactics and procedures any enterprising criminal will carry out\nagainst his or her intended target.\nThe hacking incident is one of the most ambitious thefts committed via cybercrime to date. Were it\nnot for a small typo , more than a billion US dollars would have been stolen. As it stands, more than\n$80 million was still wired and laundered via several casinos in the Philippines. Investigations of\nthe attack are looking at the possibility of malware  being installed on the central bank’s computer\nsystems as the primary tool used to help facilitate the heist.\nIf malware was involved:\nHow did the attackers gain authorization to do the transaction? Did they get control of an\naccount that has the power to do so, and if so, how (phishing, keylogging, others)?\nAre there security measures or controls in place that would have triggered anomalies (e.g.,\nhigh amount of transaction, high volume of transactions, etc.)?\nIf malware was used, this incident may not be entirely different from other cases of cybercrime and\ntargeted attacks that happen every day. There’s a wide variety of tools like cheap keyloggers  sold\nin the cybercriminal underground and the Deep Web which criminals can use, along with\nenhanced social engineering tactics like those employed in Business Email Compromise (BEC)\nattacks .\nSo what can organizations learn from this? For starters, try answering the questions above in the\ncontext of your own network, your policies–your solutions. Who, in your organization, has access\nto the most important data? How do you ensure that these data are protected? Do your\nprocesses, policies, and your infrastructure empower your employees to see “trigger warnings”\nand perform appropriate action at the right time?\nSecurity should not be a simple item on a checklist. It should be a process, an attitude, and a\nmindset. This incident adds to the growing list of proof points that support this statement,\nespecially now that cyber attacks are getting bigger and definitely more “real” in terms of impact.\nLearn how to protect Enterprises, Small Businesses, and Home Users from ransomware:\nENTERPRISE SMALL BUSINESS HOME\n\n» » »\nHome Categories\nSearch:\n "
}