{
    "title": "winnti-stolen digital certificates re-used in current watering hole attacks on tibetan and uyghur groups _ securelist",
    "text": "Share post on:A new-ish Flash exploit has been on the loose for attacks around the web. This time, the attackers have compromised a\ncaregiver site providing support for Tibetan refugee children and are spreading backdoors signed with Winnti stolen\ncertificates delivered with Flash exploits – the compromised web site is the NGO “Tibetan Homes Foundation”. Previously,\nFireEye identified similar “Lady Boyle” related malicious swf  exploiting CVE-2013-0634. A notification has been sent to the\ncontacts of the web site, but apparently the malicious footer.swf file is still hosted at the Foundation’s web site, so please do\nnot visit it just yet. Also, be sure to update your Flash player to the latest version.\nThis site certainly appears to be a classic example of a “watering hole” attack. F-Secure pointed out another Lady Boyle\nwatering hole  set up against a related Uyghur group, which has been targeted in tandem following the early March World\nUyghur Congress. The delivered backdoors are shown to be signed with Winnti-stolen digital certificates in the F-Secure\npost, including the stolen MGAME certificate.\nHere is an example of those same stolen certs reused for the backdoors in the Tibetan Homes Foundation incident. We see\nboth the MGAME cert and the ShenZehn certs signing the backdoors, here are screenshots of the latter:\nOur products detect the Flash exploit+payload as Exploit.SWF.CVE-2013-0634.a . Here is a heatmap of our worldwide\ndetections. Note that not all of these detections are Lady Boyle related, I estimate that at least a third of them are:\n \nOther sites hosting the Lady Boyle swf exploit over the past couple of months have included “tibetangeeks.com”, who\nrecently cleaned up their site and posted a cooperative plea to their attackers, and “vot.org” or the “Voice of Tibet” which is\nalso cleaned up. Currently cleaned up but previously serving “Exploit.SWF.CVE-2013-0634.a” were Uyghur related sites\n“istiqlaltv.com” and “maarip.org”, with the same “LadyBoyle” swf path as the Tibetan Homes Foundation, i.e.:\nhxxp://maarip.org/uyghur/footer(.)swf\n \n \nSo, what we have is an active watering hole campaign implementing a fairly new Flash exploit and abusing digital certificates\nthat were stolen as a part of the ongoing Winnti targeted attack campaigns  on game developers and publishers.\n \nRelated md5:\nBD9FD3E199C3DAB16CF8C9134E06FE12\n215CEC7261D70A5913E79CD11EBC9ECC\n12181311E049EB9F1B909EABFDB55427\nADOBE  ADOBE FLASH  APT TARGETED ATTACKS  VULNERABILITIES AND EXPLOITS  WEBSITE HACKS\nRelated Posts\nLEAVE A REPLY\nYour email address will not be published.  Required fields are marked *\nEnter your comment here\nName *\nEmail *\nSave my name, email, and website in this browser for the next time I comment.\n \nSUBMIT\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\n \nIN THE SAME CATEGORY\nDNS Manipulation in Venezuela in regards\nto the Humanitarian Aid Campaign\nChafer used Remexi malware to spy on\nIran-based foreign diplomatic entities\nGreyEnergy’s overlap with Zebrocy\nA Zebrocy Go Downloader\nDarkVishnya: Banks attacked through\ndirect connection to local network\nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\nAPT REPORTS  INCIDENTS\nWinnti-Stolen Digital Certiﬁcates Re-\nUsed in Current Watering Hole Attacks\non Tibetan and Uyghur Groups\nBy Kurt Baumgartner  on April 12, 2013. 4:31 am\n \nNotify me when new comments are added.\n© 2020 AO Kaspersky Lab.  All Rights Reserved. \nRegistered trademarks and service marks are the property of their respective owners.\nContact us  | Privacy Policy  | License AgreementEmail\n I agree to provide my email address to “AO Kaspersky Lab” to\nreceive information about new posts on the site. I understand\nthat I can withdraw this consent at any time via e-mail by\nclicking the “unsubscribe” link that I find at the bottom of any e-\nmail sent to me for the purposes mentioned above.\nSUBSCRIBE\nHunting APTs with YARA\n Mokes and Buerak\ndistributed under the guise\nof security certificates\nOperation AppleJeus Sequel\nEnglish\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPRCompanyAccount GET IN TOUCHSolutions for: Home Products  Small Business 1-50 employees Medium Business 51-999 employees Enterprise 1000+ employees\nWe use cookies to make your experience of our websites better. By using and further navigating this website you accept this. Detailed\ninformation about the use of cookies on this website is available by clicking on more information .ACCEPT AND CLOSE\n "
}