{
    "title": "winnti_ attacking the heart of the german industry",
    "text": "daa0\nC: c7cb\n\\W f4f0\nin fbcf\ndo d6d1\nws ffd7\n\\s dcd5\nys d3cd\nte c499\nm3 99f0\n2\\ dacc\nwb cadd\nem edc1\n\\s cac7\nys\nc1d3\nte da96\nm. dddb\nda cfbc\nt bdbe\n  bfc0\n  c1c2\n  c3c4\n  c5c6\n  c7c8\n  999a\n  9b9c\n  eafc\nwb facd\nem\nc2cd\nco ceca\nmn 8bc2\n.d cbc4\nll a9aa\n  abac\n  adae\n  afb0\n  b1b2\n  b3b4\n  b5b6\n  b7b8\n  b9ba\n  bbbc\n \ncec7\nsy ccb4\nst a4af\nem eda6\n.b aca8\nin c7c8\n  c9ca\n  cbcc\n  cdce\n  cfd0\n  d1d2\n  d3d4\n  d5d6\n  d7d8\n \nf9fa\n  fbfc\n  fdfe\n  ff00\n  0102\n  0304\n  0506\n  0708\n  090a\n  0b0c\n  0d0e\n  0f10\n  1112\n  1314\n \n1516\n  1718\n  191a\n  1b1c\n  1d1e\n  1f20\n  2122\n  2324\n  2526\n  2728\n  292a\n  2b2c\n  2d2e\n  2f30\n \n3132\n  3334\n  3536\n  3738\n  393a\n  3b3c\n  3d3e\n  3f40\n  2521\ndc 4344\n  4546\n  4748\n  595a\n  5b5c\n \n5d5e\n  5f60\n  0603\nga 0e01\nme 0309\nfo 150f\nrg 0c6a\ne 6b6c\n  6d6e\n  6f70\n  7172\n  7374\n  7576\n  7778\n \n797a\n  7b7c\n  7d7e\n  7f80\n  b1b5\n07 b2b3\n17 8586\n  8788\n  898a\n  8b8c\n  8d8e\n  8f90\n  9192\n  9394\n For a number of years now, a group of professional hackers has been busy\nspying on businesses all over the world: Winnti. Believed to be controlled by\nChina. For the first time, in a joint investigation, German public broadcasters BR\nand NDR are shedding light on how the hackers operate and how widespread\nthey are. — by Hakan Tanriverdi, Svea Eckert, Jan Strozyk, Maximilian Zierer and\nRebecca Ciesielski\nUnser Bericht  zur digitalen „Söldnertruppe“, die Industriespionage betreibt.\nThis investigation starts with a code: daa0 c7cb f4f0 fbcf d6d1 . If you\nknow what to look for, you’ll find Winnti. Hackers who have been spying on\nbusinesses all over the world for years. A group, presumably China-based, has\nhoned in on Germany and its DAX corporations. For the first time ever, BR and\nNDR reporters have successfully analyzed hundreds of the malware  versions\nused for that unsavory purpose. The targets: At least six DAX corporations, the\nstock-listed top companies of the German industry.\nWinnti is a highly complex structure that is difficult to penetrate. The term\ndenotes both a sophisticated malware and an actual group of hackers. IT\nsecurity experts like to call them digital mercenaries. Since at least 2011, these\nhackers have been using malware to spy on corporate networks. Their mode of\noperation: to collect information on the organizational charts of companies, on\ncooperating departments, on the IT systems of individual business units, and on\ntrade secrets, obviously.\nAsked about the group an IT security expert who has been analyzing the attacks\nfor years replies, tongue in cheek: “Any DAX corporation that hasn’t been\nattacked by Winnti must have done something wrong.” A high-ranking German\nofficial says: “The numbers of cases are mind-boggling.” And claims that the\ngroup continues to be highly active—to this very day. The official’s name will\nremain undisclosed, as will names of the more than 30 people whom we were\nable to interview for this article: Company staff, IT security experts, government\nofficials, and representatives of security authorities. They are either not willing or\nnot allowed to speak frankly. But they are allowed to reveal some of their tactics.\nThis allows us to find the software and to figure out for ourselves how the\nattackers work. Thanks to the help received from the informers, we, the\nreporters, are able to get on to the group. Part of their trail is the following\ncode: daa0 c7cb f4f0 fbcf d6d1 .\nModern-day espionage operations have one big advantage: Instead of\npainstakingly planting agents in companies, digital spies are simply sending\nprepared emails. Instead of taking pictures of confidential documents while the\nrest of the staff is out to lunch, hackers can remotely log on to company\ncomputers and send their commands from their keyboard. But every hacking\noperation also comes with a huge drawback. It leaves digital traces. If you notice\nhackers, you can log their every step. The hackers themselves have no clue that\nthey are under meticulous scrutiny, sometimes even for months at a time.\nTo decipher the traces of hackers, you need to take a closer look at the\nprogram code of the malware itself. It can be found in databases operated by\nprivate companies like “Virustotal.” The company is owned by Google and is a\nkind of malware search engine. The information stored in that database is so\nvaluable to IT consultants and security companies that they pay thousands of\nEuros per month for accessing it. Anybody who is unsure whether a mail\nattachment contains a Trojan can have it checked in that database by more\nthan 50 antivirus programs. In return, Virustotal stores the file with the aid of a\ndigital fingerprint. This digital fingerprint allows others to search for the file and\nto analyze the codes it contains. People like ourselves.\nEvery file has a digital fingerprint—which makes is clearly identifiable.\nIn former times, it was solely the job of intelligence agencies to uncover\nespionage operations. Nowadays, corporations and IT security companies\nprefer to employ staff earning six-figure salaries for that purpose. Their job is to\nsearch the corporate networks and Virustotal for evidence of hacker groups.\nAfter all, it is the companies they work for which are being spied on—and the\ncompanies’ secret formulas and building plans warrant absolute protection.\nProfessionally, these employees are on a par with the security services. It is one\nof those professionals who meets with us and hands us a piece of paper.\n“This might help you find the hackers”, the gentleman tells us. He believes that\nbecause they are spying on so many targets at the same time, they have to\nfigure out how to keep track. He also believes that the hackers chose\nconvenience over anonymity. We soon realize how incredibly negligent the\nhackers are. We are working with Moritz Contag , an IT security expert affiliated\nwith Ruhr University Bochum (RUB). What we find: The hackers are writing the\nnames of the companies they want to spy on directly into their malware. Contag\nhas analyzed more than 250 variations of the Winnti malware and found them\nto contain the names of global corporations.\nHackers usually take precautions, which experts refer to as Opsec . The Winnti\ngroup’s Opsec was dismal to say the least. Somebody who has been keeping an\neye on Chinese hackers on behalf of a European intelligence service believes\nthat they didn’t really care: “These hackers don’t care if they’re found out or not.\nThey care only about achieving their goals.\"\nThe sheet of paper the staff member is showing us has a code printed on it:\ndaa0 c7cb f4f0 fbcf d6d1 . We are looking for the same string of\ncharacters in Virustotal, the gigantic database of infected files. And we succeed.\nPhase 1: Cybercrime\nIt would seem that during the early stages, the hackers were concerned mainly\nabout making money. Gameforge  is a case in point: a gaming company based\nin the German town of Karlsruhe. During its heyday, the company had a staff of\n700 working hard at conquering the global gaming market, and boasted annual\nsales to the tune of 140 million Euros. Gameforge offers so-called “freemium”\ngames. While playing the games is free, those who want more either have to\nearn virtual money by completing certain tasks, which takes a long time, or shell\nout real money.\nWe are told that in 2011, an email message found its way into Gameforge’s\nmailbox in Karlsruhe. A staff member opened the attached file and\nunbeknownst to him started the hackers’ Winnti program. Shortly afterwards, a\nfew players became virtual rich persons.\nThe administrators became aware that someone was directly accessing\nGameforge’s databases and raising the account balance. They started getting\nworried. How could this be happening? The technicians used the next\nmaintenance interval to reinstall the servers of the affected game. The players\ndidn’t have a clue about what’s going on. No sooner were the servers back up\nthan the manipulations continued.\nGameforge was using Kaspersky antivirus software, which didn't cause any alarm\nbells to ring. Gameforge arranged for Kaspersky's IT security experts to come\ndirectly to Karlsruhe. Because obviously there was something weird going on.\nNobody informed the State Bureau of Criminal Investigation or the local police.\nThe year was 2011, and many investigators were barely familiar with the term or\nconcept of cybercrime.\nWhile keeping an eye on Gameforge’s corporate network, the IT security experts\ndid find suspicious files and decided to analyze them. They noticed that the\nsystem had in fact been infiltrated by hackers—who were acting like\nGameforge’s administrators most of the time. Which allowed them to remain\ninvisible. It turned out that the hackers have taken over a total of 40 servers.\nThis mode of operation is typical of many hacker groups—and especially of\nWinnti. “They are a very, very persistent  group,” says Costin Raiu, who has been\nwatching Winnti since 2011. Raiu is in charge of Kaspersky’s malware analysis\nteam. “Once the Winnti hackers are inside a network, they take their sweet time\nto really get a feel for the infrastructure,” he says.\nThe hackers will map a company’s network and look for strategically favorable\nlocations for placing their malware. They keep tabs on which programs are used\nin a company and then exchange a file in one of these programs. The modified\nfile looks like the original, but was secretly supplemented by a few extra lines of\ncode. From now on, this manipulated file does the attackers’ bidding.\nRaiu and his team have followed the\ndigital tracks left behind by some of the\nWinnti hackers. “Nine years ago, things\nwere much more clear-cut. There was a\nsingle team, which developed and used\nWinnti. It now looks like there is at least\na second group that also uses Winnti.”\nThis view is shared by many IT security companies. And it is this second group\nwhich is getting the German security authorities so worried. One government\nofficial puts it very matter-of-factly: “Winnti is very specific to Germany. It is the\nattacker group that's being encountered most frequently.\"\nPhase 2: Industrial espionage\nBy 2014, the Winnti malware code was no longer limited to game\nmanufacturers. The second group’s job is mainly industrial espionage. Hackers\nare targeting high-tech companies as well as chemical and pharmaceutical\ncompanies. We find evidence going as far as mid-2019. Cases of espionage\nwhich were probably still ongoing when we discovered them. Winnti is attacking\ncompanies in Japan, France, the U.S. and Germany. Or more precisely: in\nDüsseldorf.\nMost people probably know the DAX company Henkel as a manufacturer of\ndetergents and shampoos. But Henkel offers a huge range of other products,\nincluding adhesives for industrial applications. Modern cars are glued instead of\nwelded. In a commercial on Youtube , Henkel shows staff members successfully\njoining two metal plates with just three grams of adhesive and then using the\nplates to pull a 280-ton train. Nearly half of Henkel’s annual sales of 20 billion\nEuros are generated by Henkel’s so-called “adhesive technologies\".\nThe Winnti hackers broke into Henkel’s network in 2014. We have three files\nshowing that this happened. Each of these files contains the same website\nbelonging to Henkel and the name of the hacked server. For example, one\nstarts with the letter sequence DEDUSSV. We realize that server names can be\narbitrary, but it is highly probable that DE stands for Germany and DUS for\nDüsseldorf, where the company headquarters are located. The hackers were\nable to monitor all activities running on the web server. And they also seemed\nto be able to reach systems which didn't have direct internet access: Internal\nstorage files and possibly even the intranet.\nThe corporation confirms the Winnti incident and issues the following\nstatement: “The cyberattack was discovered in the summer of 2014 and Henkel\npromptly took all necessary precautions.” Henkel claims that a “very small\nportion” of its worldwide IT systems had been affected— the systems in\nGermany. According to Henkel, there was no evidence suggesting that any\nsensitive data had been diverted.\nHow we worked\nBR and NDR reporters, in collaboration with several IT security experts,\nhave analyzed the Winnti malware. It was notably Moritz Contag of Ruhr\nUniversity Bochum who managed to extract information from different\nvarieties of the malware. Contag wrote a script for this analysis. You can\nfind it here . Silas Cutler, an IT security expert with US-based Chronicle\nSecurity, has confirmed Contag’s analyses.\nA collaboration between  and \nFar from attacking Henkel and the other companies arbitrarily, Winnti takes a\nhighly strategic approach. Which is perfectly evident from the other cases. Take\nCovestro, for example, also a manufacturer of adhesives, lacquers and paints.\nThis chemical corporation, a Bayer spin-off, is now listed on the DAX. Covestro is\nregarded as Germany’s most successful spin-off in the recent past. Up until June\n2019, they had at least two systems on which the Winnti malware had been\ninstalled. Although there is no concrete evidence of data loss, Covestro\nconsiders “this evidence of infection to be a serious attack on our company.”\nAnother manufacturer of adhesives, Bostik of France, was infected with Winnti in\nearly 2019.\nThe hackers behind Winnti have also set their sights on Japan’s biggest chemical\ncompany, Shin-Etsu Chemical. We have in our hands several varieties of the\n2015 malware which was most likely used for the attack. In the case of another\nJapanese company, Sumitomo Electric, Winnti apparently penetrated their\nnetworks during the summer of 2016. And consider Roche, one of the largest\npharmaceutical companies in the world: the sheer number of files, 25 in total,\ngives you an idea of the degree of network penetration by the hackers. Winnti\nhackers also penetrated the BASF and Siemens networks. Both corporations\nhave confirmed our research data.\nA BASF spokeswoman tells us in an email that in July 2015, hackers had\nsuccessfully overcome “the first levels” of defense. “When our experts discovered\nthat the attacker was attempting to get around the next level of defense, the\nattacker was removed promptly and in a coordinated manner from BASF’s\nnetwork.” She added that no business relevant information had been lost at any\ntime. According to Siemens, they were penetrated by the hackers in June 2016.\n“We quickly discovered and thwarted the attack,” Siemens told us in a written\nreply. Siemens claims that even after detailed analyses, no evidence suggesting\ndata loss from the attack has been found to date.\nTargeted companies\nGaming : Gameforge, Valve\nSoftware : Teamviewer\nTechnology : Siemens, Sumitomo, Thyssenkrupp\nPharma : Bayer, Roche\nChemical : BASF, Covestro, Shin-Etsu\nBostik, Sumitomo and Shin-Etsu didn’t respond to our requests for comments\nat all. Roche chose to keep their response neutral. A spokesperson replied that\n“information security and data protection are taken very seriously.” Nearly all\nmajor corporations now emphasize that there is no such thing as one hundred\npercent protection. Hacking attacks on large companies have become almost\ncommonplace. And yet: No company really likes to talk about having hackers in\nits own networks. In many cases, customers are not informed. They are\njustifiably scared of damage to their reputation.\nTeamviewer is a case in point. A company based in the southwest of Germany, a\nbona fide Silicon Valley contender, and a true showpiece enterprise. It was\nquickly traded at a nine-digit valuation, the highest accolade for a newly\nincorporated enterprise. Then came the Winnti hackers. “Spiegel” magazine was\nthe first to report about it .\nThe corporation offers a remote maintenance software solution which,\naccording to Teamviewer, is installed on two billion devices. To imagine the\nmayhem a hacker might cause by infiltrating the end users’ devices via the\nTeamviewer application—it boggles the mind. But things didn’t get that far for\nTeamviewer, the company assures us. They add that they replaced their entire\nIT infrastructure and spent millions on removing the hackers from their\nnetworks in 2016.\nThe second way to find Winnti\nFor the IT departments, the infected computers are extremely difficult to detect.\nThat is because a new variety of this malware remains perfectly passive as long\nas it is left alone. How can you find something that’s playing dead? Since 2018\nthere’s a public tool available designed to systematically trawl the Internet for\nthese infected systems. This network scan works by luring the software out of its\nhiding spot.\nThis tool hit pay dirt at Covestro and Bostik. Many IT companies are taking the\nsame route to find Winnti infected computers; some of the results have been\nleaked to us—in the strictest confidence. Thanks to this tool, we found out back\nin March 2019 that the Bayer  pharmaceutical group had been hacked by\nWinnti.\nThe tool was written by staff of Thyssenkrupp, because the industrial giant—\ncompany number eleven—had been spied on by Winnti. In 2016, the\ncorporation allowed a reporter from “Wirtschaftswoche” to watch the attackers\nbeing pushed back. The magazine later wrote of a “ six-month defensive battle .”\nThe hackers had succeeded in extracting small data sets of importance for the\nconstruction of plants. The company mentions “data fragments” and believes\nthat the hackers have missed their actual target, tapping into the corporation’s\nresearch results.\nThe trail leading to China\nAt Gameforge, the Winnti hackers had already been removed from the networks\nwhen a staff member noticed a Windows start screen with Chinese characters.\nPresumably, the hackers were using tools in their native language, which would\nhave made their work easier. But they forgot to cover up their tracks. Just\nanother mistake they made, one of many.\nIn October 2016, several DAX corporations, including BASF and Bayer, founded\nthe German Cyber Security Organization (DCSO). The job of DCSO’s IT security\nexperts is to observe and recognize hacker groups like Winnti and to get to the\nbottom of their motives. In Winnti’s case, DCSO speaks of a “mercenary force”\nwhich is said to be closely linked with the Chinese government. They have been\ntracking the group for a long time: “We can, based on many, many indicators,\nsay with high confidence that Winnti is being directed by the Chinese.”\nMany of the experts we talked to\nbelieve that the group is operating out\nof mainland China. “I don’t care if the\nhackers work in green uniforms or are\ncommissioned by people wearing green\nuniforms,” says an IT security expert,\nalluding to a suspected proximity to the\ncountry’s military intelligence service.\nIt would seem that in the early days, Winnti hackers were still quite careless.\nOne of them left many traces on the Internet. In 2013, the Kaspersky team was\nable to follow clues in their code. This is how Costin Raiu and his colleagues\ncame across a person using the alias “Mer4en7y.” This individual was active in\nhacker forums where he commented in Chinese on a job offer for recruiting\nhackers. There was mention of a “powerful background.” “And ‘Mer4en7y’\nreplied that the job was too far away for him, but that he was in full support of\nthe work,” says Raiu.\nOn 30 October 2018, the US government brought charges against ten Chinese\nnationals . Two of them are believed to be working for one of China’s intelligence\nservices. Hackers are charged with spying on a manufacturer of gas turbines.\nAlso charged in connection with the crime: “Mer4en7y”, who is believed to have\nbeen acting on behalf of the intelligence service and to have used the Winnti\nsoftware for the hack. IT security experts attribute the cyberattack to a different\nChinese group. But the charges filed are testimony to the close links between at\nleast one Winnti hacker and the government.\nThe US government is accusing the individual going by the alias Mer4en7y of\nusing the Winnti software\nJanka Oertel of the German Marshall Fund of the United States (GMF) in Berlin\nhas been keeping a close eye on China. Oertel considers it “very unlikely that\nlarge-scale cyber operations could be happening without at least parts of the\nChinese party-state knowing about them.” Oertel, a political scientist,\nemphasizes that China wants to play a “significant market role” in key industries\nsuch as materials research by 2025 and to dominate the world market by 2035.\n“In some of these areas, however, China has not yet managed to achieve its\ngoals without technology transfers—including transfers from Germany,” Oertel\nadds.\nA government official familiar with the hacking cases agrees: “Cyber incidents\nallow us to draw conclusions as to a nation’s true priorities.” The point, he\nbelieves, is to understand one’s own industry and to figure out what cannot be\nproduced fast enough. The missing materials are then procured by hacking\noperations.\nBut a former staffer of a European intelligence agency warns: “If I wanted to\nhack anyone right now, I’d make it look like a Chinese group.” He warns against\nunderestimating the proficiency of hackers working for governments. After all,\nhe says, laying false trails is their job.\nPeople working for the German intelligence agencies tell us that, although all\ncurrent findings suggest that Winnti originates from China, much of the evidence\nis based on data that is several years old. “We have a knowledge gap for the\npast two to three years,” says one individual familiar with the incidents.”\nWhile Germany does address industrial\nespionage in direct talks with the\nChinese leadership, these attempts are\nconsidered a waste of time. “Fruitless,”\nsays one individual who knows how\nthese meetings work. The other side\ndenies everything, he says, and what’s\nleft at the end of the day are\nmeaningless declarations of intent. And the Germans are hesitant to provide\nconcrete evidence—for fear of revealing to the Chinese leadership what they\nknow— for example, from the work of the Federal Intelligence Service (BND).\nThe BND is trawling the internet for specific groups of attackers. The agency\nreceived 300 million Euros to set up a powerful surveillance system, among\nother things. The idea is to find hacker groups suspected of being government\nbacked and likely to cause damage to the Federal Republic. There is also talk of\nstarting an “intelligence offensive” against Chinese groups of attackers. This\nmeans: Hacking into the networks. Spies watching spies.\nPolitical espionage?\nCorporations like Bayer, Covestro, Roche and Bostik share a single common\ndenominator: the chemical sector. However, analyses also show that a number\nof targets now affected are deviating from the known pattern. We are talking\nabout the possibility of political espionage. We have come across several\nindicators corroborating this suspicion.\nThe Hong Kong government was spied on by the Winnti hackers. We found four\ninfected systems thanks to the network scan, and proceeded to inform the\ngovernment by email. They confirm our findings: “Recently, it was found that six\nInternet facing computers of two government departments returned positive\nresults from a test for Winnti malware.” The affected computers did not contain\nany classified information or citizens’ personal data, and there was “no\nevidence” that any data have been copied out, we are being told.\nThe network scan also sniffs out a telecommunications provider from India,\nwhich happens to be located precisely in the region where the Tibetan\ngovernment in exile (the “Central Tibetan Administration”) has its headquarters.\nIncidentally, the relevant identifier in the malware is called “CTA.” A file which\nended up on Virustotal in 2018 contained a pretty straightforward keyword:\n“tibet”. The CTA didn’t respond to our requests for comment.\nPodcast (in German): How we deciphered the code\nBR PODCAST\nPlayer\nOn top of this there are campaigns which don’t seem to make a lot of sense\nunless you consider political espionage. Take Marriott, the hotel chain based in\nMaryland, USA. The corporation manages more than one million rooms\nworldwide. While Marriott hotels may be state-of-the-art, who would want to\nhack Marriott for cutting-edge technologies or innovative ideas? Who would\nwant to spy on the Indonesian airline Lion Air for the same reasons? Probably\nnobody. But hotels and airlines collect data. If you know how to access these\ndata, you know where people travel and where they spend the night. And if you\nalso hack into telecommunications companies you know where these people\nare located at any given time. The Winnti hackers managed to penetrate the\nnetworks of Lion Air and several telecommunications companies, and they at\nleast did take Marriott into their sights. We have the relevant coded file in our\nhands.\nWhen reached for comment, the German government tells us that the security\nauthorities have established “multiple platforms and discussion groups” for that\nmatter. If required, affected companies can request “appropriate advice and\nassistance for cleaning up their systems and further prevention.” In July 2019 the\nFederal Office for Information Security reached out to a company, whose name\nwas included in a Winnti implant. We were told that “generally speaking foreign\nintelligence agencies have established cyberattacks as a vital mode of acquiring\nmore information.” According to the government, these hackers usually don’t\nhave to fear political or economical risks, “due to various obfuscation methods.\"\nThe German government’s response is elusive, when asked whether there is a\nconnection between the Winnti hackers and the Chinese Government. They tell\nus that cyberattacks are taken seriously, no matter who is responsible. We\nreached out to the Foreign Ministry of China and the embassy in Berlin with this\nand other questions. We didn't hear back.\nRelated stories (in German):\nTagesschau.de:\nIndustriespionage:\nMehrere Dax-Firmen\nvon Hackerangriff\nbetroffenDer Funkstreifzug:\nHackerangriffe auf\ndeutsche Dax-\nUnternehmenPlusminus: Deutsche\nUnternehmen stärker\nim Visier von\nIndustriespionen (Mai\n2019).\nAbout the project\n“Winnti: Attacking the Heart of the German Industry” is a joint investigation by\nBayerischer Rundfunk ( BR Recherche /BR Data ) and Norddeutscher Rundfunk.\nPublished on 24 July 2019\nReporters:  Hakan Tanriverdi, Maximilian Zierer, Rebecca Ciesielski (BR), Svea\nEckert, Jan Lukas Strozyk (NDR)\nContributing:  Maximilian Richt (BR)\nEditors:  Uli Köppen, Verena Nierle, Robert Schöffel\nIllustrations:  Anna Hunger\nDigital design:  Steffen Kühne\nImpressum  | Datenschutz  | Bayerischer Rundfunk 2019Attacking the Heart of the\nGerman Industry\nMalware:\nMalicious software,\nlike computer\nviruses or Trojans.\nLogging:\nThe hackers’\nindividual steps are\nstored in log files.\nOpsec:\nOperational Security.\nIt is a collective term\nfor all the steps\ntaken by hackers to\ncover their tracks.\nPersistent:\nIt is very hard to\npermanently remove\nthe hackers from\nthe network.\nWinnti is very specific to Germany.\nIt is the attacker group that's being\nencountered most frequently.\nAnonymous government official“\nHave you kept\ncount?\nSo far, ten\ncompanies have\nbeen affected, most\nof them in Germany.\nWe can, based on many, many\nindicators, say with high confidence\nthat Winnti is being directed by the\nChinese\nDror-John Röcher, DCSO“\nIf I wanted to hack anyone right\nnow, I’d make it look exactly like a\nChinese group.\nFormer staffer of a European intelligence\nagency“\nStep 1 : At the end of a Windows file we find the following code: daa0\nc7cb f4f0 fbcf d6d1 . This is the data stream in which Winnti\nhackers are hiding their commands.\nStep 2 : It is a piece of cake to unmask the data. From this point, it is\neasy to see what the hackers are up to. daa0 c7cb f4f0 fbcf\nd6d1  transforms into C:\\Windows , a file path on the Microsoft\noperating system.\nStep 3 : For the hackers to keep track of which network they are\ncurrently invading, they simply write it directly into their program. In the\nexample shown herein, the Winnti hackers are inside the networks of\nGameforge .\nEach company has its own IP address range. The IP address is a\ncomputer’s unique address. This is how computers can be reached via\nthe Internet.\nOnce the Winnti malware has infected a computer, it initially behaves\npassively. Winnti is now waiting for control commands.\nWith the aid of special software we send requests to different company\nnetworks. The software per se is harmless, but capable of simulating\ncontrol commands designed to lure Winnti out of hiding.\nIn all cases where Winnti was installed, the malware will respond to our\nrequest. This tells us: That company has been hacked.    Winnti : Attacking the Heart of the German Industry\n "
}