{
    "title": "wp-are-you-ready-to-respond-2017",
    "text": "How to Prepare for  \na Cyber Attack \nSix core capabilities modelwhite paper2\nWHITE PAPER | MANDIANT SERVICES  HOW TO PREPARE FOR A CYBER ATTACK \nWith those words, FireEye Chief Executive Officer Kevin \nMandia opened his testimony to the U.S. House Permanent \nSelect Committee on Intelligence in a previous hearing.\nHe was speaking in the wake of several high-profile data \nbreaches that had piqued concern among law-makers. \nAs recent headlines demonstrate, his prediction is more \nrelevant than ever.\nThe question is no longer “will you be breached,” but \n“how will you respond when you are breached,” despite \nyour best efforts at prevention. The organization with a \nwell-designed incident response plan has a much greater \nadvantage than the organization without one.\nHaving detection technology in place is only the start of a \nthorough defense.\nToday’s threat landscape also requires a detailed incident \nresponse strategy to detect, respond to, and contain \na breach, along with staff expertise to implement that \nstrategy. Once it’s determined that an attacker has \ninfiltrated your network, you must move quickly to \nminimize damage to your organization’s infrastructure, \nbrand and customer base.“In our current state of cyber security, security breaches are \ninevitable. This is an important fact, so I am intentionally \nrepeating it. In our current state of cyber security, security \nbreaches are inevitable.”1\nThis paper draws on the worldwide incident response (IR) \nexperience of Mandiant, a FireEye company, to explore the \nthree phases of preparing for a cyber attack:\n• Developing an effective IR plan\n• Adopting the proper capabilities to execute that IR plan\n• Practicing the IR plan\nOnce you have a response plan in place, you need the \nproper security technologies and expertise to support \nit. A response plan requires a full view of your IT assets, \naccurate detection capabilities and quick reaction time. \nYour team should regularly practice the response plan and \nkeep track of various metrics that measure how well it is or \nisn’t working. This helps you continually improve the plan \nto properly handle subsequent incidents.\nMany companies have an incident response plan that \nmay look good on paper but execution has not been \ntested. Key stakeholders must agree on the strategy, \nevolve it over time, and be able to implement it \nconfidently during an incident. \n1 U.S. House of Representatives (October 2011). “Written Testimony of Kevin Mandia, Chief Executive Officer, Mandiant Corporation, Before the Permanent \nSelect Committee on Intelligence U.S. House of Representatives Cyber Threats and Ongoing Efforts to Protect the Nation.”3\nWHITE PAPER | MANDIANT SERVICES  HOW TO PREPARE FOR A CYBER ATTACK \nThe Importance of an Incident Response Plan\nSecurity teams need to focus more resources on building \nup their defenses and developing a battle plan to stop \nattackers that outmaneuver those defenses.\nFor example, aircraft companies spend millions of dollars on \nmechanical and avionics systems to maintain and improve \naircraft safety. But they still enable the installation of life \nvests and emergency escape chutes. Airlines train flight \ncrews on emergency procedures. And passengers receive \ntraining before every flight. Your security program should \nprevent as many attacks as possible, but you should also \nprepare for attacks that slip through your defenses.Six Core Capabilities for Effective Response\nMandiant consultants have found that an effective incident \nresponse plan addresses six core areas (Table 1). Evaluate \nall of them when planning, executing and maintaining your \nincident response plan.\nTable 1.  Six key areas of an effective response plan.\nCapability Description\nGovernance • An organizational structure that aligns with overall business objectives and mission statement\n• Clear security policy that safeguards critical systems and information sharing between internal and external entities\nCommunication • Mechanisms and processes that promote effective information sharing between internal and external entities\nVisibility • Technologies and processes that keep stakeholders aware of activities occurring on systems and networks\n• Methods by which the cyber incident response team (CIRT) remains aware of the threat landscape and applies that \nunderstanding to defending critical infrastructure\nIntelligence • Cyber threat intelligence capabilities that enable a detailed understanding of the adversary’s capabilities, techniques \nand intent\n• Intelligence that informs and enhances security planning, vulnerability management and incident response\nResponse • CIRT processes and technologies used to identify, categorize, investigate and remediate incidents\nMetrics • Objective measures of people, processes and technology that can be easily tracked and collected automatically\n• Focused IR metrics tied to overall business goals and security objectives, driving continuous improvement4\nWHITE PAPER | MANDIANT SERVICES  HOW TO PREPARE FOR A CYBER ATTACK \nGovernance\nGovernance is more than compliance with applicable \nregulations and laws.\nGovernance includes ensuring that the security team’s \nstructure aligns with an organization’s overall goals \nand mission statement, supported by employees who \nunderstand their specific roles during an incident.\nRoles and responsibilities are reinforced by leadership, \nmaking it crucial to establish a suitable reporting structure \nacross the team.\nIn some cases, the chief information officer (CIO), who \ntypically manages IT systems and their security, is also the \nchief administration officer (CAO) — thus taking time away \nfrom IT. In other cases, a chief information security officer \n(CISO) focuses exclusively on security. Sometimes security \noperations center (SOC) staff report to the chief financial \nofficer (CFO) because security was originally tasked with \nprotecting the company’s financial data. Organizational \ncharts that may have made sense at one point of a \ncompany’s development, are not always ideal for sound \nsecurity governance.\n A security program assessment can identify potential \nconflicts due to reporting relationships between a security \nteam and the executive suite. If a security director reports \nto the CIO, security-focused initiatives may not be \nprioritized or adequately resourced. \nGiven these variations, it is crucial to detail job duties \nand relationships of personnel across the entire incident \nresponse plan.\nLogistical issues may come to the surface when assessing \nyour response plan. With some clients, the SOC is located \nin one time zone, though the company has operations in \nmultiple zones, even hemispheres. In this case, the security \nteam should develop a suitable 24/7 “follow the sun” model.Communication\nA robust incident response plan depends on quickly \nsharing information with the appropriate internal and \nexternal parties. This could be another department \nwithin the same organization or third parties outside \nthe company, including security vendors, government \nagencies and law enforcement. \nEffective communication requires defining incidents \nby category or severity. This expedites stakeholder \nnotification if an incident escalates. The response plan \nmust define which stakeholders and levels of management \nto alert as an incident unfolds. Contingency plans are \nessential when critical security staff are unavailable due to \nillness or vacation.\nWithout full and effective communication, you cannot \nrespond effectively. And organizations should not assume \nproper communication will occur naturally.  \nIf you don’t communicate \nfully and effectively, you aren’t \nresponding effectively.5\nWHITE PAPER | MANDIANT SERVICES  HOW TO PREPARE FOR A CYBER ATTACK \nUnderstanding what your \nnetwork is supposed to look \nlike, better equips you to spot \nactivity that doesn’t belong — \nincluding an intruder.\n2 Jose Pagliery (CNN). “Don’t assume you’re safe from Heartbleed.” April 2014.Visibility\nIt is vital to know what is happening on your network \nevery day. Technology and processes should provide \nvisibility throughout your organization to quickly \ndetect and scope incidents to scale. Awareness of your \nthreat landscape enables you to quickly defend your \norganization’s critical infrastructure.\nOne effective way to measure visibility is through \nyour ability to track activity logs for various network \nsecurity appliances. Logs alert your security team when, \nunauthorized users are in your network or worst case, an \nattack is underway. \nAssessing your visibility can reveal blind spots. For \nexample, if a group in your organization is granted \nexemptions from certain security requirements to speed \nup network processes, their networks may not be fully \nvisible to the security team. \nUnderstanding what your network is supposed to look like, \nbetter equips you to spot activity that doesn’t belong — \nincluding an intruder.Intelligence\nA detailed understanding of attacker tactics, techniques, \nand procedures (TTPs) dramatically improves the quality \nand speed of your response. While this information is not \nalways easy to obtain, gaining insight into attacker TTPs \nhelps you better anticipate their next move.\nSome cyber threat intelligence comes from aggregating \npublicly available information from online sources.\nNews stories and blogs share information on well-known \nattacks, how they unfold and what steps you can take to \nprotect your network from them. However, a security team \nshould never rely on publicly available information alone.\nIn other instances, companies engage in public-private \npartnerships to share intelligence. For example, a utility \ncompany may have an agreement with a government \nagency: the utility company might share network activity \ninformation with the agency, and the agency might inform \nthe utility company of threats that might be targeting their \nnetwork. Similar information-sharing agreements exist \nbetween businesses and their network security vendors.\nThese partnerships can provide more valuable intelligence. \nRevelations about the Heartbleed Bug generated a lot of \nnews coverage when it was first discovered in April 2014.2 \nThe vulnerability in the OpenSSL cryptographic software \nlibrary put a vast amount of encrypted content potentially \nat risk.\nWhile OpenSSL was widely used, Heartbleed was not \nparticularly dangerous for organizations that maintained \ngood security habits. If your network was fully patched \nand up to date, Heartbleed did not affect you. Heartbleed \ngained a lot of traction on major news outlets, but it was \nnot a major threat to most organizations. Regardless, when \nC-level executives heard about Heartbleed from the news, \nit increased their overall awareness of cyber threats.\n6\nWHITE PAPER | MANDIANT SERVICES  HOW TO PREPARE FOR A CYBER ATTACK \nResponse\nThe ultimate test of your security posture is how you \nrespond when an actual incident occurs. Your response \nplan must identify the processes and technologies \nthat your cyber incident response team (CIRT) uses to \nidentify, categorize, investigate and remediate security \nevents. Before an incident occurs, you need to answer \nthese key questions:\n• Did your team receive suitable training to respond \neffectively and efficiently to an incident?\n• Does your organization have the right hardware and \nsoftware to respond across your enterprise?\nYou can’t defend what you can’t see\nWhy visibility is key to an effective response plan \nThe cyber security industry is rife with tools that generate alerts \nbased on programmed rules and heuristic analysis. The typical SOC \nreceives more than 500,000 alerts per day.4  Organizations need to \nspend valuable time sorting out which alerts actually matter.\nVisibility is a critical criteria for assessing your readiness. Effective \nand efficient security relies on being able to tell the difference \nbetween alerts to which you should respond and alerts to \nwhich you must respond. Breaches often occur because people \noverlook critical alerts amid all the noise.\nTo enhance security visibility, you must prioritize alerts and \nrecognize which combination of alerts can lead to a critical situation.\nNetwork security monitoring occurs through an analysis of \nappliance logs. Feeds from these appliances flow through \nan aggregator that then helps create rules to issue alerts. \nWarnings from appliance A mean one thing. Simultaneous \nwarnings from appliances A, B and C mean something much \nmore serious, warranting a higher alert. If you also get an alert \nfrom appliance F, you should know that you must mobilize your \nentire security team immediately. \nIn network security parlance, alerts that sound simultaneously \nfrom multiple points on the network can be a strong sign of a \ntargeted attack.\nVisual cues are also important for prioritizing alerts. On your \nsystem dashboard, a green light may indicate a minor alert, while \na red light, possibly flashing and beeping, indicates a critical one.\nMandiant experts have identified 13 different types of logs that \ngenerate alerts. Besides the usual antivirus, firewall and intrusion \ndetection system (IDS) warnings, logs also identify anomalies \ngenerated by alerts on vendor-specific network appliances, \nas well as in Windows or Linux environments, virtual private \nnetworks (VPN), open wireless architecture (OWA) and web-\nfacing servers (just to name a few). Having many sources of \nalerts, including many false alerts, can severely obscure the threat \nenvironment. \nTo respond to the most critical alerts immediately, your system \nneeds to provide a complete, clear view of your threat situation — \none that you can act on.\nFirst, reduce the volume of trivial and false alerts by dynamically \nanalyzing them in real time using virtual- machine technology. \nDeploy technology that groups alerts that may stem from the \nsame attack — such as an APT attack — so the security team can \nview the situation holistically.\nAn important complement to your visibility capability is \nintelligence to identify widely known threats and threat actors. \nYou can compare their signatures and behavior to what you are \nseeing on your network.\nSome alert systems fail to provide response information to the \nsecurity team. The staff must work to discover what specific \nsystems are under attack, what information is at risk and what \nsteps to take to stop the attack and restore order.\nImproved visibility into the threat environment can help make \nyour incident response program more effective.If you employ a smaller team that uses manual tools \nand systems to respond, consider adopting automated \nsystems that can address suspect events more precisely \nand quickly. \nA security plan on paper is only part of the solution. \nRelying on institutional knowledge rather than the \nwritten plan can result in poor security behavior, \nespecially if key personnel are absent or never-before-\nseen threats appear.\n4 Unpublished FireEye customer data.7\nWHITE PAPER | MANDIANT SERVICES  HOW TO PREPARE FOR A CYBER ATTACK \nMetrics\nMetrics help organizations measure and improve how \neffectively and efficiently they respond to incidents. \nMetrics could include the following:\n• After you identify a breach, how long does it take your \nteam to contain the attack? \n• After the attack has been contained, how long does it \ntake to fully remediate and remove the threat from your \nenvironment?\nYou can evaluate progress by comparing metrics before \nand after you improve the incident response plan.Assessing your response readiness allows you to \nsubjectively analyze which responsibilities are assigned to \nwhich personnel, how well someone can identify a threat \nand what technology and practices should be in place.\nMetrics also objectively measure how efficient your \npeople, processes and technology are throughout a \nsystem that can be tracked and automated. Incident \nresponse performance metrics are also valuable because \nthey align with overall security and business goals — and \nare geared toward steady improvement.\n8\nWHITE PAPER | MANDIANT SERVICES  HOW TO PREPARE FOR A CYBER ATTACK \nKey Response Metrics\nOne of the most important sets of metrics that helps \nmeasure readiness is the time it takes to recognize an \nincident is occurring and the time it takes to contain it.  \nThe longer those times stretch, the more time the \nadversary has to do harm. \nMean Time to Detection\nMean time to detection (dwell time) measures the time \nbetween when a breach has occurred and when it is \ndiscovered. This measurement includes several stages:\n• Detect:  The time from initial entry into the network \nto detection. This stage gauges the effectiveness of \nperimeter technology such as intrusion detection \nsystems (IDS) and firewalls.\n• Review:  Time from detection to an analyst’s review of the \nincident. This helps determine whether your staffing level is \nsufficient to keep a close eye on your network for threats.\n• Analyze:  The time taken to analyze the incident. As you \nexplore the threat further, you must determine if the \nproper tools and expertise are in place to take action if \nthe incident escalates.\n• Identify:  The time taken to identify affected assets — a \ngroup of servers, for example — their location and their \nowner. The owner could be a specific department within \nyour organization or an outside vendor. This step helps \nmeasure the effectiveness of the organization’s asset \ninventory management.\n• Notify:  The process of alerting appropriate contacts. \nThis step measures the effectiveness of a contact \ndatabase and a communication plan that determines \nwho might get a 3:00 a.m. phone call.Mean Time to Resolution\nMean time to resolution measures the time between when \nan organization discovers a breach and when it resolves the \nbreach. This measurement includes the following elements:\n• Collect: Time to collect live response data from the \nnetwork to manage the breach. This step determines if \nyou are deploying the correct collection tools.\n• Validate: Time to confirm the extent of the intrusion \nbased on that collected data. This helps determine if the \nright skills are in place at each level of your organization.\n• React:  Time to contain and remove the threat. This \nmeasures whether the remediation is applied correctly, \nconsistently and as quickly as possible.\nA response readiness assessment reveals areas of \nopportunity for improvement, and can help organizations \nprioritize what changes to make. If an organization cannot \ncompletely eliminate damage from a breach, they can at \nleast reduce the risk to a tolerable level.\nCollectively, both detection and resolution processes \nserve many purposes for a company assessing its \nresponse readiness. They help measure how its response \ncapability has improved, particularly after a recent breach. \nSecurity leaders can also measure readiness over time as \ntheir organization grows and adds more endpoints and \ncomplexity to its IT infrastructure.\nSome organizations may want to compare their readiness \nto that of industry peers. This kind of comparison can have \nsome value, but it does not directly indicate how well-\nprepared an organization is to respond to threats.Security leaders can measure their readiness over time as \ntheir company grows and adds more endpoints and more \ncomplexity to its IT infrastructure.9\nWHITE PAPER | MANDIANT SERVICES  HOW TO PREPARE FOR A CYBER ATTACK \nFigure 1.  Sample Response Readiness Assessment score.Determine Your Readiness Rank\nMandiant ranks each of the six plan capabilities on a scale \nof 0–5 as follows:\n• 0.00 No capability: There is no recognizable process.\nThe organization does not see a problem and there \nis no communication on the issue. A zero ranking is \nnot possible; organizations always have some kind of \nsecurity technology. But this score serves as a baseline.\n• 1.00 Planned capability:  The organization has made a \ncommitment to implement new security technology and \nprocedures, but the project has not yet been completed.\n• 2.00 Minimal capability:  The organization has some \nsecurity in place, but it is bare bones and unlikely to \nprotect against things such as advanced persistent \nthreat (APT) actors.\n• 3.00 Effective capability:  The organization has security \nin place that meets industry standards.• 4.00 Mature capability:  The organization has security in \nplace that exceeds industry standards.\n• 5.00 World class:  The organization has security that is \nthe envy of the National Security Agency. Your security \nchief is a frequent guest speaker at industry events.  \n \nOthers aspire to this standard. Few companies get a five \n— it would be prohibitively expensive for most.\nRanking results are presented to clients in a bar graph (Fig. 1). \nA client can achieve a high ranking in some areas and a lower \nranking in others. This helps security leaders determine where \nthey have strong capabilities and where they need to improve.\nThe hypothetical client assessed in Figure 1 ranked highest \non its communications capability, but ranked very low on its \nability to gather network threat intelligence.\nScore Capability\n0.00 None\n1.00 Planned\n2.00 Minimal\n3.00 Effective\n4.00 Mature\n5.00 World ClassOverall RRA Score 1.51\nCommunication 1.92Governance 1.88\nVisibility 1.65\nIntelligence 0.66\n0.0 2.0 4.0 1.0 3.0 5.0Response 1.63\nMetrics 1.63CAPABILITY AREAS\nMATURITY10\nWHITE PAPER | MANDIANT SERVICES  HOW TO PREPARE FOR A CYBER ATTACK \nThe Mandiant Approach \nMandiant experts can help gauge your organization’s overall security posture, as well as its facility with the six core \ncapabilities. The Mandiant Response Readiness Assessment also measures how effectively your team detects and \ncontains an incident, and evaluates how your SOC and CIRT are organized.\nThe Response Readiness Assessment follows the three-step process shown in Table 2.\nAssess capabilities\nMandiant consultants provide an independent assessment of \nyour current security monitoring and response capabilities, \nleveraging intelligence from our expert incident responders \nwho work with compromised organizations around \nthe world on a daily basis. Because the consultants are \ntypically brought in after a breach, they can clearly identify \nshortcomings of existing response plans. That vantage point \nprovides unique insights into what actually works.\nReview best practices\nMandiant consultants provide incident response best \npractices and ways to structure your SOC workflow. \nThey can also help integrate your security information \nand event management (SIEM) tools with your incident \nresponse practices.  \nReview latest threats\nMandiant experts brief clients on the latest threat groups \nand how to outmaneuver them. Before each onsite visit \nwith a client, Mandiant consultants obtain the latest \ninformation on local and global emerging threats. Our \nconsultants can speak with authority leaders about the \ndifferent threat actors that may be targeting companies in \nyour specific industry.Table 2.  Mandiant Response Readiness Assessment.\nStep 1 Step 2 Step 3\nAssess your ability to detect, respond  \nto and contain threats\nMandiant consultants review your SOC and \nIR documentation, and compare your current \nprocesses against industry best practices to \nestablish your baseline performance. They \nalso conduct detailed staff interviews to better \nunderstand SOC and IR processes that are \nunique to your organization.   Test your processes with  \ntabletop exercises\nIncident scenarios (such as system \ncompromise, unauthorized access of personally \nidentifiable information (PII), policy violations, \ninappropriate emails) are simulated to evaluate \nyour organization’s response processes from \nincident detection to closure.Adopt recommendations and  \ncustom roadmap\nThe observations identified during \ndocumentation review, staff interviews, and \nthe tabletop exercise will be used to develop \nthe final report and presentation. Your \norganization will be benchmarked against legal \nand regulatory requirements, and industry \nbest practices. The RRA will highlight your \norganization’s SOC and IR strength’s, and \nidentify improvement opportunities.   \nPractice responding\nMandiant consultants can help you practice incident \nresponse with specially designed drills based on real-world \nincidents. These tabletop exercises present an attack \nscenario to participants with various “injects,” similar to \nplot twists in a movie thriller.\nIn one scene, an employee inadvertently opens a phishing \nemail; in the next, the malware carried in the fake email \nexposes a CEO’s actual email revealing a proposed merger. \nThe question after each inject is “How do you respond?”\nThe simulated exercise is especially revealing when \nresponses in the drill differ from an organization’s \ndocumented policies and procedures, and are compared \nto actual behaviors in previous, similar incidents.\nRecommend project roadmap\nA project roadmap presents necessary improvements \nbased on what will generate the greatest return and \nhave the biggest impact on your organization’s security \nposture. Mandiant consultants offer short, medium \nand long-term investment recommendations based on \nyour organization’s risk tolerance, budget and overall \nbusiness objectives.11\nWHITE PAPER | MANDIANT SERVICES  HOW TO PREPARE FOR A CYBER ATTACK \nConclusion\nAs Kevin Mandia said, acknowledging that breaches are \ninevitable is not the same as giving up the fight. “While this \n[reality] sounds defeatist,” he testified, “we are not defeated.”\nA Mandiant Response Readiness Assessment can help \ndetermine how well equipped your organization is to prevent, \ndetect, analyze and respond to the inevitable breach.The ultimate goal is for organizations to adopt a response \nreadiness architecture that prevents many breaches \noutright, detects more advanced attacks as soon as \npossible, analyzes the threat to quickly understand the \nscope, and responds quickly to avoid lasting harm and \nnormalize business operations.\nThe hope is to never have to use your incident response \nplan — but if and when you do use it, it needs to work.\nFireEye, Inc.  \n601 McCarthy Blvd. Milpitas, CA 95035  \n408.321.6300/877.FIREEYE (347.3393)  \ninfo@FireEye.com To learn more about Mandiant response readiness services,  \nvisit: www.FireEye.com/services.html\nAbout FireEye, Inc . \nFireEye is the intelligence-led security company. Working as a \nseamless, scalable extension of customer security operations, FireEye \noffers a single platform that blends innovative security technologies, \nnation-state grade threat intelligence and world-renowned Mandiant® \nconsulting. With this approach, FireEye eliminates the complexity \nand burden of cyber security for organizations struggling to prepare \nfor, prevent and respond to cyber attacks. FireEye has over 6,600 \ncustomers across 67 countries, including more than 45 percent of the \nForbes Global 2000.© 2018 FireEye, Inc. All rights reserved. FireEye is \na registered trademark of FireEye, Inc. All other \nbrands, products, or service names are or may be \ntrademarks or service marks of their respective \nowners. WP.HPCA.US-EN-072018\n"
}