{
    "title": "wp-fakem-rat",
    "text": "Trend Micro Incorporated\nResearch Paper\n2013\nFAKEM RAT\nMalware Disguised as Windows® \nMessenger and Yahoo!® Messenger\nBy: Nart Villeneuve  \nJessa dela TorreContents\nIntroduction  ........................................................................................................................... 1\nDistribution  ............................................................................................................................ 2\nInstallation  ............................................................................................................................. 3\nBackdoor  ................................................................................................................................ 3\nNetwork Traffic Encryption  .............................................................................................. 5\nInfrastructure ........................................................................................................................ 7\nConclusion  ............................................................................................................................ 81   |   FAKEM RATIntroduction\nThe perpetrators of targeted attacks aim to maintain persistent presence in a \ntarget network in order to extract sensitive data when needed. To maintain \npersistent presence, attackers seek to blend in with normal network traffic \nand use ports that are typically allowed by firewalls. As a result, many of the \nmalware used in targeted attacks utilize the HTTP and HTTPS protocols to \nappear like web traffic. However, while these malware do give attackers full \ncontrol over a compromised system, they are often simple and configured to \ncarry out a few commands.\nAttackers often use remote access Trojans (RATs), which typically have \ngraphical user interfaces (GUIs) and remote desktop features that include \ndirectory browsing, file transfer, and the ability to take screenshots and \nactivate the microphone and web camera of a compromised computer. \nAttackers often use publicly available RATs like Gh0st, PoisonIvy, Hupigon, \nand DRAT, and “closed-released” RATs like MFC Hunter and PlugX.1 However, \nthe network traffic these RATs produce is well-known and easily detectable \nalthough attackers still successfully use them.2\nAttackers always look for ways to blend their malicious traffic with legitimate \ntraffic to avoid detection. We found a family of RATs that we call “FAKEM” that \nmake their network traffic look like various protocols. Some variants attempt \nto disguise network traffic to look like Windows® Messenger and Yahoo!® \nMessenger traffic. Another variant tries to make the content of its traffic look \nlike HTML. While the disguises the RATs use are simple and distinguishable \nfrom legitimate traffic, they may be just good enough to avoid further scrutiny.\n1 Gh0st: http://download01.norman.no/documents/ThemanyfacesofGh0stRat.pdf  and http://www.\nmcafee.com/ca/resources/white-papers/foundstone/wp-know-your-digital-enemy.pdf ; \nPoisonIvy: https://media.blackhat.com/bh-eu-10/presentations/Dereszowski/BlackHat-EU-2010-\nDereszowski-Targeted-Attacks-slides.pdf ; Hupigon: http://www.f-secure.com/v-descs/backdoor_\nw32_hupigon.shtml ; DRAT: http://blog.trendmicro.com/trendlabs-security-intelligence/\nwatering-holes-and-zero-day-attacks/ ; MFC Hunter: http://blog.trendmicro.com/trendlabs-\nsecurity-intelligence/japan-us-defense-industries-among-targeted-entities-in-latest-attack/ ; and \nPlugX: http://about-threats.trendmicro.com/us/webattack/112/Pulling+the+Plug+on+PlugX\n2 http://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/white-papers/wp-\ndetecting-apt-activity-with-network-traffic-analysis.pdf2   |   FAKEM RAT\nDistribution\nAll three versions of the FAKEM RAT that we investigated were distributed via \nspear-phishing emails using social engineering to lure targets into executing \na malicious attachment. While we observed the use of different themes, the \ncontent of the emails were always interesting to potential targets.\nFIGURE 1:  Sample spear-phishing emails with attachments that drop FAKEM RAT\nThe malicious attachments were most often Microsoft® Word® documents \nwith code that exploits the following vulnerabilities:\n• CVE-2010-3333:  RTF Stack Buffer Overflow Vulnerability addressed in \nMicrosoft Security Bulletin MS10-087.3\n• CVE-2012-0158:  MSCOMCTL.OCX RCE Vulnerability addressed in Microsoft \nSecurity Bulletin MS12-027.4\nWe also found a Microsoft® Excel® file that exploits CVE-2009-3129, the Excel \nFeatheader Record Memory Corruption Vulnerability addressed in Microsoft \nSecurity Bulletin MS09-067.5 We also saw samples that were simply executable \n(.EXE) files.\n3 http://technet.microsoft.com/en-us/security/bulletin/MS10-087\n4 http://technet.microsoft.com/en-us/security/bulletin/ms12-027\n5 http://technet.microsoft.com/en-us/security/bulletin/MS09-067\n3   |   FAKEM RATInstallation\nAfter exploitation, an .EXE file packed with UPX is dropped.6 After initially \ndropping the malicious file named hkcmd.exe  to the %Temp% folder , the \nmalware typically copies itself using the name, tpframe.exe , to the %System%  \nfolder.\nIt then adds the following registry entry to enable its automatic execution at \nevery system startup:\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\  \nWindows\\CurrentVersion\\policies\\Explorer\\run  \ntpbar = “%System%\\tpframe.exe”\nBackdoor\nThe network traffic the malware produces is designed to look like Windows \nMessenger traffic. Malware of this type were discussed on Twitter, noted by \nSonicWALL, and found to have been active as far back as September 2009.7 \nHowever, it remains unclear if all the attacks that used this malware were \nconnected.\nThe malicious traffic begins with headers similar to actual Windows Messenger \ntraffic:\nMSG 5 N 130  \nMIME-Version: 1.0\nHowever, beyond this, you will see that the traffic is not valid Windows \nMessenger traffic but may be sufficiently disguised as such to escape further \nscrutiny.\n6 UPX is a free tool that compresses executable files. However, it is commonly used to pack \nmalware files, see http://upx.sourceforge.net/  for more details.\n7 https://twitter.com/mikko/status/232851667446538241 , https://www.mysonicwall.com/\nsonicalert/searchresults.aspx?ev=article&id=464 , and https://twitter.com/diocyde/\nstatuses/2328730236513361924   |   FAKEM RAT\nFIGURE 4:  Malicious traffic disguised as \nYahoo! Messenger trafficFIGURE 3:  Legitimate Windows Messenger \ntrafficFIGURE 2:  Malicious traffic disguised as \nlegitimate Windows Messenger traffic\nCompared with actual Windows Messenger traffic shown in Figure 3, it is easy \nto distinguish the malicious traffic shown in Figure 2.\nDuring our investigation of the fake “Windows Messenger” RAT, we found \nanother version that attempts to disguise its network traffic as Yahoo! \nMessenger traffic. The network communication this version uses begins with \nYMSG , the Yahoo! Messenger traffic header.\nFIGURE 5:  Legitimate Yahoo! Messenger \ntraffic\nHowever, the network traffic shown in Figure 4 does not resemble legitimate \nYahoo! Messenger traffic beyond the use of the header, YMSG . Compared \nwith the legitimate Yahoo! Messenger traffic shown in Figure 5, it is easy to \ndistinguish between the two.\nA third version of the FAKEM RAT attempts to disguise the network traffic it \nproduces as HTML. The malicious traffic begins with strings like \n<html><title>1..56</title><body>  or <html><title>12356</title><body> .8\n8 This variant was referenced during an incident documented by AlienVault in March 2012 in \nhttp://labs.alienvault.com/labs/index.php/2012/alienvault-research-used-as-lure-in-targeted-\nattacks/ .5   |   FAKEM RATFIGURE 6:  Malicious traffic disguised as \nHTML traffic\nThis is a fairly rudimentary disguise \nand odd because you would expect \nHTML to be the result of a request to \na web server and not as something a \nclient would send to a web server.\nNetwork Traffic Encryption\nThe network communication between the compromised computer and the RAT \ncontroller is encrypted. The encryption is the same across variants and done \nat the bit level. Each byte is XOR-ed by every letter in the string, YHCRA , \nand rotated 3 bits to the right after every XOR operation. Encrypting the \ncommunication ensures that the suspicious data passed between the \ncompromised host and the attackers cannot be easily viewed in plain text. The \ncommunication comes in 1024-byte blobs of data that start with the 32-byte \nheader. It appears that attackers may specify any kind of fake headers within \nthe first 32 bytes in order to disguise the subsequent network traffic.\nThe following bits of information are initially sent by the compromised host \nwhen the communication starts:\n• User name\n• Computer name\n• OEM code page identifier\n• What looks like a campaign code but only for some samples\nThe commands are not preconfigured as the malware relies on the data sent by \nthe server. For instance, when a client receives the command, 0211, this \nsignifies that it should execute the accompanying data in memory.6   |   FAKEM RAT\nThe following are the commands the server issues and their meanings:\n• 0211:  Execute code.\n• 0212:  Reconnect to receive data.\n• 0213:  Sleep, close socket, and reconnect.\n• 0214:  Exit.\nTo determine the RAT’s capabilities, we allowed the attackers to infiltrate a \nhoneypot computer and captured all of the network traffic it generated. We \ndecrypted the network traffic and determined the commands the attackers \nused, which include:\n• CmdMana:  Command Manager allows attackers to execute shell \ncommands.\n• FileMan:  File Manager allows the attackers to browse directories.\n• HostIn:  Host Information provides information about the compromised \ncomputer.\n• ProcMan:  Process Manager gives attackers access to running processes.\n• RegMana:  Registry Manager gives attackers access to the Windows \nregistry.\n• Scree:  Screen takes a snapshot of the desktop.\n• ServiceMa:  Service Manager allows access to services.\n• Passwo:  Password accesses stored passwords like those saved in Internet \nExplorer (IE).\n• UStea:  Uploads files from a compromised computer.7   |   FAKEM RATInfrastructure\nThe Windows Messenger samples we analyzed were clustered into five groups \nthat did not have overlapping linkages. Four of the clusters were relatively \nsmall and focused on four different domains:\n• vcvcvcvc.dyndns.org\n• zjhao.dtdns.net\n• avira.suroot.com\n• *.googmail.com\nThe vcvcvcvc.dyndns.org  domain is particularly interesting because we also \nfound it being used as a command-and-control (C&C) server for Protux—a well-\nknown malware family that has been used in many targeted attacks over the \nyears. We also found that the avira.suroot.com  domain used as a C&C server \nfor yet another malware family we call “cxgid.”\nThe *.googmail.com  domain was slightly larger and included names like \napple12.crabdance.com  and apple12.co.cc . However, the largest cluster \nrevolved around the *.yourturbe.org  domain and overlapped with the HTML \nvariant. We also found small clusters of the HTML variant that revolved around \nthe domain, endless.zapto.org , which was downloaded as a second-stage \nmalware by Protux.\nFIGURE 7:  FAKEM domains associated with the Windows Messenger and HTML variants\n8   |   FAKEM RAT\nMeanwhile, the Yahoo! Messenger samples we analyzed all accessed freeavg.\nsytes.net —a domain name that frequently resolved to different IP addresses.\nFIGURE 8:  FAKEM domains associated with the Yahoo! Messenger variant\nThe various samples we collected appear to belong to groups that overlapped a \nlittle. This suggests that rather than being associated with a particular \ncampaign, the use of various FAKEM RATs could be distributed among multiple \nthreat actors.\nConclusion\nKnowledge of the attack tools, techniques, and infrastructure of adversaries is \ncritical for developing defensive strategies. This research paper examined three \nvariants of a RAT—FAKEM—that attempt to disguise the network traffic they \nproduce to stay under the radar.\nNow that popular RATs like Gh0st and PoisonIvy have become well-known and \ncan easily be detected, attackers are looking for methods to blend in with \nlegitimate traffic. While it is possible to distinguish the network traffic FAKEM \nRAT variants produce for the legitimate protocols they aim to spoof, doing so in \nthe context of a large network may not be not easy. The RAT’s ability to mask \nthe traffic it produces may be enough to provide attackers enough cover to \nsurvive longer in a compromised environment.\nFortunately, solutions like Trend Micro™ Deep Discovery can help network \nadministrators protect their organizations from attacks that use the FAKEM \nRAT by detecting the traffic its variants produce.\nTREND MICRO INCORPORATED\nTrend Micro Incorporated (TYO: 4704; TSE: 4704), a global cloud \nsecurity leader, creates a world safe for exchanging digital information \nwith its Internet content security and threat management solutions \nfor businesses and consumers. A pioneer in server security with \nover 20 years’ experience, we deliver top-ranked client, server and \ncloud-based security that fits our customers’ and partners’ needs, \nstops new threats faster, and protects data in physical, virtualized and \ncloud environments. Powered by the industry-leading Trend Micro™ \nSmart Protection Network™ cloud computing security infrastructure, \nour products and services stop threats where they emerge—from the \nInternet. They are supported by 1,000+ threat intelligence experts \naround the globe.TREND MICRO INCORPORATED\n10101 N. De Anza Blvd.  \nCupertino, CA 95014\nU.S. toll free: 1 +800.228.5651  \nPhone: 1 +408.257.1500  \nFax: 1 +408.257.2003\nwww.trendmicro.com\n©2013 by Trend Micro Incorporated. All rights reserved. Trend Micro and the Trend Micro t-ball logo are trademarks or registered trademarks of Trend \nMicro Incorporated. All other product or company names may be trademarks or registered trademarks of their owners.\n"
}