{
    "title": "wtb_ new security flaw impacts most linux and bsd distros",
    "text": "Weekly Threat Briefing: New Security Flaw Impacts\nMost Linux And BSD Distros\nOctober 30, 2018 | Anomali Threat Research Team\nYou might also be interested in... \nLEARN MORE\nSupport Blog Forum  EN\nWEEKLY THREAT BRIEFING\n\n\n\n\nThe intelligence in this weekís iteration discuss the following threats: APT, Data breach, DDoS,\nNARWHAL SPIDER, Phishing, Ransomware, TA554, Targeted attacks, TRITON, and  Vulnerabilities . The\nIOCs related to these stories are attached to the Community Threat Briefing and can be used to check your\nlogs for potential malicious activity.\nTrending Threats\nNew Security Flaw Impacts Most Linux And BSD Distros (October 25, 2018 )\nThe popular \"X.Org Server\" package for Linux and BSD has a new vulnerability that was recently disclosed.\nThis vulnerability, registered as \"CVE-2018-14665,\" allows for a threat actor to gain elevated privileges\nand root access via a terminal or SSH session. The X.Org Server package is a core graphics and windowing\ntechnology that is the base for KDE and GNOME desktop interfaces, and is found in all major Linux and\nBSD distributions. This vulnerability was caused by the mishandling of two command-line options \"-\nlogfile\" and \"-modulepath\" that can allow a threat actor to insert and execute their own commands. The\nX.Org Foundation issued a new version to this package (version 1.20.3) to fix this vulnerability. Services like\nUbuntu, Fedora, and OpenBSD are among the projects affected.\nClick here for Anomali  recommendation\nMITRE ATT&CK: [MITRE ATT&CK] Exploitation for Privilege Escalation (T1068)\nMisconfigured Container Abused To Deliver Cryptocurrency-mining Malware (October 25, 2018 )\nThere has been an increase of systems containing misconfigured Docker Engine-Community with Docker\nApplication Programme Interface (API) ports, researchers at Trend Micro observed. The misconfigured API\nports were seen to be exposed for external access on ports 2375 and 2376 by users with administrative\npermissions. Threat actors have used those exposed ports to then initiate attacks that ultimately install\nMonero cryptominers onto the target system. Threat actors create fake users \"richard\" and \"frank\" then\ngive them root privileges on the system. Once obtaining those privileges, the threat actors re-configure\nthe Secure Socket Shell (SSH) daemon to allow for password authentication, then install system managing\npackages and additional files for persistence. Then they scan for open 2375 and 2376 ports and infect\nsystems laterally with Monero miners.\nClick here for Anomali  recommendation\nMITRE ATT&CK: [MITRE ATT&CK] Exploitation for Privilege Escalation (T1068)  | [MITRE ATT&CK]\nUncommonly Used Port (T1065)\nCutwail Spam Campaign Uses Steganography To Distribute URLZone (October 25, 2018 )\nResearchers from CrowdStrike observed a new \"Cutwail\" botnet campaign from the for-hire threat group,\n\"NARWHAL SPIDER.\" The targets of this recent spam campaign vary depending on the customer's needs.\nThe threat group uses phishing emails written in Japanese that contain a malicious attachment. The emails\nare observed to be order forms, payment reports, billing data, among other financial-themes and contain a\nmacro-enabled Microsoft Excel attachment. If the macros are enabled, PowerShell and steganography are\nemployed to distribute \"URLZone\" malware. The malware initiates by deobfuscating using Visual Basic\nApplication (VBA), and then downloads an image file and executes PowerShell commands that are hidden\nin the blue and green channels of the image. Once that payload is executed, URLZone connects to a\nCommand and Control (C2) server, though it is unclear at the writing of this article what the final payload\ndelivered is.\nClick here for Anomali  recommendation\nMITRE ATT&CK: [MITRE ATT&CK] Spearphishing Attachment (T1193)  | [MITRE ATT&CK] Data\nObfuscation (T1001)\nCathay Pacific Hack: Personal Data Of Up To 9.4 Million Airline Passengers Laid Bare (October 25, 2018 )\nAirline company, Cathay Pacific, disclosed on October 24, 2018 that they suffered a data breach in which\n9.4 million passengers were affected. The data that was accessed by unauthorised threat actors includes:\n27 active credit card numbers (without the associated CVV numbers), customer service remarks, dates of\nbirth, email addresses, expired credit card numbers, frequent flyer programme membership numbers,\nhistorical travel data, Hong Kong ID card numbers, nationalities, passenger name, passport numbers,\nphone numbers, and physical addresses. Cathay Pacific employees discovered the compromise following\nroutine IT security processes, according to the company. During a thorough investigation, it is suspected\nunauthorised access to some data might have occurred in March 2018, though by May 2018 the data was\nconfirmed to have been exposed. The company is in the process of contacting all customers via several\ncommunication channels and have reported that, at the time of the article, no passenger data appeared to\nhave been misused. It is not publicly clear what was the cause of the breach.\nClick here for Anomali  recommendation\nGovernment Spyware Vendor Left Customer, Victim Data Online For Everyone To See (October 24,\n2018 )\nA German-based spyware organisation, Wolf Intelligence, accidentally leaked over 20 gigabytes of\ncompany information such as recordings of customer meetings, scans of the founder's passport, credit card\ninformation, and surveillance targets. Researchers from CSIS Security discovered the information on an\nunprotected Command and Control (C2) server along with a public Google Drive folder. All of the\ninformation was able to be publicly accessed by anyone if they knew where to look. The company stated\nthat the cause of the breach was due to a mishandling of the information by a reseller, although the\ncompany did not report who that reseller was. Following notice of the data breach, Wolf Intelligence shut\ndown the exposed servers.\nClick here for Anomali  recommendation\nAndroid/TimpDoor Turns Mobile Devices Into Hidden Proxies (October 24, 2018 )\nA recent phishing campaign has been observed utilising SMS text messages to trick Android users into\ndownloading a fake voice-messaging application that actually allows threat actors to covertly use the\ninfected devices as network proxies. Researchers at McAfee Mobile Research found that this campaign has\nbeen targeting users in the United States since March 2018 and installs a \"Socks\" proxy that redirects all\nnetwork traffic through a third-party server via an encrypted shell tunnel connection to bypass security\nmechanisms. The malware has been dubbed \"Android/TimpDoor\" and initiates by sending a text message\nthat states something along the lines of \"you've received two new voice messages. To hear these, use\n[URL].\" If a user clicks this link, it redirects them to a fake web page that purports to be from a popular\nadvertisement site where the link to download the \"voice-messaging\" application is located. The\napplication has zero functionality aside from playing the two fake voice messages, though the voice\nmessages length do not correspond with the length the file states it to be. This malware appears to be\nsimilar to \"MilkyDoor,\" however, TimpDoor only has one functionality (acting as a proxy) whilst MilkyDoor\nappears to be a full SDK.\nClick here for Anomali  recommendation\nMITRE ATT&CK: [MITRE ATT&CK] Spearphishing Link (T1192)  | [MITRE ATT&CK] Connection Proxy\n(T1090)\nMalware Targeting Brazil Uses Legitimate Windows Components WMI And CertUtil As Part Of Its\nRoutine  (October 24, 2018 )\nResearchers at Trend Micro have discovered malware that is utilising two legitimate Windows files,\n\"wmic.exe\" and \"certutil.exe,\" to install a banking malware payload onto the targeted device. This campaign\nis conducted through phishing emails purporting to be from Correios, the national postal service of Brazil,\nthat notifies the recipient of an unsuccessful delivery attempt. The email includes a tracking code of the\ndelivery that can be accessed through the link it provides. If the target clicks upon the link, a window pop-\nup will request a ZIP file to be downloaded and extracted. This will drop a LNK file that will then direct the\nuser to execute \"wmic.exe\" that connects to the Command and Control (C2) server of the threat actors. The\nC2 server then sends a script command to make a copy of \"certutil.exe\" in the \"%temp%\" folder that is\nsaved as \"certis.exe.\" \"Certis.exe\" downloads the main payload of the malware that is a Dynamic Link\nLibrary (DLL) file. The banking malware apparently only works when the language on the target machine is\nin Portuguese, meaning that the targets are likely contained to Brazil and possibly Portugal.\nClick here for Anomali  recommendation\nMITRE ATT&CK: [MITRE ATT&CK] Spearphishing Link (T1192)\nsLoad And Ramnit Pairing In Sustained Campaigns Against UK And Italy  (October 23, 2018 )\nA recent phishing email campaign has been observed by researchers at Proofpoint that utilises a new\ndownloader, dubbed \"sLoad,\" to install the Ramnit banking trojan and conduct reconnaissance. The\ncampaign has been ongoing since May 2018 and it is suspected that the threat group \"TA554\" is behind\nthe attacks that have targeted Canada, Italy, and the UK. The emails are crafted in the target country's\nlanguage, and personalised to include the intended target's name and email address in parts of the email\nbody so the user may be more inclined to believe the email is legitimate and click on the URL in the email.\nThe URL takes the user to a zipped LNK file that requests macros to be enabled. If they are enabled, it\ntriggers a PowerShell script to run and download sLoad. sLoad is capable of delivering Ramnit, Gootkit,\nDarkVNC, Ursnif, or PsiXBot as the final payload, although this particular campaign delivers Ramnit as the\nfinal payload. This particular campaign employs sophisticated geofencing to restrict access to content\ndepending on the user's IP location.\nClick here for Anomali  recommendation\nMITRE ATT&CK: [MITRE ATT&CK] Spearphishing Link (T1192)  | [MITRE ATT&CK] Spearphishing\nAttachment (T1193)\nMagecart Group Leverages Zero-days In 20 Magento Extensions  (October 23, 2018 )\nSecurity researcher, William DeGroot, contends that there are approximately 20 Magneto extension zero-\nday vulnerabilities that would allow threat actors to enter payment skimming malware on online stores'\ncheckout pages. De Groot has only been able to identify two of the 20 extensions that threat actors are\ntargeting, and has requested assistance from the larger information security community to help track the\nspecific extensions that are vulnerable. There are several URL pathways that threat actors have been\nobserved using to exploit these vulnerabilities. The two identified Magneto extensions are\n\"Webcooking_SimpleBundle,\" which has had a patch released already, and \"TBT_Rewards\" which was\nabandoned months ago and no longer receives patches so it should be uninstalled from online stores\nimmediately.\nClick here for Anomali  recommendation\nHacker Discloses New Windows Zero-Day Exploit On Twitter  (October 23, 2018 )\nIndependent security researcher, \"SandboxEscaper,\" disclosed on Twitter a Proof-of-concept (PoC) for a\nzero-day exploit in Microsoft Windows that appears to be a privilege escalation flaw in Microsoft Data\nSharing (dssvc.dll). The Data Sharing Service allows for data brokering between applications. This\nparticular vulnerability could allow a threat actor with low privileges to elevate their privileges by using\n\"deletebug.exe\" and thus gives them the ability to delete critical system files despite not having\nadministrative access. The vulnerability only affects Windows 10 and recent versions of Windows server\neditions, so Windows 7 and 8.1 are not affected. Even a patched Windows 10 machine that has the latest\nOctober 2018 security updates, is still exploitable for this vulnerability.\nClick here for Anomali  recommendation\nMITRE ATT&CK: [MITRE ATT&CK] Exploitation for Privilege Escalation (T1068)\nNSA Tools Used to Attack Nuclear Energy Firms (October 23, 2018 )\nUnknown threat actors have launched a new campaign that is targeting nuclear energy firms in Egypt, Iran,\nand Russia, according to Kaspersky Lab researchers. The actors are using National Security Agency (NSA)\ntools leaked by the group called \"Shadow Brokers\" in their campaigns. Multiple tools were observed\nincluding: \"DanderSpritz,\" which is used to gather data and utilize exploits; \"FuzzBunch,\" which is a\nframework adaptable for different utilities and work in tangent with various plugins that each have their\nown malicious purpose; \"DarkPulsar,\" which is a backdoor that is used to connect DanderSpritz and\nFuzzBunch together. DanderSpritz is used to monitor and steal data, and FuzzBunch to exploit\nvulnerabilities and gain remote access on an infected system.\nClick here for Anomali  recommendation\nMITRE ATT&CK: [MITRE ATT&CK] Exploitation for Privilege Escalation (T1068)\nTRITON Attribution: Russian Government-Owned Lab Most Likely Built Custom Intrusion Tools for\nTRITON Attackers (October 23, 2018 )\nFireEye researchers have published a report in which they claim that the attack framework \"TRITON,\"\nwhich specifically targets Industrial Control Systems (ICS), was developed with assistance from the\nRussian government. Specifically, the malicious activity attributed to TRITON, which first reported on in\nDecember 2017, that resulted in the distribution of the malware that \"was supported by the Central\nScientific Research Institute of Chemistry and Mechanics (CNIIHM).\" CNIIHM is owned by the Russian\ngovernment and is located in Moscow. Researchers track actors using TRITON as TEMP.Veles and justify\ntheir claims with the following evidence: malware development by TEMP.Veles of which some was found\nduring the TRITON intrusion, testing activity was linked to a specific individual with ties CNIIHM, an IP\nregistered to CNIIHM was used by TEMP.Veles in TRITON activity, TEMP.Veles activity aligns with the\nMoscow time zone, and researchers contend that CNIIHM possesses the skills and knowledge necessary\nto create TRITON and assist in TEMP.Veles campaigns.\nClick here for Anomali  recommendation\nChalubo Botnet Wants To DDoS From Your Server Or IoT Device  (October 24, 2018 )\nA new botnet, dubbed \"Chalubo,\" has been discovered that has been observed targeting insecure Internet-\nof-Things (IoT) devices and internet-facing SSH servers on Linux systems, according to Sophos researchers.\nThe botnet uses code from the \"Xor.DDoS\" and \"Mirai\" botnet malware and other malware techniques\nsuch as encryption to make the malware difficult to detect. Chalubo contains a Lua command script and\nutilises the \"Elknot dropper\" that has been used in the past by the \"Elasticsearch\" botnet. The bot was\nobserved to attack a Sophos research honeypot, and the researchers were then able to see that a\ndownloader named \"libsdes,\" creates an empty file to prevent multiple occurrences of the malware from\nexecuting. The downloader drops various scheduled task commands to assist in gaining persistence and\nensure the malware survives a reboot. The end goal is to commit a Distributed-Denial-of-Service (DDoS)\nattack from the infected devices. Sophos researchers believe that the bot was going through a testing\nperiod after an attack ordered their the honeypot to target a single Chinese IP address. Researchers now\nbelieve that the bot will be observed in the future in more wide-spread campaigns.\nClick here for Anomali  recommendation\nMITRE ATT&CK: [MITRE ATT&CK] Data Obfuscation (T1001)  | [MITRE ATT&CK] Remote Access Tools\n(T1219)  | [MITRE ATT&CK] Brute Force (T1110)\nGamma Ransomware Compromises Data On 16,000 Patients At California Hernia Institute (October 22,\n2018 )\nThe National Ambulatory Hernia Institute (NAHI) in California suffered a data breach following a Gamma\nransomware attack on September 13, 2018. Approximately 16,000 patient records containing sensitive\ndata including name, address, date of birth, Social Security Number (SSN), diagnosis, and appointments'\ndata and time. An email address \"Glynnaddey@aol[.]com\" initiated the attack, though it is unclear how this\noccurred, which is known to be tied to the Gamma ransomware. The Institute stated that patients in their\nsystem prior to July 19, 2018 had their information compromised. NAHI reports that it has moved most of\ntheir data to an off-site server and are continuing to investigate the incident.\nClick here for Anomali  recommendation\nAbout the Author\nAnomali Threat Research Team\nBlog\nWolves Attack When the\nHerd Is Distracted\nBlog\nAPTs & Threat Actors That\nMay Increase Hostile Activity\nDue to Elimination of Iranian\nGeneral Quassem Suleimani\nBlog\nPhishing Campaign Targets\nLogin Credentials of Multiple\nUS, International\nGovernment Procurement\nServices\nBlog\nMalicious Activity Aligning\nwith Gamaredon TTPs\nTargets Ukraine\nGet the latest threat intelligence news in your email.\nCompany Email\n SUBSCRIBE\nCopyright 2020 ANOMALI. \nAll Rights Reserved.PRODUCTS\nCOMMUNITY\nAPP STOREISACS\nRESEARCH\nCOMPANYBLOG\nNEWS & EVENTS\nSUPPORT\nPrivacy Policy\nTerms of Use\n3rd Party Vendor Policy\n\nRESOURCES\n PRODUCTS COMMUNITY APP STORE ISAC s COMPANY\nREQUEST DEMO\n\n "
}