{
    "title": "xenotime _ dragos",
    "text": "XENOTIME\nSince 2014\nMode of Operation\nFocused on physical destruction and long-term\npersistence\nCapabilities\nTRISIS, custom credential harvesting, off the shelf\ntools\nVictimology\nOil & Gas, Electric, Middle East, North America,\nEurope, APAC\nLinks\nNoneXenotime\nDragos, Inc.\nXENOTIME is easily the most dangerous threat activity publicly known. It is the only activity group intentionally\ncompromising and disrupting industrial safety instrumented systems, which can lead to scenarios involving loss of\nlife and environmental damage.\nDragos identified several compromises of ICS vendors and manufacturers in 2018 by activity associated with\nXENOTIME, providing potential supply chain threat opportunities and vendor-enabled access to asset owner and\noperator ICS networks.\nXENOTIME rose to prominence in December 2017 when Dragos and FireEye jointly published details\nof TRISIS  destructive malware targeting Schneider Electric’s Triconex safety instrumented system. The multi-step\nmalware framework caused industrial systems in a Middle Eastern industrial facility to shut down. The incident\nrepresented a shift in the capabilities and consequences of ICS malware.\nTRISIS was an escalation of the type of attacks historically targeting ICS systems. Targeting a safety system indicates\nsignificant damage and loss of human life were either intentional or acceptable goals of the attack, a consequence\nnot seen in previous disruptive attacks such as the 2016 CRASHOVERRIDE  malware that caused a power loss in\nUkraine.\nNote: Industrial safety instrumented systems comprise part of a multi-layer engineered process control framework\nto protect life and environment. Industrial safety systems are highly redundant and separate controls which\noverride and manage industrial processes if they approach unsafe conditions such as over-pressurization,\noverspeed, or over-heating. They enable engineers and operators to safely control and possibly shutdown\nprocesses before a major incident occurs. They’re a critical component of many dangerous industrial environments\nsuch as electric power generation and oil and gas processing.\nXENOTIME configured TRISIS based on the specifics and functions of the Triconex system within the industrial\ncontrol (ICS) environment. XENOTIME used credential capture and replay to move between networks, Windows\ncommands, standard command-line tools such as PSExec, and proprietary tools for operations on victim hosts. (Full\nreports detailing XENOTIME’s tool techniques, and procedures are available to Dragos WorldView  customers.)\nBecause the TRISIS malware framework was highly tailored, it would have required specific knowledge of the\nTriconex’s infrastructure and processes within a specific plant. This means it’s not easy to scale—however, the\nmalware provides a blueprint of how to target safety instrumented systems. This tradecraft is thus scalable and\navailable to others even if the malware itself changes. Dragos’ data indicates XENOTIME remains active. Furthermore, Dragos’ analysis of the TRISIS event continues as we recover\nadditional data surrounding the incident.\nDragos assesses with moderate confidence that XENOTIME intends to establish required access and capability to cause a potential, future disruptive—or even destructive—event.\nCompromising safety systems provides little value outside of disrupting operations. The group created a custom malware framework and tailormade credential gathering tools, but\nan apparent misconfiguration prevented the attack from executing properly. As XENOTIME matures, it is less likely that the group will make this mistake in the future.\nXENOTIME operates globally, impacting regions far outside of the Middle East, their initial target. Intelligence suggests the group has been active since at least 2014 and is presently\noperating in multiple facilities targeting safety systems beyond Triconex. This group has no known associations to other activity groups.\nDragos threat intelligence leverages the Dragos Platform, our threat operations center, and other sources to provide comprehensive insight into threats affecting industrial control\nsecurity and safety worldwide. Dragos does not corroborate nor conduct political attribution to threat activity. Dragos instead focuses on threat behaviors and appropriate\ndetection and response. Read more  about Dragos’ approach to categorizing threat activity and attribution.\nDragos does not publicly describe ICS activity group technical details except in extraordinary circumstances in order to limit tradecraft proliferation. However, full details on\nXENOTIME and other group tools, techniques, procedures, and infrastructure is available to network defenders via Dragos WorldView .\n  Your mainline ICS feed:  @DragosInc\nPRODUCTS & SERVICES\nDragos Platform\nThreat Intelligence\nNeighborhood Keeper\nProfessional Services\nTrainingRESOURCES\nWhitepapers\nWebinars\nDatasheets & Brochures\nInfographics\nYear in Review\nAdversaries ReportsMEDIA\nNews\nPress Releases\nVideos\nPodcastsCOMPANY\nAbout Us\nAwards\nCareers\nDragos Industrial Security Conference\nEvents\nMeet the Team\n1745 Dorsey Rd\nHanover, Maryland 21076\n(855) 372-4670\ninfo@dragos.comExperienced an Incident?\nBlog\nContact Us\nTerms & Conditions\nCOPYRIGHT © 2020 DRAGOS, INC. ALL RIGHTS RESERVED.\nFor information about how we collect, use, share or otherwise process information about you, please see our privacy policy.\n      \nProducts & Services 3 Community Tools 3 Why Dragos Partners Company 3 Resources 3U    Blog Contact Us WorldView Login Experienced An Incident? REQUEST A DEMO\n "
}