{
    "title": "“el machete” _ securelist",
    "text": "Share post on:Introduction\nSome time ago, a Kaspersky Lab customer in Latin America contacted us to say he had visited China and suspected his\nmachine was infected with an unknown, undetected malware. While assisting the customer, we found a very interesting file\nin the system that is completely unrelated to China and contained no Chinese coding traces. At first look, it pretends to be a\nJava related application but after a quick analysis, it was obvious this was something more than just a simple Java file.  It was\na targeted attack we are calling “Machete”.\nWhat is “Machete”?\n“Machete” is a targeted attack campaign with Spanish speaking roots. We believe this campaign started in 2010 and was\nrenewed with an improved infrastructure in 2012. The operation may be still “active”.\nThe malware is capable of the following cyber-espionage operations:\nLogging keystrokes\nCapturing audio from the computer’s microphone\nCapturing screenshots\nCapturing geolocation data\nTaking photos from the computer’s web camera\nCopying files to a remote server\nCopying files to a special USB device if inserted\nHijjacking the clipboard and capturing information from the target machine\nTargets of “Machete”\nMost of the victims are located in, Venezuela, Ecuador, Colombia, Peru, Russia, Cuba, and Spain, among others. In some\ncases, such as Russia, the target appears to be an embassy from one of the countries of this list.\nTargets include high-level profiles, including intelligence services, military, embassies and government institutions.\nHow does “Machete” operate?\nThe malware is distributed via social engineering techniques, which includes spear-phishing emails and infections via Web by\na fake Blog website. We have found no evidence of of exploits targeting zero-day vulnerabilities. Both the attackers and the\nvictims appear to be Spanish-speaking.\nDuring this investigation, we also discovered many other the files installing this cyber-espionage tool in what appears to be a\ndedicated a spear phishing campaign. These files display a PowerPoint presentation that installs the malware on the target\nsystem once the file is opened.  These are the names of the PowerPoint attachments:\nHermosa XXX.pps.rar\nSuntzu.rar\nEl arte de la guerra.rar\nHot brazilian XXX.rar\nThese files are in reality Nullsoft Installer self-extracting archives and have compilation dates going back to 2008.\nA consequence of the embedded  Python code inside the executables is that these installers include all the necessary\nPython libraries as well as the PowerPoint file shown to the victim during the installation. The result is extremely large files,\nover 3MB.\nHere are some screnshots of the mentioned files:\nA technical relevant fact about this campaign is the use of Python embedded into Windows executables of the malware.\nThis is very unusual and does not have any advantage for the attackers except ease of coding. There is no multi-platform\nsupport as the code is heavily Windows-oriented (use of libraries). However, we discovered several clues that the attackers\nprepared the infrastructure for Mac OS X and Unix victims as well. In addition to Windows components, we also found a\nmobile (Android) component.\nBoth attackers and victims speak Spanish natively, as we see it consistently in the source code of the client side and in the\nPython code.\nIndicators of Compromise\nWeb infections\nThe following code snippets were found into the HTML of websites used to infect victims:\nNote: Thanks to Tyler Hudak  from Korelogic  who noticed that the above HTML is copy pasted from SET, The Social\nEngineering Toolkit .\nAlso the following link to one known infection artifact:\nhxxp://name.domain.org/nickname/set/Signed_Update.jar\nDomains\nThe following are domains found during the infection campaign. Any communication with them must be considered\nextremely suspicious\njava.serveblog.net \nagaliarept.com\nfrejabe.com\ngrannegral.com\nplushbr.com\nxmailliwx.com\nblogwhereyou.com (sinkholed by Kaspersky Lab)\ngrannegral.com (sinkholed by Kaspersky Lab)\nInfection artifacts\nMD5 Filename\n61d33dc5b257a18eb6514e473c1495fe AwgXuBV31pGV.eXe\nb5ada760476ba9a815ca56f12a11d557 EL ARTE DE LA GUERRA.exe\nd6c112d951cb48cab37e5d7ebed2420b Hermosa XXX.rar\ndf2889df7ac209e7b696733aa6b52af5 Hermosa XXX.pps.rar\ne486eddffd13bed33e68d6d8d4052270 Hermosa XXX.pps.rar\ne9b2499b92279669a09fef798af7f45b Suntzu.rar\nf7e23b876fc887052ac8e2558f0d6c38 Hot Brazilian XXX.rar\nb26d1aec219ce45b2e80769368310471 Signed_Update.jar\nTraces on infected machines\nCreates the file Java Update.lnk pointing to appdata/Jre6/java.exe\nMalware is installed in appdata/ MicroDes/\nRunning processes Creates Task Microsoft_up\nHuman part of “Machete”\nLanguage\nThe first evidence is the language used, both for the victims and attackers, is Spanish.\nThe victims are all Spanish speaking according to the filenames of the stolen documents.\nThe language is also Spanish for the operators of the campaign, we can find all the server side code written in this language:\nreportes, ingresar, peso, etc.\nConclusion\nThe “Machete” discovery shows there are many regional  players in the world of targeted attacks. Unfortunately, such\nattacks became a part of the cyber arsenal of many nations located over the world. We can be sure there are other parallel\ntargeted attacks running now in Latin America and other regions.\nKaspersky Lab products detect malicious samples related to this targeted attack as Trojan-Spy.Python.Ragua .\nNote: A full analysis of the Machete attacks is available to the Kaspersky Intelligent Services customers.\nContact: intelreports@kaspersky.com\nAPT CYBER ESPIONAGE  MACHETE  SPEAR PHISHING\nRelated Posts\nLEAVE A REPLY\nYour email address will not be published.  Required fields are marked *\nEnter your comment here\nName *\nEmail *\nSave my name, email, and website in this browser for the next time I comment.\n \nSUBMIT\nI'm not a robot\nreCAPTCHA\nPrivacy  - Terms\n APT REPORTS\n“El Machete”\nBy GReAT  on August 20, 2014. 6:30 am\n \nNotify me when new comments are added.\nIN THE SAME CATEGORY\nChafer used Remexi malware to spy on\nIran-based foreign diplomatic entities\nGreyEnergy’s overlap with Zebrocy\nA Zebrocy Go Downloader\nAPT review of the year\nDarkPulsar FAQ\n© 2020 AO Kaspersky Lab.  All Rights Reserved. \nRegistered trademarks and service marks are the property of their respective owners.\nContact us  | Privacy Policy  | License AgreementEmail\n I agree to provide my email address to “AO Kaspersky Lab” to\nreceive information about new posts on the site. I understand\nthat I can withdraw this consent at any time via e-mail by\nclicking the “unsubscribe” link that I find at the bottom of any e-\nmail sent to me for the purposes mentioned above.\nSUBSCRIBE\nHunting APTs with YARA\n OilRig’s Poison Frog – old\nsamples, same trick\nAPT review: what the world’s\nthreat actors got up to in\n2019\nTHREATS\n CATEGORIES\n TAGS\n STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019\n English\nSolutions\n Industries\n Products\n Services\n Resource Center\n Contact Us GDPR GET IN TOUCH\n "
}