{
  "title": "00. APT29",
  "url": "https://github.com/darpa-i2o/Transparent-Computing",
  "text": "The threat actor crafted the phishing emails to masquerade as a U.S. Department of State Public Affairs official sharing an official document. The links led to a ZIP archive that contained a weaponized Windows shortcut file hosted on a likely compromised legitimate domain, jmj.com. The shortcut file was crafted to execute a PowerShell command that read, decoded, and executed additional code from within the shortcut file. Upon execution, the shortcut file dropped a benign, publicly available, U.S. Department of State form and Cobalt Strike Beacon. Cobalt Strike is a commercially available post-exploitation framework. The BEACON payload was configured with a modified variation of the publicly available \"Pandora\" Malleable C2 Profile and used a command and control (C2) domain – pandorasong.com – assessed to be a masquerade of the Pandora music streaming service. The customization of the C2 profile may have been intended to defeat less resilient network detection methods dependent on the default configurations. The shortcut metadata indicates it was built on the same or very similar system as the shortcut used in the November 2016 campaign. ",
  "val_meta": {
    "server": [
      "jmj.com",
      "pandorasong.com"
    ],
    "victim": [],
    "related_file": [
      "ZIP archive",
      "Windows shortcut file",
      "PowerShell command",
      "U.S. Department of State form"
    ],
    "threat_actor": [],
    "tool": [
      "PowerShell",
      "Cobalt Strike"
    ],
    "vulnerability": []
  },
  "val_triples": [
    "(Windows shortcut file, consists_of, PowerShell command)",
    "(ZIP archive, consists_of, Windows shortcut file)",
    "(jmj.com, delivers, Windows shortcut file)",
    "(jmj.com, delivers, ZIP archive)",
    "(pandorasong.com, controls, Cobalt Strike)",
    "(00. APT29, has_related_file, ZIP archive)",
    "(00. APT29, has_related_file, Windows shortcut file)",
    "(00. APT29, has_related_file, PowerShell command)",
    "(00. APT29, has_related_file, U.S. Department of State form)",
    "(00. APT29, has_server, jmj.com)",
    "(00. APT29, has_server, pandorasong.com)",
    "(00. APT29, uses, PowerShell)",
    "(00. APT29, uses, Cobalt Strike)"
  ]
}