{
    "title": "_state-sponsored_ hackers targeted eirgrid electricity network in _devious attack_ - independent.ie",
    "text": "Your browser is outdated, it will not render this page properly, please upgrade. 'State-sponsored' hackers targeted EirGrid electricity network in 'devious attack' Cathal McMahon August 07 2017 01:30 AM    The company that manages the country's electricity grid was targeted by \"state-sponsored\" hackers, leaving its network exposed to a \"devious attack\". The hackers, using IP addresses sourced in Ghana and Bulgaria, gained access to a Vodafone network used by Irish operator EirGrid in the UK, the Irish Independent can reveal. Following the original attack in April hackers then compromised the routers used by EirGrid in Wales and Northern Ireland. They did this by installing a virtual wire tap on the system so that they had access to all of unencrypted communications sent to and from the companies. The breach was discovered last month, but sources say it is still not known if any malicious software was secreted onto EirGrid's control systems. State-owned EirGrid manages and operates the electricity transmission grid across the island of Ireland. EirGrid moves wholesale power around the country. A breach of the system could result in power outages across the island. Malware has previously been used in the Ukraine by suspected Russian hackers to cause major national power outages. The Irish Independent has learned that the hack came to light after a tip-off from Vodafone and the National Cyber Security centre in the UK to EirGrid. The original breach took place on April 20 and lasted just short of seven hours. A source said that both Vodafone and the National Cyber Security Centre believed it was a \"state-sponsored attack\". The breach of the Vodafone network allowed the hackers to create a type of wire tap known as Generic Routing Encapsulation (GRE) to tunnel into EirGrid's Vodafone router located in Shotton. Household customer information was not stored on the EirGrid computers but information pertaining to commercial customers would have been transferred over the compromised network. David Martin, spokesperson for EirGrid Group, said: \"We are aware of the currently reported focus on energy companies and national infrastructure and wish to state that our computer systems have not been breached.\" A spokesman for Vodafone said it did not comment on specific security incidents. \"In such cases we always work closely with the relevant authorities to investigate and take immediate actions to contain the issue and protect our customers,\" he said. Irish Independent Related Content News Exclusive: EirGrid targeted by 'state sponsored' hackers leaving networks exposed to 'devious attack' Irish electricity transmission system operator EirGrid was targeted by “state sponsored” hackers leaving its network exposed to a “devious attack”.EirGrid was targeted by 'state sponsored' hackers. Stock photo: PA by  Promoted Links Most Computer Owners Don't Know This Clever Security Trick (Do It Now) Security Savers Online Learning a new language this year? – This app gets you speaking in just 3 weeks Babbel.com Most Dangerous Selfies Ever Taken Far and Wide Ukrainian Billionaire Is Buyer of €200 Million French Riviera Mansion Mansion Global Rustic Mountain House With Ski- in, Ski-out Trail Access Mansion Global Learning A Language In 2020? - This App Is Used By Millions Of Language Learners Babbel  News  Opinion  Business  Sport  Life  Style  Entertainment  Travel  Search entire site  News Irish News World News Local papers Environment Weather Opinion Letters Editorial Comment Business Brexit Irish World Technology Personal Finance Small Business Farming Jobs Commercial Property In The Workplace Sport Rugby GAA Soccer The Left Wing The Throw In Women's Sport Golf Horse Racing Other Sports Life Health & Wellbeing Home & Garden Family Food & Drink Motoring Style Celebrity Fashion Beauty Sex & Relationships Voices Galleries Entertainment Movies Television Music Radio Books Theatre & Arts Games Festivals Banter Coffee Break Travel Travel News Reader Travel Awards Ireland Reviews Walks Europe World/USA Travel TV Cruise Ski Podcasts Women in Tech The Throw In The Big Tech Show Real Health Podcast Going to College Partners in Business The Left Wing The Floating Voter Video Newsletters Socials    Sitemap Contact Us Terms & Conditions Privacy Statement Cookie Policy Paid-for content Policy Group Websites Advertise with Us AN   WEBSITE    Independent.ie  SectionsNews  Opinion  Business  Sport  Life  Style  Entertainment  Travel Irish NewsFriday, 20 March 2020  | 6.7°C Dublin  Search  SubscribeLog In Privacy  "
}