{
    "title": "A Fanny Equation, I am your father, Stuxnet",
    "text": "01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 1 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/APT REPORTS17 FEB 2015 12 minute readA Fanny Equation: “I am your father, Stuxnet” GREATAt the Virus Bulletin conference in 2010, researchers fromKaspersky Lab partnered with Microsoft to present!ndings related to Stuxnet. The included slides dealing with various parts of Stuxnet, suchas the zero-days used in the attack.Perhaps the most interesting zero-day exploit fromStuxnet was the LNK exploit (CVE-2010-2568). Thisallowed Stuxnet to propagate through USB drives andinfect even machines that had Autorun disabled.It was discovered during the 2010 research into Stuxnetthat the LNK exploit has earlier been used in anothermalware, supposedly a Zlob PE, that pointed to“fanny.bmp“.//AUTHORSjoint presentationGREAT WEBINARS13 MA Y 2021, 1:00PMGReAT Ideas. Balalaika EditionBORIS LARIN,DENIS LEGEZO26 FEB 2021, 12:00PMGReAT Ideas. Green T ea EditionJOHN HUL TQUIST,BRIAN BARTHOLOMEW,SUGURU ISHIMARU,VITAL Y KAMLUK,SEONGSU P ARK,YUSUKE NIWA,MOTOHIKO SATO17 JUN 2020, 1:00PMGReAT Ideas. Powered by SAS:malware attribution and next-gen Io ThoneypotsMARCO PREUSS,DENIS LEGEZO,COSTIN RAIU,KURT BAUMGARTNER,DAN DEMETER,Y AROSLA V SHMELEV26 AUG 2020, 2:00PMGReAT Ideas. Powered by SAS: threatactors advance on new frontsIV AN KWIATKOWSKI,MAHER Y AMOUT,NOUSHIN SHABAB,PIERRE DELCHER,FÉLIX AIME,GIAMP AOLO DEDOLA,SANTIAGO PONTIROLI22 JUL 2020, 2:00PMGReAT Ideas. Powered by SAS: threathunting and new techniquesDMITRY BESTUZHEV,COSTIN RAIU,PIERRE DELCHER,BRIAN BARTHOLOMEW,BORIS LARIN,ARIEL JUNGHEIT,FABIO ASSOLINI Content menuSearch... Subscribe 01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 2 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/Back in 2010, very few people paid much attention to apiece of malware that used the LNK exploit prior toStuxnet. Zlob is a large malware family and these kinds ofcrimeware-grade samples are rarely of interest toresearchers digging into zero-days and nation-statesponsored operations.However, during our 2014 research into the  group,we created a special detection for the group’s exploitationlibrary, codenamed “PrivLib”. T o our surprise, this detectiontriggered a worm from 2008 that used the Stuxnet LNKexploit to replicate, codenamed Fanny.What’s so Fanny?This PrivLib-boosted Worm, which spreads using theStuxnet LNK exploit and the !lename “fanny.bmp” wascompiled on Mon Jul 28 11:11:35 2008, if we are to trust thecompilation timestamp. It arrived in our December 2008collection from the wild, so the compilation might very wellbe correct. “Fanny my name” could be an introductory messagefrom the authorsThe 2008 “Fanny.bmp” Worm is detected by KasperskyLab products as Trojan-Downloader.Win32.Agent.bjqt.The malware includes the LNK exploit, which means that itis a piece of malicious software that used the Stuxnet LNKexploit before Stuxnet!The second Stuxnet exploit(MS09-025)If one piece of malicious software that used an exploitEquation 01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 3 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/ from Stuxnet before Stuxnet is a good catch, a secondStuxnet exploit makes it even more interesting.The second exploit used to be a zero-day when Fanny wasoperational. This means that Fanny used two zero-days toreplicate, both of which were later used by Stuxnet. Thespeci!c vulnerability used for privilege escalation waspatched with MS09-025:“The security update addresses thesevulnerabilities by correcting the methods used forvalidating a change in speci!c kernel objects, forvalidating the input passed from user mode to thekernel, and for validating the argument passed tothe system call. The security update alsoaddresses a vulnerability by ensuring that theWindows kernel cleans up pointers under errorconditions.”The same exploit was later used in an early Stuxnetmodule from 2009, which was embedded into a largebinary built using the Flame platform. That Stuxnetmodule, also known as “atmpsvcn.ocx” or Resource 207was the technical link between Stuxnet and Flame. Thisstory has previously been covered in our . While the vulnerability exploited by both theStuxnet/Flame module and Fanny is the same, theimplementation of the exploit is di\"erent. The exploit inStuxnet targets a speci!c OS version, while Fanny isdesigned to be universal and is capable of running onmultiple platforms. It has a unique shellcode and exploit-triggering procedures for:#Fanny used two zero-days to replicate,both of which were later used by #Stuxnet#EquationAPT #TheSAS2015T weet Windows NT 4.0Windows 2000Windows XPpost01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 4 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/The implementation of the exploit in Fanny is morecomplex than in Stuxnet: instead of running just onepayload the authors created a framework to run as manypayloads as they want by replacing a system service calldispatcher nt!NtShutdownSystem with their own custompointer from  theuser-space as shown in the next !gure.Fanny injected its own system service call dispatcherThis enables a persistent trampoline from user-mode tokernel-mode. This feature was not present in the Stuxnetmodule but there are other similarities. For instance, itseems that both the developers of Stuxnet and of Fannyfollow certain coding guidelines such as the usage ofunique magic numbers from each function call. Most ofthe returned results are simply disposed but they are stillpart of the code. This could be the remains of a debugversion of the code which could potentially log every stepin the code to ease the tracking down of an error whiletesting. In complex systems where kernel and user-spacecode is running with no interaction this seems a logical andeven essential method. Again, it’s implemented both in theStuxnet code and in Fanny. See next !gure.Windows 2003Windows Vista, 2008 and possibly others from NT6.xfamily01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 5 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/Stuxnet (on the left) and Fanny (on the right) usingmagic return valuesThe Fanny MalwareSo, what is Fanny essentially? It is a USB Worm with asophisticated backdoor that uses the so-called “StuxnetLNK vulnerability” to automatically execute from the USBdrive even if Autorun has been disabled. It can elevateprivileges to the local System using kernel exploit anddrops and registers additional modules. It attempts toconnect to a C&C server and deploys additionalcomponents if connection is available. If not, it uses theUSB drive as a carrier to send/receive requests to andfrom the operator via a hidden storage area created inraw FAT structure. FROM THE SAME AUTHORS01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 6 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/Typically a victim plugs in a new USB drive and opens itwith Windows Explorer. Y ou can visually observe the twostages of infection from the USB which take seconds toexecute.Android malware, Androidmalware and more AndroidmalwareCoyote: A multi-stagebanking Trojan abusing theSquirrel installerFakeSG campaign, Akiraransomware and AMOSmacOS stealerAdvanced threat predictionsfor 2024Stealer for PIX paymentsystem, new Lumar stealerand Rhysida ransomware01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 7 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/Fanny modulesMD50a209ac0de4ac033f31d6ba9191a8f7aSize184320TypeWin32 DLLInternal namedll_installer.dllCompiled2008.07.28 08:11:35 (GMT)01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 8 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/This !le is a DLL with two exports (to install and uninstallthe malware). It contains a xor-encrypted con!g in binaryresource with number 101. The con!g determines malwarebehavior: there is a command to deploy malware on thecurrent system, URLs for the C&C server and local!lenames and paths used to install embedded malwarecomponents. Fanny components inside the main executableUpon starting it checks the following mutexes:Where is a 1-byte long integer taken from the con!g. Ifany of these mutexes exist, the code doesn’t run. It meansthat another instance of the same code is running.InstanceNum most likely identi!es a variant or generationof Fanny preventing the same version from reinfecting thesystem but allowing for di\"erent versions to run (possiblyto enable enforced update of components).The module also checks another important byte in itscon!guration. This byte is a counter that is decreasedduring successful system infection. When the counterreaches a minimal value of one the module cleans up theUSB drive and stops spreading the worm. In this way theattackers limit the maximum length of the Worm’s killchain.Global\\RPCMutexGlobal\\RPCMutex01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 9 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/If the module is named “fanny.bmp” (the !le name thatFanny uses to spread via USB drives) the module self-installs from the USB drive.As part of the initial infection process Fanny attempts toelevate current privileges if the user has no administrativerights on the current system. It uses a vulnerabilitypatched by MS09-025 for that purpose. Only if theelevation succeeds does the malware attempt to connectto the C&C server using a URL which is stored in thecon!g:Below is a sample request issued by the malware:GET /ads/QueryRecord200586_f2ahx.html HTTP /1.1User-Agent: Mozilla/4.0 (compatible;)Host: webuysupplystore.mooo.comThe malware expects the C&C server to reply with anHTTP 200 response and append a 0x7f-xored string thathas a second stage URL. The second stage response maycontain an executable !le body which is saved on disk andexecuted.The C&C server is currently sinkholed by Kaspersky Lab,but according to our pDNS records it previously pointedto the following IP address:IP information The following describes the stages that were identi!edhttp:/ /webuysupplystore[.]mooo[.]com/ads/QueryRecord200586_f2ahx.html 210.81.22.23901/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 10 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/during the analysis of the initial and embeddedcomponents of Fanny.InfectionThe module searches for fanny.bmp in the root of diskdrives starting from drive D: and copies it to the followinglocations:Why does Fanny make two copies of itself? Actually, thereis a minor di\"erence between these two !les. Fannypatches its con!g in the resource section of one of the!les (comhost.dll). The patched data is the value ofremained maximum length of the Fanny killchain.“mscorwin.dll” is the original !le copied as-is from theremovable drive. So far, one copy is used for infectingother USB drives, the other is loaded on the system boot.It also copies all *.lnk !les from the USB drive to“%WINDIR%\\system32\\” in order to reuse them wheninfecting other attached USB drives. Note that there maybe more than one LNK !le, because each LNK contains adistinct path to the DLL which gets loaded. As far as theletter of a new drive on the target system is unknown,Fanny uses several LNKs for the most common driveletters. This method was improved later in Stuxnet, whichused a relative DeviceID-dependent path to the USB drive.However, even that method required several LNK !les (upto four) because of di\"erent relative paths on di\"erentversions of Windows, but that’s far fewer than an almostfull set of letters from the Latin alphabet.PersistenceFanny creates the following registry value to achievepersistence:HKLM\\System\\CurrentControlSet\\Control\\MediaResources\\acm\\ECELP4\\Driver.%WINDIR%\\system32\\comhost.dll%WINDIR%\\system32\\mscorwin.dll Subscribe to ourweekly e-mailsThe hottest research right in yourinboxEmailI agree to provide my email address to “AOKaspersky Lab” to receive information aboutnew posts on the site. I understand that I canwithdraw this consent at any time via e-mailby clicking the “unsubscribe” link that I !nd at01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 11 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/This is not a common way to make code startautomatically on a system boot and it’s extremely invasive,but it guarantees that the module is loaded in the addressspace of each process in the system, including somecritical processes such as lsass.exe and services.exerunning as SYSTEM user. When the module is loaded it checks other values thatstart from “!lter” in the same registry key, i.e.: The values contain a hosting process name and a path to aDLL or EXE !le. If the current process name contains thevalue set as hosting process, then the module loads a DLLor starts a new process (in case of EXE !le) depending ontarget !le extension.This is a map of the processes and modules that are usedin Fanny:ProcessFanny moduleShortDescriptionwinlogonc:\\windows\\MSAgent\\AGENTCPD.DLLUSB backdoorexplorerc:\\windows\\system32\\shelldoc.dllWindowsExplorerHKLM\\System\\CurrentControlSet\\Control\\MediaResources\\acm\\ECELP4\\!lter2HKLM\\System\\CurrentControlSet\\Control\\MediaResources\\acm\\ECELP4\\!lter3HKLM\\System\\CurrentControlSet\\Control\\MediaResources\\acm\\ECELP4\\!lter8 Subscribeby clicking the “unsubscribe” link that I !nd atthe bottom of any e-mail sent to me for thepurposes mentioned above.01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 12 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/rootkitlsassc:\\windows\\system32\\mscorwin.dllUSB wormUSB WormThe code of the actual Worm is part of%WINDIR%\\system32\\comhost.dll export with ordinal 4(name of export is “dll_installer_4“). The DLL is a modi!ednext-generation Worm which is copied to every attachedUSB drive with all related LNK !les stored inWindows\\System32 directory. This module is distributedby mscorwin.dll which is part of the lsass system process.Windows Explorer RootkitThe rootkit functionality is provided by a shelldoc.dll !leloaded in the Windows Explorer process. It hides someFanny-related !les (LNK-!les and fanny.bmp) in WindowsExplorer by removing them from the list of items in theforeground window that uses SysListView32 control(normally Windows Explorer window).Some screenshots with disappearing !les weredemonstrated previously, however sometimes thisapproach may raise suspicions. Here is what it looks like ifthe user opens a system32 directory with Explorer: Seven Fanny-related !le icons disappeared inWindows Explorer01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 13 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/ Apparently, it looks as if some of the !le icons were cuto\". In addition some of standard directories seem to bemissing due to a bug in the rootkit code. It appears as ifthis component was not tested properly by the authors.Masquerade Mode OnThere is an interesting part of the code in USB BackdoorDLL which at !rst glance doesn’t make much sense. Ittakes some hardcoded constants and generates a randomvalue which is saved to a registry key. Fanny generates random values that are saved to theregistryThen it moves the current executable which is hosting theDLL to c:\\windows\\system32\\msdtc32.exe. After thatthe executable path is appended toHKLM\\Software\\Microsoft\\ WindowsNT\\CurrentVersion\\ Winlogon\\Shell registry value whichmakes this executable run on system boot. This may look like a traditional way for malware to additself to autostart, but don’t be fooled by that. Thepurpose of this move is to make certain automatedsystems and software, such as those based on sandboxesand emulators, believe that they have caught some knownmalware and not to let it run further. It seems that theThe trick to mimic the behavior oftraditional malware was used to avoidrevealing further secret activities #FannyT weet01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 14 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/component is so unique that the authors decided to avoidthe risk of looking even more suspect. It might seem aparadox, but the authors prefer this code to be detectedas malware if someone is checking it. The trick is to mimicthe behavior of some traditional cybercriminal malware, abot, and get detected as soon as possible, thereby notrevealing any further secret activities. Considering thatthis component was spreading via USB drives and couldpop up on many systems, discovering it as a traditional botwould put it in lower risk zone and as a result the malwarewould probably end up being deleted without properanalysis.This might explain why this code was detected as a variantof Zlob malware in the past and no one paid properattention to it.USB BackdoorOne of the modules, agentcpd.dll, is a backdoor that wasdesigned to work as an advanced reconnaissance tool forair-gapped computers that are normally used in highlysecure facilities. The backdoor waits for a USB drive to beplugged in and if that’s a new disk, it instantly allocatessome space for a hidden container using its ownFAT16/FAT32 !lesystem driver.This is what the FAT root directory looks like before andafter plugging a USB drive into an infected machine: Hexdump of raw disk partition before and afterplugging into an infected machineOn top of this hexdump the drive label “MYDRIVE” can befound (corresponding hex bytes are underlined withgreen). It is followed by a single byte $ag value (0x08 inhex) which, according to Microsoft, means01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 15 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/ ATTR_VOLUME_ID. Each entry in this root directory tableis 32-bytes long.Subdirectory entries such as Pictures, Music, Documentsand Work occupy 63 bytes, because of the long !lenameFAT feature. There are two variants of subdirectory names– short and long. A subdirectory entry uses a $ag 0x10following the short directory name, which, according toMicrosoft, means ATTR_DIRECTORY.The last record inserted by Fanny (highlighted in red) usesan invalid directory name and a $ag 0x18, which combinesATTR_VOLUME_ID and ATTR_DIRECTORY. Thiscombination of $ags is not documented according tocurrent FAT speci!cations and the whole entry istherefore ignored by !lesystem drivers as if it were a datacorruption or a bad block. As a result this entry is notvisible in Windows, Mac OS and Linux and probably allother implementations of FAT driver. While Fanny doesn’t rigorously protect data in hiddenstorage (it doesn’t mark the allocated space as bad blocks,probably to avoid attention), it changes the !lesystemdriver hint value indicating where to look for the next freecluster. In this way it reserves disk space of approximately1Mb in size to use for a hidden storage.When Fanny detects a new USB drive, with the help of itsown FAT driver it looks into the root directory and locatesthe entry which starts with magic value 51 50 40 98 (seeabove). It then uses the o\"set which follows the $ag valueof 0x18. On the !gure above it is set to 0x001e9c00. Thiso\"set on the same USB disk will have another magic valueD0 CF CE CD serving as a marker for the beginning of thehidden storage:It’s possible that #Fanny was used to mapsome of the future targets of #Stuxnet#EquationAPT #TheSAS2015T weetIN THE SAME CATEGORY HrServ – Previously unknownweb shell used in APT attackModern Asian APT groups’tactics, techniques andprocedures (TTPs)A cascade of compromise:unveiling Lazarus’ newcampaignHow to catch a wild triangle01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 16 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/Hexdump of Fanny hidden storage with list of runningprocessesOnce Fanny has allocated space for hidden storage itpopulates the storage with basic information about thecurrent system: i.e. OS Version, Service Pack number,computer name, user name, company name, list of runningprocesses, etc.This secret storage is also used to pass commands tocomputers that are not connected to the Internet.According to Fanny code, the container may carryadditional components and internal commands: such as tocopy certain !le from the local !lesystem to the USB drive(locations are de!ned as parameters, the !le is set hiddenand system !le attributes), or to update the con!gurationblock. It uses RC4 with the following hard-coded key toprotect critical information:18 05 39 44 AB 19 78 88  C4 13 33 27 D5 10 6C 25When the USB drive travels to another infected computerconnected to the Internet it can be used to carryimportant !les and provide a way to interact with theoperator. This simple and extremely slow method ofcommunication is not used by traditional cybercriminals,that is why the whole code looks like a toolkit forprofessional cyberespionage. This component is one ofthe rare malware samples from a new class of malwarecalled USB-Backdoors.If you !nd this or a similar code of USB-Backdoor on someStripedFly: Perennially \"yingunder the radar01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 17 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/of your systems this is an indicator of a professionalcyberattack.Sinkholing and victim statisticsWe sinkholed the Fanny C&C server and collected victimstatistics, shown below. In total, we observed over 11,200unique IPs connecting to the sinkhole server over a periodof !ve months: At the moment, the vast majority of victims are located inPakistan (a whopping 59.36%). Indonesia and Vietnamfollow at great distance, with 15.99% and 14.17%respectively. The infection numbers in other countries areprobably too small to be relevant.Of course, this could raise the question: was Pakistan thetrue target of Fanny? T o be honest, we do not know. Thecurrent infection situation might be di\"erent from what itwas in 2008-2010. Considering that there are still over tenthousand victims worldwide, the number back in 2009might have been much, much higher – perhaps even ashigh as  50,000 infections. It may be relevant that Pakistanis a top target for the Equation group’s other malware,along with Russia and Iran.ConclusionWith Fanny, we begin yet another chapter in the story ofStuxnet, the Equation Group and Flame. Created in 2008,Fanny used two zero-day exploits. These two were added01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 18 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/to Stuxnet in June 2009 and March 2010. E\"ectively, itmeans that the Equation group had access to these zero-days (and others) years before the Stuxnet group did.While the true target of Fanny remains unknown, its uniquecapability to map air-gapped networks and communicatevia USB sticks indicate a lot of work went into gaining theability to access these air-gapped networks. As aprecursor for the versions of Stuxnet that could replicatethrough the network, it’s possible that Fanny was used tomap some of the future targets of Stuxnet.Another unusual fact is the very high number of infectionscoming from Pakistan. Since Fanny spreads only throughUSB sticks, which is rather slow, this indicates that theinfection began in Pakistan, possibly before many othercountries.Was Fanny used to map some highly sensitive networks inPakistan, for an unknown purpose, or was it used inpreparation for Stuxnet? Perhaps time will tell. APTCYBER ESPIONAGEEQUATIONFLAMESPYWARESTUXNETTARGETED ATTACKSA Fanny Equation: “I am yourfather, Stuxnet”01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 19 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/Y our email address will not be published. Required !eldsare marked * Type your comment hereName *Email *  CommentREDWOLFE_98Posted onFebruary 18, 2015. 1:29 pmkaspersky implies that the “equation group” and the“stuxnet group” are two di\"erent groups, but i think thatanother possibility is that they are one and the same..thanks for the article.. i was wondering about the“fanny.bmp” !le and how a “BMP” !le was being used..apparently it is just copied to the harddrive, but with adi\"erent !le-extension, making it usable for maliciouspurposes..ReplyCYRUWANPosted onMarch 9, 2015. 7:09 amHats o\" to Kaspersky engineers!!ReplyFROZENPosted onJune 29, 2015. 4:13 amThe only thing U.S is worried about Pakistan is NuclearPower (well hidden). U.S seeking for locations of nuclearweapons in Pakistan to damage or de-nuking the country.Pakistan Intelligence told that of all the things in the worldto worry about, the issue you should worry about the leastis the safety of our nuclear program,” the o\"icial said.Pakistan said no to U.S safety program. it’s wise for theU.S. to try to design a plan for seizing Pakistan’s nuclear01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 20 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787///LATEST POSTS MALWARE REPORTSAndroid malware,Android malware andmore Android malwareGREATSOC, TI AND IR POSTSA patched Windowsattack surface is stillexploitableELSA YED ELREFAEI,ASHRAF REFAAT,KASPERSKY GERTMALWARE DESCRIPTIONSWhat’s in yournotepad? Infected texteditors target ChineseusersSERGEY PUZANRESEARCHT op 10 web applicationvulnerabilities in 2021–2023OXANA ANDREEV A,KASPERSKY SECURITY SERVICES//LATEST WEBINARSweapons in a low and slow risk manner, ( Fanny ). Fannyalso Failed….so they skip for second option, Iran.ReplyPHUNTERSWPosted onAugust 3, 2016. 1:02 pmI don’t think this one would be nuclear-focused.Remember who was living in Pakistan with a computerbut no direct Internet connection pre-2011? Osamabin Laden.ReplyWILLIAM MARTENSPosted onDecember 17, 2020. 7:57 pmHello, !rst o\": great, GREAT and fascinating write up!Respect.I have created a GitHub for malware-researchers ifsomeone is interested. there I have provided the dll!les(mscorwin,agentcpd.dll, …), rootkits, etc. Exercisecaution if you do proceed.Reply 01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 21 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/11 DEC 2023, 4:00PM60 MINThe Future of AI incybersecurity: what toexpect in 2024VLADIMIR DASHCHENKO,VICTOR SERGEEV,VLADISLA V TUSHKANOV,DENNIS KIPKERTECHNOLOGIES ANDSERVICES30 NOV 2023, 4:00PM70 MINResponding to a databreach: a step-by-stepguideANNA P A VLOVSKA Y ATHREATINTELLIGENCE ANDIR14 NOV 2023, 4:00PM60 MIN2024 Advancedpersistent threatpredictionsIGOR KUZNETSOV,DA VID EMM,MARC RIVERO,DAN DEMETER,SHERIF MAGDYCYBERTHREAT TALKS09 NOV 2023, 5:00PM60 MINOverview of moderncar compromisetechniques andmethods of protectionALEXANDER KOZLOV,SERGEY ANUFRIENKOCYBERTHREAT TALKS //REPORTSHrServ – Previously unknownweb shell used in APT attackIn this report Kasperskyresearchers provide an analysis ofthe previously unknown HrServweb shell, which exhibits both APTand crimeware features and haslikely been active since 2021.Modern Asian APT groups’tactics, techniques andprocedures (TTPs)Asian APT groups target variousorganizations from a multitude ofregions and industries. Wecreated this report to provide thecybersecurity community with thebest-prepared intelligence data toe\"ectively counteract Asian APTgroups.A cascade of compromise:unveiling Lazarus’ newcampaignWe unveil a Lazarus campaignexploiting security companyproducts and examine its intricateconnections with othercampaignsHow to catch a wild triangleHow Kaspersky researchersobtained all stages of theOperation Triangulation campaigntargeting iPhones and iPads,including zero-day exploits,validators, TriangleDB implant andadditional modules. 01/04/24, 15:26A Fanny Equation: \"I am your father, Stuxnet\" | Securelist Pagina 22 di 22https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/  2024 AO Kaspersky Lab. All Rights Reserved.Registered trademarks and service marks are the property of their respectiveowners.THREATSAPT (Targeted attacks)Secure environment(Io T)Mobile threatsFinancial threatsSpam and phishingIndustrial threatsWeb threatsVulnerabilities andexploitsCATEGORIESAPT reportsMalware descriptionsSecurity BulletinMalware reportsSpam and phishingreportsSecurity technologiesResearchPublicationsOTHER SECTIONSArchiveAll tagsWebinarsAPT LogbookStatisticsEncyclopediaThreats descriptionsKSB 2023Privacy PolicyLicense AgreementCookiesThe hottestresearch right inyour inbox//SUBSCRIBETO OURWEEKLY E-MAILS SubscribeEmailI agree to provide my email address to “AO Kaspersky Lab” to receiveinformation about new posts on the site. I understand that I can withdraw thisconsent at any time via e-mail by clicking the “unsubscribe” link that I !nd atthe bottom of any e-mail sent to me for the purposes mentioned above."
}