{
    "title": "adobe flash zero-day used in targeted attacks _ securelist",
    "text": "Share post on:Earlier today, Adobe published the security advisory APSA16-03 , which describes a critical vulnerability in Adobe Flash Player version 21.0.0.242 and earlier versions for Windows, Macintosh, Linux, and Chrome OS: A few of months ago, we deployed a new set of technologies into our products designed to identify and block zero day attacks. These technologies already proved its effectiveness earlier this year, when they caught an Adobe Flash zero day exploit, CVE-2016-1010 . Earlier this month, we caught another zero-day Adobe Flash Player exploit deployed in targeted attacks. We believe these attacks are launched by an APT Group we call “ScarCruft”. ScarCruft is a relatively new APT group; victims have been observed in several countries, including Russia, Nepal, South Korea, China, India, Kuwait and Romania. The group has several ongoing operations utilizing multiple exploits — two for Adobe Flash and one for Microsoft Internet Explorer. Currently, the group is engaged in two major operations: Operation Daybreak  and Operation Erebus . The first of them, Operation Daybreak, appears to have been launched by ScarCruft in March 2016 and employs a previously unknown (0-day) Adobe Flash Player exploit, focusing on high profile victims. The other one, “Operation Erebus” employs an older exploit, for CVE-2016-4117 and leverages watering holes. It is also possible that the group deployed another zero day exploit, CVE- 2016-0147, which was patched in April. We will publish more details about the attack once Adobe patches the vulnerability, which should be on June 16. Until then, we confirm that Microsoft EMET is effective at mitigating the attacks. Additionally, our products detect and block the exploit, as well as the malware used by the ScarCruft APT threat actor. * More information about the ScarCruft APT and Operation Daybreak is available to customers of Kaspersky Intelligence Services. Contact: intelreports@kaspersky.com   ADOBE FLASH  APT VULNERABILITIES  ZERO-DAY VULNERABILITIES Related Posts LEAVE A REPLY Your email address will not be published.  Required fields are marked * Enter your comment here Name * Email * Save my name, email, and website in this browser for the next time I comment.   SUBMIT I'm not a robot reCAPTCHA Privacy  - Terms   IN THE SAME CATEGORY Assessing the impact of protection from web miners An advertising dropper in Google Play Agent 1433: remote attack on Microsoft SQL Server How to steal a million (of your data) On the IoT road: perks, beneﬁts and security of moving smartly INCIDENTS  RESEARCH CVE-2016-4171 – Adobe Flash Zero- day used in targeted attacks By Costin Raiu  on June 14, 2016. 6:38 pm   Notify me when new comments are added.   2020 AO Kaspersky Lab.  All Rights Reserved.  Registered trademarks and service marks are the property of their respective owners. Contact us  | Privacy Policy  | License AgreementEmail  I agree to provide my email address to “AO Kaspersky Lab” to receive information about new posts on the site. I understand that I can withdraw this consent at any time via e-mail by clicking the “unsubscribe” link that I find at the bottom of any e-mail sent to me for the purposes mentioned above.SUBSCRIBE OilRig’s Poison Frog – old samples, same trick Kaspersky Security Bulletin 2019. Statistics Windows 0-day exploit CVE- 2019-1458 used in Operation WizardOpium THREATS  CATEGORIES  TAGS  STATISTICS ENCYCLOPEDIA DESCRIPTIONS KSB 2019  English Solutions  Industries  Products  Services  Resource Center  Contact Us GDPRCompanyAccount GET IN TOUCHSolutions for: Home Products  Small Business 1-50 employees Medium Business 51-999 employees Enterprise 1000+ employees We use cookies to make your experience of our websites better. By using and further navigating this website you accept this. Detailed information about the use of cookies on this website is available by clicking on more information .ACCEPT AND CLOSE  "
}