{
    "title": "advanced persistent threat groups _ fireeye",
    "text": "advanced Persistent Th reat Groups Who's who of cybe r threat acto rs FireEye pays special attention to a dvanced persistent threats (aPT) g roups that receive direction an d support from an e stablished nation state. Like othe r attacke rs, aPT groups try to steal data, disrupt operations or destroy infrastructure. Unlike mo st cyber criminals, aPT attacke rs pursue their objective s over months or years. They a dapt to cybe r defenses and frequently retarget the same victim. Just because you have aPT-linke d malware variants in your system doesn't mean that yo u're an aPT ta rget. But your security team should be aware of this list of the mo st active aPT groups and take ext ra precautions when they detect mal ware linked to previous aPT attacks. REaD THE LaTEST REPORT  a 360-Degree View of the Late st aPT G roups REGISTER FOR T HE WEBInaR WEBINAR SUSPECTED ATTRIBUTION: IRAN aPT39 Suspected attribution: Iran Target sectors: While aPT 39's targeting scope is global, it s activitie s are concent rated in the Mi ddle East. aPT39 has prioritized the telecomm unication s sector, with additional ta rgeting of the t ravel industry and IT firms that support it and the high-tech in dustry. Overview: The group's focus on the telecomm unication s and travel industries suggests intent to pe rform monitoring, tracking, o r surveillance ope rations against specific in dividuals, collect p roprietary or customer data for comme rcial or operational p urposes that serve strategic requirements related to national priorities, or create additional acce sses and vectors to facilitate f uture campaign s. Government entitie s targeting suggests a potential secondary intent to collect geopolitical data that may benefit nation- state decision making. associated malware: The group primarily leverages the SEaWEED and CaCHEMOnEY backdoors along with a specific va riant of the POWBaT back door. attack vecto rs: For initial comp romise FireEye Intelligence ha s observed aPT39 leverage spearphishing with malicio us attachment s and/or hyperlinks typically resulting in a POWBaT infection. In some ca ses previously comp romised email acco unts have al so been leve raged, likely to ab use inherent trusts and increase the chance s of a successful attack. aPT 39 frequently registers and leverages domains that masquerade as legitimate web services and organizations that are relevant to the inten ded target. Furthermore, this group has routinely identified and exploite d vulnerable web servers of targeted organizations to install web shells, such as anTaK an d aSPXSPY, an d used stolen legitimate c redentials to comp romise externally facing O utlook Web acce ss (OWa) resources. We have not ob served aPT39 exploit v ulnerabilities. Back to top ▵ additional resources Blog  – aPT39: an Iranian Cybe r Espionage Group Focused on Personal Information aPT34 Suspected attribution: Iran Target sectors: This threat group has conducted broad targeting ac ross a variety of in dustries, including financial, gove rnment, ene rgy, chemical, an d telecomm unication s, and has largely foc used its operations within the Mi ddle East Overview: We believe aPT 34 is involve d in a long-te rm cybe r espionage ope ration la rgely foc used on reconnai ssance effo rts to benefit Iranian nation- state inte rests and has been ope rational since at lea st 2014. We a ssess that aPT 34 works on behalf of the Iranian gove rnment ba sed on infrastructure details that contain references to Iran, use of Iranian inf rastructure, and targeting that align s with nation- state interests. Suspected attribution Iran | China  | north Korea | Russia | Vietnam  | Undisclosed Home  Resources advanced Persistent Th reat Groups   COnTaCT US  REPORT a n InCIDEnT Solutions Services Customers Partners Resources Company  associated malware: POWBaT, POWRU nER, BOnDUPDaT ER attack vecto rs: In its latest campaign, aPT 34 leveraged the recent Mic rosoft Office v ulnerability CV E- 2017-11882  to deploy POWRU nER and BOnDUPDaT ER. Back to top ▵ additional resources Blog  – new Targeted attack in the Mi ddle East by aPT 34, a Suspected Iranian Th reat Group, Using CVE-2017-11882  Exploit aPT33 Suspected attribution: Iran Target sectors: aerospace, ene rgy Overview: aPT33 has targeted organizations, spanning m ultiple industries, headquartered in the U.S., Saudi arabia an d South Korea. aPT 33 has shown particular interest in organizations in the aviation sector involved in both milita ry and comme rcial capacitie s, as well as organizations in the ene rgy sector with ties to petrochemical p roduction. associated malware: SHaPESHIFT, DROPS HOT, TUR nEDUP, nanOCORE, nETWIRE, aLFa Shell attack vecto rs: aPT33 sent spear-phishing email s to employee s whose jobs related to the aviation industry. These emails included recruitment theme d lures and containe d links to malicio us HTML application (.hta) file s. The .hta file s containe d job descriptions and links to legitimate job po stings on popular employment websites that would be relevant to the ta rgeted individuals. Back to top ▵ additional resources Blog  – aPT33 Targets aerospace an d Energy Sectors and has Ties to Destructive Mal ware Webina r – Insights into Iranian Cybe r Espionage Group SUSPECTED ATTRIBUTION: CHINA aPT41 Suspected attribution: China Target sectors: aPT41 has directly ta rgeted organizations in at lea st 14 countries dating back to a s early as 2012 . The group’s espionage campaign s have ta rgeted healthca re, telecom s, and the high-tech sector, and have hi storically incl uded stealing intellect ual property. Thei r cyber crime intrusions are most apparent among vi deo game in dustry targeting, incl uding the manip ulation of vi rtual currencies, and attempte d deployment of ransomware. aPT4 1operations against higher education, t ravel services, and news/media firms provide some indication that the g roup also tracks individuals and conducts surveillance. Overview: aPT41 is a prolific cybe r threat group that ca rries out Chinese state-sponsored espionage activity in a ddition to financially motivate d activity potentially o utside of state cont rol. associated malware: aPT41 has been ob served using at lea st 46 different code familie s and tools. attack vecto rs: aPT41 often relies on spear-phishing email s with attachment s such as compile d HTML (.chm) file s to initially comp romise their victims. Once in a victim o rganization, aPT4 1 can leve rage mo re sophisticated TTPs and deploy a dditional mal ware. For example, in a campaign running almo st a year, aPT41 compromised hundreds of systems and used close to 150 unique piece s of malware including backdoors, credential stealers, keylogge rs, and rootkits. aPT41 has also deployed rootkits and Master Boot Reco rd (MBR) bootkit s on a limite d basis to hide their malware and maintain pe rsistence on select victim systems. Back to top ▵ additional resources Report – aPT4 1: a Dual Espionage an d Cyber Crime Ope ration  Blog  – aPT4 1, a Dual Espionage an d Cyber Crime Threat Webina r – Double Dragon: aPT4 1, a Dual Espionage an d Cyber Crime Ope ration aPT40 Suspected attribution: China Target sectors: aPT40 is a Chine se cyber espionage g roup that typically ta rgets countries strategically important to the Belt an d Road Initiative. altho ugh the g roup targets global o rganizations — especially those with a foc us on enginee ring and defense — it al so historically con ducted campaign s against regional entities in areas such as Southeast asia. Since at lea st January 2013 , the group has conducted campaign s against a range of ve rticals including maritime ta rgets, defense, aviation, chemical s, research/education, government, an d technology o rganizations. Overview: FireEye Intelligence believe s that aPT4 0's operations are a cybe r counterpart to China' s efforts to modernize its naval capabilitie s; this is also manife sted in targeting wide-scale research projects at universities and obtaining designs for marine equipment an d vehicle s. The group's operations tend to target gove rnment- sponsored projects and take la rge amo unts of information specific to such projects, including proposals, meeting s, financial data, shipping info rmation, plan s and drawings, and raw data. associated malware: aPT40 has been ob served using at lea st 51 different code familie s. Of the se, 37 are non-public. at lea st seven of the se non-p ublic tool s (BaDS IGn, FIELDGOaL, F InDLOCK, P HOTO, SCanBOX, SOGU, an d WIDETOnE) are shared with othe r suspected China-nex us operators. attack vecto rs: aPT40 typically po ses as a prominent in dividual who is probably of inte rest to a ta rget to send spear-phishing email s. This includes pretending to be a jo urnalist, an individual from a trade publication, o r someone f rom a relevant milita ry organization or non-gove rnmental o rganization (nGO). In some instances, the group has leveraged previously comp romised email a ddresses to send spear- phishing email s. Back to top ▵ additional resources Blog  – aPT4 0: Examining a China- nexus Espionage acto r aPT30 Suspected attribution: China Target sectors: Membe rs of the a ssociation of So utheast asian nations (aSEan) Overview: aPT30 is noted not only fo r sustained activity ove r a long pe riod of time b ut also for successfully modifying an d adapting source code to maintain the same tool s, tactics and infrastructure since at lea st 2005 . Evidence shows that the g roup prioritizes targets, most likely works in shifts in a collabo rative envi ronment an d builds malware from a cohe rent development plan. The g roup has had the capability to infect ai r-gappe d networks since 2005 . associated malware: SHIPSHaPE, SPaCESHIP, FLaS HFLOOD attack vecto rs: aPT30 uses a suite of tool s that incl udes downloaders, backdoors, a cent ral controller and several component s designed to infect removable drives and cross air-gappe d networks to steal data. aPT 30 frequently registers its own DnS domains for malware CnC activitie s. Back to top ▵ additional resources Report – aPT30 and the Mechanic s of a Long- Running Cybe r Espionage Ope ration: How a Cyber Threat Group Exploited Goverments and Comme rcial Entities across Southeast asia and India for over a Deca de Blog  – aPT30 and Lessons for aSEan aPT19 also known as: Codoso Team Suspected attribution: China Target sectors: Legal an d investment Overview: a group likely compo sed of freelance rs, with some degree of sponsorship by the Chine se government. associated malware: BEaCOn, COBaLTSTR IKE attack vecto rs: In 2017, aPT19 used three different techniq ues to attempt to comp romise targets. In early May, the phi shing lures leveraged RTF attachment s that exploite d the Mic rosoft Win dows vulnerability described in CVE 2017-0199 . Toward the end of May, aPT 19 switched to using mac ro-enable d Microsoft Excel (XLSM) documents. In the mo st recent ve rsions, aPT19 added an application whitelisting bypa ss to the XLSM documents. at lea st one ob served phishing lure delivered a Cobalt St rike payloa d. Back to top ▵  aPT18 also known as: Wekby Suspected attribution: China Target sectors: aerospace an d Defense, Construction an d Engineering, Education, Health an d Biotechnology, High Tech, Telecomm unication s, Transportation Overview: Very little ha s been released publicly abo ut this group. associated malware: Gh0st RaT attack vecto rs: Frequently develope d or adapted zero-day exploit s for operations, which were likely planned in advance. U sed data from Hacking Team leak, which demonstrated how the group can shift resources (i.e. selecting ta rgets, preparing infrastructure, crafting me ssages, updating tool s) to take advantage of unexpecte d opportunities like newly expo sed exploit s. Back to top ▵ additional resources Blog  – Demon strating Hustle, Chine se aPT Groups Quickly Use Zero-Day V ulnerability (CV E- 2015 -5119) Following Hacking Team Leak Webina r – State of the Hack: Spotlight on Healthca re aPT17 also known as: Tailgato r Team, Dep uty Dog Suspected attribution: China Target sectors: U.S. gove rnment, an d international la w firms and information technology companie s Overview: Conducts network intrusion again st targeted organizations. associated malware: BLaCKCOFF EE attack vecto rs: The threat group took a dvantage of the ability to c reate profiles and post in forums to embed encoded CnC fo r use with a va riant of the mal ware it used. This techniq ue can make it difficult for network security professionals to determine the t rue location of the CnC, an d allow the CnC inf rastructure to remain active fo r a longe r period. Back to top ▵ additional resources Report – Hiding in Plain Sight: Fi reEye and Microsoft Expose Obfuscation Tactic aPT16 Suspected attribution: China Target sectors: Japane se and Taiwanese organizations in the high-tech, gove rnment services, media and financial services industries Overview: China-ba sed group conce rned with Taiwan political an d journalistic matte rs. associated malware: IROnHaLO, ELMER attack vecto rs: Spearphishing email s sent to Tai wanese media organizations and webmail a ddresses. Lure documents containe d instructions for registration an d subsequent listing of goo ds on a Tai wanese auction website. Back to top ▵  aPT12 also known as: Calc Team Suspected attribution: China Target sectors: Journalists, government, defense industrial base Overview: aPT12 is believe d to be a cybe r espionage g roup thought to have link s to the Chine se People' s Liberation a rmy. aPT 12's targets are consistent with larger People' s Republic of China (PRC) goal s. Intrusions and campaign s conducted by this group are in-line with PRC goal s and self-interest in Taiwan. associated malware: RIPTIDE, HIGHTIDE, THREBYTE, WaTERSPOUT attack vecto rs: FireEye observed aPT12 deliver these exploit documents via phi shing email s from vali d but comp romised accounts. Based on past aPT12 activity, we expect the th reat group to contin ue to utilize phishing as a malware delivery metho d. Back to top ▵ additional resources Report – M-Trends 2014: Beyon d the Breach Blog  – Darwin’s Favorite aPT G roup aPT10 also known as: Menupass Team Suspected attribution: China Target sectors: Construction an d enginee ring, aerospace, an d telecom fi rms, and governments in the United States, Europe, an d Japan Overview: aPT10 is a Chine se cyber espionage g roup that Fi reEye has tracked since 2009 . They have historically ta rgeted construction an d enginee ring, aerospace, an d telecom fi rms, and governments in the United States, Europe, an d Japan. We believe that the ta rgeting of the se industries has been in support of Chine se national security goal s, including acq uiring valuable milita ry and intelligence info rmation a s well as the theft of confi dential b usiness data to support Chinese corporations. associated malware: HaYMaK ER, SnUGRIDE, BUGJU ICE, QUaSaRRaT attack vecto rs: This recent aPT 10 activity ha s included both traditional spear phishing an d access to victim’s networks through manage d service providers. (For more information on infection via service providers see M-Trends 2016 ). aPT10 spear phishes have been relatively unsophisticated, leveraging .lnk files within archives, files with double exten sions (e.g. [Redacted]_Group_Meeting_Doc ument_20170222 _doc_.exe) an d in some ca ses simply identically name d decoy documents and malicio us launchers within the same archive. In addition to the spear phishes, FireEye Threat Intelligence ha s observed aPT10 accessing victim s through global service providers. Back to top ▵ additional resources Blog  – aPT10 Targeting Japane se Corporations Using Updated TTPs Blog  – aPT10 (MenuPass Group): new Tools, Global Campaign Late st Manife station of Longstanding Threat aPT3 also known as: UPS Team Suspected attribution: China Target sectors: aerospace an d Defense, Construction an d Engineering, High Tech, Telecomm unication s, Transportation Overview: The China-ba sed threat group FireEye tracks as aPT3 is one of the mo re sophisticated threat groups that Fi reEye Threat Intelligence t racks, and they have a hi story of using browser-based exploit s as zero-days (e.g., Internet Explorer, Firefox, an d adobe Fla sh Playe r). after successfully exploiting a ta rget host, this group will quickly dump credentials, move late rally to a dditional ho sts, and install custom backdoors. aPT3’s comman d and control (CnC) inf rastructure is difficult to track, as there is little ove rlap across campaign s. associated malware: SHOTPUT, COOK IECUTTER, SOGU attack vecto rs: The phi shing email s used by aPT 3 are usually gene ric in nat ure, almo st appea ring to be spam. attack s have exploite d an unpatche d vulnerability in the way adobe Fla sh Playe r parses Flash Video (FLV) file s. The exploit uses common vecto r corruption techniq ues to bypa ss address Space Layout Randomization (aSLR), an d uses Return-Oriented Programming (ROP) to bypa ss Data Execution Prevention (D EP). a neat t rick to thei r ROP techniq ue make s it simpler to exploit an d will evade some ROP detection techniq ues. Shellco de is stored in the packe d adobe Fla sh Playe r exploit file along side a key used for its decryption. The payloa d is xor encoded and hidden inside an image. Back to top ▵  additional resources Blog  – Demon strating Hustle, Chine se aPT Groups Quickly Use Zero-Day V ulnerability (CV E- 2015 -5119) Following Hacking Team Leak Blog  – new Zero-Day Exploit ta rgeting Internet Explorer Versions 9 through 11 Identified in Targeted attack s Blog  – Operation Do uble-Tap Blog  – Operation Clan destine Wolf: a dobe Fla sh Zero-Day in aPT 3 Phishing Campaign aPT1 also known as: Unit 61398 , Comment C rew Suspected attribution: China’s People’ s Liberation a rmy (PLa) Gene ral Staff Depa rtment’s (GSD) 3rd Department ( 总参三部二局 ), which is most commonly kno wn by its Military Unit Cove r Designator (MUCD) as Unit 61398  (61398部队). Target sectors: Information Technology, ae rospace, P ublic administration, Satellite s and Telecomm unication s, Scientific Re search and Consulting, Energy, Transportation, Con struction an d Manufacturing, Engineering Services, High-tech Electronics, International O rganizations, Legal Se rvices Media, advertising and Entertainment, navigation, Chemical s, Financial Se rvices, Food and agriculture, Healthca re, Metal s and Mining, Education Overview: aPT1 has systematically stolen hundreds of terabytes of data from at lea st 141 organizations, and has demonstrated the capability an d intent to steal from dozens of organizations simultaneously. The group focuses on comp romising organizations across a broad range of in dustries in English-speaking countries. The size of aPT 1’s infrastructure implie s a large organization with at lea st dozens, but potentially h undreds of human ope rators. associated malware: TROJa n.ECLTYS, BaCKDOOR.BaRK IOFORK, BaCKDOOR.WaK EMInaP, TROJa n.DOWnBOT, BaCKDOOR.DaLBOT, BaCKDOOR.R EVIRD, TROJa n.BaDnaME, BaCKDOOR.WUaL ESS attack vecto rs: The mo st commonly ob served metho d of initial comp romise is spear phishing. The spear phishing email s contain eithe r a malicio us attachment o r a hype rlink to a malicio us file. The subject line an d the text in the email bo dy are usually relevant to the recipient. aPT 1 also creates webmail acco unts using real people s’ names. While aPT 1 intruders occasionally use publicly available back doors such as Poison Ivy and Gh0st RaT, the va st majority of the time they use what appea r to be thei r own custom back doors. Throughout their stay in the net work (which could be yea rs), aPT1 usually installs new backdoors as they claim mo re systems in the envi ronment. Then, if one back door is discovered and deleted, they still have other backdoors they can use. We usually detect m ultiple familie s of aPT 1 backdoors scattered around a victim net work when aPT 1 has been p resent for more than a fe w weeks. Back to top ▵ additional resources Report – aPT1: Exposing One of China’ s Cyber Espionage Unit s Report – M-Trends 2014: Beyon d the Breach SUSPECTED ATTRIBUTION: NORTH KOREA aPT38 Suspected attribution: north Korea Target sectors: Financial in stitutions world-wide Overview: Our analysis of the north Korean regime-backe d threat group we are calling aPT 38 reveals that they a re responsible for conducting the la rgest observed cyber heists. although aPT 38 shares malware development resources and north Korean state sponsorship with a group referred to by the security comm unity as “Lazarus”, we believe that aPT 38’s financial motivation, unique toolset, and tactics, techniq ues, and procedures (TTPs) are distinct eno ugh for them to be t racked separately from othe r north Korean cybe r activity. associated malware: This large and prolific group uses a variety of c ustom mal ware familie s, including backdoors, tunnelers, datamine rs, and destructive mal ware to steal million s of dollars from financial institutions and render victim net works inoperable. attack vecto rs: aPT38 has conducted operations in over 16 organizations in at lea st 11 countries. This group is careful, calculated, and has demonstrated a desire to maintain acce ss to victim envi ronment s for as long as necessary to understand the net work layout, required permissions, and system technologie s to achieve it s goals. aPT38 is unique in that they a re not af raid to agg ressively destroy evidence or victim networks as part of thei r operations. Back to top ▵  additional resources Report – aPT 38: Un-usual Suspects Blog  – aPT38: Details on new north Korean Regime-Backe d Threat Group aPT37 Suspected attribution: north Korea Target sectors: Primarily South Korea – tho ugh also Japan, Vietnam an d the Middle East – in va rious industry verticals, including chemical s, electronics, manufacturing, aerospace, a utomotive, an d healthca re. Overview: Our analysis of aPT 37’s recent activity reveals that the g roup’s operations are expan ding in scope an d sophistication, with a tool set that incl udes access to zero-day vulnerabilities and wiper malware. We a ssess with high confi dence that thi s activity i s carried out on behalf of the north Korean government given mal ware development a rtifacts and targeting that align s with north Korean state interests. FireEye Threat Intelligence believe s that aPT 37 is aligned with the activity p ublicly reported as Scarcruft and Group123. associated malware: a diverse suite of mal ware for initial int rusion and exfiltration. along with custom malware used for espionage p urposes, aPT37 also has access to destructive mal ware. attack vecto rs: Social enginee ring tactic s tailored specifically to desired targets, strategic web compromises typical of ta rgeted cyber espionage ope rations, and the use of torrent file- sharing sites to distribute malware more indiscriminately. F requent exploitation of v ulnerabilities in Hangul Word Processor (HWP), as well as adobe Fla sh. The g roup has demonstrated access to zero-day vulnerabilities (CVE-2018 -0802 ), and the ability to inco rporate them into ope rations. Back to top ▵ additional resources Report – aPT 37 (Reape r) Blog  – aPT37 (Reape r): The Ove rlooked north Korean acto r SUSPECTED ATTRIBUTION: RUSSIA aPT29 Suspected attribution: Russian gove rnment Target sectors: Western European gove rnments, foreign policy g roups and other similar organizations Overview: aPT29 is an adaptive an d disciplined threat group that hi des its activity on a victim’ s network, communicating inf requently an d in a way that clo sely resembles legitimate t raffic. By using legitimate popular web services, the group can al so take a dvantage of enc rypted SSL connection s, making detection even mo re difficult. aPT29 is one of the mo st evolve d and capable th reat groups. It deploys new backdoors to fix it s own bugs and add features. It monito rs network defender activity to maintain control over systems. aPT29 uses only comp romised servers for CnC comm unication. It counters attempt s to remediate attack s. It also maintain s a fast development cycle fo r its malware, quickly alte ring tools to hinder detection. associated malware: HaMMERTOSS, TD ISCOVER, UPLOaD ER attack vecto rs: aPT29 has used social me dia sites such as Twitter or GitHub, as well as cloud storage services, to relay comman ds and extract data from comp romised networks. The group relays comman ds via image s containing hi dden and encrypted data. Information i s extracted from a comp romised network and files are uploaded to cloud storage services. Back to top ▵ additional resources Report – HaMMERTOSS: Stealthy Tactic s Define a Russian Cybe r Threat Group aPT28 also known as: Tsar Team Suspected attribution: Russian gove rnment Target sectors: The Ca ucasus, particularly Georgia, eastern European co untries and militaries, north atlantic T reaty Organization (naTO) an d other European security organizations and defense firms Overview: aPT28 is a skilled team of develope rs and operators collecting intelligence on defense and geopolitical i ssues—intelligence that would be useful only to a gove rnment. Thi s aPT group compile s malware samples with Russian lang uage settings during working ho urs (8 a.m. to 6 p.m.), con sistent with the time zone of R ussia’s major cities, including Moscow and St. Pete rsburg. This suggests that aPT 28  receives direct ongoing financial an d other resources from a well-established organization, mo st likely the Russian gove rnment. associated malware: CHOPSTICK, SOURFaC E attack vecto rs: Tools commonly used by aPT 28 include the SOURFaC E downloader, its second-stage backdoor EVILTOSS an d a modular family of implant s dubbed CHOPSTICK. aPT 28 has employe d RSa encryption to p rotect file s and stolen info rmation move d from the victim’ s network to the cont roller. It has also made incremental an d systematic change s to the SOURFaC E downloader and its surrounding ecosystem since 2007, indicating a long- standing and dedicated development effo rt. Back to top ▵ additional resources Report – Russia’s aPT28 Strategically Evolves its Cyber Operations Blog  – Operation R ussianDoll: a dobe & Win dows Zero-Day Exploits Likely Leve raged by Russia’s aPT28 in Highly-Ta rgeted attack Blog  – aPT28: a Win dow into Russia's Cyber Espionage Ope rations? Webina r – aPT28: Cyber Espionage an d the Russian Gove rnment? SUSPECTED ATTRIBUTION: VIETNAM aPT32 also known as: OceanLot us Group Suspected attribution: Vietnam Target sectors: Foreign companie s investing in Vietnam’ s manufacturing, con sumer products, consulting and hospitality sectors Overview: Recent activity ta rgeting p rivate inte rests in Vietnam suggests that aPT 32 poses a threat to companie s doing business, manufacturing or preparing to inve st in the co untry. While the specific motivation fo r this activity remains opaque, it could ultimately e rode the competitive a dvantage of targeted organizations. associated malware: SOUnDBITE, WInDSHIELD, PHOREaL, BEaCOn, KOMPROGO attack vecto rs: aPT32 actors leverage activeMime file s that employ social enginee ring metho ds to entice the victim into enabling mac ros. Upon exec ution, the initiali zed file typically downloads multiple malicio us payloads from a remote server. aPT32 actors delivers the malicio us attachment s via spear phishing emails. Evidence ha s shown that some may have been sent via Gmail. Back to top ▵ additional resources Blog  – Cybe r Espionage i s alive an d Well: aPT 32 and the Threat to Global Co rporations Webina r – aPT32: new Cyber Espionage G roup SUSPECTED ATTRIBUTION: UNDISCLOSED aPT5 Suspected attribution: Undisclosed Target sectors: Regional Telecomm unication P roviders, asia-Based Employee s of Global Telecomm unication s, and Tech Fi rms, High-Tech Man ufacturing, Milita ry application Technology Overview: aPT5 has been active since at lea st 2007. aPT5 has targeted or breached organizations across multiple industries, but its focus appears to be on telecomm unication s and technology companie s, especially info rmation abo ut satellite comm unication s. associated malware: LEOUnCIa attack vecto rs: It appea rs to be a la rge threat group that con sists of several subgroups, often with distinct tactic s and infrastructure. The g roup uses malware with keylogging capabilitie s to specifically target telecomm unication companie s' corporate net works, employee s and executives. Back to top ▵  additional resources Report – Southeast asia: an Evolving Cybe r Threat Lan dscape Report – nation State an d Hacktivist attack s: Targeted Hits on asian Organizations CONCLUSION although informative, the se documents cannot substitute for thorough intelligence gathe ring effo rts and investigation of suspected cyber attacks. Over the last decade, FireEye has spent ove r 100,000 hours per year responding to the world’s largest and most consequential breaches. This deep inci dent response experience, gathe red from six worldwide security operation cente rs (SOCs), is curated and fed back into a self-learning, symbiotic security ecosystem that incl udes over 11 million sensors and is updated every 60 minutes. FireEye expe rts, assisted by this ecosystem, track a g rowing collection of 30+ advanced threat acto rs and 300+ advanced malware familie s. They al so maintain p rofiles of 10+ nation- state threat sponsors and 40+ targeted industries to track and analyze financial an d political dimensions of cybe r threats worldwide. FireEye expe rts can not only determine the risk associated with a vali dated threat, but also how the threat got into the envi ronment, ho w it spread and what can an d should be done abo ut it. The se insights are delivered as context ual intelligence that help s client o rganizations quickly prioritize and effectively respond to critical sophisticated threats. Further reading: Threat Intelligence Repo rts Company Why Fi reEye? Customer Stories Careers Certification s and Compliance Investor Relation s Supplier Documents news and Events newsroom Press Releases Webina rs Events awards and Honors Email Preferences Technical S upport Incident? Report Security Issue Contact S upport Customer Portal Communities Documentation Po rtal FireEye Blog s Threat Research FireEye Stories Industry Perspective s Threat Map View the Late st Threats Contact U s +1 877-347-3393   Stay Connecte d  Copyright   2020  FireEye, Inc. all rights reserved.  Privacy & Cookie s Policy  | Privacy Shiel d | Legal Doc umentationSite Lang uage English  "
}