{
    "title": "APT10 Targets Japanese Corporations | UPPERCUT backdoor",
    "text": "01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 1 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttpsIntroductionIn July 2018, FireEye devices detected and blocked what appears to be APT10 (Menupass)activity targeting the Japanese media sector. APT10 is a Chinese cyber espionage group thatFireEye has tracked since 2009, and they have a history of targeting Japanese entities.In this campaign, the group sent spear phishing emails containing malicious documents that ledAPT10 Targeting JapaneseCorporations Using UpdatedTTPsAYAKO MATSUDA, IRSHAD MUHAMMAD#ADV ANCED PERSISTENT THREATS (APTS)#TTPS#THREAT RESEARCH#MALW ARE THREAT RESEARCHSEP 13, 2018|6 MIN READ|   LAST UPDA TED: AUG 10, 2023 REPORT BlogSupportContact us/report_problemIncident Response Assistance Get startedPlatformSolutionsIntelligenceServicesResourcesEN/expand_moreMandiant is now part of Google Cloud. Learn More. 01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 2 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttps to the installation of the UPPERCUT backdoor. This backdoor is well-known in the securitycommunity as ANEL, and it used to come in beta or RC (release candidate) until recently. Part ofthis blog post will discuss the updates and differences we have observed across multipleversions of this backdoor.Attack OverviewThe attack starts with Microsoft Word documents containing a malicious VBA macro beingattached to spear phishing emails. Although the contents of the malicious documents areunreadable (see Figure 3), the Japanese titles are related to maritime, diplomatic, and NorthKorean issues. Table 1 shows the UPPERCUT indicators of compromise (IoCs).File NameMD5SizeC2⾃⺠党海洋総合戦略⼩委員会が政府に提⾔申し⼊れ.docGovernmentRecommendations from theLiberal Democratic Party’sComprehensive StrategicMaritime Subcommittee4f83c01e8f7507d23c67ab085bf79e97843022eservake.jetos[.]com82.221.100.52151.106.53.147グテマラ⼤使講演会案内状.docInvitation to Lecture byGuatemalan Ambassadorf188936d2c8423cf064d6b8160769f21720384 eservake.jetos[.]com151.106.53.147153.92.210.208 ⽶ 接近に揺れる北朝鮮内部.docNorth Korean interior swayedby the approach of the UnitedStatescca227f70a64e1e7fcf5bccdc6cc25dd733184eservake.jetos[.]com153.92.210.208167.99.121.203Table 1: UPPERCUT IoCsFor the North Korean lure, a news article with an identical title was readily available online. It’salso worth noting that in the Guatemalan lure, the attacker used an unusual spelling ofGuatemala in Japanese. The top result of a Google search using the same spelling led us to theevent website for the lecture of the Guatemalan Ambassador, held in August 2018. Figure 1shows the screenshot of the event page.REPORTCompany mandiant.com uses cookies from Google to deliver andenhance the quality of its services and to analyze tra!c. Learnmore. OK, got it01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 3 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttps Figure 1: Event Website for the Lecture of Guatemala AmbassadorFigure 2 shows the macro function that displays the lure document. At the bottom of thisfunction, we can see the readable text that matches the contact information found in Figure 1.Thus, people who would have an interest in Latin American issues may have been the targets ofthis campaign.01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 4 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttpsFigure 2: Macro to display lure documentThe initial Word documents were password protected, likely in an effort to bypass detection.Once the password (delivered in the body of the email) is entered, the users are presented with adocument that will request users to enable the malicious macro, as shown in Figure 3. Figure 3: Lure document01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 5 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttps Figure 4 shows what happens when the malicious macro is executed. Figure 4: Macro to install UPPERCUTThe execution workﬂow is as follows:1.     The macro drops three PEM ﬁles, padre1.txt, padre2.txt, and padre3.txt, to the victim’s%TEMP% folder and then copies them from %TEMP% to the %AllUserProﬁle% folder.2.     The macro decodes the dropped ﬁles using Windows certutil.exe with the followingcommands (certutil.exe is a legitimate built-in command-line program to manage certiﬁcates inWindows):C:\\Windows\\System32\\cmd.exe\" /c certutil -decode C:\\ProgramData\\padre1.txtC:\\ProgramData\\\\GUP.txtC:\\Windows\\System32\\cmd.exe\" /c certutil -decode C:\\ProgramData\\padre2.txtC:\\ProgramData\\\\libcurl.txtC:\\Windows\\System32\\cmd.exe\" /c certutil -decode C:\\ProgramData\\padre3.txtC:\\ProgramData\\\\3F2E3AB93.     The macro creates a copy of the ﬁles with their proper extensions using Extensible StorageEngine Utilities (esentutil.exe) with the following commands (esentutil.exe is also a legitimateprogram that is pre-installed in Windows):C:\\Windows\\System32\\esentutl.exe\" /y C:\\ProgramData\\\\GUP.txt /d C:\\ProgramData\\GUP.exe /oC:\\Windows\\System32\\esentutl.exe\" /y C:\\ProgramData\\\\libcurl.txt /d C:\\ProgramData\\libcurl.dll /oThe dropped ﬁles include the following:01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 6 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttpsGUP.exe : GUP, a free (LGPL) Generic Updater. GUP is an open source binary used byNotepad++ for software updates. The version used here is version 4.1 digitally signed byNotepad++, as shown in Figure 5.libcurl.dll: Malicious Loader DLL3F2E3AB9: Encrypted shellcode Figure 5: Notepad++ signed updater4.     The macro launches the legitimate executable GUP.exe.The executable sideloads the malicious DLL (libcurl.dll), which decrypts and runs01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 7 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttpsshellcode (3F2E3AB9) located in the same folder.The shellcode decodes and decompresses another DLL, which is an updated variant ofUPPERCUT. Before decoding the DLL, the shellcode uses an anti-debug technique basedon ntdll_NtSetInformationThread which causes the thread to be detached from thedebugger, as shown in Figure 6. The DLL is then loaded into memory and the randomlynamed exported function is called. Figure 6: Anti-debug technique used by shellcode5.     The macro deletes the initially dropped .txt ﬁles using Windows esentutl.exe and changesthe document text to an embedded message.The complete attack overview is shown in Figure 7. Figure 7: Attack overview01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 8 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttps Several threat actors leverage the technique of using Windows certutil.exe for payloaddecoding, and APT10 continues to employ this technique.Evolution of UPPERCUTFigure 8 shows the timeline of updates for UPPERCUT. The PE compile time of loaders and thecreate time of droppers (Word documents) are plotted in the graph. The compile time of loadersin the newer version(s) are not shown here since the timestamps are overwritten and ﬁlled withzeroes. We don’t have visibility into UPPERCUT 5.2.x series, but it’s possible that minor revisionswere released every few months between December 2017 and May 2018. Figure 8: Timeline of UPPERCUT updatesUnlike previous versions, the exported function names are randomized in the latest version(Table 2).Encoded PayloadDecodedPayloadMD5SizeImport HashExported Functionaa3f303c3319b14b4829fe2faa5999c1322164182ee99b4f0803628c30411b1faa9992l7MF25T96n45qOGWX126067d634d94c45084cbe1d9873d8953308045f45532f947501cf024d84c36e3a19a1hJvTJcdAU3mNkuvGGq7Lfce54b4886cac5c61eda1e7605483ca3345812c1942a0ca397b627019dace26eca78d8WcuHTable 2: Static characteristics of UPPERCUT01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 9 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttpsAnother new feature in the latest UPPERCUT sample is that the malware sends an error code inthe Cookie header if it fails to receive the HTTP response from the command and control (C2)server. The error code is the value returned by the GetLastError function and sent in the nextbeacon. This was likely included to help the attackers understand the problem if the backdoor isunable to receive a response (Figure 9). This Cookie header is a unique indicator that can beused for network-based detection. Figure 9: Example of callbackEarlier versions of UPPERCUT used the hard-coded string “this is the encrypt key” for Blowﬁshencryption when communicating with a C2. However, in the latest version, the keys are hard-coded uniquely for each C2 address and use the C2’s calculated MD5 hash to determine whichkey to use, as shown in Figure 10. Figure 10: Blowﬁsh key generation01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 10 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttps For instance, Table 3 lists the hard-coded C2 addresses, their MD5 hash, and the correspondingBlowﬁsh key in the decoded payload of 126067d634d94c45084cbe1d9873d895.C2MD5Blowﬁsh Keyhxxp[:]//151.106.53[.]147/VxQGf613846eb5bed227ec1a5f8df7e678d0bdc4b9f5af9868e028dd0adc10099a4e6656e9f0ad12b2e75a30f5ca0e34489dhxxp[:]//153.92.210[.]208/wBNh150c60f37922ff2ff8733aaeaa9802da5fb9f7fb3c709373523ff27824ed6a31d800e275ec5217d8a11024a3dffb577ddhxxp[:]//eservake.jetos[.]com/qIDjc500dae1ca41236830b59f1467ee96c1d3450966ceb2eba93282aace7d7684380d87c6621bbd3c4f621caa079356004aDefault Defaultf12df6984bb65d18e2561bd017df29ee1cf946efa5e510802005aeee9035dd53Table 3: Example of Blowﬁsh keysIn this example, the MD5 hash of hxxp[:]//151.106.53[.]147/VxQG will bef613846eb5bed227ec1a5f8df7e678d0. When the malware interacts with this URL,bdc4b9f5af9868e028dd0adc10099a4e6656e9f0ad12b2e75a30f5ca0e34489d will be selected asa Blowﬁsh key. If the MD5 hash of the URL does not match any of the listed hashes, then thedefault key f12df6984bb65d18e2561bd017df29ee1cf946efa5e510802005aeee9035dd53 will beused.Another difference in the network tra\"c generated from the malware is that the encoded proxyinformation has been added in the URL query values during the C2 communication. Table 4shows the parameters sent to C2 server from the backdoor in the newer versions. These aresent via POST request, as shown in Figure 9.01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 11 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttps Table 4: URL parametersAdditionally, the command string is hashed using the same RGPH hashing algorithm as before.Two more commands, 0xD290626C85FB1CE3 and 0x409C7A89CFF0A727, are supported in thenewer versions (Table 5).CommandsDescription0x97A168D9697D40DDDownload and validate ﬁle (XXHash comparison) from C2 server0x7CF812296CCC68D5Upload ﬁle to C2 server0x652CB1CEFF1C0A00Load PE ﬁle0x27595F1F74B55278Download, validate (XXHash comparison), execute ﬁle, and send output to C2server0xD290626C85FB1CE3Format the current timestamp0x409C7A89CFF0A727Capture the desktop screenshot in PNG format and send it to C2None of the aboveThe received buffer is executed via cmd.exe and the output is then sent to theC2 serverTable 5: Supported commands01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 12 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttpsConclusionWhile APT10 consistently targets the same geolocation and industry, the malware they use isactively evolving. In the newer versions of UPPERCUT, there is a signiﬁcant change in the waybackdoor initializes the Blowﬁsh encryption key, which makes it harder for analysts to detectand decrypt the backdoor’s network communications. This shows that APT10 is very capable ofmaintaining and updating their malware.To mitigate the threat, users are advised to disable O\"ce macros in their settings and not toopen documents from unknown sources. FireEye Multi-Vector Execution (MVX) engine is able torecognize and block this threat with the following detection names:APT.Backdoor.Win.UPPERCUTFE_APT_Backdoor_Win32_UPPERCUTLink to RSS feedPrepare for2024'scybersecuritylandscape. Download nowGet the Google CloudCybersecurity Forecast 2024repo! to explore the latesttrends on the horizon.01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 13 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttps Havequestions?Let's talk.Mandiantexperts areready toanswer yourquestions.Contactus Follow us01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 14 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttpsMandiant AdvantagePlatformPlatform OverviewSecurity ValidationAttack SurfaceManagementThreat IntelligenceDigital ThreatMonitoringManaged DefenseSolutionsProactive ExposureManagementRansomwareIndustrial Controls &OTCyber RiskManagementDigital RiskProtectionInsider ThreatsCyber Security SkillsGapElection SecurityGovernment CyberSecurityManufacturingCyber Threat VisibilityAttack SurfaceVisibilityCyber PreparednessDetection andResponseFinancial ServicesCyber SecurityServicesServices OverviewIncident ResponseStrategic ReadinessCyber SecurityTransformationTechnical AssuranceView all Services (48)Expertise on DemandMandiant AcademyOverviewEducation FormatsUpcoming CoursesOn-Demand CoursesCertiﬁcationsThreatSpace CyberRangeFree Course SneakPeaks ResourcesResource CenterBlogPodcastsCompanyAbout UsCareersEventsPartnersPartners OverviewTechnology PartnersCyber Risk PartnersConnect withMandiantContact UsReport an IncidentCustomer Support01/04/24, 21:09APT10 Targets Japanese Corporations | UPPERCUT backdoor Pagina 15 di 15https://www.mandiant.com/resources/blog/apt10-targeting-japanese-corporations-using-updated-ttpsCustomer StoriesReportsWebinarsInsightseBooksInfographicsWhite PapersDatasheetsMedia CenterService PartnersPartner PortalCustomer SuccessMedia Inquiries   Copyright 2024 Mandiant. All rights reserved.Website Privacy PolicyTerms & ConditionsComplianceSite Map"
}