{
    "title": "Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of July 2018 Elections and Reveals Broad Operations Globally | Mandiant",
    "text": "01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 1 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-electionsIntroductionChinese Espionage GroupTEMP.Periscope TargetsCambodia Ahead of July 2018Elections and Reveals BroadOperations GloballySCOTT HENDERSON, STEVE MILLER, DAN PEREZ, MARCIN SIEDLARZ, BENWILSON, BEN READ#MALW ARE#THREAT RESEARCH THREAT RESEARCHJUL 10, 2018|9 MIN READ|   LAST UPDA TED: AUG 23, 2022 BlogSupportContact us/report_problemIncident Response AssistanceGet startedPlatformSolutionsIntelligenceServicesResourcesCompanyEN/expand_moreMandiant is now part of Google Cloud. Learn More. 01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 2 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-electionsFireEye has examined a range of TEMP.Periscope activity revealing extensive interest inCambodia's politics, with active compromises of multiple Cambodian entities related to thecountry’s electoral system. This includes compromises of Cambodian government entitiescharged with overseeing the elections, as well as the targeting of opposition ﬁgures. Thiscampaign occurs in the run up to the country’s July 29, 2018, general elections. TEMP.Periscopeused the same infrastructure for a range of activity against other more traditional targets,including the defense industrial base in the United States and a chemical company based inEurope. Our previous blog post focused on the group’s targeting of engineering and maritimeentities in the United States.Overall, this activity indicates that the group maintains an extensive intrusion architecture andwide array of malicious tools, and targets a large victim set, which is in line with typicalChinese-based APT efforts. We expect this activity to provide the Chinese government withwidespread visibility into Cambodian elections and government operations. Additionally, thisgroup is clearly able to run several large-scale intrusions concurrently across a wide range ofvictim types.Our analysis also strengthened our overall attribution of this group. We observed the toolsetswe previously attributed to this group, their observed targets are in line with past group effortsand also highly similar to known Chinese APT efforts, and we identiﬁed an IP address originatingin Hainan, China that was used to remotely access and administer a command and control (C2)server.TEMP.Periscope BackgroundActive since at least 2013, TEMP.Periscope has primarily focused on maritime-related targetsacross multiple verticals, including engineering ﬁrms, shipping and transportation,manufacturing, defense, government o\"ces, and research universities (targeting issummarized in Figure 1). The group has also targeted professional/consulting services, high-tech industry, healthcare, and media/publishing. TEMP.Periscope overlaps in targeting, as wellas tactics, techniques, and procedures (TTPs), with TEMP.Jumper, a group that also overlapssigniﬁcantly with public reporting by Proofpoint and F-Secure on \"NanHaiShu.\"  mandiant.com uses cookies from Google to deliver andenhance the quality of its services and to analyze tra!c. Learnmore. OK, got it01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 3 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-elections Figure 1: Summary of TEMP.Periscope activityIncident BackgroundFireEye analyzed ﬁles on three open indexes believed to be controlled by TEMP.Periscope,which yielded insight into the group's objectives, operational tactics, and a signiﬁcant amountof technical attribution/validation. These ﬁles were \"open indexed\" and thus accessible toanyone on the public internet. This TEMP.Periscope activity on these servers extends from atleast April 2017 to the present, with the most current operations focusing on Cambodia'sgovernment and elections.Two servers, chemscalere[.]com and scsnewstoday[.]com, operate as typical C2 serversand hosting sites, while the third, mlcdailynews[.]com, functions as an active SCANBOXserver. The C2 servers contained both logs and malware.Analysis of logs from the three servers revealed:Potential actor logins from an IP address located in Hainan, China that was used toremotely access and administer the servers, and interact with malware deployed at01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 4 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-electionsvictim organizations.Malware command and control check-ins from victim organizations in theeducation, aviation, chemical, defense, government, maritime, and technologysectors across multiple regions. FireEye has notiﬁed all of the victims that we wereable to identify.The malware present on the servers included both new families (DADBOD, EVILTECH) andpreviously identiﬁed malware families (AIRBREAK, EVILTECH, HOMEFRY, MURKYTOP,HTRAN, and SCANBOX) .Compromises of Cambodian Election EntitiesAnalysis of command and control logs on the servers revealed compromises of multipleCambodian entities, primarily those relating to the upcoming July 2018 elections. In addition, aseparate spear phishing email analyzed by FireEye indicates concurrent targeting of oppositionﬁgures within Cambodia by TEMP.Periscope.Analysis indicated that the following Cambodian government organizations and individuals werecompromised by TEMP.Periscope:National Election Commission, Ministry of the Interior, Ministry of Foreign Affairs andInternational Cooperation, Cambodian Senate, Ministry of Economics and FinanceMember of Parliament representing Cambodia National Rescue PartyMultiple Cambodians advocating human rights and democracy who have written criticallyof the current ruling partyTwo Cambodian diplomats serving overseasMultiple Cambodian media entitiesTEMP.Periscope sent a spear phish with AIRBREAK malware to Monovithya Kem, DeputyDirector-General, Public Affairs, Cambodia National Rescue Party (CNRP), and the daughter of(imprisoned) Cambodian opposition party leader Kem Sokha (Figure 2). The decoy documentpurports to come from LICADHO (a non-governmental organization [NGO] in Cambodiaestablished in 1992 to promote human rights). This sample leveraged scsnewstoday[.]com forC2. 01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 5 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-elections Figure 2: Human right protection survey lureThe decoy document \"Interview Questions.docx\" (MD5: ba1e5b539c3ae21c756c48a8b5281b7e) istied to AIRBREAK downloaders of the same name. The questions reference the oppositionCambodian National Rescue Party, human rights, and the election (Figure 3). 01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 6 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-elections Figure 3: Interview questions decoyInfrastructure Also Used for Operations Against Private CompaniesThe aforementioned malicious infrastructure was also used against private companies in Asia,Europe and North America. These companies are in a wide range of industries, includingacademics, aviation, chemical, maritime, and technology. A MURKYTOP sample from 2017 anddata contained in a ﬁle linked to chemscalere[.]com suggest that a corporation involved in theU.S. defense industrial base (DIB) industry, possibly related to maritime research, wascompromised. Many of these compromises are in line with TEMP.Periscope’s previous activitytargeting maritime and defense industries. However, we also uncovered the compromise of aEuropean chemical company with a presence in Asia, demonstrating that this group is a threatto business worldwide, particularly those with ties to Asia.AIRBREAK Downloaders and Droppers Reveal Lure IndicatorsFilenames for AIRBREAK downloaders found on the open indexed sites also suggest the ongoingtargeting of interests associated with Asian geopolitics. In addition, analysis of AIRBREAKdownloader sites revealed a related server that underscores TEMP.Periscope's interest inCambodian politics.The AIRBREAK downloaders in Table 1 redirect intended victims to the indicated sites to displaya legitimate decoy document while downloading an AIRBREAK payload from one of theidentiﬁed C2s. Of note, the hosting site for the legitimate documents was not compromised. Anadditional C2 domain, partyforumseasia[.]com, was identiﬁed as the callback for an AIRBREAKdownloader referencing the Cambodian National Rescue Party.01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 7 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-elections Redirect Site (Not Malicious)AIRBREAK Downloaderen.freshnewsasia.com/index.php/en/8623-2018-04-26-10-12-46.htmlTOP_NEWS_Japan_to_Support_the_Election.js(3c51c89078139337c2c92e084bb0904c) [Figure4]iric.gov.kh/LICADHO/Interview-Questions.pdf[pdf]Interview-Questions.pdf.js(e413b45a04bf5f812912772f4a14650f)iric.gov.kh/LICADHO/Interview-Questions.pdf[docx]Interview-Questions.docx.js(cf027a4829c9364d40dcab3f14c1f6b7)unknownInterview_Questions.docx.js(c8fdd2b2ddec970fa69272fdf5ee86cc)atimes.com/article/philippines-draws-three-hard-new-lines-on-china/Philippines-draws-three-hard-new-lines-on-china .js(5d6ad552f1d1b5cfe99ddb0e2bb51fd7)facebook.com/CNR.Movement/videos/190313618267633/CNR.Movement.mp4.js(217d40ccd91160c152e5fce0143b16ef)Table 1: AIRBREAK downloaders Figure 4: Decoy document associated with AIRBREAK downloader ﬁleTOP_NEWS_Japan_to_Support_the_Election.jsSCANBOX Activity Gives Hints to Future OperationsThe active SCANBOX server, mlcdailynews[.]com, is hosting articles related to the currentCambodian campaign and broader operations. Articles found on the server indicate targeting ofthose with interests in U.S.-East Asia geopolitics, Russia and NATO affairs. Victims are likelyeither brought to the SCANBOX server via strategic website compromise or malicious links intargeted emails with the article presented as decoy material. The articles come from open-source reporting readily available online. Figure 5 is a SCANBOX welcome page and Table 2 is alist of the articles found on the server. Figure 5: SCANBOX welcome page01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 8 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-elections Copied Article TopicArticle Source (NotCompromised)Leaders conﬁdent yet nervousKhmer TimesMahathir_ 'We want to be friendly with ChinaPM urges voters to support CPP for peaceCPP determined to maintain Kingdom's peace and developmentBun Chhay's wife dies at 60Crackdown planned on boycott callersFurther ﬂoods coming to KingdomKem Sokha again denied bailPM vows to stay on as premier to quash traitorsIran_ Don't trust TrumpFresh NewsKim-Trump summit_ Singapore's roleTrump's North Korea summit may bring peace declaration - but at a costReutersU.S. pushes NATO to ready more forces to deter Russian threatus-nato-russia_us-pushes-nato-to-ready-more-forces-to-deter-russian-threatInterior Minister Sar Kheng warns of dirty tricksPhnom Penh PostAnother player to enter market for cashless payDonald Trump says he has 'absolute right' to pardon himself but he's donenothing wrong - Donald Trump's AmericaABC NewsChina-funded national road inaugurated in CambodiaThe Cambodia DailyKim and Trump in ﬁrst summit session in SingaporeAsia TimesU.S. to suspend military exercises with South Korea, Trump saysU.S. NewsRainsy defamed the King_ Hun SenBREAKING NEWScambodia-opposition-leader-denied-bail-again-in-treason-caseAssociated Press01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 9 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-elections Table 2: SCANBOX articles copied to serverTEMP.Periscope Malware SuiteAnalysis of the malware inventory contained on the three servers found a classic suite ofTEMP.Periscope payloads, including the signature AIRBREAK, MURKYTOP, and HOMEFRY. Inaddition, FireEye’s analysis identiﬁed new tools, EVILTECH and DADBOD (Table 3).MalwareFunctionDetailsEVILTECHBackdoorEVILTECH is a JavaScript sample that implements a simple RAT withsupport for uploading, downloading, and running arbitrary JavaScript.During the infection process, EVILTECH is run on the system, which thencauses a redirect and possibly the download of additional malware orconnection to another attacker-controlled system.DADBODCredentialTheftDADBOD is a tool used to steal user cookies.Analysis of this malware is still ongoing.Table 3: New additions to the TEMP.Periscope malware suiteData from Logs Strengthens Attribution to ChinaOur analysis of the servers and surrounding data in this latest campaign bolsters our previousassessment that TEMP.Periscope is likely Chinese in origin. Data from a control panel accesslog indicates that operators are based in China and are operating on computers with Chineselanguage settings.A log on the server revealed IP addresses that had been used to log in to the software used tocommunicate with malware on victim machines. One of the IP addresses, 112.66.188.28, islocated in Hainan, China. Other addresses belong to virtual private servers, but artifactsindicate that the computers used to log in all cases are conﬁgured with Chinese languagesettings.Outlook and ImplicationsThe activity uncovered here offers new insight into TEMP.Periscope’s activity. We werepreviously aware of this actor’s interest in maritime affairs, but this compromise givesadditional indications that it will target the political system of strategically important countries.01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 10 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-electionsNotably, Cambodia has served as a reliable supporter of China’s South China Sea position ininternational forums such as ASEAN and is an important partner. While Cambodia is rated asAuthoritarian by the Economist’s Democracy Index, the recent surprise upset of the ruling partyin Malaysia may motivate China to closely monitor Cambodia’s July 29 elections.The targeting of the election commission is particularly signiﬁcant, given the critical role itplays in facilitating voting. There is not yet enough information to determine why theorganization was compromised – simply gathering intelligence or as part of a more complexoperation. Regardless, this incident is the most recent example of aggressive nation-stateintelligence collection on election processes worldwide.We expect TEMP.Periscope to continue targeting a wide range of government and militaryagencies, international organizations, and private industry. However focused this group may beon maritime issues, several incidents underscore their broad reach, which has includedEuropean ﬁrms doing business in Southeast Asia and the internal affairs of littoral nations.FireEye expects TEMP.Periscope will remain a virulent threat for those operating in the area forthe foreseeable future.Link to RSS feedPrepare for2024'scybersecuritylandscape.Get the Google CloudCybersecurity Forecast 2024repo! to explore the latesttrends on the horizon.01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 11 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-elections Download now Havequestions?Let's talk.Mandiantexperts areready toanswer yourquestions.Contactus01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 12 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-electionsMandiant AdvantagePlatformPlatform OverviewSecurity ValidationAttack SurfaceManagementThreat IntelligenceDigital ThreatMonitoringManaged DefenseSolutionsProactive ExposureManagementRansomwareIndustrial Controls &OTCyber RiskManagementDigital RiskProtectionInsider ThreatsCyber Security SkillsGapElection SecurityGovernment CyberSecurityManufacturingCyber Threat VisibilityAttack SurfaceVisibilityServicesServices OverviewIncident ResponseStrategic ReadinessCyber SecurityTransformationTechnical AssuranceView all Services (48)Expertise on DemandMandiant AcademyOverviewEducation FormatsUpcoming CoursesOn-Demand CoursesCertiﬁcationsThreatSpace CyberRangeFree Course SneakPeaks Follow us01/04/24, 15:25Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of…2018 Elections and Reveals Broad Operations Globally | Mandiant Pagina 13 di 13https://www.mandiant.com/resources/blog/chinese-espionage-group-targets-cambodia-ahead-of-electionsCyber PreparednessDetection andResponseFinancial ServicesCyber SecurityResourcesResource CenterBlogPodcastsCustomer StoriesReportsWebinarsInsightseBooksInfographicsWhite PapersDatasheetsCompanyAbout UsCareersEventsMedia CenterPartnersPartners OverviewTechnology PartnersCyber Risk PartnersService PartnersPartner PortalConnect withMandiantContact UsReport an IncidentCustomer SupportCustomer SuccessMedia Inquiries   Copyright 2024 Mandiant. All rights reserved.Website Privacy PolicyTerms & ConditionsComplianceSite Map"
}