{
    "title": "cobalt group_ cobalt gang_ cobalt spider_ group g0080 _ mitre att_ck®",
    "text": "JUST RELEASED: ATT&CK for Industrial Control Systems GROUPS Overview admin@338 APT1 APT12 APT16 APT17 APT18 APT19 APT28 APT29 APT3 APT30 APT32 APT33 APT37 APT38 APT39 APT41 Axiom BlackOasis BRONZE BUTLER Carbanak Charming Kitten Cleaver Cobalt Group CopyKittens Dark Caracal Darkhotel DarkHydrus Deep Panda Dragonfly Dragonfly 2.0 DragonOK Dust Storm Elderwood Equation FIN10 FIN4 FIN5 FIN6 FIN7 FIN8 Gallmaker Gamaredon Group GCMAN Gorgon Group Group5 Honeybee Ke3chang Kimsuky Lazarus Group Leafminer Leviathan Lotus Blossom Machete Magic Hound menuPass Moafee Molerats MuddyWater Naikon NEODYMIUM Night Dragon OilRig Orangeworm Patchwork PittyTiger PLATINUM Poseidon GroupHome >Groups >Cobalt Group Cobalt Group Associated Group Descriptions Name Description Cobalt Gang   Cobalt Spider Techniques Used Domain ID Name Use Enterprise T1088 Bypass User Account ControlCobalt Group  has bypassed UAC. Enterprise T1191 CMSTP Cobalt Group  has used the command cmstp.exe /s /ns C:\\Users\\ADMINI~W\\AppData\\Local\\Temp\\XKNqbpzl.txt  to bypass AppLocker and launch a malicious script. Enterprise T1059 Command-Line InterfaceCobalt Group  has used a JavaScript backdoor that is capable of launching cmd.exe to execute shell commands. Enterprise T1173 Dynamic Data ExchangeCobalt Group  has sent malicious Word OLE compound documents to victims. Enterprise T1203 Exploitation for Client ExecutionCobalt Group  had exploited multiple vulnerabilities for execution, including Microsoft’s Equation Editor (CVE-2017-11882), an Internet Explorer vulnerability (CVE-2018- 8174), CVE-2017-8570, CVE-2017-0199, and CVE-2017-8759. Enterprise T1068 Exploitation for Privilege EscalationCobalt Group  has used exploits to increase their levels of rights and privileges. Enterprise T1107 File Deletion Cobalt Group  deleted the DLL dropper from the victim’s machine to cover their tracks. Enterprise T1037 Logon Scripts Cobalt Group  has added persistence by registering the file name for the next stage malware under UserInitMprLogonScript. Enterprise T1046 Network Service ScanningCobalt Group  leveraged an open-source tool called SoftPerfect Network Scanner to perform network scanning. Enterprise T1050 New Service Cobalt Group  has created new services to establish persistence. Enterprise T1027 Obfuscated Files or InformationCobalt Group  obfuscated several scriptlets and code used on the victim’s machine, including through use of XOR and RC4. Enterprise T1086 PowerShell Cobalt Group  has used powershell.exe to download and execute scripts. Enterprise T1055 Process Injection Cobalt Group  has injected code into trusted processes. Enterprise T1108 Redundant Access Cobalt Group  has used TeamViewer to preserve remote access in case control using the Cobalt Strike module was lost. Enterprise T1060 Registry Run Keys / Startup FolderCobalt Group  has used Registry Run keys for persistence. The group has also set a Startup path to launch the PowerShell shell command and download Cobalt Strike. Enterprise T1117 Regsvr32 Cobalt Group  has used regsvr32.exe to execute scripts. Enterprise T1219 Remote Access ToolsCobalt Group  used the Ammyy Admin tool as well as TeamViewer for remote access. Enterprise T1076 Remote Desktop ProtocolCobalt Group  has used Remote Desktop Protocol to conduct lateral movement. Enterprise T1105 Remote File Copy Cobalt Group  has used public sites such as github.com and sendspace.com to upload files and then download them to victim computers. The group's JavaScript backdoor is also capable of downloading files. Enterprise T1053 Scheduled Task Cobalt Group  has created Windows tasks to establish persistence. Enterprise T1064 Scripting Cobalt Group  has sent Word OLE compound documents with malicious obfuscated VBA macros that will run upon user execution and executed JavaScript scriptlets on the victim's machine. The group has also used an exploit toolkit known as Threadkit that launches .bat files. Enterprise T1063 Security Software DiscoveryCobalt Group  used a JavaScript backdoor that is capable of collecting a list of the security solutions installed on the victim's machine. Enterprise T1218 Signed Binary Proxy ExecutionCobalt Group  has used odbcconf  to proxy the execution of malicious DLL files. Enterprise T1193 Spearphishing AttachmentCobalt Group  has sent spearphishing emails with various attachment types to corporate and personal email accounts of victim organizations. Attachment types have included .rtf, .doc, .xls, archives containing LNK files, and password protected archives containing .exe and .scr executables. Enterprise T1192 Spearphishing LinkCobalt Group  has sent emails with URLs pointing to malicious documents. Enterprise T1071 Standard Application Layer ProtocolCobalt Group  has used HTTPS and DNS tunneling for C2. The group has also used the Plink utility to create SSH tunnels. Enterprise T1032 Standard Cryptographic ProtocolCobalt Group  has used the Plink utility to create SSH tunnels. Enterprise T1204 User Execution Cobalt Group  has sent emails containing malicious attachments or links that require users to execute a file or macro to infect the victim machine. Enterprise T1220 XSL Script ProcessingCobalt Group  used msxsl.exe to bypass AppLocker and to invoke Jscript code from an XSL file.Cobalt Group  is a financially motivated threat group that has primarily targeted financial institutions. The group has conducted intrusions to steal money via targeting ATM systems, card processing, payment systems and SWIFT systems. Cobalt Group  has mainly targeted banks in Eastern Europe, Central Asia, and Southeast Asia. One of the alleged leaders was arrested in Spain in early 2018, but the group still appears to be active. The group has been known to target organizations in order to use their access to then compromise additional victims.        Reporting indicates there may be links between Cobalt Group  and both the malware Carbanak  and the group Carbanak . [1][2][3][4][5][6][7] [8]ID: G0080 Associated Groups : Cobalt Gang, Cobalt Spider Version : 1.1 Created: 17 October 2018 Last Modified: 26 July 2019 [1][12][9] [12] ATT&CK  Navigator Layers    [4] [1] [9][10] [9] [1] [1][2][3][5][6][7][12][11] [4] [1] [9] [2][3][4] [4] [1][9] [1][2][3][4][7][11] [4] [4] [4] [1][9][11] [2][3][4] [4] [2][3][9] [4] [1][2][4][9][10][11] [9] [11] [1][2][3][4][5][6][10][11] [1] [1][3][4] [4] [1][10] [1] Matrices Groups Software Blog  Contribute Tactics  Techniques  Mitigations  Resources    Domain ID Name Use PROMETHIUM Putter Panda Rancor RTM Sandworm Team Scarlet Mimic Silence SilverTerrier Soft Cell Sowbug Stealth Falcon Stolen Pencil Strider Suckfly TA459 TA505 Taidoor TEMP.Veles The White Company Threat Group-1314 Threat Group-3390 Thrip Tropic Trooper Turla Winnti Group WIRTESoftware ID Name References Techniques S0154 Cobalt StrikeAccess Token Manipulation, BITS Jobs, Bypass User Account Control, Command-Line Interface, Commonly Used Port, Component Object Model and Distributed COM, Connection Proxy, Credential Dumping, Custom Command and Control Protocol, Data from Local System, Execution through API, Exploitation for Privilege Escalation, Indicator Removal from Tools, Input Capture, Man in the Browser, Multiband Communication, Network Service Scanning, Network Share Discovery, New Service, Parent PID Spoofing, Pass the Hash, PowerShell, Process Discovery, Process Hollowing, Process Injection, Remote Desktop Protocol, Remote Services, Remote System Discovery, Scheduled Transfer, Screen Capture, Scripting, Service Execution, Standard Application Layer Protocol, Timestomp, Valid Accounts, Windows Admin Shares, Windows Management Instrumentation, Windows Remote Management S0002 Mimikatz Account Manipulation, Credential Dumping, Credentials in Files, DCShadow, Pass the Hash, Pass the Ticket, Private Keys, Security Support Provider, SID-History Injection S0284 More_eggs Code Signing, Command-Line Interface, Data Encoding, Data Encrypted, Deobfuscate/Decode Files or Information, File Deletion, Regsvr32, Remote File Copy, Security Software Discovery, Standard Application Layer Protocol, System Information Discovery, System Network Configuration Discovery, System Owner/User Discovery S0029 PsExec Service Execution, Windows Admin Shares S0195 SDelete Code Signing, Data Destruction, File Deletion References[1] [2] [4] [5] [6] [7] [12] [11] [2] [3] [4] [1] [2] [4] [3] 1. Svajcer, V. (2018, July 31). Multiple Cobalt Personality Disorder. Retrieved September 5, 2018. 2. Positive Technologies. (2017, August 16). Cobalt Strikes Back: An Evolving Multinational Threat to Finance. Retrieved September 5, 2018. 3. Positive Technologies. (2016, December 16). Cobalt Snatch. Retrieved October 9, 2018. 4. Matveeva, V. (2017, August 15). Secrets of Cobalt. Retrieved October 10, 2018. 5. Mesa, M, et al. (2017, June 1). Microsoft Word Intruder Integrates CVE-2017-0199, Utilized by Cobalt Group to Target Financial Institutions. Retrieved October 10, 2018. 6. Klijnsma, Y.. (2017, November 28). Gaffe Reveals Full List of Targets in Spear Phishing Attack Using Cobalt Strike Against Financial Institutions. Retrieved October 10, 2018.7. Klijnsma, Y.. (2018, January 16). First Activities of Cobalt Group in 2018: Spear Phishing Russian Banks. Retrieved October 10, 2018. 8. Europol. (2018, March 26). Mastermind Behind EUR 1 Billion Cyber Bank Robbery Arrested in Spain. Retrieved October 10, 2018. 9. Gorelik, M. (2018, October 08). Cobalt Group 2.0. Retrieved November 5, 2018. 10. Unit 42. (2018, October 25). New Techniques to Uncover and Attribute Financial actors Commodity Builders and Infrastructure Revealed. Retrieved December 11, 2018. 11. Giagone, R., Bermejo, L., and Yarochkin, F. (2017, November 20). Cobalt Strikes Again: Spam Runs Use Macros and CVE-2017-8759 Exploit Against Russian Banks. Retrieved March 7, 2019. 12. CrowdStrike. (2018, February 26). CrowdStrike 2018 Global Threat Report. Retrieved October 10, 2018.   2015-2020, The MITRE Corporation. MITRE ATT&CK and ATT&CK are registered trademarks of The MITRE Corporation. Privacy Policy Terms of Use ATT&CK v6.3  @MITREattack Contact  "
}