{
    "title": "darwin’s favorite apt group _ fireeye inc",
    "text": "Threat Research Darwin’s Favorite aPT G roup Septembe r 03, 2014 | by ned Moran, Mike Oppenheim  | Threat Intelligence , Botnets, Targeted attack THREaT InTELLIGEnCE  aDVanCED THREaT aCTOR   BOTnETS  aDVanCED MaLWaR E  TaRGETED aTTaCK   aDVanCED TaRG ETED aTTaCK   aDVanCED PERSISTEnT THREaT  TaRGETED aTTaCK Introduction The attacke rs referred to as aPT12 (also known as IXESHE, DynCalc, an d DnSCaLC) recently started a new campaign ta rgeting o rganizations in Japan an d Taiwan. aPT 12 is believe d to be a cybe r espionage g roup thought to have link s to the Chine se People' s Liberation a rmy. aPT 12's targets are consistent with larger People' s Republic of China (PRC) goal s. Intrusions and campaign s conducted by this group are in-line with PRC goals and self-interest in Taiwan. additionally, the ne w campaign s we uncovered further highlight the co rrelation between aPT g roups ceasing and retooling ope rations after media expo sure, as aPT12 used the same strategy after compromising the new York Times in Oct 2012 . Much like Da rwin’s theory of biological evol ution, aPT 12 been fo rced to evolve an d adapt in o rder to maintain it s mission. The new campaign ma rks the first aPT12 activity p ublicly reported since arbor networks released their blog “Illuminating The Etumbot aPT Back door.” FireEye refers to the Etumbot back door as RIPTIDE. Since the release of the a rbor blog po st, FireEye has observed aPT12 use a modified RIPTIDE backdoor that we call HIGHTIDE. This is the second time Fi reEye has discovered aPT12 retooling afte r a public disclosure. as such, FireEye believes this to be a common theme fo r this aPT group, as aPT12 will contin ue to evolve in an effo rt to avoi d detection an d continue its cyber operations. FireEye researchers also discovered two possibly related campaign s utilizing two other backdoors known as THREEBYTE and WaTERSPOUT. Both back doors were dropped from malicio us documents built utilizing the “Tran Duy Linh” exploit kit, which exploite d CVE-2012 -0158 . These documents were also emaile d to organizations in Japan an d Taiwan. While aPT 12 has previously used THREEBYTE, it is unclear if aPT12 was responsible for the recently discovered campaign utilizing THREEBYTE. Similarly, WaT ERSPOUT i s a newly discovered backdoor and the threat acto rs behind the campaign have not been po sitively identified. However, the WaT ERSPOUT campaign shared several traits with the R IPTIDE and HIGHTIDE campaign that we have att ributed to aPT 12. Background From Octobe r 2012  to May 2014, FireEye observed aPT12 utilizing RIPTIDE, a proxy-aware backdoor that communicates via HTTP to a ha rd-coded comman d and control (C2) server. RIPTIDE’s first comm unication with its C2 server fetches an enc ryption key, an d the RC4 enc ryption key i s used to encrypt all f urther communication. Figure 1: RIPTIDE HTTP GET Request Example In June 2014, arbor networks published an article describing the R IPTIDE backdoor and its C2 infrastructure in great depth. The blog highlighte d that the back door was utilized in campaign s from March 2011 till May 2014. Following the release of the a rticle, FireEye observed a distinct change in R IPTIDE’s protocols and strings. We suspect thi s change was a direct result of the a rbor blog po st in order to decrease detection of R IPTIDE by security vendors. The change s to RIPTIDE were significant eno ugh to ci rcumvent exi sting RIPTIDE detection rules. FireEye dubbed this new malware family HIGHTIDE. HIGHTIDE Malware Family On Sunday august 24, 2014 we observed a spear phish email sent to a Tai wanese government mini stry. attache d to this email was a malicio us Microsoft Word document (MD 5: f6fafb7c30b1114befc93f39d0698560 ) that exploite d CVE-2012 -0158 . It is worth noting that thi s email appea red to have been sent from anothe r Taiwanese Gove rnment employee, implying that the email was sent from a vali d but compromised account.   Figure 2:  aPT12 Spearphishing Email The exploit document dropped the HIGHTIDE backdoor with the follo wing properties:                                                        Email Up dates Information an d insight on to day's advanced threats from FireEye. SHaRE Recent Po sts 09 Mar 2020 24 Feb 2020 20 Feb 2020 RSS FEED: STaY CO nnECTEDFirst name Last name Email address Company name Threat Research Blog FireEye Stories Blog Industry Perspective s Blog Yes, I would like to receive communication s from FireEye. Please read more about our information collection an d use. SUBSCR IBE Crescendo: Real Time Event Vie wer for macOS   Ransomware again st the Machine: How adversaries are Learning to Disrupt Industrial Production by Targeting IT and OT  M-Trends 2020 : Insights From the Front Line s   Home  FireEye Blog s Threat Research  Septembe r 2014 Threat Research Blog Po sts  Darwin’s Favorite aPT G roup     Solutions Services Customers Partners Resources Company                          MD5 6e59861931fa2796ee107dc27bfdd480 Size 75264 bytes Complie Time2014-08-23 08:22:49 Import Hashead55ef2b18a80c00786c25211981570   The HIGHTIDE backdoor connecte d directly to 141.108.2.157. If you compa re the HTTP GET request from the RIPTIDE samples (Figure 1) to the HTTP GET request from the HIGHTIDE samples (Figure 3) you can see the malware author change d the follo wing item s: User agent Format and structure of the HTTP Unifo rm Resource Identifier (URI) Figure 3: HIGHTIDE GET Request Example Similar to RIPTIDE campaign s, aPT12 infects target systems with HIGHTIDE using a Mic rosoft Word (.doc) document that exploit s CVE-2012 -0158 . FireEye observed aPT12 deliver these exploit documents via phi shing emails in multiple ca ses. Based on past aPT12 activity, we expect the th reat group to contin ue to utilize phishing as a malware delivery metho d.                                                                                                                                                                                MD5 File Name Exploit 73f493f6a2b0da23a79b50765c164e88 議程最新修正及注意事項 .docCVE-2012- 0158 f6fafb7c30b1114befc93f39d0698560 0824.1.docCVE-2012- 0158 eaa6e03d9dae356481215e3a9d2914dc簡易名冊 0全國各警察機關主官至分局 長.docCVE-2012- 0158 06da4eb2ab6412c0dc7f295920eb61c4 附檔.docCVE-2012- 0158 53baedf3765e27fb465057c48387c9b6 103年第3屆通訊錄 .docCVE-2012- 0158 00a95fb30be2d6271c491545f6c6a7072014 09 17 Welcome Reception for Bob and Jason_invitation.docCVE-2012- 0158 4ab6bf7e6796bb930be2dd0141128d06產諮會_Y103(2) 委員會 _從東協新興國家 崛起(0825).docCVE-2012- 0158   Figure 4: Identified exploit documents for HIGHTIDE  When the file i s opened, it drops HIGHTIDE in the fo rm of an exec utable file onto the infecte d system. RIPTIDE and HIGHTIDE differ on several point s: executable file location, image ba se address, the User-agent within the G ET requests, and the format of the UR I. The RIPTIDE exploit document drops its executable file into the C:\\Doc uments and Setting s\\{user}\\application Data\\Location fol der while the HIGHTIDE exploit document drops its executable file into the C:\\DOCUM EnTS and SETTInGS\\{user}\\LOCaL S ETTInGS\\Temp\\ fol der. all but one sample that we identified were written to thi s folder as word.exe. The one o utlier was written as winword.exe. Research into thi s HIGHTIDE campaign revealed aPT12 targeted multiple Tai wanese Gove rnment o rganizations between august 22 and 28. THREEBYTE Malware Family On Mon day august 25, 2014 we observed a different spear phish email sent from lilywang823@ gmail.com to a technology company locate d in Taiwan. This spear phish containe d a malicio us Word document that exploite d CVE-2012 -0158 . The MD 5 of the exploit document was e009b95ff7b69cbbebc 538b2c5728b11. Similar to the ne wly discovered HIGHTIDE samples documented above, thi s malicio us document dropped a backdoor to C:\\DOCUM EnTS and SETTInGS\\{user}\\LOCaL S ETTInGS\\Temp\\ word.exe. Thi s backdoor had the following properties:                                                                                MD5 16e627dbe730488b1c3d448bfc9096e2 Size 75776 bytes Complie Time2014-08-25 01:22:20 Import Hashdcfaa2650d29ec1bd88e262d11d3236f   This backdoor sent the follo wing callback t raffic to vi deo[.]csmcpr[.]com: Figure 5:  THREEBYTE GET Request Beacon The THREEBYTE spear phishing inci dent (while not yet att ributed) shared the follo wing cha racteristics with the above HIGHTIDE campaign att ributed to aPT 12: The THREEBYTE backdoor was compile d two days after the HIGHTIDE backdoors. Both the T HREEBYTE and HIGHTIDE backdoors were used in attack s targeting o rganizations in Taiwan. Both the T HREEBYTE and HIGHTIDE backdoors were written to the same filepath of C:\\DOCUM EnTS and SETTInGS\\{user}\\LOCaL S ETTInGS\\Temp\\ word.exe. aPT12 has previously used the THREEBYTE backdoor. WaTERSPOUT Mal ware Family On august 25, 2014, we observed anothe r round of spear phishing email s targeting a high-technology company in Japan. attache d to this email was anothe r malicio us document that was designed to exploit CV E-2012 -0158 . This malicio us Word document ha d an MD 5 of 499bec15ac83f2c8998 f0391 7b63652 e and dropped a back door to C:\\DOCUM EnTS and SETTInGS\\{user}\\LOCaL S ETTInGS\\Temp\\ word.exe. The back door had the follo wing properties:                                                                                MD5 f9cfda6062a8ac9e332186a7ec0e706a Size 49152 bytes Complie Time2014-08-25 02:10:11 Import Hash864cd776c24a3c653fd89899ca32fe0b   The back door connect s to a comman d and control server at icc[.]igno relist[.]com. Similar to RIPTIDE and HIGHTIDE, the WaT ERSPOUT back door is an HTTP-ba sed backdoor that comm unicates with its C2 server.                           GET /<string>/<5 digit number>/<4 character string>.php?<first 3 characters of last string>_id=<43 character string>= HTTP/1.1   accept: image/jpeg, application/x-m s-application, image/gif, application/xaml+xml, image/pjpeg, application/x-m s-xbap, */* User-agent: Mo zilla/4.0 (compatible; MS IE 8.0; Windows nT 6.1; Trident/4.0; SLCC2; .nET CLR 2.0.50727; .nET CLR 3.5.30729; .nET CLR 3.0.30729; .nET4.0C; .nET4.0E) Host: <C2 Location> Cache-Cont rol: no-cache   Figure 6: Sample G ET request for WaTERSPOUT back door although there are no current infrastructure ties to link thi s backdoor to aPT 12, there are several data point s that show a possible tie to the same acto rs: Same initial delivery metho d (spear phishing email) with a Mic rosoft Word Document exploiting CV E-2012 - 0158 .   The same “Tran Duy Linh” Mic rosoft Word Exploit Kit was used in delivery of this backdoor.   Similar Targets were observed where the th reat acto rs utilized this backdoor.   Japane se Tech Company Taiwanese Gove rnment O rganizations Organizations in the a sia-Pacific Region that a re of Interest to China   The WaT ERSPOUT back door was written to the same file path a s the HIGHTIDE backdoors:   C:\\DOCUM EnTS and SETTInGS\\{user}\\LOCaL S ETTInGS\\Temp\\ word.exe C:\\DOCUM EnTS and SETTInGS\\{user}\\LOCaL S ETTInGS\\Temp\\ winword.exe   WaTERSPOUT was compile d within two days of the la st HIGHTIDE backdoor and on the same day as the THREEBYTE backdoor. aPT12 closely monito rs online me dia related to its tools and operations and reacts when its tools are publicly disclosed. aPT12 has the ability to a dapt quickly to p ublic expo sures with new tools, tactics, and procedures (TTPs). Public disclosures may result in an imme diate change in aPT 12’s tools. These change s may be temporary and FireEye believe s they are aimed at decreasing detection of thei r tools until a mo re permanent an d effective TTP change can be implemente d (e.g., WaT ERSPOUT). although these points do not definitively tie WaT ERSPOUT to aPT 12, they do indicate a po ssible connection bet ween the WaT ERSPOUT campaign, the T HREEBYTE campaign, an d the HIGHTIDE campaign attributed to aPT 12. Conclusion FireEye believe s the change f rom RIPTIDE to HIGHTIDE represents a tempo rary tool shift to decrease malware detection while aPT 12 develope d a completely ne w malware toolset. These development effo rts may have resulted in the eme rgence of the WaT ERSPOUT back door.   PREVIOUS POST nEXT POST Figure 7: Compile dates for all three malware familie s  aPT12’s adaptation s to public disclosures lead FireEye to make several concl usions about this threat group: Though public disclosures resulted in aPT 12 adaptation s, FireEye observed only a b rief pause in aPT 12 activity befo re the th reat acto rs returned to normal activity level s. Similarly, the p ublic disclosure of aPT 12’s intrusion at the new York Times also led to only a b rief pause in the th reat group’s activity an d immediate change s in TTPs. The pa use and retooling by aPT 12 was covered in the Mandiant 2014 M-Trends report. Currently, aPT 12 continues to target organizations and conduct cybe r operations using its new tools. Most recently, Fi reEye observed HIGHTIDE at multiple Tai wan-based organizations and the suspected aPT12 WaTERSPOUT back door at a Japan-ba sed electronics company. We expect that aPT 12 will contin ue their trend and evolve an d change it s tactics to stay ahea d of network defenders. note: IOCs for this campaign can be fo und here.   Company Why Fi reEye? Customer Stories Careers Certification s and Compliance Investor Relation s Supplier Documents news and Events newsroom Press Releases Webina rs Events awards and Honors Email Preferences Technical S upport Incident? Report Security Issue Contact S upport Customer Portal Communities Documentation Po rtal FireEye Blog s Threat Research FireEye Stories Industry Perspective s Threat Map View the Late st Threats Contact U s +1 877-347-3393   Stay Connecte d  Copyright   2020  FireEye, Inc. all rights reserved.  Privacy & Cookie s Policy  | Privacy Shiel d | Legal Doc umentationSite Lang uage English  "
}