{
    "title": "Endpoint Protection - Symantec Enterprise - Duuzer - North Korea",
    "text": "01/04/24, 20:58Endpoint Protection - Symantec Enterprise Pagina 1 di 5https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments PRODUCTSAPPLICATIONSSUPPORTCOMPANYHOW TO BUYSign inRegister StatisticsEndpoint Protection View OnlyCommunity HomeThreadsLibraryEventsMembers BACK TO LIBRARYDuuzer back door Trojan targets South Korea to takeover computers 1 RecommendOct 26, 2015 09:01 AM A LJohnson Symantec has found that South Korea is being impacted by an active back door Trojan,detected as Backdoor.Duuzer. While the malware attack has not been exclusively targeting theregion, it has been focusing on the South Korean manufacturing industry. Duuzer is a well-designed threat that gives attackers remote access to the compromised computer, downloadsadditional ﬁles, and steals data. It’s clearly the work of skilled attackers looking to obtainvaluable information.There is also evidence to suggest that the actors behind Duuzer are spreading two otherthreats, detected as W32.Brambul and Backdoor.Joanap, to target more organizations in SouthKorea. Brambul and Joanap appear to be used to download extra payloads and carry outreconnaissance on infected computers.Duuzer: An advanced back door threatDuuzer is an ongoing threat that is being delivered in targeted attacks. While the exactdistribution method is unknown, it’s likely that the malware is spreading through spear-phishingemails or watering-hole attacks.The Trojan has been designed to work on both 32-bit and 64-bit computers. It also detectswhether the computer it has infected is a virtual machine that was made using Virtual Box orVMware. If this is the case, then Duuzer stops executing. This allows Duuzer to attempt to evadedetection from security researchers who are running virtual machines that are designed to becompromised with malware for analysis.Once Duuzer infects a computer, it opens a back door, giving the attackers access to almosteverything. The attackers can securely connect to the compromised computer through thethreat and perform the following activities:Gather system and drive informationCreate, enumerate, and end processesAccess, modify, and delete ﬁlesUpload and download ﬁlesChange the time attributes of ﬁlesExecute commands0 Favorited0 Views0 Files0 Shares0 Downloads01/04/24, 20:58Endpoint Protection - Symantec Enterprise Pagina 2 di 5https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocumentsThe Duuzer attackers have been observed trying to disguise their malware on an infectedcomputer. They do this by identifying what software is installed and runs on startup, thenrenaming their malware to a similar title of an existing, legitimate program.Based on our analysis of Duuzer, the attackers behind the threat appear to be experienced andhave knowledge about security researchers’ analysis techniques. Their motivation seems to beobtaining valuable information from their targets’ computers.The attackers appear to be manually running commands through the back door on affectedcomputers. In one case, we observed the attackers creating a camouﬂaged version of theirmalware, and in another, we saw them attempting, but failing, to deactivate Symantec EndpointProtection (SEP).Duuzer in disguiseThe attackers began by querying the Run key in the registry, redirecting the output to atemporary ﬁle:cmd.exe /c \"reg query \"HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\" >C:\\Windows\\TEMP\\BP25B4.tmp\" 2>&1They narrowed their query down to a speciﬁc user’s Run key:cmd.exe /c \"reg query \"HKEY_USERS\\[REMOVED]\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\" >C:\\Windows\\TEMP\\BP6380.tmp\" 2>&1The attackers discovered that a particular program was installed on the affected computer anddecided to mimic that software. They created a new folder with the same name as the identiﬁedapplication, but in a different location. They then copied their malware into that folder:cmd.exe /c \"md C:\\USER_PROFILE\\AppData\\Local\\[REMOVED]\"The attackers listed out the attributes for the ﬁle that they attempted to mimic. They thenchanged the attributes of their malicious ﬁle to match those of the clean one.cmd.exe /c \"dir /a \"C:\\Program Files (x86)\\[REMOVED]\\[REMOVED] AGENT\\[REMOVED].exe\" > C:\\Windows\\TEMP\\BPD0B6.tmp\" 2>&1Finally, the attackers created a new registry entry in the Run subkey to load their malware.Again, they used a similar name to the legitimate application to mimic it.cmd.exe /c \"reg add \"HKEY_USERS\\[REMOVED]\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\" /v \"[REMOVED]Agent\" /tREG_SZ /d \"\\\"C:\\USER_PROFILE\\AppData\\Local\\[REMOVED]\\[REMOVED].exe\\\"\" /f >C:\\Windows\\TEMP\\BPA62F.tmp\" 2>&1The attackers launched the camouﬂaged version of the malware, ended the old instanceprocess, and deleted the ﬁrst instance of the malware. At this point, having blended into thevictim process, the attackers began to explore the local network using standard networkenumeration tools.Failing to deactivate Symantec Endpoint ProtectionOn a separate computer, during their network-mapping exercise, the attackers were unable tobypass SEP detections and attempted to disable the application. To do this, they installed anAPI-hooking tool in an effort to discover how the security application was interfacing withWindows and deactivate it. However, they were unable to stop SEP’s monitoring activities.The Brambul/Joanap connectionDuring our research, we found a dropper that infects computers with a worm known as Brambuland a back door Trojan called Joanap. It’s unclear how the dropper is being distributed, but it’slikely that it comes from malicious emails. Our analysis into Duuzer indicates that the Trojan isassociated with both Brambul and Joanap. Computers infected with Brambul have been used ascommand-and-control (C&C) servers for Duuzer and have also been compromised with Duuzer.The Brambul worm uses brute-force attacks to propagate. The threat connects to random IPaddresses through the Server Message Block (SMB) protocol using a hardcoded list of usernames and passwords. The passwords are quite common or easy to guess, such as “123123”,“abc123”, “computer,” “iloveyou,” ”login”, and “password”.After Brambul compromises a computer, it creates a net share to give attackers access to thesystem drive (usually the C: drive). It sends a message with the computer’s details and logincredentials to a hardcoded email address. Brambul’s variants may be able to drop additionalthreats.Joanap is dropped alongside Brambul and registers itself as a service with the display name“SmartCard Protector.” This threat can open a back door, send speciﬁc ﬁles to the attackers,save or delete ﬁles, download and run executables, and launch or end processes.Joanap also sends commands and conﬁguration data over an RC4-encrypted connection toother computers infected with these threats. These commands could include running or endingprocesses, moving or deleting ﬁles, and updating C&C details.01/04/24, 20:58Endpoint Protection - Symantec Enterprise Pagina 3 di 5https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocumentsMitigationDuuzer, Brambul, and Joanap are just a small selection of many threats affecting South Korea.The nation has been impacted in high-proﬁle, targeted campaigns over the last few years.According to the region’s National Computing & Information Agency (NCIA), there have beenmore than 114,035 attacks targeting government agencies between 2011 and 2015 so far. Thenumerous malicious campaigns in the region highlight how attackers continue to see SouthKorea as an attractive target.Symantec recommends that users and businesses adhere to the following best practices toprevent their computers from being compromised with this malware:Change default user names and passwordsAvoid using common or easy-to-guess passwords. The Norton Security Center has adviceon how to pick strong passwords.Ensure that the operating system and software is regularly updated to prevent knownvulnerabilities from being exploitedDon’t open suspicious emails. These messages typically distribute malware throughmalicious links and attachments.Keep security software up-to-date with the latest deﬁnitionsProtectionNorton Security, Symantec Endpoint Protection, and other Symantec security products protectusers against these threats through the following detections:AntivirusBackdoor.DuuzerW32.BrambulBackdoor.JoanapIntrusion Prevention SystemSystem Infected: Backdoor.Joanap ActivityWe’ve also provided the indicators of compromise for Duuzer, Brambul, and Joanap, as follows:Backdoor.Duuzer indicators of compromiseMD51205c4bd5d02782cc4e66dfa3fef749c92d618db54690c6ae193f07a31d920983e6be312a28b2633c8849d3e95e487b541a6d7c944bd84329bd31bb07f83150a7343f81a0e42ebf283415da7b3da253f73471f41319468ab207b8d5b33b0b4be84a3f8941bb4bf15ba28090f8bc0faecb04fabf3a7a710aafe5bc2d899c0fc2be04792e8e0959e66499bfacb2a76802b3a963e1de08c9920c1dfe923bd4594ff51b3e2c7a8ad29f296365972c84526215f05a8f1e545457dbd42fe1329f7945291e5a64826f75f74a5ae123abdf7cef59749a4b538022e2602945523192964ad9ca7ec51a98c2b16fd7d9a985877a4babb6cbebd4ffd642d437afc605c32eca0fb4caaaf1ac1df378d05111d810a833e4b2d221deb0c8042780376cb565532f8cd7a72be9c16c2ece1140bc461d6226df032712aa20da98a1bbad7ae5d998767f940a21971820a2fcf8433c28be1e96771cdcc903f94f56c758121d0b442690f0f844300318446a70c022f9487475490SHA256fd5a7e54cfdd3b3f32b44d8fdd845e62d6b86c0ddb550c544d659588d06ceaee89b25f9a454240a3f52de9bf6f9a829d2b4af04a7d9e9f4136f920f7e372909ba01bd92c02c9ef7c4785d8bf61ecff734e990b255bba8e22d4513f35f370fd14c327de2239034b6f6978884b33582ce97761bcc224239c955f62feebd01e5946c7024cf43d285ec9671e8dc1eae87281a6ee6f28e92d69d94474efc2521f03ed5a69bce8196b048f8b98f48c8f4950c8b059c43577e35d4af5f26c624140377c477ca3e7353938f75032d04e232eb2c298f06f95328bca1a34fce1d8c9d12023d57d772eefa6086b5c249efff01189cf4869c2b73007af63affc353474eaafcb4efeea9eeae3d668897206eeccb1444d542ea537ca5c2787f13dd5dadd0e6aaaa0a6d0e3af6e76264db1e0d4a4ad5745fff15eb2790938718b2c0988b9415b2b5b28c86d7e581e52328942b35ece0d0875585fbb4e29378666d1af5be7f56b4647181c973a8a69740b710a420ea8f6bf82ce8a613134a8b080b64ce26bb5db93fb6d81f4165b41febc739358aeba0fe15048e1d445296e8df9104875be30f9a74a6aba1c182dd8304bac91cc9e1fc39291d78044995f559c1d3bce05afd1998201/04/24, 20:58Endpoint Protection - Symantec Enterprise Pagina 4 di 5https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments7099093177094ea5cc3380b42c2556ed6e8dd06a2f537fa6dd275e5cc1df9c9a90d8643e7e52f095ed59ed739167421e45958984c4c9186c4a025e2fd2be668b66df7660ddae300b1fcf1098b698868dd6f52db5fcf679fc37a396d28613e66b37f652e2060066a1c2c317195573a334416f5a9b9933cfb1ece55bea8048d80f6b71465e59eb1e266d47efeaecc256a186d3e08f570bffcfd5ac55e635c67c2ad2e03115ef1525f82d70fc691f0360e318ade176a3789cf36969630d9af6901a912905ec9d839ca8dfd6771ff5c17aec3516f9ad159a9d627b81261055095fbf4cf3a7e17dc4628725dd34b8e98238ed0a2df2dc83189db98d85a38f73706fa5W32.Brambul indicators of compromiseMD51c532fad2c60636654d4c778cfe104081db2dced6dfa04ed75b246ff2784046a3844ec6ec70347913bd1156f8cd159b840878869de3fc5f23e14bc3f7654126395a5f91931723a65dcd4a3937546da3499d9f156c73bd69d5df1a1fe1b08c544a1ad82988af5d5b2c4003c42a81dda17ca4c2009bf7ff17d556cc095a4ce06ddf273d1283364625f986050bdf7dec8bbSHA256c029ae20c314d7a0a2618f38ced03bac99e2ff78a85fe8c8f8de8555a8d153ab1da344e5e55bef4307e257edd6f1e14835bdae17538a74afa5fc12c2766661129c3e13e93f68970f2844fb8f1f87506f4aa6e87918449e75a63c1126a240c70e230c2727e26467e16b5cf3ca37ecb8436ee5df41bfc4cd04062396642f9de352d558bb63ed9f613d51badd8fea7e8ea5921a9e31925cd163ec0412e0d999df58cbb174815739c679f694e16484a65aa087019272f94bcbf086a92817b4e4154b61f46b86741c95336cdac3f07f42b7df3e84695968534be193e98ea76d1070d11dea57b33a48c79743481371a19e17f68ae768a26abc352f21560308698c786f8df658cba8f8cf0e2b85007f57d79286eec6309e7a0955dd48bcd15c583a9650Backdoor.Joanap indicators of compromiseMD5fd59af723b7a4044ab41f1b2a33350d64613f51087f01715bf9132c704aea2c2074dc6c0fa12cadbc016b8b5b5b7b7c527a3498690d6e86f45229acd2ebc05107a83c6cd46984a84c40d77e9acff28bc1d8f0e2375f6bc1e045fa2f25cd4f7e0304cea78b53d8baaa2748c7b0bce5dd0a1ad82988af5d5b2c4003c42a81dda17SHA2569a179e1ca07c1f16c4c1c4ee517322d390cbab34b5d123a876b38d08da1face4a1c483b0ee740291b91b11e18dd05f0a460127acfc19d47b446d11cd0e26d7177650d8c0874aa7d1f2a5a7d255112976e9f38ffad8b7cdda76d0baa8f47292035b10cfb236d56a0f3ddaa5e9463ebf307b1d2e0624b0f1c6ece19213804b68260622481f1c1e246289014e9fe3497e69f06ed8b3a327eda86e4442a46790dd2e4c5b8c3e0369eb738686c8a111dfe460e26eb3700837c941ea2e9afd3255981ecbf5f579ff16206b17f039c2dc0fa35704ec01ede4ba18ecb1fc2c7b8217e54f61f46b86741c95336cdac3f07f42b7df3e84695968534be193e98ea76d1070d1Tags and KeywordsRelated Entries and LinksNo Related Resource entered.01/04/24, 20:58Endpoint Protection - Symantec Enterprise Pagina 5 di 5https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocumentsPRODUCTSAPPLICATIONSSUPPORTCOMPANYHOW TO BUYCopyright   2005-2024 Broadcom. All Rights Reserved. The term \"Broadcom\" refers to Broadcom Inc. and/or its subsidiaries.Hosted by Higher Logic, LLC on the behalf of Broadcom - Privacy Policy | Cookie Policy | Supply Chain TransparencyTerms of Use"
}