{
    "title": "Endpoint Protection - Symantec Enterprise - Sowbug- Cyber",
    "text": "01/04/24, 16:47Endpoint Protection - Symantec Enterprise Pagina 1 di 4https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments PRODUCTSAPPLICATIONSSUPPORTCOMPANYHOW TO BUYSign inRegister StatisticsEndpoint Protection View OnlyCommunity HomeThreadsLibraryEventsMembers BACK TO LIBRARYSowbug: Cyber espionage group targets SouthAmerican and Southeast Asian governments 3 RecommendNov 07, 2017 09:00 AM A LJohnsonSymantec has identiﬁed a previously unknown group called Sowbug that has been conductinghighly targeted cyber attacks against organizations in South America and Southeast Asia andappears to be heavily focused on foreign policy institutions and diplomatic targets. Sowbug hasbeen seen mounting classic espionage attacks by stealing documents from the organizations itinﬁltrates. Symantec saw the ﬁrst evidence of Sowbug-related activity with the discovery in March 2017 ofan entirely new piece of malware called Felismus used against a target in Southeast Asia.  Wehave subsequently identiﬁed further victims on both sides of the Paciﬁc Ocean. While theFelismus tool was ﬁrst identiﬁed in March of this year, its association with Sowbug was unknownuntil now. Symantec has also been able to connect earlier attack campaigns with Sowbug,demonstrating that it has been active since at least early-2015 and may have been operatingeven earlier. To date, Sowbug appears to be focused mainly on government entities in South America andSoutheast Asia and has inﬁltrated organizations in Argentina, Brazil, Ecuador, Peru, Brunei andMalaysia. The group is well resourced, capable of inﬁltrating multiple targets simultaneously andwill often operate outside the working hours of targeted organizations in order to maintain alow proﬁle. [click_to_tweet:1]Highly targeted intrusionsSome clues about the motivation and interests of the attackers can be found in their activitiesafter compromising victims. For example, in a 2015 attack on one South American foreignministry, the group appeared to be searching for very speciﬁc information. The ﬁrst evidence of its intrusion dated from May 6, 2015 but activity appeared to have begunin earnest on May 12. The attackers appeared to be interested in one division of the ministry thatis responsible for relations with the Asia-Paciﬁc region. They attempted to extract all Worddocuments stored on a ﬁle server belonging to this division by bundling them into a RARarchive by running the following command:cmd.exe /c c:\\windows\\rar.exe a -m5 -r -ta20150511000000 -v3072 c:\\recycler\\[REDACTED].rar\"\\\\[REDACTED]\\*.docx\" \\\\[REDACTED]\\*.doc.Interestingly, the command speciﬁed that only ﬁles modiﬁed from May 11, 2015 onwards shouldbe archived.The attackers appear to have successfully extracted the archive because an hour later theyreturned, this time attempting to extract all documents modiﬁed from May 7, 2015, an extra fourdays’ worth of data. Presumably they either didn't ﬁnd what they were looking for in the initialincursion, or else noticed something in the documents they stole earlier that prompted them tohunt for more information.The attackers didn’t stop there. Their next move was to list any remote shared drives and thenattempt to access remote shares owned by the speciﬁc government office they were targeting,again attempting to extract all Word documents. In this case, they searched for any documentsmodiﬁed from May 9 onwards. The attackers then seemed to broaden their interest, listing thecontents of various directories on remote shares, including one belonging to another division ofthe South American foreign ministry, this one responsible for relations with international0 Favorited1 Views0 Files0 Shares0 Downloads01/04/24, 16:47Endpoint Protection - Symantec Enterprise Pagina 2 di 4https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocumentsorganizations. They also deployed two unknown payloads to the infected server. In total, theattackers maintained a presence on the target’s network for four months between May andSeptember 2015. Network traversal: Keeping a low proﬁleSowbug frequently maintains a long-term presence on the networks of targeted organizations,sometimes remaining inside a victim environment for up to six months. One of the tactics ituses to avoid drawing attention to itself is impersonating commonly used software packagessuch as Windows or Adobe Reader. It has never attempted to compromise the software itself.Rather, it gives its tools ﬁle names similar to those used by the software and places them indirectory trees that could be mistaken for those used by the legitimate software. This allows theattackers to hide in plain sight, as their appearance in process listings is unlikely to arousesuspicion.For example, in September 2016, Sowbug inﬁltrated an organization in Asia, deploying theFelismus backdoor on one of its computers, Computer A, using the ﬁle name adobecms.exe inCSIDL_WINDOWS\\debug. From there, it installed additional components and tools to adirectory named CSIDL_APPDATA\\microsoft\\security.01/04/24, 16:47Endpoint Protection - Symantec Enterprise Pagina 3 di 4https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocumentsThe attackers then began to perform reconnaissance activities on Computer A via cmd.exe,collecting system-related information, such as the OS version, hardware conﬁguration, andnetwork information. They then performed some further reconnaissance, attempting to identifyall installed applications on the computer. They returned four days later, creating a sub-directory called “common” in the Adobe directory of the Program Files folder, i.e. c:\\ProgramFiles\\Adobe\\common, and installed another tool in this sub-directory,  again namedadobecms.exe.  This was possibly an updated version of the backdoor.The attackers’ network reconnaissance appeared to be successful because a second computerof interest in the organization was identiﬁed and compromised. The attackers then returned toComputer A, installing another executable called fb.exe. This ﬁle appears to be used to copyFelismus across the network to other computers and there is evidence that the attackers used itto attempt to infect at least two more computers.The attackers took further measures to remain under the radar by carrying out their operationsoutside of standard office hours. In this case, the attackers maintained a presence on thetarget’s network for nearly six months between September 2016 and March 2017.Infection vectorsHow Sowbug performs its initial inﬁltration of a target’s network remains unknown. In somecases, there was no trace of how Felismus made its way onto compromised computers,meaning it was likely deployed from other compromised computers on the network. In otherattacks, there was evidence that Felismus was installed using a tool known as Starloader(detected by Symantec as Trojan.Starloader). This is a loader that installs and decrypts datafrom a ﬁle called Stars.jpg. Additionally, Starloader was also observed deploying additionaltools used by the attackers, such as credential dumpers and keyloggers.It is still unknown how Starloader is installed on the compromised computer. One possibility isthat the attackers use fake software updates to install ﬁles. Symantec has found evidence ofStarloader ﬁles being named AdobeUpdate.exe, AcrobatUpdate.exe, and INTELUPDATE.EXEamong others. These were used to create versions of the Felismus backdoor as well as othertools.Global threatWhile cyber espionage attacks are often seen against targets in the U.S., Europe, and Asia, it ismuch less common to see South American countries targeted. However, the number of activecyber espionage operations has increased steadily in recent years and the emergence ofSowbug is a reminder that no region is immune to this kind of threat.ProtectionSymantec customers are protected against Sowbug and Symantec has also made efforts tonotify identiﬁed targets of its operations.Customers with Intelligence Services or WebFilter-enabled products are protected againstactivity associated with the Sowbug group. These products include:Web Security Service (WSS)ProxySGAdvanced Secure Gateway (ASG)Security AnalyticsContent AnalysisMalware AnalysisSSL VisibilityPacketShaperSymantec has the following speciﬁc detections in place for the threats called out in this blog:AVBackdoor.FelismusTrojan.StarloaderIPSSystem Infected: Backdoor.Felismus ActivitySystem Infected: Backdoor.Felismus Activity 2System Infected: Backdoor.Felismus Activity 3Indicators of compromiseBackdoor.Felismus samplesMD5Detection514f85ebb05cad9e004eee89dde2ed07Backdoor.Felismus00d356a7cf9f67dd5bb8b2a88e289bc8Backdoor.Felismusc1f65ddabcc1f23d9ba1600789eb581bBackdoor.Felismus01/04/24, 16:47Endpoint Protection - Symantec Enterprise Pagina 4 di 4https://community.broadcom.com/symantecenterprise/communities…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments967d60c417d70a02030938a2ee8a0b74Backdoor.FelismusTrojan.Starloader samplesMD5Detection4984e9e1a5d595c079cc490a22d67490Trojan.StarloaderHacktoolsMD5Detectione4e1c98feac9356dbfcac1d8c362ab22Hacktool.MimikatzInstallation directory%WINDOWS%\\debug%APPDATA%\\microsoft\\securityCommand and control infrastructurenasomember[DOT]comcosecman[DOT]comunifoxs[DOT]comTags and KeywordsRelated Entries and LinksNo Related Resource entered. PRODUCTSAPPLICATIONSSUPPORTCOMPANYHOW TO BUYCopyright   2005-2024 Broadcom. All Rights Reserved. The term \"Broadcom\" refers to Broadcom Inc. and/or its subsidiaries.Hosted by Higher Logic, LLC on the behalf of Broadcom - Privacy Policy | Cookie Policy | Supply Chain TransparencyTerms of Use"
}