{
    "title": "fin7 spear phishing campaign targets personnel involved in sec filings _ fireeye inc",
    "text": " PREVIOUS POST nEXT POSTThreat Research FIn7 Spear Phishing Campaign Ta rgets Personnel Involved in SEC Filing s March 07, 2017 | by Steve Mille r, Jordan nuce, Barry Venge rik | advanced Malware SECURITIES anD EXCHanGE COMM ISSIOn (SEC)  CaRBa naK  aDVanCED MaLWaR E  SPEaR PHISHInG  FIn7 In late Feb ruary 2017, FireEye as a Service (FaaS) i dentified a spear phishing campaign that appea red to be targeting pe rsonnel involve d with Unite d States Securities and Exchange Commi ssion (SEC) filing s at various organizations. Based on multiple identified overlaps in infrastructure and the use of similar tools, tactics, and procedures (TTPs), we have high confi dence that thi s campaign i s associated with the financially motivate d threat group tracked by FireEye as FIn7. FIn7 is a financially motivate d intrusion set that selectively ta rgets victims and uses spear phishing to distribute its malware. We have ob served FIn7 attempt to comp romise diverse organizations for malicio us operations – usually involving the deployment of point-of- sale malware – primarily again st the retail an d hospitality in dustries. Spear Phishing Campaign all of the ob served intended recipient s of the spear phishing campaign appea red to be involve d with SEC filings for their respective o rganizations. Many of the recipient s were even li sted in their company’ s SEC filings. The sender email a ddress was spoofed as EDGaR <filing s@sec.gov> an d the attachment was named “Important_Change s_to_Fo rm10_K.doc” (MD 5: d04b6410dddee19adec75f597c52e386). an example email i s shown in Fig ure 1. Figure 1: Example of a phi shing email sent during this campaign We have ob served the follo wing TTP s with this campaign: The malicio us documents drop a VBS script that in stalls a PowerShell back door, which uses DnS TXT records for its comman d and control. This backdoor appears to be a ne w malware family that Fi reEye iSIGHT Intelligence ha s dubbed POWERSOURC E. POWERSOURC E is a heavily obf uscated and modified version of the publicly available tool D nS_TXT_P wnage. The back door uses DnS TXT requests for comman d and control and is installed in the registry or alternate Data St reams. Using DnS TXT records to comm unicate is not an enti rely new finding, but it should be note d that thi s has been a rising trend since 2013  likely beca use it makes detection an d hunting fo r comman d and control traffic difficult. We also observed POWERSOURC E being used to download a second-stage Po werShell back door called TEXTMaT E in an effo rt to further infect the victim machine. The T EXTMaT E backdoor provides a reverse shell to attacke rs and uses DnS TXT q ueries to tunnel inte ractive comman ds and other data. TEXTMaT E is “memo ry resident” – often described as “fileless” malware. This is not a novel techniq ue by any mean s, but it’s worth noting since it p resents detection challenge s and further speaks to the th reat acto r’s ability to remain stealthy an d nimble in ope rations. In some ca ses, we identified a Cobalt St rike Beacon payloa d being delivered via POW ERSOURC E. This particular Cobalt St rike stager payloa d was previously used in operations linked to FIn7. We observed that the same domain ho sting the Cobalt St rike Beacon payloa d was also hosting a CaRBa naK back door sample compile d in February 2017. CaRBa naK mal ware has been used heavily by FIn7 in previous operations. Victim s Thus far, we have directly identified 11 targeted organizations in the follo wing sectors: Financial services, with different victim s having in surance, inve stment, ca rd services, and loan foc uses Transportation Retail Education IT services Electronics all these organizations are based in the Unite d States, and many have inte rnational p resences. as the SEC is a U.S. regulatory organization, we would expect recipient s of these spear phishing attempt s to eithe r work for U.S.-ba sed organizations or be U.S.-ba sed representative s of organizations located elsewhere. However, it is possible that the attacke rs could perform similar activity mimicking othe r regulatory organizations in othe r countries. Implication s We have not yet i dentified FIn7’s ultimate goal in thi s campaign, a s we have eithe r blocked the delivery of the malicious emails or our FaaS team detected and containe d the attack ea rly enough in the lifecycle befo re we observed any data targeting o r theft.  However, we surmise FIn7 can p rofit from comp romised organizations in several ways. If the attacke rs are attempting to comp romise persons involve d in SEC filings due to thei r information acce ss, they may ultimately be p ursuing securities fraud or other investment ab use. alternatively, if they are tailoring thei r social enginee ring to the se individuals, but have othe r goals once they have e stablished a foothol d, they may inten d to pursue one of many othe r fraud types. Previous FIn7 operations deployed multiple point-of- sale malware familie s for the purpose of collecting an d exfiltrating sensitive financial data. The use of the CaRBa naK mal ware in FIn7 operations also provides limited evidence that the se campaign s are linked to previously observed CaRBa naK ope rations leading to f raudulent banking t ransactions, aTM comp romise, and other moneti zation schemes. Community Protection Event FireEye implemente d a Comm unity Protection Event – FaaS, Man diant, Intelligence, an d Products – to secure all clients affecte d by this campaign. In this instance, an inci dent detected by FaaS le d to the deployment of additional detection s by the Fi reEye Labs team afte r FireEye Labs advanced Reverse Engineering quickly analyzed the mal ware. Detection s were then q uickly deployed to the suite of Fi reEye products. The FireEye iSIGHT Intelligence MyS IGHT Portal contain s additional info rmation ba sed on our investigation s of a variety of topic s discussed in this post, including FIn7 and the POW ERSOURC E and TEXTMaT E malware. Click here for more information.  Email Up dates Information an d insight on to day's advanced threats from FireEye. SHaRE Recent Po sts 17 Mar 2020 16 Mar 2020 09 Mar 2020 RSS FEED: STaY CO nnECTED  First name Last name Email address Company name Threat Research Blog FireEye Stories Blog Industry Perspective s Blog Yes, I would like to receive communication s from FireEye. Please read more about our information collection an d use. SUBSCR IBE Six Fact s about address Space Layout Randomization on Windows  They Come in the night: Ransomware Deployment T rends  Crescendo: Real Time Event Vie wer for macOS    Home  FireEye Blog s Threat Research  FIn7 Spea r Phishing Campaign Ta rgets Personnel Inv...    Company Why Fi reEye? Customer Stories Careers Certification s and Compliance Investor Relation s Supplier Documents news and Events newsroom Press Releases Webina rs Events awards and Honors Email Preferences Technical S upport Incident? Report Security Issue Contact S upport Customer Portal Communities Documentation Po rtal FireEye Blog s Threat Research FireEye Stories Industry Perspective s Threat Map View the Late st Threats Contact U s +1 877-347-3393   Stay Connecte d  Copyright   2020  FireEye, Inc. all rights reserved.  Privacy & Cookie s Policy  | Privacy Shiel d | Legal Doc umentationSite Lang uage English Solutions Services Customers Partners Resources Company  "
}