{
    "title": "GAME OVER - Detecting and Stopping an APT41 Operation | Mandiant",
    "text": "01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 1 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operationIn August 2019, FireEye released the “Double Dragon” report onour newest graduated threat group, APT41. A China-nexus dualespionage and ﬁnancially-focused group, APT41 targetsindustries such as gaming, healthcare, high-tech, highereducation, telecommunications, and travel services. APT41 isknown to adapt quickly to changes and detections within victimenvironments, often recompiling malware within hours ofincident responder activity. In multiple situations, we alsoidentiﬁed APT41 utilizing recently-disclosed vulnerabilities,often weaponzing and exploiting within a matter of days.GAME OVER: Detecting andStopping an APT41 OperationALEX PENNINO, MATT BROMILEY#ADV ANCED PERSISTENT THREATS (APTS)#THREAT RESEARCH THREAT RESEARCHAUG 19, 2019|5 MIN READ|   LAST UPDA TED: NOV 29, 2023 BlogSupportContact us/report_problemIncident Response Assistance Get startedPlatformSolutionsIntelligenceServicesResourcesCompanyEN/expand_moreMandiant is now part of Google Cloud. Learn More. 01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 2 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operationOur knowledge of this group’s targets and activities are rootedin our Incident Response and Managed Defense services, wherewe encounter actors like APT41 on a regular basis. At eachencounter, FireEye works to reverse malware, collectintelligence and hone our detection capabilities. This ultimatelyfeeds back into our Managed Defense and Incident Responseteams detecting and stopping threat actors earlier in theircampaigns.In this blog post, we’re going to examine a recent instancewhere FireEye Managed Defense came toe-to-toe with APT41.Our goal is to display not only how dynamic this group can be,but also how the various teams within FireEye worked to thwartattacks within hours of detection – protecting our clients’networks and limiting the threat actor’s ability to gain a footholdand/or prevent data exposure.GET TO DA CHOPPA!In April 2019, FireEye’s Managed Defense team identiﬁedsuspicious activity on a publicly-accessible web server at aU.S.-based research university. This activity, a snippet of whichis provided in Figure 1, indicated that the attackers wereexploiting CVE-2019-3396, a vulnerability in AtlassianConﬂuence Server that allowed for path traversal and remotecode execution.  Figure 1: Snippet of PCAP showing attacker attempting CVE- mandiant.com uses cookies from Google to deliver andenhance the quality of its services and to analyze tra!c. Learnmore. OK, got it01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 3 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operation2019-3396 vulnerabilityThis vulnerability relies on the following actions by the attacker:Customizing the _template ﬁeld to utilize a template thatallowed for command execution.Inserting a cmd ﬁeld that provided the command to beexecuted.Through custom JSON POST requests, the attackers were ableto run commands and force the vulnerable system to downloadan additional ﬁle. Figure 2 provides a list of the JSON data sentby the attacker. Figure 2: Snippet of HTTP POST requests exploiting CVE-2019-3396As shown in Figure 2, the attacker utilized a template located athxxps[:]//github[.]com/Yt1g3r/CVE-2019-3396_EXP/blob/master/cmd.vm. This publicly-availabletemplate provided a vehicle for the attacker to issue arbitrarycommands against the vulnerable system. Figure 3 provides thecode of the ﬁle cmd.vm.  Figure 3: Code of cmd.vm, used by the attackers to executecode on a vulnerable Conﬂuence system01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 4 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operationThe HTTP POST requests in Figure 2, which originated from theIP address 67.229.97[.]229, performed system reconnaissanceand utilized Windows certutil.exe to download a ﬁle located athxxp[:]//67.229.97[.]229/pass_sqzr.jsp and save it as test.jsp(MD5: 84d6e4ba1f4268e50810dacc7bbc3935). The ﬁle test.jspwas ultimately identiﬁed to be a variant of a China Chopperwebshell.A Passive Aggressive OperationShortly after placing test.jsp on the vulnerable system, theattackers downloaded two additional ﬁles onto the system:64.dat (MD5: 51e06382a88eb09639e1bc3565b444a6)Ins64.exe (MD5: e42555b218248d1a2ba92c1532ef6786)Both ﬁles were hosted at the same IP address utilized by theattacker, 67[.]229[.]97[.]229. The ﬁle Ins64.exe was used todeploy the HIGHNOON backdoor on the system. HIGHNOON is abackdoor that consists of multiple components, including aloader, dynamic-link library (DLL), and a rootkit. When loaded,the DLL may deploy one of two embedded drivers to concealnetwork tra\"c and communicate with its command and controlserver to download and launch memory-resident DLL plugins.This particular variant of HIGHNOON is tracked asHIGHNOON.PASSIVE by FireEye. (An exploration of passivebackdoors and more analysis of the HIGHNOON malware familycan be found in our full APT41 report).Within the next 35 minutes, the attackers utilized both thetest.jsp web shell and the HIGHNOON backdoor to issuecommands to the system. As China Chopper relies on HTTPrequests, attacker tra\"c to and from this web shell was easilyobserved via network monitoring. The attacker utilized ChinaChopper to perform the following:Movement of 64.dat and Ins64.exe to C:\\ProgramFiles\\Atlassian\\ConﬂuencePerforming a directory listing of C:\\ProgramFiles\\Atlassian\\Conﬂuence01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 5 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operationPerforming a directory listing of C:\\UsersAdditionally, FireEye’s FLARE team reverse engineered thecustom protocol utilized by the HIGHNOON backdoor, allowingus to decode the attacker’s tra\"c. Figure 4 provides a list of thevarious commands issued by the attacker utilizing HIGHNOON.  Figure 4: Decoded HIGHNOON commands issued by theattackerPlaying Their ACEHASH CardAs shown in Figure 4, the attacker utilized the HIGHNOON01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 6 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operationbackdoor to execute a PowerShell command that downloaded ascript from PowerSploit, a well-known PowerShell Post-Exploitation Framework. At the time of this blog post, the scriptwas no longer available for downloading. The commandsprovided to the script – “privilege::debugsekurlsa::logonpasswords exit exit” – indicate that theunrecovered script was likely a copy of Invoke-Mimikatz,reﬂectively loading Mimikatz 2.0 in-memory. Per the observedHIGHNOON output, this command failed.After performing some additional reconnaissance, the attackerutilized HIGHNOON to download two additional ﬁles into theC:\\Program Files\\Atlassian\\Conﬂuence directory:c64.exe (MD5: 846cdb921841ac671c86350d494abf9c)F64.data (MD5: a919b4454679ef60b39c82bd686ed141)These two ﬁles are the dropper and encrypted/compressedpayload components, respectively, of a malware family knownas ACEHASH. ACEHASH is a credential theft and passworddumping utility that combines the functionality of multiple toolssuch as Mimikatz, hashdump, and Windows Credential Editor(WCE).Upon placing c64.exe and F64.data on the system, the attackerran the commandc64.exe f64.data \"9839D7F1A0 -m”This speciﬁc command provided a password of “9839D7F1A0” todecrypt the contents of F64.data, and a switch of “-m”,indicating the attacker wanted to replicate the functionality ofMimikatz. With the correct password provided, c64.exe loadedthe decrypted and decompressed shellcode into memory andharvested credentials.Ultimately, the attacker was able to exploit a vulnerability,execute code, and download custom malware on the vulnerableConﬂuence system. While Mimikatz failed, via ACEHASH theywere able to harvest a single credential from the system.However, as Managed Defense detected this activity rapidly vianetwork signatures, this operation was neutralized before the01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 7 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operation attackers progressed any further.Key Takeaways From This IncidentAPT41 utilized multiple malware families to maintainaccess into this environment; impactful remediationrequires full scoping of an incident.For effective Managed Detection & Response services,having coverage of both Endpoint and Network is criticalfor detecting and responding to targeted attacks.Attackers may weaponize vulnerabilities quickly aftertheir release, especially if they are present within atargeted environment. Patching of critical vulnerabilitiesASAP is crucial to deter active attackers.Detecting the TechniquesFireEye detects this activity across our platform, includingdetection for certutil usage, HIGHNOON, and China Chopper.DetectionSignature NameChina ChopperFE_Webshell_JSP_CHOPPER_1 FE_Webshell_Java_CHOPPER_1 FE_Webshell_MSIL_CHOPPER_1HIGHNOON.PASSIVEFE_APT_Backdoor_Raw64_HIGHNOON_2 FE_APT_Backdoor_Win64_HIGHNOON_2Certutil DownloaderCERTUTIL.EXE DOWNLOADER (UTILITY) CERTUTIL.EXE DOWNLOADER A (UTILITY)ACEHASHFE_Trojan_AceHashIndicators01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 8 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operation TypeIndicatorMD5 Hash (if applicable)Filetest.jsp84d6e4ba1f4268e50810dacc7bbc3935File64.dat51e06382a88eb09639e1bc3565b444a6FileIns64.exee42555b218248d1a2ba92c1532ef6786Filec64.exe846cdb921841ac671c86350d494abf9cFileF64.dataa919b4454679ef60b39c82bd686ed141IPAddress67.229.97[.]229N/ALooking for more? Join us for a webcast on August 29, 2019where we detail more of APT41’s activities. Here's a direct link tothe public APT41 report.AcknowledgementsSpecial thanks to Dan Perez, Andrew Thompson, Tyler Dean,Raymond Leong, and Willi Ballenthin for identiﬁcation andreversing of the HIGHNOON.PASSIVE malware.Link to RSS feedPrepare for2024'scybersecuritylandscape.01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 9 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operation Download now Havequestions?Let's talk.Mandiantexperts areready toanswer yourquestions.ContactusGet the Google CloudCybersecurity Forecast 2024repo! to explore the latesttrends on the horizon.01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 10 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operationMandiant AdvantagePlatformPlatform OverviewSecurity ValidationAttack SurfaceManagementThreat IntelligenceDigital ThreatMonitoringManaged DefenseSolutionsProactive ExposureManagementRansomwareIndustrial Controls &OTCyber RiskManagementDigital RiskProtectionInsider ThreatsCyber Security SkillsGapElection SecurityGovernment CyberSecurityManufacturingCyber Threat VisibilityAttack SurfaceVisibilityCyber PreparednessDetection andResponseServicesServices OverviewIncident ResponseStrategic ReadinessCyber SecurityTransformationTechnical AssuranceView all Services (48)Expertise on DemandMandiant AcademyOverviewEducation FormatsUpcoming CoursesOn-Demand CoursesCertiﬁcationsThreatSpace CyberRangeFree Course SneakPeaks Follow us01/04/24, 21:01GAME OVER: Detecting and Stopping an APT41 Operation | Mandiant Pagina 11 di 11https://www.mandiant.com/resources/blog/game-over-detecting-and-stopping-an-apt41-operationFinancial ServicesCyber SecurityResourcesResource CenterBlogPodcastsCustomer StoriesReportsWebinarsInsightseBooksInfographicsWhite PapersDatasheetsCompanyAbout UsCareersEventsMedia CenterPartnersPartners OverviewTechnology PartnersCyber Risk PartnersService PartnersPartner PortalConnect withMandiantContact UsReport an IncidentCustomer SupportCustomer SuccessMedia Inquiries   Copyright 2024 Mandiant. All rights reserved.Website Privacy PolicyTerms & ConditionsComplianceSite Map"
}