{
    "title": "Indian Ogranization Target In Surfly Attack",
    "text": "01/04/24, 12:02Endpoint Protection - Symantec Enterprise Pagina 1 di 5https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments PRODUCTSAPPLICATIONSSUPPORTCOMPANYHOW TO BUYSign inRegister StatisticsEndpoint Protection View OnlyCommunity HomeThreadsLibraryEventsMembers BACK TO LIBRARYIndian organizations targeted in Suckfly attacks 1 RecommendMay 17, 2016 08:59 AM JonDiMaggio In March 2016, Symantec published a blog on Suckﬂy, an advanced cyberespionage group thatconducted attacks against a number of South Korean organizations to steal digital certiﬁcates.Since then we have identiﬁed a number of attacks over a two-year period, beginning in April2014, which we attribute to Suckﬂy. The attacks targeted high-proﬁle targets, includinggovernment and commercial organizations. These attacks occurred in several differentcountries, but our investigation revealed that the primary targets were individuals andorganizations primarily located in India.While there have been several Suckﬂy campaigns that infected organizations with the group’scustom malware Backdoor.Nidiran, the Indian targets show a greater amount of post-infectionactivity than targets in other regions. This suggests that these attacks were part of a plannedoperation against speciﬁc targets in India.Campaign activity in IndiaThe ﬁrst known Suckﬂy campaign began in April of 2014. During our investigation of thecampaign, we identiﬁed a number of global targets across several industries who were attackedin 2015. Many of the targets we identiﬁed were well known commercial organizations located inIndia. These organizations included:One of India's largest ﬁnancial organizationsA large e-commerce companyThe e-commerce company's primary shipping vendorOne of India's top ﬁve IT ﬁrmsA United States healthcare provider's Indian business unitTwo government organizationsSuckﬂy spent more time attacking the government networks compared to all but one of thecommercial targets. Additionally, one of the two government organizations had the highestinfection rate of the Indian targets. Figure 1 shows the infection rate for each of the targets.  0 Favorited0 Views0 Files0 Shares0 Downloads01/04/24, 12:02Endpoint Protection - Symantec Enterprise Pagina 2 di 5https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments Figure 1. Infection rates of Indian targetsIndian government org #2 is responsible for implementing network software for differentministries and departments within India's central government. The high infection rate for thistarget is likely because of its access to technology and information related to other Indiangovernment organizations.Suckﬂy's attacks on government organizations that provide information technology services toother government branches is not limited to India. It has conducted attacks on similarorganizations in Saudi Arabia, likely because of the access that those organizations have.Suckﬂy's targets are displayed in ﬁgure 2 by their industry, which provides a clearer view of thegroup’s operations. Most of the group's attacks are focused on government or technologyrelated companies and organizations. Figure 2. Suckﬂy victims, by industrySuckfly attack lifecycleOne of the attacks we investigated provided detailed insight into how Suckﬂy conducts itsoperations. In 2015, Suckﬂy conducted a multistage attack between April 22 and May 4 againstan e-commerce organization based in India. Similar to its other attacks, Suckﬂy used the Nidiranback door along with a number of hacktools to infect the victim's internal hosts. The tools andmalware used in this breach were also signed with stolen digital certiﬁcates. During this timethe following events took place:01/04/24, 12:02Endpoint Protection - Symantec Enterprise Pagina 3 di 5https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments Figure 3. Suckﬂy attack lifecycle1. Suckﬂy's ﬁrst step was to identify a user to target so the attackers could attempt theirinitial breach into the e-commerce company's internal network. We don't have hardevidence of how Suckﬂy obtained information on the targeted user, but we did ﬁnd alarge open-source presence on the initial target. The target's job function, corporate emailaddress, information on work related projects, and publicly accessible personal blog couldall be freely found online. 2. On April 22, 2015, Suckﬂy exploited a vulnerability on the targeted employee's operatingsystem (Windows) that allowed the attackers to bypass the User Account Control andinstall the Nidiran back door to provide access for their attack. While we know theattackers used a custom dropper to install the back door, we do not know the deliveryvector. Based on the amount of open-source information available on the target, it isfeasible that a spear-phishing email may have been used. 3. After the attackers successfully exploited the employee’s system, they gained access tothe e-commerce company's internal network. We found evidence that Suckﬂy usedhacktools to move latterly and escalate privileges. To do this the attackers used a signedcredential-dumping tool to obtain the victim's account credentials. With the accountcredentials, the attackers were able to access the victim's account and navigate theinternal corporate network as though they were the employee. 4. On April 27, the attackers scanned the corporate internal network for hosts with ports8080, 5900, and 40 open. Ports 8080 and 5900 are common ports used with legitimateprotocols, but can be abused by attackers when they are not secured. It isn't clear whythe attackers scanned for hosts with port 40 open because there isn't a common protocolassigned to this port. Based on Suckﬂy scanning for common ports, it’s clear that thegroup was looking to expand its foothold on the e-commerce company's internal network. 5. The attackers’ ﬁnal step was to exﬁltrate data off the victim’s network and onto Suckﬂy’sinfrastructure. While we know that the attackers used the Nidiran back door to stealinformation about the compromised organization, we do not know if Suckﬂy wassuccessful in stealing other information.These steps were taken over a 13-day period, but only on speciﬁc days. While tracking whatdays of the week Suckﬂy used its hacktools, we discovered that the group was only activeMonday through Friday. There was no activity from the group on weekends. We were able todetermine this because the attackers’ hacktools are command line driven and can provideinsight into when the operators are behind keyboards actively working. Figure 4 shows theattackers’ activity levels throughout the week.01/04/24, 12:02Endpoint Protection - Symantec Enterprise Pagina 4 di 5https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments Figure 4. Signed hacktools in use against targets, by dayThis activity supports our theory, mentioned in the previous Suckﬂy blog, that this is aprofessional organized group.Suckfly's command and control infrastructureSuckﬂy made its malware difficult to analyze to prevent their operations from being detected.However, we were able to successfully analyze Suckﬂy malware samples and extract some ofthe communications between the Nidiran back door and the Suckﬂy command and control(C&C) domains.We analyzed the dropper, which is an executable that contains the following three ﬁles:1. dllhost.exe: The main host for the .dll ﬁle2. iviewers.dll: Used to load encrypted payloads and then decrypt them3. msﬂed: The encrypted payloadAll three ﬁles are required for the malware to run correctly. Once the malware has beenexecuted, it checks to see if it has a connection to the internet before running. If the connectiontest is successful, the malware runs and attempts to communicate with the C&C domain overports 443 and 8443. In the samples we analyzed we found the port and C&C informationencrypted and hardcoded into the Nidiran malware itself. The Nidiran back door made thefollowing initial communication request to the Suckﬂy C&C domain:GET /gte_ok0/logon.php HTTP/1.1Accept: */*Accept-Encoding: gzip, deﬂateUser-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR1.1.4322; .NET CLR 2.0.50727; .NET CLR 3.0.04506.30; .NET CLR 3.0.4506.2152;.NET CLR 3.5.30729)Host: REDACTEDConnection: Keep-AliveCookie:dfe6=OIAXUNXWn9CBmFBqtwEEPLzwRGmbMoNR7C0nLcHYa+C1tb4fp7ydcZSmVZ1c4akergWcQQ==The interesting information being transmitted to the C&C server in the initial request is locatedin the cookie which is comprised of the following:[COOKIE NAME]=[RC4 ENCRYPTED + B64 ENCODED DATA FROM VICTIM]The key for the RC4 encryption in this sample is the hardcoded string “h0le”. Once the cookiedata is decoded, Suckﬂy has the network name, hostname, IP address, and the victim'soperating system information.Information about the C&C infrastructure identiﬁed in our analysis of Suckﬂy activity can beseen in Table 1.DomainRegistrationIP addressRegistration dateaux.robertstockdill[.]comkumar.pari@yandex[.]comUnknownApril 1, 2014ssl.2upgrades[.]comkumar.pari@yandex[.]com176.58.96.234July 5, 2014bss.pvtcdn[.]comregistrar@mail.zgsj[.]com106.184.1.38May 19, 2015ssl.microsoft-security-center[.]comWhoisguardUnknownJuly 20, 2015usv0503.iqservs-jp[.]comDomain@quicca[.]com133.242.134.121August 18, 2014ﬂi.fedora-dns-update[.]comWhoisguardUnknownUnknownTable. Suckﬂy C&C infrastructure information01/04/24, 12:02Endpoint Protection - Symantec Enterprise Pagina 5 di 5https://community.broadcom.com/symantecenterprise/communities/…Key=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocumentsConclusionSuckﬂy targeted one of India’s largest e-commerce companies, a major Indian shippingcompany, one of India’s largest ﬁnancial organizations, and an IT ﬁrm that provides support forIndia’s largest stock exchange. All of these targets are large corporations that play a major rolein India’s economy. By targeting all of these organizations together, Suckﬂy could have had amuch larger impact on India and its economy. While we don't know the motivations behind theattacks, the targeted commercial organizations, along with the targeted governmentorganizations, may point in this direction.Suckﬂy has the resources to develop malware, purchase infrastructure, and conduct targetedattacks for years while staying off the radar of security organizations. During this time theywere able to steal digital certiﬁcates from South Korean companies and launch attacks againstIndian and Saudi Arabian government organizations. There is no evidence that Suckﬂy gainedany beneﬁts from attacking the government organizations, but someone else may havebeneﬁted from these attacks.The nature of the Suckﬂy attacks suggests that it is unlikely that the threat group orchestratedthese attacks on their own. We believe that Suckﬂy will continue to target organizations in Indiaand similar organizations in other countries in order to provide economic insight to theorganization behind Suckﬂy's operations.ProtectionSymantec has the following detections in place to protect against Suckﬂy’s malware:AntivirusBackdoor.NidiranBackdoor.Nidiran!g1HacktoolExp.CVE-2014-6332Intrusion prevention systemWeb Attack: Microsoft OleAut32 RCE CVE-2014-6332Web Attack: Microsoft OleAut32 RCE CVE-2014-6332 2Web Attack: Microsoft OleAut32 RCE CVE-2014-6332 4Web Attack: OLEAUT32 CVE-2014-6332 3System Infected: Trojan.Backdoor Activity 120Tags and KeywordsRelated Entries and LinksNo Related Resource entered. PRODUCTSAPPLICATIONSSUPPORTCOMPANYHOW TO BUYCopyright   2005-2024 Broadcom. All Rights Reserved. The term \"Broadcom\" refers to Broadcom Inc. and/or its subsidiaries.Hosted by Higher Logic, LLC on the behalf of Broadcom - Privacy Policy | Cookie Policy | Supply Chain TransparencyTerms of Use"
}