{
    "title": "Kim Suki's organization begins watering hole 'Operation Low Kick'",
    "text": " -Kim Suki's organization begins watering hole 'Operation Low Kick'Malicious code analysis report 2019. 3. 21. 02:16 hello? This is East Security Security Response Center (ESRC).On March 20, 2019, it was discovered that multiple websites researching the policies ofpublic and private institutions in Korea and the website of a specific academic groupresearching North-South unification were hacked and an attempt was made to secretlydistribute malicious code.These websites are accessible only to people in the fields of diplomacy, security, andunification, or in North Korea-related research.by Alyac. 0  ESRC confirmed that malicious vulnerability code was inserted into the website, and doesnot rule out the possibility of similar threats occurring on other unidentified sites .■ Kimsuky APT Group, ‘Operation Low Kick ’ESRC confirmed that the breaches of these specific websites were not general cybercrimes, but intentional 'watering hole' attacks targeting people in specific fields whoaccessed the websites.This organization also carried out ‘ Operation Water Tank’ around May 2018 .※ What is a watering hole attack?It is a metaphor for the image of a carnivore, such as a lion, lying in ambush near a'watering hole' to attack herbivores that gather to drink water. It is a targeted attackaimed only at people accessing websites in a specific field. It means method. And it isone of the types of sophisticated cyber attacks carried out by government-backedattackers for the purpose of cyber intelligence and spy missions.It was confirmed that the exploit code identified on multiple websites and the finalpayload mostly matched, and the string code used by the attacker read \"I'm Low.\" I foundthe English notation:Using these keywords, we named this cyber operation (OPSEC) 'Operation Low Kick',and at the same time, we identified the command and control (C2) server and some of thecode used in the attack as the hacking organization that attacked Korea Hydro & NuclearPower in 2014. , it was confirmed that it exactly matches the so-called ‘Kimsuky’ threatindicator . ■ Combination of ‘CVE-2018-8174’ vulnerability and watering holeattackFirst of all, in the case of a research group related to North-South unification, the followingmalicious script can be confirmed to be inserted into the main website. [Figure 1] Malicious code screen inserted into the main website of a research grouprelated to North-South unificationCode that is almost identical to the malicious code inserted into this server has beenfound on multiple other websites, but since it uses a similar flow of attack vectors, I willonly explain one case.Visual Basic Script (VBS) code that has been obfuscated (JSUtility Obfuscated Code) isconverted to the following form through decryption and exploits the 'CVE-2018-8174'vulnerability. [Figure 2] Script exploiting ‘CVE-2018-8174’ vulnerabilityAfter executing the 'svchost.exe' process again using the shellcode command includedwithin VBS, it connects to a specific command control (C2) server.- mail.membercp.net/checkFrom this server, an encoded shellcode binary block disguised as a specific image file isdownloaded and executed. There are two images on the server, and they were the samefile at the time of analysis.If the file disguised as an image file is loaded normally, the decoded executable file moduleis injected into the 'userinit.exe' file, one of the system files. After successful injection, the running binary module communicates with another serverand processes the attacker's new commands.- korea.getenjoyment.netThe final malicious code attempts to steal information from document files such as '.hwp','.doc', and '.pdf' along with system information collection and keylogging functions. [Figure 3] Collection target document file screen■ Threat intelligence-based correlation similarity analysisWhen analyzing the malware used in this attack, the following communication parameterstring can be identified. - \"\\r\\n------WebKitFormBoundarywhpFxMBe19cSjFnG [Figure 4] String screen used by malicious codeThis parameter string used when communicating with the C2 server can be confirmedthrough the post titled 'Operation Kimsuky's covert activities, Korea-customized APTattacks are currently in progress' on February 12, 2018 . [Figure 5] Kim Suki-related pill blog screen in February 2018또 , 1차 명령제어(C2) 서버로 사용됐던 'mail.membercp.net' 도메인은 또 다른 피싱 사건에서 여러차례 목격된 바 있고, 이 공격들은 모두 김수키(Kimsuky) 유형으로 분류가 된 상태입니다.아래 화면은   의  북관련 단체에 시도된 피싱 공격으로 마치  메일 다음캐시 결제내역 안내처럼 위장하고 있습니다.만약, 해당 이메일을 수신  이용자가 본문에 포함된 [결제내역 상세보기] 버튼을 클릭하게 되면 얼핏보면  메일의 주소처럼 보이는 피싱 서버가 연결됩니다.- hanmail.membercp.net/itsme.daum? [그림 06]  메일 캐시 결제 내역으로 위장  피싱 이메일 화면이번 워터링 홀 공격에 사용된 'mail.membercp.net' 도메인과 지난 01월 발생  피싱 사이트의 도메인 'hanmail.membercp.net' 주소가 일부 다르게 보이기도 합니다.ESRC에서는 해당 도메인을 분석하던 과정에 'mail.membercp.net' 사이트로 접속 시도시 내부 설정에 의해 'hanmail.membercp.net' 주소로 리다이렉션(302 Found)되고 있는 것을 확인했고, 두개의 서버가 모두 동일  공격자에 의해 관리되고 있다는 것으로 결론내렸습니다. [그림 7] 'mail.membercp.net' 접속 응답 화면■ 마무리ESRC는  내 특정 웹 사이트를 해킹하여, 은밀하게 워터링 홀 기반의 APT 공격이 진행되고 있다는 것을확인했습니다.특히, 'CVE-2018-8174' 취약점이 쓰이고 있어, 이용자분들은 반드시 최신 업데이트 상태를 유지해 주셔야 유사  위협에 노출되는 것을 미연에 예방하실 수 있습니다.최근 '특정 정부의 후원을 받는 위협조직(State-Sponsored Cyber Actors)'의 활동이 눈에 띄게 증가하고 있습니다.스피어 피싱(Spear Phishing) 공격 뿐만 아니라, 워터링 홀 공격까지 전방위적인 위협을 가하고 있습니다.저희는 이번 워터링 홀 공격에    보다 상세  위협 인텔리전스 리포트를 '쓰렛 인사이드(ThreatInside)' 서비스를 통해 다시  번 제공할 예정에 있습니다. [김수키 관련 참고자료]2차 북미정상회담 좌담회 초청으로 수행된 최신 APT 공격, '작전명 라운드 테이블(OperationRound Table)' (2019. 02. 21)▶ https://blog.alyac.co.kr/2140일요일 수행된 APT 변종 공격, 오퍼레이션 페이크 캡슐(Operation Fake Capsule) 주의 (2019.01. 20)▶ https://blog.alyac.co.kr/2086통일부 기자단을 상 로   APT공격, '오퍼레이션 코브라 베놈(Operation Cobra Venom)' 주의(2019. 01. 07)▶ https://blog.alyac.co.kr/20662019년 북  신년사 평가로 위장  '오퍼레이션 엔케이 뉴이어(Operation NK New Year)' APT사이버 위협 등장 (2019. 01. 03)▶ https://blog.alyac.co.kr/2063    상 최신 APT 공격, 작전명 미스터리 베이비(Operation Mystery Baby) 주의! (2018. 11.02)▶ https://blog.alyac.co.kr/1963안보· 북 연구기관 등을 상 로   APT 공격, '작전명 물 탱크(Operation Water Tank)' (2018.05. 31)▶ https://blog.alyac.co.kr/1718판문점 선언 관련 내용의 문서로 수행된 '작전명 원제로(Operation Onezero)' APT 공격 분석(2018. 05. 28)▶ https://blog.alyac.co.kr/17102010년 해외  상 APT 공격자, 오퍼레이션 베이비 코인(Operation Baby Coin)으로    귀환(2018. 04. 19)▶ https://blog.alyac.co.kr/1640 #'오퍼레이션 로우 킥(Operation Low Kick) '#cve-2018-8174#Watering Hole#김수키(Kimsuky)#워터링 홀 고격더보기 댓글 0 개오퍼레이션 김수키(Kimsuky)의 은밀  활동,    맞춤형 APT 공격은 현재 진행형 (2018. 02. 12)▶ https://blog.alyac.co.kr/1536 태그 관련글북  백신 프로그램 사칭, '다크 평양(Operation Dark Pyongya…2019.03.23Trojan.Ransom.Clop 악성코드분석 보고서2019.03.22[주의] 새로운 헌법 재판소 소환장으로 사칭, 유포중인 갠드크랩 v…2019.03.20로켓맨 APT 캠페인, '오퍼레이션골든 버드(Operation Golden …2019.03.20구독하기9 이스트시큐리티 알약 블로그이스트시큐리티 공식 블로그입니다. 이스트시큐리티는 AI 기술을 활용  사이버 위협 인텔리전스의 선도 기업이 되겠습니다. 구독하기namepassword Leave a commentPlease enter a comment.비밀글 Operating policyEast Security websiteEast Security FacebookEast Security Co., Ltd. East Building, 3 Banpo-daero, Seocho-gu, Seoul 06711 CEO: Jeong Jin-il Business registration number 548-86-00471 Mail order business report number: 2017-Seoul Seocho-0134 ESTsecurity, ALL RIGHTS RESERVED.▲family site "
}