{
    "title": "Kimsuky organization, beware of ‘Blue Estimate Part3’ APT",
    "text": "01/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 1 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=it 21Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration filesMalicious code analysis report 2020. 2. 6. 23:38 hello? This is East Security ESRC (Security Response Center).On February 6, 2020, an APT (Advanced Persistent Threat) attack disguised as a PDFby Alyac. 0 CoreanoInglese01/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 2 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=itscan file of the actual resident registration certificate of a former ○○ Education Centerofficial appeared. The detection name of the malicious file is'Trojan.Dropper.1081856K' .This attack was confirmed to be the third variant of the ' Kim Suki organization, APTattack impersonating a quote for the Blue House Nokjiwon/Sangchunjae event ' thatwas disclosed on December 4, 2019 .【Operation Blue Estimate】 【Operation Blue Estimate Part2 (Operation Blue Estimate Part2)】 【Operation Blue Estimate Part3 (Operation Blue Estimate Part3)】 file name  Production date (timestamp)  MD5 Vietnam Green GardenSangchunjae EventEstimate.hwp (including manyspaces) .exe 2019-12-02 18:01:05 (KST) 35d60d2723c649c97b414b3cb701df1c  file name  Production date (timestamp)  MD5 Ohseongsa MC2-500 exteriordiagram P1307033Model_Modified.pdf (includingmany spaces) .exe 2020-01-17 10:33:41 (KST) da799d16aed24cf4f8ec62d5048afd1a  file name  Production date (timestamp)  MD5 Resident registration copy.pdf(including many spaces) .scr 2020-02-06 15:27:36 (KST) 20add5eb5fbe527a8b6090a08e7636a601/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 3 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=it【Operation Blue Estimate Part4 (Operation Blue Estimate Part4)】 While the Blue Estimate campaign continues, the variant produced on February 6, 2020actually shows a screen of a specific person's resident registration certificate issuedonline.Malicious files disguised with double extensions, like PDF documents, are executedidentically to EXE executable files through the actual screen saver (SCR) extension.Then, create and load the ‘Resident Registration Copy.tif’ image file included in theinternal resources.The resident registration table shown actually contains personal information thatappears to be related to former ○○ Education Center officials. file name  Production date (timestamp)  MD5 letter of indemnity (newversion).pdf (including manyspaces) .exe 2020-02-13 14:58:31 (KST) cf87475a87cb2172e73ee6afa7eb638401/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 4 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=it [Figure 1] Resident registration copy image screen displayed after a malicious file is01/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 5 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=itexecutedThe malicious file 'Resident registration copy.pdf (including many spaces) .scr' has thefollowing resource (BINARY) area inside, and the resource name is the same as in theexisting Blue Estimate campaign.And when the malicious file was created, you can see that it was created based onKorean.The '103' area contains image files, and the '104' area contains 64-bit malicious DLLfiles. [Figure 2] Malicious file internal resource screenSince this host file creates and runs a 64-bit DLL file with the name 'Hero.dll' , thefollowing error window may occur when run on a 32-bit operating system. 01/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 6 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=it[Figure 3] Error message screen that appears when running on a 32-bit Windows OSThe malicious file uses the 'HelloSidney' mutex value, which is the same as 'OseongsaMC2-500 Appearance P1307033 Model_Modified.pdf (including many spaces) .exe' . [Figure 4] Mutex creation screenThe payload of similar operations in the past is different for each operation.Characteristically, there are differences in C&C, strings, and function methods, but the'MAC address and serial information collection' function shows a common code.01/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 7 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=it  Fake Capsule(AlyacMonitor.db)Blue Estimate(NewACt.dat)Blue Estimate 2(Hero.dll)01/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 8 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=itMD566B73FBA4E47B3184EDD75B0CE9CF928E54B370D96CA0E2ECC083C2D42F05210C315DE8AC15B51163A3BC075063A58AATime-Stamp2019.01.06 14:55:36 UTC2019/11/19 07:15:57 UTC2020/01/07 01:38:25 UTCExport Function NameCheckFilecheckdrive-PDB Path--E:\\works\\utopia\\Utopia_v0.2\\bin\\AppleSeed64.pdbMutexAlyacMonThe glory of PapuaHelloSidneyC&C (C2)safe-naver-mail.pe.huantichrist.or.krHappy-New-Year.esy.esBoundaryboundary=---------------44cdd22e90fboundary=-------------223de5564f====19d953e4Injection Processexplorer.exeexplorer.exeexplorer.exeRegistry Autoruns NameAlyac UpdatelyricIEAutoUpdateC&C address load methodLoad hardcoded C&C address from 'AlyacMonitor.db_ini'Hardcoded inside malwareWhen running with regsvr32.exe, load the C&C address encoded in the argument value.C&C connection methodInside the payload(Windows API)Inside the payload(Windows API)Drop and run JavaScriptOS information collection functionOXOMac address, serial information collection functionOOOSecondary payload ﬁle nameSpecifying payload ﬁle names in C&C commandsLyric.datSway.dat[User Mac address]_[Year-Month-Day_Hour_Minute_Second_Millisecond]01/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 9 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=itmain command control function1) C&C changes2) Downloader3) Self-delete4) Execute cmd command1) Downloader2) Self-delete1) Downloader2) Uploader3) Execute cmd command* Comparative analysis data for Threat Inside threat intelligence report (https://www.threatinside.com/ )In this ' Operation Blue Estimate Part3' , 'Hero.dll' and 'HelloSidney' have the samecommon features, but PDB has been removed and C2 has been changed to'mernberinfo.tech (213.190.6.159)' address.  It is done. [Figure 5] C2 communication packet screenESRC believes that the 'Kimsuky' organization is behind this APT attack, and moredetailed analysis will be provided separately in the threat intelligence report of ' ThreatInside ' in the future.01/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 10 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=it#Kimsuky#mernberinfo.tech#Operation Blue Estimate#Souki Kim#Operation Blue Estimate#ID cardsee more 0 comments tag Related postsBeware of ‘issue celebrity’ Naver phishing posts being …ploaded to many cafes!!2020.02.11Malicious emails exploiting the new coronavirus issue …e introduced into the country.2020.02.07Beware of smishing aimed at Koreans disguised as “I…ortant Notice”2020.02.03Beware of Emotet malwarebeing distributed through …mails threatening to steal user data!2020.01.29Subscribe2101/04/24, 14:46Kimsuky organization, beware of ‘Blue Estimate Part3’ APT attacks disguised as actual resident registration files Pagina 11 di 11https://blog-alyac-co-kr.translate.goog/2737?_x_tr_sl=auto&_x_tr_tl=it&_x_tr_hl=itEast Security Pill BlogThis is East Security’s official blog. East Security will become a leading company incyber threat intelligence using AI technology.Subscribenamepassword Leave a commentPlease enter a comment.secret message Operating policyEast Security websiteEast Security FacebookEast Security Co. , Ltd. East Building, 3 Banpo-daero, Seocho-gu, Seoul 06711 CEO: Jeong Jin-il Business registrationnumber 548-86-00471 Mail order business report number: 2017-Seoul Seocho-0134⃆ ESTsecurity, ALL RIGHTS RESERVED.▲family site"
}