{
    "title": "Leviathan, Espionage Actor Targets Defense & Government",
    "text": "01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 1 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targetsSHARE WITH YOUR NETWORK!SHARE WITH YOUR NETWORK!SHARE WITH YOUR NETWORK!SHARE WITH YOUR NETWORK!/Blog/Threat Insight/Leviathan: Espionage actor spearphishes maritime and defense targets OCTOBER 16, 2017 | AXEL F, PIERRE TOverviewProofpoint researchers are tracking an espionage actor targeting organizations and high-value targets in defense and government. Active since at least 2014, this actor has long-standing interest in maritime industries, naval defense contractors, and associated researchinstitutions in the United States and Western Europe.Key takeaways from this research include: Industry targeting: The actor targets defense contractors, universities (particularly thosewith military research ties), legal organizations [3] and government agencies [3]. Theactor has particular interest in naval industries including shipbuilding and relatedresearch•Geographical targeting: Targeting includes United States, Western Europe, and SouthChina Sea•Tools: Custom JavaScript malware known as “Orz” and “NanHaiShu”, Cobalt Strike, the•Leviathan: Espionage actorspearphishes maritime anddefense targets ProductsSolutionsPartnersResourcesCompanyLOGIN01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 2 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targetsThis blog traces key activities connected to this actor and examines a number of their toolsand techniques. Campaigns and details are presented in reverse chronological order tohighlight the group’s most recent activities.Delivery and ExploitationSeptember 2017On September 15 and 19, 2017, Proofpoint detected and blocked spearphishing emails fromthis group targeting a US shipbuilding company and a US university research center withmilitary ties. Example emails used the subject “Apply for internship position” and containedan attachment “resume.rtf”. Another attachment, “ARLUAS_FieldLog_2017-08-21.doc”contained a “Torpedo recovery experiment” lure. The attachments exploited CVE-2017-8759which was discovered and documented only ﬁve days prior to the campaign [1].SeDll JavaScript loader, and MockDll dll loaderDelivery: Emailed attachments and URLs, often employing a fraudulent lookalikedomain and stolen branding•Exploitation: Microsoft Excel and Word documents with macros (sometimes password-protected), very recent vulnerabilities such as CVE-2017-0199 and CVE-2017-8759,and malicious Microsoft Publisher ﬁles•Installation: JavaScript, JavaScript Scriptlets in XML, HTA, PowerShell, WMI, regsvr32,Squiblydoo•Lateral Movement: The actor sometimes utilizes access at one compromisedorganization to attack the next. For example, compromised email accounts at oneorganization were used to send the next wave of malicious attachments to potentialvictims in the same industry. Similarly the actor attempts to compromise servers withinvictim organizations and use them for command and control (C&C) for their malware.•01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 3 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets Figure 1: Example attachment resume.rtf from September 2017 campaignAugust 2017Between August 2 and 4, the actor sent targeted spearphishing emails containing maliciousURLs linking to documents to multiple defense contractors. Some of this activity wasdocumented and observed by a fellow researcher [2]. Many of the documents, C&Cdomains, and payload domains abused the brand of a major provider of ships, submarines,and other vessels with military applications. Some of the documents exploited CVE-2017-0199 to deliver the payload. Figure 2: One of the documents involved in the campaign used Microsoft licensing lurespurporting to be from a well-known shipbuilder (sha256:6f6ee01e9dc2d8c4c260ef4131fe88dc152e53ee8afd3e66e92d4e1bf5fd2e92).01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 4 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targetsOther documents were Microsoft Publisher ﬁles that relied on social engineering. Thepotential victims were lured into starting an embedded PowerPoint presentation, moving themouse to trigger execution of an embedded JavaScript [5], and then pressing “Enable” in awarning dialog to cause the payload download. The Publisher ﬁles were poorly crafted, reliedon multiple user interactions, and contained multiple grammatical and typographic errors. Figure 3: Publisher document delivered via a link in email is in Italian, and is a simple reuseof a student’s work.February 2015From February to October of 2015, our colleagues at F-Secure and McAfee reported oncampaigns [3][4] by this actor targeting South China Sea interests. During this time, thegroup utilized Microsoft Excel and Word documents with macros to target the PhilippinesDepartment of Justice, APEC organizers, and an international law ﬁrm. Targeting of thesecompanies is different from that which we typically observe for this actor; however it stillcenters around marine and naval issues as related to South China sea politics.01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 5 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets Figure 4: Example attachment “DOJ Staff bonus  January 13, 2015.xls”. Similar to thisdocument attachment, most of the attachments in this campaign did not contain meaningfulcontentNovember 2014The period between November 2014 and January 2015 marked one of the earlier instancesin which Proofpoint observed persistent exploitation attempts by this actor. The actorgenerally emailed Microsoft Excel documents with malicious macros to US universities withmilitary interests, most frequently related to the Navy. The actor also occasionally usedmacro-laden Microsoft Word documents to target other US research and developmentorganizations with military and intelligence ties during this period.Emails were often very simple with a greeting and an attachment. On other occasions, itappears that the attackers used highly topical lures based on current events or legitimatedocuments stolen from previous victims. Lure topics included symposia, the Navy, IT, andrelevant research.01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 6 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets Figure 5: Example Excel attachment “2014 Accomplishments Input Template.xls”InstallationThe actor continues to: Example 1: Resume.rtfThe “resume.rtf” ﬁle from the September 19, 2017 attack retrieves the malicious SOAPWSDL deﬁnition named “readme.txt “ using an anonymous FTP logon to the attacker’sserver.Innovate and modify the code that accomplishes the installation, while the backdoorcode remains more static•Use scripting languages such as JavaScript, JavaScript Scriptlets, VBScript, and XML•Use simple obfuscation such as base64, gzip compression, and insertion of garbagecharacters•Split functionality of the backdoor & code that establishes persistence for the backdoorinto separate ﬁles and scripts•01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 7 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets Figure 6: SOAP WSDL deﬁnition (“readme.txt “)This deﬁnition in turn downloads a VBScript favicon.ico ﬁle, which then creates and runs twoJavaScript ﬁles in the %TMP% directory: Figure 7: Code snipped showing VBScript dropping 2 JavaScript ﬁlesThe job of the smaller of the two JavaScripts is to establish a system autostart mechanism. Itaccomplishes this by deobfuscating another script, link.js, into %TMP%. Link.js in turncreates a shortcut  ﬁle \"Java(TM) Platform SE Auto Updater.lnk\" in the \"Startup\" specialfolder pointing to the main backdoor JavaScript. Figure 8: Code for establishing persistence after reboot (autostart mechanism)The job of the larger of the two JavaScripts is to download and execute the Cobalt Strikepayload. It accomplishes this by writing more code to rWug5n0PHUFjDFyb8k.js in the01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 8 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targetstemporary directory, which then runs a PowerShell command (obfuscated using garbagecharacters, base64 encoding, and Gzip compression). The PowerShell is a default CobaltStrike downloader. Figure 9: PowerShell code downloading Cobalt StrikeExample 2: Malicious Microsoft Publisher documentThe malicious script executed by the Microsoft Publisher ﬁle downloads and runs yet anotherJavaScript ﬁle, 0.js, hosted on the attacker-controlled server: Figure 10: Malicious script executed by the Microsoft Publisher ﬁle (sha256:305f331bfb1e97028f8c92cbcb1dff2741dcddacc76843e65f9b1ec5a66f52bc)Similar to the previous example (resume.rtf), the 0.js handles the system autostartmechanism via a shortcut ﬁle \"ofﬁce 365.lnk\" in the \"Startup\" special folder. However, the01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 9 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targetsshortcut abuses the “Squiblydoo” technique [6]. Moreover, the backdoor is not run directlybut via an intermediary SeDll (see below).0.js also downloads two additional ﬁles from the C&C server (green.ddd and green.tmp) Theﬁrst of these ﬁles, green.ddd, is an executable ﬁle internally named “SEDll_Win32.dll”. This isa known backdoor used by this actor since 2014 for the same purpose: decrypting andexecuting the ﬁnal JavaScript backdoor “Orz”.ToolsNanHaiShuWe have observed variants of this JavaScript backdoor used in various campaigns, includingthose publically reported. The actor continues to improve and reﬁne the malware by, forexample, wrapping it inside an HTA wrapper. Several good descriptions are available  inanalyses from fellow researchers [3][4]. Basic functionality includes: Figure 11: Screenshot from 2015 version of the malware dropped by “DOJ Staff bonusJanuary 13, 2015.xls”Information gathering (computer name, user name, serial number, proxy server)•Downloading from URL•Executing other JavaScript•Registry, system, process, directory, ﬁle operations•SafeIE (change IE settings to reduce warnings about about malware activity)•01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 10 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targetsOrzWe observed this backdoor in an August 2017 campaign dropped by the Microsoft Publisherﬁles, as well as much earlier in 2014. We named it due to a variable name “orz”, which ischanged to “core” in the more recent version. The actor consistently tweaks and improvesthis backdoor as well. The backdoor is a fairly involved script malware. Its functionalityincludes: Figure 12: Snippet of the Orz backdoor code delivered by the the Microsoft PublisherInformation gathering (IE version, OS version, OS 64-bit/32-bit, etc)•Overwriting registry settings to reduce malware visibility on system•Download ﬁle•Upload ﬁle•Execute a command with cscript•Execute JavaScript•Execute shell command•Execute a dll (via an embedded ‘MockDll')•Get proxy info•Get process list•Terminate process•Get drive info•GET request to a URL•POST request to a URL•01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 11 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targetsdocument. The URL domain is a fraudulent lookalike domain.There is an extensive conﬁguration section at the top of the script. The \"jmpUrlList\" providesthe initial C&C servers, which are used to determine the secondary C&C server as well asadditional commands to execute. It is worth noting that the secondary C&C may be the sameas the ﬁrst. We have observed attacker-controlled web servers, compromised victim webservers, and Technet and Pastebin web pages used for the initial C&C.The initial C&C response is parsed with a regex. The backdoor ﬁrst looks for the secondaryencoded C&C server using the \"jmpRegex\" regex. Next, the backdoor looks for additionalcode to execute using the \"codeRegex\" regex. For additional code, we observed simple codeblocks that provide a different upload/download functionality. Figure 13: The encoded response \"vcmQx3ELgTyTyOVSvsm7wrBKwraFw8VFwCuL\" in theimage above decodes to \"hxxp://www.vitaminmain[.]info\" which is the secondary C&C serverfor an older backdoor variant (Decoder provided in Appendix).MockDllSome versions of the Orz backdoor have 32- and 64-bit embedded DLLs, stored internallyas base64 strings. Their purpose is to simply run another binary. These are used as loadersfor future executable payloads, using the well-known process hollowing technique. To usethe MockDll, the backdoor creates a conﬁguration .ini ﬁle like that shown in Figure 14:01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 12 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets Figure 14: MockDll conﬁguration ﬁlemock: defaults to 'regsvr32'real: the dll, which is the ultimate goal to executeargs: arguments to the dll that will be executed, if anyoutf: ﬁle in which to write results of the MockDll runtime: timeout defaults to 5After the conﬁguration ﬁle is created, the MockDll is executed with regsvr32. MockDll readsthe mentioned .ini conﬁg ﬁle to determine what to execute. It can log its execution results intoa ﬁle speciﬁed by the “outf” parameter, as shown in Figure 15: Figure 15: Contents of the log ﬁle created by MockDllSeDllThis DLL is used for decrypting and executing another JavaScript backdoor such as Orz.The DLL is registered by the installer using regsvr32. The DllRegisterServer export is thencalled, which performs checks on the commandline parameter. If the string “DR” is passedas an argument, or if the DLL is running in the active session with a username that is not“system”, the ﬁnal JavaScript backdoor is decoded using a custom base64 alphabet. Thisbackdoor has to be present in the same directory as the dll, with a “.tmp” ﬁle extension. Thebackdoor script is then executed using the IActiveScript and IActiveScriptParse32 COMinterfaces.01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 13 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets Figure 16: Decoding and executing of the JavaScript backdoorIf those conditions are not met, it runs the following command line “\"regsvr32 /s \\\"%s\\\" DR__CIM__\"” to register the DLL, where %s is the path to the DLL. It tries to do this with thecurrent user privileges, but if the privileges cannot be adjusted it defaults to the availableexecution environment.Cobalt StrikeThis is a penetration testing tool. The attackers often abuse the free trial version.ConclusionThis actor, whose espionage activities primarily focus on targets in the US and WesternEurope with military ties, has been active since at least 2014. The tools, techniques, andtargets consistently connect their work, particular given their attention to naval and maritimedefense interests and use of custom backdoors. While defense contractors and academicresearch centers with military ties should always be cognizant of the potential forcyberattacks, organizations ﬁtting their targeting proﬁles should be especially wary oflegitimate-looking but unsolicited emails from outside entities. Appropriate layered defensesat the ﬁrewall, email gateway, and endpoint can all help prevent the kinds of lateralmovement we have observed with this actor, as well as the compromise and abuse ofsystems via which this group expands its attack surface to other organizations.References[1] https://www.ﬁreeye.com/blog/threat-research/2017/09/zero-day-used-to-distribute-ﬁnspy.html[2] https://twitter.com/James_inthe_box/status/893525493059788800[3] https://labsblog.f-secure.com/2016/08/04/nanhaishu-rating-the-south-china-sea/01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 14 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets[4] https://community.spiceworks.com/topic/1028936-stealthy-cyberespionage-campaign-attacks-with-social-engineering[5] http://blog.trendmicro.com/trendlabs-security-intelligence/mouseover-otlard-gootkit/[6] https://www.carbonblack.com/2016/04/28/threat-advisory-squiblydoo-continues-trend-of-attackers-using-native-os-tools-to-live-off-the-land/Indicators of Compromise (IOCs)IOCIOC TypeDescriptioncdf6e2e928a89cbb857e688055a25e37a8d8b8b90530bd52c8548fb544f66f1fSHA256Resume.rtf exploiting CVE-2017-8759 (Sep 19, 2017)c7fa6f27ec4f4142ae591f2dd7c63d046431945f03c87dbed88d79f55180a46dSHA256ARLUAS_FieldLog_2017-08-21.doc exploiting CVE-2017-8759 (Sep 19, 2017)ftp://185.106.120[.]206/pub/readme.txtURLResume.rtf downloadingscripts (Sep 19, 2017)hxxp://185.106.120[.]206/favicon.ico URLResume.rtf downloadingscripts (Sep 19, 2017)39c952c7e14b6be5a9cb1be3f05eafa22e1115806e927f4e2dc85d609bc0eb36SHA256Favicon.ico (Sep 19, 2017)5860ddc428ffa900258207e9c385f843a3472f2fbf252d2f6357d458646cf362SHA256Cobalt Strike (Sep 19,2017)ced7ca9625543d3d3d09f70223cc19f0d99e21792854452df5ba84b3a59d17b8SHA25620170720_ﬁnal_pm_app-2.doc (August2017)Document hash(August 2017)305f331bfb1e97028f8c92cbcb1dff2741dcddacc76843e65f9b1ec5a66f52bcSHA256Publisher hash (August2017)bfc5c6817ff2cc4f3cd40f649e10cc9ae1e52139f35fdddbd32cb4d221368922SHA256MockDll 32-bit (August2017)80b931ab1798d7d8a8d63411861cee07e31bb9a68f595f579e11d3817cfc4acaSHA256MockDll 32-bit (August2017)146aa9a0ec013aa5bdba9ea9d29f59d48d43bc17c6a20b74bb8c521dbb5bc6f4SHA256green.ddd SeDll (August2017)01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 15 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets4029b43c7febd05e8bf013c1022244aaa238341ca44bbce2250667614c1a4932SHA2562014 AccomplishmentsInput Template.xls(December 2014)hxxp://www.vitaminmain[.]infoURLOrz secondary C2(December 2014) ET and ETPRO Suricata/Snort Coverage2024192 | ET EXPLOIT Possible CVE-2017-0199 HTA Inbound2024196 | ET WEB_CLIENT HTA File containing Wscript.Shell Call - Potential CVE-2017-01992022520 | ET POLICY Possible HTA Application Download2024197 | ET CURRENT_EVENTS SUSPICIOUS MSXMLHTTP DL of HTA (Observed inCVE-2017-0199)2024449 | ET CURRENT_EVENTS SUSPICIOUS Possible CVE-2017-0199IE7/NoCookie/Referer HTA dl2814013 | ETPRO TROJAN Meterpreter or Other Reverse Shell SSL Cert2023629 |  ET INFO Suspicious Empty SSL Certiﬁcate - Observed in Cobalt Strike2810628 | ETPRO TROJAN JavaScript Backdoor CnC Beacon M2 (b64 3)2828317 | ETPRO TROJAN Orz JavaScript Backdoor Communicating with CnC2828316 | ETPRO TROJAN Orz JavaScript Backdoor Sending Password to CnC Appendix: Orz Trafﬁc Decodervar _keyStr =\"oMZF/W42VkcCbqOiPSajhnKtQws8NRAxr16XJpu=0mgE3THGLlvz9+5BDYd7feyUI\";function decode (input) {                        var output = \"\";                        var chr1, chr2, chr3;01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 16 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets                        var enc1, enc2, enc3, enc4;                        var i = 0;                        input = input.replace(/[^A-Za-z0-9\\+\\/\\=]/g, \"\");                        while (i < input.length) {                                    enc1 = this._keyStr.indexOf(input.charAt(i++));                                    enc2 = this._keyStr.indexOf(input.charAt(i++));                                    enc3 = this._keyStr.indexOf(input.charAt(i++));                                    enc4 = this._keyStr.indexOf(input.charAt(i++));                                    chr1 = (enc1 << 2) | (enc2 >> 4);                                    chr2 = ((enc2 & 15) << 4) | (enc3 >> 2);                                    chr3 = ((enc3 & 3) << 6) | enc4;                                    output = output + String.fromCharCode(chr1);                                    if (enc3 != 64) {                                                output = output + String.fromCharCode(chr2);                                    }                                    if (enc4 != 64) {                                                output = output + String.fromCharCode(chr3);                                    }                        }                        output = this._utf8_decode(output);                        return output;            }function _utf8_decode (utftext) {01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 17 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets                        var string = \"\";                        var i = 0;                        var c = c1 = c2 = 0;                        while ( i < utftext.length ) {                                    c = utftext.charCodeAt(i);                                    if (c < 128) {                                                string += String.fromCharCode(c);                                                i++;                                    } else if((c > 191) && (c < 224)) {                                                c2 = utftext.charCodeAt(i+1);                                                string += String.fromCharCode(((c & 31) << 6) | (c2 & 63));                                                i += 2;                                    } else {                                                c2 = utftext.charCodeAt(i+1);                                                c3 = utftext.charCodeAt(i+2);                                                string += String.fromCharCode(((c & 15) << 12) | ((c2 & 63) <<6) | (c3 & 63));                                                i += 3;                                    }                        }                        return string;            }var decodeme =\"s2S9NF0GCBRBRvY9s2pzN5nHsBk+N2oT8KWvsKYpNBpzR4nTNvYGNuNdOFoDbZeTQtkm8unzAtq9wK+zCLII\"01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 18 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targetsAboutAboutAboutAboutThreat CenterThreat CenterThreat CenterThreat CenterProductsProductsProductsProductsResourcesResourcesResourcesResourcesConnectConnectConnectConnect SupportSupportSupportSupportvar res = decode(decodeme);document.write(res);Previous Blog PostNext Blog PostSubscribe to theProofpoint Blog  Business Email *Submit OverviewWhy ProofpointCareersLeadership TeamNews CenterNexus PlatformPrivacy and TrustThreat HubCybersecurityAwareness HubRansomware HubThreat GlossaryThreat BlogEmail Security &ProtectionAdvanced ThreatProtectionSecurityAwarenessTrainingCloud SecurityArchive &ComplianceInformationProtectionProduct BundlesWhite PapersWebinarsData SheetsEventsCustomer StoriesBlogFree Trial+1-408-517-+1-408-517-+1-408-517-+1-408-517-4710471047104710Contact UsOfﬁce LocationsRequest aDemoSupport LoginSupportServicesIP AddressBlocked?01/04/24, 15:22Leviathan: Espionage Actor Targets Defense & Government | Proofpoint US Pagina 19 di 19https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targetsFacebook Twitter linkedin Youtube  2024. All rights reserved. Terms and conditions Privacy Policy Sitemap     1"
}