{
    "title": "new insights into energetic bear_u2019s cyber attacks on turkish critical infrastructure",
    "text": "log New Insights into nergetic ear’s Watering Hole Cer Attacks on Turkish Critical Infrastructure Novemer 2, 2017 , Yonathan Klijnsma On Octoer 20th U-CRT pulished an alert (TA-17-293A)  with information aout the activities of an APT targeting the critical infrastructure sector. The report contains an extensive set of indicators with detailed context and information around them. Part of the Russian sphere of influence, the threat group discussed in the U-CRT report is the perpetrator of documented cer espionage attacks  around the world, man of which target industrial and manufacturing firms and critical infrastructure. Known  man names, the group is most prominentl known as ‘ nergetic ear ’ and ‘Crouching Yeti.’ Detailed analsis of nergetic ear’s malware and activities was recentl done  Kaspersk , and RiskIQ initiall investigated them earlier this ear. Through our we crawling network, we were ale to determine that a wesite elonging to a Turkish energ compan was eing used in a watering hole attack targeting people associated with Turkish critical infrastructure. Compromised via a suppl chain attack, the site was injected with M credential-harvesting malware. RiskIQ then linked the malicious infrastructure to a string of related Turkish sites that were compromised for the same purpose and traced the attack ack to a likel timeframe in which it egan. Watering hole attacks, especiall those involving suppl chain compromises, have een an extremel effective method  for operators of cer espionage campaigns ecause the target victims of specific groups, organizations, and regions, and with close ut tumultuous relations etween Turke and the Russian Federation, Turke is not a surprising target for nergetic ear. We shared our findings with law enforcement and national CRT partners, ut now that the indicators have ecome pulic per U-CRT’s pulication, we want to give our unique point of view on the threat. trategical Compromise for Reconnaissance Part of nergetic ear’s campaign involved strategical we compromises that give them exposure to specific targets. For example, prior activities from the group include compromising software suppliers for programmale logic controller (PLC) components used in critical infrastructure and ackdooring them with the Havex malware . In the case of the campaign descried in the U-CRT report, the group compromised the wesite of Turcas Petrol, a Turkish energ compan, located at turcas.com.tr. Fig-1 turcas.com.tr In Ma 2017, during one of our crawls of Turcas’ wesite, RiskIQ encountered a watering hole setup in use  nergetic ear. In the screenshot of the wesite aove, ou can see four top elements: ‘Join the Turcas nerg Famil,’ ‘Announcements,’ ‘Compan News,’ and ‘Tv interviews.’ These separate elements are structured as iframes to other pages on the wesite as shown in the DOM capture elow: Fig-2 DOM capture showing the modified susection However, the iframe’d page for the ‘Announcements’ susection was modified  nergetic ear operators to contain a small addition in the form of an image inclusion: Fig-3 Malicious image inclusion The image URL redirects to a link using the file://  scheme, which forces the connection through the file protocol, which then allows the group to harvest Microsoft M credentials. This ehavior was also noted  Talos, which wrote a detailed analsis of the spear-phishing emails  elonging to the same campaign as this watering hole attack. It’s interesting to note that the ack-end server used in the attack seems to e written using the Tornadoerver Pthon framework  used for uilding we and networking applications: Fig-4 Response headers showing the ack-end server In the case of Turcas Petrol, elow is the entire chain of events we oserved during the crawl: Fig-5 The entire chain of events oserved  RiskIQ In and of itself, this compromise seems targeted at Turcas Petrol and those with a close relationship with the usiness, a tactic that mirrors other nergetic ear campaigns. ssentiall, the group’s goal is to influence areas of interest to the Russian Federation. What we’d like to show, which seems to e missing from the U-CRT report, is the entire chain of events for this attack.  RiskIQ found that the M credential harvesting host at 184.154.150.66  is not alwas directl included on the wesites. Instead, the intermediar host at 103.41.177.58  is usuall present on the we pages, which, in turn, redirect visitors—most likel with some filtering to avoid unwanted traffic —to the M harvesting host. Additionall, the URL format of the file requested, which in this case was turcas_icon.png , is not related to the referring wesite. Instead, nergetic ear seems to use a form of tagging to correlate an possile victims and their source wesite. The format we oserved is <tag>_icon.png  and <tag>.png . trategical Compromise for road Targeting The previous example of the Turcas Petrol wesite compromise showed specific targeting. While compan-specific wesites were compromised in this campaign, ‘general purpose’ wesites were also amongst the victims. One such site is plantengineering.com  which serves as an information and news hu for the critical infrastructure sector. Fig-6 Another compromised wesite linked to the attack For a few months in earl 2017, this wesite had one of its resources compromised, likel meaning that nergetic ear operators had road access to the server. On the main page of the wesite, a resource loads from /tpo3conf/ext/t3s_jslidernews/res/js/jquer.easing.js  as seen in our crawl: Fig-7 Compromised resource The compromised resource is a modified version of jQuer asing  Javacript lirar. At the ottom of the script, we can find the M credential harvesting link, which is emedded as an image element in the main page’s DOM: Fig-8 M credential harvesting link When we go through more of our data for this ver simplified direct image inclusion, we find a pattern in the URLs and wesites. Here are three of our hits: http://www.plantengineering.com/tpo3conf/ext/t3s_jslidernews/res/js/jquer.easing.js http://www.csemag.com/tpo3conf/ext/t3s_jslidernews/res/js/jquer.easing.js http://www.controleng.com/tpo3conf/ext/t3s_jslidernews/res/js/jquer.easing.js All three URLs are the same, as is the injected content. All the affected wesites are news and information wesites for the industrial sector, which indicates a definite pattern. o, who owns these wesites? Looking at the WHOI information in PassiveTotal we find plantengineering.com  is owned  CF Media LLC : Fig-9 WHOI record for affected sites Reading a it further, we find the email address srourke@cfemedia.com  was used to register the domain. Pivoting off this address we can see the same pattern that we saw with the URLs: Fig-10 Other affected sites From our data, RiskIQ found that controleng.com , plantengineering.com , and csemag.com  were all affected  the injection from nergetic ear. ecause the’re geared toward engineers working in the critical infrastructure sector and thus prime targets for this watering hole attack, the odds are that CF Media’s other wesites were affected. In fact, CF Media has at least six confirmed rands that pulish news and information: Fig-11 rands affected  the nergetic ear campaign ecause we started seeing nergetic ear’s M-harvesting injection at the end of March and our crawl data from the end of Januar was still clean, RiskIQ has een ale to pinpoint the start of the campaign to etween the eginning of Feruar and the end March. Conclusion: Don’t Feed the ear Over the past few ears,  suppl-chain attacks are ecoming more and more prevalent in the attacker’s portfolio. Javacript can e changed and compromised without the knowledge of the site owner, finding its wa onto a site when pulic code was modified downstream. To prevent this, site owners must have an understanding of what elongs to their organization, how it’s connected to the rest of their asset inventor, including inventoring all the third-part code running on their we assets so the can avoid eing a pawn  operators like nergetic ear. igning up for RiskIQ Communit dition  now gives ou access to one of the most popular RiskIQ products–Digital Footprint. When ou sign up or sign in with our organizational email address, ou get a glimpse into our organization’s attack surface. To track the full list of IOCs related to this campaign, visit the RiskIQ Communit Pulic Project . hare: Return to log Home → RiskIQ Retweeted Twitter  Twitter  Twitter  Twitter  Twitter  RiskIQ RiskIQ is the leader in attack surface management. We help organizations discover, understand, and mitigate exposures across all digital channels.ARCH CATGORI xternal Threat Management (243) Las (88) Analst (81) Magecart (21) Interesting Crawls (6) CONNCT WITH U         FATURD POT   Full(z) House: A Digital Crime Group Using a Full Deck to Maximize Profits Novemer 26, 2019 , Yonathan Klijnsma Tweets   @riskiq alesTechtar @alesTechtar · 21h Jenna Ra, enior Vice President Of New Markets At RiskIQ share her insights and tips on nterprise ales while talking aout the asic fundamentals that have alwas helped her. https://it.l/2UkX5R #alestech #Tech #ales RiskIQ @RiskIQ ·13h RiskIQ's #COVID19 Dail Update for 3/19:  ➡ U.. tate Dept. to issue Level 4 travel advisor ➡ Red Cross issues urgent call for lood donations ➡ Two U.. Congressmen test positive ➡ U.. warns pandemic could last 18 months Read the full update here: https://it.l/2xdcxus RiskIQ @RiskIQ ·18h taff working from home have made digital attack surfaces more complex overnight. Meanwhile, cerattacks using the #COVID19 outreak run rampant. As a communit, we need to work together to defend our organizations. Here's what RiskIQ is doing to help: https://it.l/394qt70 RiskIQ @RiskIQ ·20h Want to rush up on our #ThreatHunting and learn new skills while social distancing? RiskIQ has ou covered. We pulished our Threat Hunting Workshop training on YouTue in a modular format! Methodologies and Process: https://it.l/2QsVLk  Data ets: https://it.l/3a2dGDp RiskIQ @RiskIQ ·18 Mar RiskIQ's #COVID19 Cercrime Dail Update for 3/18 covers:  - Top COVID-19 #phishing suject lines - #xploit tactics - #mail sujects when used with executale attachments - #PAM origins (the United tates leads the list) Read the update here: http://it.l/2TYocWR Follow Load More... Our Technolog RiskIQ Illuminate  Platform RiskIQ Digital Footprint  RiskIQ PassiveTotal  RiskIQ xternal Threats  xecutive Guardian  RiskIQ I  What is Attack urface Management? ervices Portfolio Compare Our Productsta Informed News Coverage Press Releases log Awards and Recognition Resources ventsAout RiskIQ Aout Us Careers Contact upportTerms  Privac  Cookie Preferences Copright 2016 - 2020 RiskIQ SUBMIT      ign Up for the Free dition log Contact Us PRODUCT OLUTION PARTNR NW ROURC COMPANY  RiskIQ Illuminate  Platform RiskIQ Digital Footprint  RiskIQ PassiveTotal  RiskIQ xternal Threats  RiskIQ xecutive Guardian  RiskIQ I What is Attack urface Management? Compare Our Products ervices Portfolio xecutive Guardian Your organization’s leadership is 12 times more likel to e the target of a securit incident and nine times more likel to e the target of a data reach than the were last ear. Find out how the can e protected. Read the DatasheetROL CIO Vulnerailit Management ecurit Operations Incident ResponsePURPO Compliance, GDPR, PII OC, Asset Management Incident Response Threat Intelligence rand Protection Anti-Phishing ocial Media ecurit Moile App MonitoringINDUTRY Financial Retail, eCommerce Manufacturing Government Infrastructure Technolog Healthcare Media, Advertising Gift Cardsharks: The Massive Threat Campaigns Circling eneath the urface Learn aout the attack group primaril targeting gift card retailers and the monetization techniques the use. Get the ReportCHANNL PARTNR Channel Partner Director ecome a Channel PartnerTCHNOLOGY PARTNR Integrations and MemershipsMP Partners Threat Hunting Workshop eries Join one of our securit threat hunting workshops to get hands-on experience investigating and remediating threats. Attend an Upcoming WorkshopNews Coverage Press Releaseslog Recognition Inside Magecart: New RiskIQ & Flashpoint Research Report Learn aout the groups and criminal underworld ehind the front-page reaches. Get the ReportROURC CNTR vents Datasheets Videos Weinars uccess tories Analst Reports White Papers ResearchUPPORT Help Documentation How-to Videos Gift Cardsharks: The Massive Threat Campaigns Circling eneath the urface Learn aout the attack group primaril targeting gift card retailers and the monetization techniques the use. Get the ReportAout Leadership oard of Directorsvents Careers Contact Threat Hunting Guide: 3 Must-Haves for the ffective Modern Threat Hunter The threat hunting landscape is constantl evolving. Learn the techniques, tactics, and tools needed to ecome a highl-effective threat hunter. Get the Report  "
}