{
    "title": "Operation Lotus Blossom - A New Nation-State Cyberthreat?",
    "text": "01/04/24, 15:23Operation Lotus Blossom: A New Nation-State Cyberthreat? Pagina 1 di 2https://unit42.paloaltonetworks.com/operation-lotus-blossom/Opera!on Lotus Blossom: A New Na!on-StateCyberthreat?80,322people reacted62 min. read Today Unit 42 published new research iden!fying a persistent cyber espionage campaign targe!ng governmentand military organiza!ons in Southeast Asia. The adversary group responsible for the campaign, which we named“Lotus Blossom,” is well organized and likely state-sponsored, with support from a country that has interests inSoutheast Asia. The campaign has been in opera!on for some !me; we have iden!ﬁed over 50 diﬀerent a#ackstaking place over the past three years.Background and FindingsUnit 42 has linked more than 50 individual a#acks across Hong Kong, Taiwan, Vietnam, the Philippines, andIndonesia to the Lotus Blossom group. These a#acks share a number of characteris!cs, including:They are against military and government targetsSpearphishing is used as the ini!al a#ack vectorThey use a custom Trojan backdoor named “Elise” to gain a footholdA decoy ﬁle appears during ini!al compromise with Elise, tricking users into thinking they opened a benign ﬁleA#acks by the Lotus Blossom group rely heavily on the use of spearphishing emails that use en!cing subject linesand legi!mate-looking decoy documents to trick users into opening a malware executable they think is alegi!mate document. This document is usually a personnel roster for a speciﬁc military or government oﬃce.We believe that the Lotus Blossom group developed the Elise malware speciﬁcally to meet the needs of the a#ackcampaigns, and we’ve observed three variants across 50 samples during the three-year period of these a#acks.Elise is a rela!vely sophis!cated tool, including variants with the ability to evade detec!on in virtual environments,connect to command-and-control servers for addi!onal instruc!on, and exﬁltrate data.Opera!on Lotus Blossom is a prime example of how a well-resourced adversary will deploy advanced tools, overan extended !me period, some!mes years, in order to reach its goals. In this case, the pa#ern of behavior suggeststhat the actors behind this group were na!on-state sponsored, from a country with an interest in the governmentand military aﬀairs of Southeast Asian na!ons.Unit 42 discovered this a#ack using the Palo Alto Networks AutoFocus service, which allows analysts to quicklyﬁnd correla!ons among malware samples analyzed by WildFire. Palo Alto Networks customers are protected fromthe malware used in Opera!on Lotus Blossom via WildFire and our Security Pla%orm’s Threat Preven!oncapabili!es (IPS signature 14358).By Unit 42June 16, 2015 at 5:00 AMCategory: Announcement, Malware, Security Pla%orm, Threat Preven!on, Unit 42Tags: AutoFocus, Elise, Lotus Blossom, WildFireSHARE  Under Attack?About Unit 42ServicesUnit 42 Threat ResearchPartnersResources01/04/24, 15:23Operation Lotus Blossom: A New Nation-State Cyberthreat? Pagina 2 di 2https://unit42.paloaltonetworks.com/operation-lotus-blossom/We recommend that other security prac!!oners review the Indicators of Compromise (IoCs) in the full report toensure they have not been targets in this campaign, and add the appropriate security controls to prevent futurea#acks.The full report on Lotus Blossom from Unit 42 can be downloaded here, which includes all IOCs. The IOCs are alsoaccessible via GitHub.Visit Unit 42 for new research and a full list of speaking appearances, as well to subscribe to updates.Get updates from Palo Alto Networks!Sign up to receive the latest news, cyber threat intelligence and research from usEmail addressSubscribe reCAPTCHANon sono un robotPrivacy - TerminiBy submi&ng this form, you agree to our Terms of Use and acknowledgeour Privacy Statement.   2024 Palo Alto Networks, Inc. All rights reserved.Popular ResourcesResource CenterBlogCommuni!esTech DocsUnit 42SitemapLegal NoticesPrivacyTerms of UseDocumentsAccountManage Subscrip!onsReport a Vulnerability"
}