{
    "title": "RASPITE | Dragos",
    "text": "01/04/24, 21:04RASPITE | Dragos Pagina 1 di 5https://www.dragos.com/threat/raspite/Live Webinar:Join us Apr. 1st for a Town Hall as Robert M. Lee shares insights from his testimony before the U.S.House of Representatives Subcommittee on Cybersecurity and Infrastructure Protection.Register Now Dismiss AlertSkip to main contentDragos Open Search  Open Menu ProductsDragos PlatformAsset Visibility & InventoryVulnerability ManagementThreat DetectionInvestigation & ResponseDragos Threat IntelligenceThreat GroupsNeighborhood Keeper ServicesProfessional ServicesThreat HuntingIncident ResponseTabletop ExerciseAssessment ServicesDragos Academy Solutions01/04/24, 21:04RASPITE | Dragos Pagina 2 di 5https://www.dragos.com/threat/raspite/By ChallengeBy IndustryCybersecurity SolutionsOT ComplianceOT Skills in ITICS security roadmapIndustrial Cyber Risk ManagementSecure Digital TransformationMITRE ATT&CK  for ICSOT Cyber ThreatsBy Industry ResourcesAll ResourcesBlogCase StudiesDatasheetsPress ReleasesReportsWhitepapersWebinarsYear In Review CommunityOT-CERTCommunity Defense ProgramSecurity Advisories Company About DragosMeet the ExpertsWhy DragosPartnersPress ReleasesEventsDISC01/04/24, 21:04RASPITE | Dragos Pagina 3 di 5https://www.dragos.com/threat/raspite/Careers Open Search Search  SearchBlogContact UsLoginUrgent Incident ResponseRequest a DemoThreat GroupRASPITESince 2017Dragos has identiﬁed a new activity group targeting access operations in the electric utility sector. We callthis activity group RASPITE.RASPITE Threat Group OperationsAnalysis of RASPITE tactics, techniques, andprocedures (TTPs) indicate the group has beenactive in some form since early- to mid-2017.RASPITE targeting includes entities in theUS, Middle East, Europe, and East Asia.Operations against electric utilityorganizations appear limited to the US at thistime.RASPITE leverages strategic websitecompromise to gain initial access to targetnetworks. RASPITE uses the samemethodology as DYMALLOY andALLANITE in embedding a link to a resourceto prompt an SMB connection, from which itharvests Windows credentials. The group thendeploys install scripts for a malicious serviceto beacon back to RASPITE-controlledinfrastructure, allowing the adversary toremotely access the victim machine.RASPITE overlaps signiﬁcantly withSymantec’s LEAFMINER, which recentlyreleased a report on the group’s activity in theMiddle East.01/04/24, 21:04RASPITE | Dragos Pagina 4 di 5https://www.dragos.com/threat/raspite/ RASPITE’s activity to date currently focuseson initial access operations within the electricutility sector. Although focused on ICS-operating entities, RASPITE has notdemonstrated an ICS-speciﬁc capability todate. This means that the activity group istargeting electric utilities, but there is nocurrent indication the group has the capabilityof destructive ICS attacks includingwidespread blackouts like those in Ukraine.While the group has not yet demonstrated anICS capability, RASPITE’s recent targetingfocus and methodology are clear indicators ofnecessary activity for initial intrusionoperations into an IT network to prepare theway for later potential ICS events.About Dragos ThreatIntelligenceDragos threat intelligence leverages theDragos Platform, our threat operations center,and other sources to provide comprehensiveinsight into threats affecting industrial controlsecurity and safety worldwide. Dragos doesnot corroborate nor conduct politicalattribution to threat activity. Dragos insteadfocuses on threat behaviors and appropriate detection and response. Read more about Dragos’ approachto categorizing threat activity and attribution.Dragos does not publicly describe ICS activity group technical details except in extraordinarycircumstances in order to limit tradecraft proliferation. However, full details on RASPITE and othergroup tools, techniques, procedures, and infrastructure is available to network defenders via DragosWorldView.Contact Us For a DemoContact UsHome / Threat Groups / RASPITE ProductsDragos PlatformThreat IntelligenceNeighborhood Keeper ResourcesBlogWhitepapersCase Studies01/04/24, 21:04RASPITE | Dragos Pagina 5 di 5https://www.dragos.com/threat/raspite/DatasheetsWebinarsEventsYear in ReviewVideos CompanyAbout DragosCareersPartnersNewsDISCContact UsReport an IncidentPrivacy PolicyTerms of ServiceCookies SettingsContact UsCOPYRIGHT   2024 DRAGOS, INC. ALL RIGHTS RESERVED.For information about how we collect, use, share or otherwise process information about you, please seeour privacy policy. "
}