{
    "title": "Rocket Kitten Showing Its Claws - Operation Woolen-GoldFish and the GHOLE campaign - Security News",
    "text": "01/04/24, 21:06Rocket Kitten Showing Its Claws: Operation Woolen-GoldFish and the GHOLE campaign - Security News Pagina 1 di 9https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-woolen-goldfish-when-kittens-go-phishingMarch 19, 2015   Rocket Kitten Showing ItsClaws: Operation Woolen-GoldFish and the GHOLEcampaign View research paper: OperationWoolen Goldﬁsh: When KittensRocket Kitten refers to acyber threat group that hasbeen hitting diﬀerent publicand privateIsraeli/Europeanorganizations. It haslaunched two campaigns sofar: a malware campaignthat exclusively makes useof GHOLE malware, as wellas a targeted attack dubbedas “Operation Woolen-RelatedPostsRising SecurityWeaknesses inthe AutomotiveIndustry andWhat It Can Doon the RoadAheadThe Linux ThreatLandscapeReportBusiness01/04/24, 21:06Rocket Kitten Showing Its Claws: Operation Woolen-GoldFish and the GHOLE campaign - Security News Pagina 2 di 9https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-woolen-goldfish-when-kittens-go-phishingWoolen Goldﬁsh: When KittensGo Phishingas “Operation Woolen-GoldFish” that's possiblystate-sponsored.GHOLE is a malware family that was discussed in the31st Chaos Communication Congress of the ChaosComputer Club (31C3), during a lecture that tackled itsongoing involvement in targeted attacks. Based on thecompilation date of its oldest samples, the malware isbelieved to have been active since 2011, and has beenused by Rocket Kitten in their targeted attacks.Operation Woolen-GoldFish, on the other hand, is acyber attack campaign that we suspect to be state-sponsored, or at the very least politically-motivated. Ithas been attacking the following targets:Civilian organizations in IsraelAcademic organizations in IsraelGerman speaking government organizationsEuropean government organizationsEuropean private companies  ReportHype vs. Reality:AI in theCybercriminalUndergroundStepping Aheadof Risk: TrendMicro 2023MidyearCybersecurityThreat ReportThe Future ofWhaling Attacks:AI-PoweredHarpoonWhalingRecentPostsOpen RAN:Attack of thexAppsRise in ActiveRaaS GroupsParallel GrowingVictim Counts:Ransomware in2H 2023Apache APISIXIn-the-wildExploitations: AnAPI GatewaySecurity StudyCalibratingExpansion: 2023AnnualCybersecurityReportRansomwareSpotlight:Rhysida01/04/24, 21:06Rocket Kitten Showing Its Claws: Operation Woolen-GoldFish and the GHOLE campaign - Security News Pagina 3 di 9https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-woolen-goldfish-when-kittens-go-phishing Background, Analysis, FindingsBackground, Analysis, FindingsGHOLE Malware Campaign:GHOLE Malware Campaign:In February 2015, we received an alert that involved aninfected Excel ﬁle that, upon analysis, proved to be part ofthe GHOLE malware campaign, one of Rocket Kitten’scampaigns.The GHOLE malware campaign involves victims being sentspear-phishing emails with malicious attachments. Theattachment is usually an Excel ﬁle that contains a maliciousmacro.When clicked, the Excel ﬁle drops a .DLL ﬁle that will thenbe executed by the malicious macro embedded in the Excelﬁle.The Excel ﬁle is tailored to trick the user into running themacro. If the user does not enable the macro content, the.DLL ﬁle will not be executed.GHOLE is a malware family derived from a modiﬁed CoreImpact product. Core Impact is a penetration-testingproduct made by Core Security, a legitimate company.Further analysis revealed that the GHOLE variants involvedin the operation connect to C&C servers hosted mainly inGermany. The servers are registered under one customerby the name of Mehdi Mavadi. We are hesitant inattributing the attack to such an identity as the name itselfis quite common, and that the customer’s servers maysimply be compromised and being used as a proxy rather01/04/24, 21:06Rocket Kitten Showing Its Claws: Operation Woolen-GoldFish and the GHOLE campaign - Security News Pagina 4 di 9https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-woolen-goldfish-when-kittens-go-phishingsimply be compromised and being used as a proxy ratherthan actually providing infrastructure for the Rocket Kittengroup.Operation Woolen-GoldFish:       Operation Woolen-GoldFish:       Similar to the GHOLE malware campaign, OperationWoolen Goldﬁsh involves spear-phishing emailsembeddedwith a malicious link that leads to a OneDrive link. The linkgoes directly to a malicious ﬁle download.The malware payload was initially found to be a variant ofGHOLE, but further samples led to te discovery of a newpayload: a variant of a keylogger known as the CWoolgerkeylogger. It is detected as TSPY_WOOLERG.A.Possible AttributionPossible AttributionAnalyzing the malicious documents in the spearphishing emails of their Microsoft Oﬃce metadata, wenarrowed down the suspects to one “Wool3n.H4t”,whose name appears in most of the document samplesfound as the last known modiﬁer.  His otheraccomplices include entities who go by the names“aikido1” and “Hoﬀman”.We looked deeper into the identity of Wool3n.H4t anddiscovered the following:He may have been running an underground hacking blogunder the same nickname, with the only two entries signedby “Masoud_pk”“Masoud_pk” may possibly be the true identity ofWool3n.H4t. “Masoud” belongs in the top 500 commonlyused ﬁrst names in Iran. A debug string found in the CWoolger keylogger codeshows that the compiler is identiﬁed as Wool3n.H4T.ConclusionConclusion01/04/24, 21:06Rocket Kitten Showing Its Claws: Operation Woolen-GoldFish and the GHOLE campaign - Security News Pagina 5 di 9https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-woolen-goldfish-when-kittens-go-phishingConclusionConclusionThis report explores Rocket Kitten by analyzing the toolsused to leverage its malicious activities. From ourﬁndings we can deﬁnitely say that threat actor team isalive and active, and while the tracks they left behind—as well as their use of macros—might make them seema bit inexperienced, they are slowly improving andgaining traction.We are also able to conﬁrm that Wool3n.H4T is not onlyresponsible for most of the infecting Oﬃce documentsused, but also capable of developing malware.With all the evidence, Rocket Kitten’s attacks can beconstrued as politically-motivated, as the targetedentities do share a particular interest in the IslamicRepublic of Iran. While motives behind targeted attackcampaigns diﬀer, the end results are one and the same:shift in power control either in the economically orpolitically.Read the research paper Operation Woolen-GoldFish:When Kittens Go Phishing for a full, detailed look intothe activities and methods of Rocket Kitten.Posted in Cyber Attacks, Research, Phishing, Cybercrime, TargetedAttacks01/04/24, 21:06Rocket Kitten Showing Its Claws: Operation Woolen-GoldFish and the GHOLE campaign - Security News Pagina 6 di 9https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-woolen-goldfish-when-kittens-go-phishingWe RecommendWe RecommendInternet ofThingsVirtualization&CloudRansomwareSecurityTechnology MQTT andM2M: DoYou KnowWho OwnsYourMachine’sData?AddressingCAPTCHA-EvadingPhishingThreatsWithBehavior-Based AIProtectionA DeepDive intothe PacketReflectionVulnerability AllowingAttackers toPlaguePrivate 5GNetworks BuildingResilience:2024SecurityPredictionsfor theCloudEnhancingSoftwareSupply-ChainSecurity:NavigatingSLSAStandardsand theMITREATT&CKFrameworkUnderstanding theKubernetesSecurityTriad:ImageScanning,AdmissionControllers, Rise inActiveRaaSGroupsParallelGrowingVictimCounts:Ransomware in 2H2023CalibratingExpansion:2023AnnualCybersecurity ReportRansomwareSpotlight:LockBit Post-QuantumCryptography:QuantumComputingAttacks onClassicalCryptographyDivingDeep IntoQuantumComputing:ComputingWithQuantumMechanicsDistributedEnergyGenerationGateway(In)Security CriticalScalability: TrendMicro SecurityPredictions for2024 View the 2024Trend MicroSecurityPredictionsCalibratingExpansion: 2023AnnualCybersecurityReport View the report T Resources Support AboutTrend01/04/24, 21:06Rocket Kitten Showing Its Claws: Operation Woolen-GoldFish and the GHOLE campaign - Security News Pagina 7 di 9https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-woolen-goldfish-when-kittens-go-phishingryourservicesfreefor30days01/04/24, 21:06Rocket Kitten Showing Its Claws: Operation Woolen-GoldFish and the GHOLE campaign - Security News Pagina 8 di 9https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-woolen-goldfish-when-kittens-go-phishing SSSSttttaaaarrrrttttyyyyoooouuuurrrrffffrrrreeeeeeeettttrrrriiiiaaaallllttttooooddddaaaayyyy SelectSelectSelectSelectaaaacountrcountrcountrcountry /y /y /y /regionregionregionregion Privacy Legal Accessibility Copyright 2024 TrendMicroIncorporated.All rightsreserved01/04/24, 21:06Rocket Kitten Showing Its Claws: Operation Woolen-GoldFish and the GHOLE campaign - Security News Pagina 9 di 9https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-woolen-goldfish-when-kittens-go-phishingUnitedStates Sitemap "
}