{
    "title": "Scarlet Mimic Years-Long Espionage Campaign Targets Minority Activists",
    "text": "01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 1 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/Scarlet Mimic: Y ears-Long Espionage CampaignTargets Minority Ac!vists89,832people reacted1227 min. read This post is also available in: ೔ຊޠ( Japanese)Execu!ve SummaryOver the past seven months, Unit 42 has been inves!ga!ng a series of a\"acks we a\"ribute to a group we havecode named “Scarlet Mimic.” The a\"acks began over four years ago and their targe!ng pa\"ern suggests that thisadversary’s primary mission is to gather informa!on about minority rights ac!vists. We do not have evidencedirectly linking these a\"acks to a government source, but the informa!on derived from these ac!vi!es supportsan assessment that a group or groups with mo!va!ons similar to the stated posi!on of the Chinese government inrela!on to these targets is involved.The goal of this report is to expose the tools, tac!cs and infrastructure deployed by Scarlet Mimic in order toincrease awareness of this threat and decrease its opera!onal success through deployment of preven!on anddetec!on countermeasures. From our vantage point, we are not able to iden!fy which a\"acks have beensuccessful against which organiza!ons. But the fact that the tools Scarlet Mimic deploys have been underdevelopment for years suggests an ac!ve adversary that has been successful in somepercentage of its opera!ons. Based on our analysis, we are also seeing Scarlet Mimic start to expand its espionageeﬀorts from PCs to mobile devices, marking an evolu!on in its tac!cs.Individuals and groups of all diﬀerent types may become the target of cyber espionage campaigns. The most wellknown vic!ms of cyber espionage are typically government organiza!ons or high-tech companies, but it’simportant to recognize that espionage-focused adversaries are tasked to collect informa!on from many sources.The a\"acks we a\"ribute to Scarlet Mimic have primarily targeted Uyghur and Tibetan ac!vists as well as thosewho are interested in their causes. Both the Tibetan community and the Uyghurs, a Turkic Muslim minorityresiding primarily in northwest China, have been targets of mul!ple sophis!cated a\"acks in the past decade. Bothalso have history of strained rela!onships with the government of the People’s Republic of China (PRC), though wedo not have evidence that links Scarlet Mimic a\"acks to the PRC.Scarlet Mimic a\"acks have also been iden!ﬁed against government organiza!ons in Russia and India, who areBy Robert Falcone and Jen Miller-OsbornJanuary 24, 2016 at 5:00 PMCategory: Reports, Threat Preven!on, Unit 42Tags: Android, Apple, AutoFocus, Bru!shCommand, CallMe, cyber espionage, Cyber Threat Alliance, cybersecurity, Espionage,FakeM, Mac OS X, microso$, MobileOrder, Psylo, Scarlet Mimic, SkiBoot Loader, SubtractThis, Trojans, WildFireSHARE  Under Attack?About Unit 42ServicesUnit 42 Threat ResearchPartnersResources01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 2 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/responsible for tracking ac!vist and terrorist ac!vi!es. While we do not know the precise target of each of theScarlet Mimic a\"acks, many of them align to the pa\"erns described above.The Scarlet Mimic a\"acks primarily center around the use of a Windows backdoor named “FakeM.” It was ﬁrstdescribed by Trend Micro in 2013 and was named FakeM because its primary command and control traﬃcmimicked Windows Messenger and Yahoo! Messenger network traﬃc to evade detec!on. We have iden!ﬁed twosubsequent variants of the FakeM family, which has undergone signiﬁcant changes since it was exposed in 2013.We have also iden!ﬁed nine dis!nct “loader” malware families, which Scarlet Mimic appears to use to avoiddetec!on when infec!ng a system.In addi!on to the FakeM variants, Scarlet Mimic has deployed Trojans that target the Mac OS X and Androidopera!ng systems. We have linked these a\"acks to Scarlet Mimic through analysis of their command and control(C2) infrastructure.To infect individuals with access to the data the actors desire, Scarlet Mimic deploys both spear-phishing andwatering hole (strategic web compromise) a\"acks. Using these tac!cs they can directly target previously iden!ﬁedindividuals (spear phishing) as well as uniden!ﬁed individuals who are interested in a speciﬁc subject (wateringhole). In their spear phishing a\"acks, Scarlet Mimic has exploited ﬁve separate vulnerabili!es. However, in manycases they chose to forgo exploi!ng a so$ware vulnerability and used self-extrac!ng (SFX) RAR archives that usethe Right-to-Le$ Override character to mask the true ﬁle extension, tricking vic!ms into opening executable ﬁles.As with many other a\"ackers who use spear-phishing to infect vic!ms, Scarlet Mimic makes heavy use of “decoy”ﬁles. These are legi!mate documents that contain content relevant to the subject of the spear phishing e-mail.A$er the system is infected, the malware displays the decoy document to trick the user into believing nothingharmful has occurred. These decoy documents allow us to iden!fy the theme of the spear phishing e-mail and insome cases the target of the a\"ack.The most recent Scarlet Mimic a\"acks we have iden!ﬁed were conducted in 2015 and suggest the group has asigniﬁcant interest in both Muslim ac!vists and those interested in cri!ques of the Russian government andRussian President Vladimir Pu!n. Based on their previous targets we suspect these individuals may be targetedbased on the informa!on they posses on ac!vist groups.The primary source of data used in this analysis is Palo Alto Networks WildFire, which analyzes malware used ina\"acks across the world. The system also analyzes malware samples collected through a sharing partnership withother security vendors, including our partners in the Cyber Threat Alliance. To connect a\"acks to each other basedon malware behavior and command and control infrastructure, we relied on AutoFocus threat intelligence.AutoFocus users can view all of the ﬁles related to Scarlet Mimic and the malware associated with the group usingthe following links:ScarletMimicFakeMPsyloMobileOrderIntroduc!onThe be\"er we can understand the threats to our networks and systems, the more eﬀec!ve we will be atpreven!ng those threats. The goal of this report is to help network defenders be\"er understand a\"acks from a01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 3 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/group we have named Scarlet Mimic. This group has been conduc!ng a\"acks for at least four years using abackdoor Trojan that has been under ac!ve development. The group primarily deploys spear-phishing e-mails toinfect its targets, but was also responsible for a watering hole (strategic web compromise) a\"ack in 2013.A\"acks from this group have been reported publicly in the past, but mostly as disparate, unconnected incidents.Based on analysis of the data and malware samples we have collected, Unit 42 believes the a\"acks describedherein are the work of a group or set of coopera!ng groups who have a single mission, collec!ng informa!on onminority groups who reside in and around northwestern China. In the past, Scarlet Mimic has primarily targetedindividuals who belong to these minority groups as well as their supporters, but we’ve recently found evidence toindicate the group also targets individuals working inside government an!-terrorist organiza!ons. We suspectthese targets are selected based on their access to informa!on about the targeted minority groups.In the following sec!ons we will describe selected a\"acks we have iden!ﬁed and who their likely targets are. Wewill also provide detailed analysis of the latest variants of the malware they deploy (known as FakeM) as well asother associated tools that allow Scarlet Mimic to target Android and OS X devices.A\"acks launched by this group were publicly exposed on 2013 in a Trend Micro report about the FakeM Trojan.Since that reports release, Scarlet Mimic has deployed two addi!onal versions of the malware. They have alsodeployed nine separate “loader” Trojans they use to infect systems with their backdoor.A\"ack DetailsThe majority of a\"acks we associate with Scarlet Mimic follow the pa\"ern shown in Figure 1. Figure 1: “Spear Phishing with Decoy” A\"ack Pa\"ern Deployed by Scarlet MimicThe a\"acker sends a spear-phishing e-mail with a subject and body content that appeal to the targeted user. Thise-mail carries an a\"achment, which is typically a document that exploits a Microso$ Oﬃce vulnerability. Thea\"achment uses a ﬁle name that is related to the e-mail content to trick the user into opening it. If the user opensthe ﬁle and the exploita!on is successful, a backdoor Trojan is installed on the system that gives the a\"ackeraccess and a decoy document is displayed to the vic!m. Decoy documents are typically non-malicious versions ofthe content the user expected to see when opening the a\"achment.Many of the targets and spoofed or compromised sending e-mail addresses have contact informa!on on theInternet. The apparent sender email usually appears to be someone associated with the accompanying text, whenappropriate, while the target emails are usually also available online !ed to target organiza!ons. A small subset of01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 4 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/the decoys could not be found online and may be from previous compromises by Scarlet Mimic.Many a\"ackers deploy this par!cular pa\"ern, as it is o$en successful at infec!ng a user without aler!ng the userof the infec!on. This is the exact same pa\"ern, for example, deployed by the a\"ackers in Opera!on LotusBlossom.We have iden!ﬁed spear phishing documents from Scarlet Mimic exploi!ng the following vulnerabili!es.CVE-2012-0158CVE-2010-3333CVE-2010-2883CVE-2010-2572CVE-2009-3129We also know Scarlet Mimic uses a number of toolkits to create documents that contain exploit code to install theFakeM payload on a compromised system. Unit 42 tracks the toolkits delivering FakeM under the names MNKit,WingD and Tran Duy Linh. These kits appear to be used by many a\"ack groups, and they alone are not a goodindica!on of Scarlet Mimic ac!vity.Addi!onally, in many cases these threat actors did not use an exploit document at all, rather they sent self-extrac!ng (SFX) RAR archives that use the Right-to-Le$ Override character to mask the true ﬁle extension. Forexample, the following two ﬁlenames of SFX archives used to deliver FakeM contain the RLO character (bolded):Update about the status of Tenzin Delek Rinpoche'ashes%E2%80%AEcod.scrtepsiliy mezmun.\\xe2\\x80\\xaetxt.scrEven when no so$ware vulnerability is exploited, the a\"acks s!ll typically include a decoy document. The contentof most of the decoy documents appear to be available on the open Internet, and the a\"ackers typically madesmall modiﬁca!ons to them.Many of the targets and spoofed or compromised sending accounts have contact informa!on on the Internet. Theapparent sender email usually appears to be someone associated with the accompanying text, when appropriate,while the target emails are usually also available online !ed to target organiza!ons. A small subset of the decoyscould not be found online and may be from previous compromises by Scarlet Mimic. The overarching decoythemes were Uyghur-related, an!-Pu!n, or Al-Qaeda-related. The decoys are o$en copied from think tanks orreputable news sources the targets would likely frequent.In one instance, the threat actors used content from a New York Times ar!cle (Figure 2) on the same day it waspublished. 01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 5 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/ Figure 2: Decoy Text Extracted from the New York Times ar!cleFigure 3 shows one of the more common themes used to target Uyghurs and those interested in their cause.Mul!ple a\"acks used press releases or other content related to the World Uyghur Congress. Figure 3: Decoy using World Uyghur Congress Press ReleaseIn July of 2015, we iden!ﬁed a full e-mail uploaded to an an!virus scanning service that carried a Scarlet Mimicexploit document. In this case (Figure 4) the recipient of the e-mail was an individual working for the RussianFederal Security Service (fsb.ru). The e-mail body requests help dealing with threatening phone calls from aninterna!onal gang. Figure 4: Phishing E-mail send to FSB E-mail Address01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 6 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/Another a\"ack, sent to an unknown target carried a decoy image (Figure 5) that compared Russian PresidentVladimir Pu!n to Adolf Hitler. Figure 5: An!-Pu!n image used as a decoy documentIn yet another case, the threat actors used a conference no!ﬁca!on from one organiza!on (Figure 6a) andmodiﬁed it to appear as thought it was for an “Islamic Country Muslim Religion Conference” (Figure 6b). Thisdocument was par!cularly poorly altered, as the registra!on form s!ll contained mul!ple hints to indicate thedocument was fraudulent (Figure 6c). Figure 6a: Original document used as a Psylo decoy Figure 6b: Modiﬁed header and contact email in the decoy 01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 7 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/ Figure 6c: Bo\"om of the decoy document with replaced email and non-altered date -- a quick search online showsthis to be fraudulentIn total we have collected over 40 individual decoy documents used in these a\"acks, far more than we can detailhere.We are aware of one case where Scarlet Mimic broke from the spear-phishing pa\"ern described above. In 2013,the group deployed a watering hole a\"ack, also known as a strategic web compromise to infect vic!ms with theirbackdoor. The watering hole is an a\"ack vector that involves compromising a website that targeted vic!ms arelikely to visit in order to infect and gain access to their systems. According to a blog by Websense, threat actorscompromised the Tibetan Alliance of Chicago’s website to host malicious code that exploited a vulnerability inInternet Explorer (CVE-2012-4969.) Microso$ patched this vulnerability in September 2012, sugges!ng that thiswatering hole a\"ack used an older vulnerability, which aligns with the threat groups con!nued use of oldervulnerabili!es in their spear-phishing eﬀorts.Malware OverviewFirst discussed in January 2013 in a Trend Micro whitepaper, FakeM is a Trojan that uses separate modules toperform its func!onality. FakeM’s func!onal code is shellcode-based and requires another Trojan to load it intomemory and execute it. There are a variety of diﬀerent Trojans used to load FakeM, some of which are moreinteres!ng than others. In this sec!on, we will explore the loader Trojans followed by an analysis of the evolu!onof FakeM itself. We end this sec!on with a discussion on tools related to FakeM and used by Scarlet Mimic.Loader TrojansFakeM is shellcode-based and therefore requires another Trojan to load FakeM into memory and execute itsfunc!onal code. Threat actors have developed many diﬀerent loading Trojans to load FakeM, some of which arefairly straigh&orward while others use very clever techniques to avoid detec!on. Unit 42 tracks the following listof loader Trojans that Scarlet Mimic has used to execute FakeM:Cryp!cConvoSkiBootRaidBaseFakeHighFivePiggyBackFullThro\"leFakeFish01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 8 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/Bru!shCommandSubtractThisIt appears that the threat actors include the loader Trojans in some sort of builder applica!on that allows actors toquickly create, conﬁgure and deploy payloads to execute FakeM. We believe this because many samples thatexecute FakeM have the same exact compila!on !me but diﬀerent C2 servers, as seen in the example in Table 1.This suggests the actors compile a single sample and use a builder tool to conﬁgure individual samples on demand.We used the loader Trojans to provide a general !meline for the development of FakeM samples, as FakeM isshellcode-based and does not contain any usable !mestamps. The !mestamps in the loader Trojans does notnecessarily correspond to the usage of FakeM, but plo'ng the compile !mes of the loaders on a !meline showsan interes!ng trend. The sca\"er plot !meline in Figure 7 shows the known compila!on !mes of the loader Trojansand the FakeM variant that it executed.SHA256CompiledLoader TrojanC2 Domains5182dc8667432d76a276dc4f864cdfcef3e481783ebaf46d3b1397080b798f4a2013-09-13 08:02:58Cryp!cConvoopero.spdns[.]org,ﬁrefox.spdns[.]de5dade00db195087aa336ce190b5fd1c22992c49556c623b42a9f742d73241a7f2013-09-13 08:02:58Cryp!cConvointersecurity.ﬁrewall-gateway[.]comTable 1: Two samples sharing a compile !me yet contain diﬀerent C2 domains in their conﬁgura!ons Figure 7: Timeline of compila!on of loader Trojans associated with FakeMBased on the !meline, it appears that the actors were ac!vely developing several of the loaders at the same !mefrom 2009 un!l the early months of 2014. A$er the ﬁrst quarter of 2014, it appears that the actors abandoneddevelopment of the older loaders in favor of FakeFish, Bru!shCommand and SubtractThis. This does not mean thatactors will not con!nue to use the older loaders, but it does suggest that the actors will con!nue including the01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 9 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/newer or freshly developed loaders in updated builder applica!ons.The !meline also presents the possibility that the FakeM developers reacted to the release of Trend Micro’s FakeMblog and whitepaper. Trend Micro published their analysis of the FakeM Trojan on January 17, 2013 (marked inFigure 7 by a red line) that discussed the original variant of FakeM. Shortly a$er, the original variant of FakeMdrops oﬀ the !meline in favor of the SSL and Custom SSL variants. It is possible that the FakeM developers sawtheir tool was exposed and adapted it to avoid detec!on for con!nued use as a payload in a\"acks. We cannot becertain if the developers reacted speciﬁcally to Trend Micro’s content, as it is possible that they were reac!ng tothe increased an!virus detec!on rate of their tool that resulted from the exposure of the tool. Regardless of thespeciﬁc s!mulus, the reac!on shows that the FakeM threat actors evolved to avoid detec!on/a\"ribu!on and tocon!nue their a\"ack campaigns.The !meline does have one no!ceable outlier, speciﬁcally the FakeHighFive sample compiled in September 2009that loaded a FakeM SSL sample. We believe this compile !me is incorrect, as the C2 domain for this sample,speciﬁcally press.ufoneconference[.]com, was registered by the threat actor in February 2013. The registra!on ofthe C2 domain in February 2013 aligns with other compila!on !mes of FakeM SSL, which leads us to theconclusion that the September 2009 compila!on !mestamp was modiﬁed and/or inaccurate.Most of the related loader Trojans, such as Cryp!cConvo, PiggyBack, FullThro\"le, FakeHighFive, FakeFish andRaidBase do li\"le more than load encrypted FakeM shellcode (either from a PE resource or embedded data),decrypt it, and execute the resul!ng shellcode. Other related loading Trojans, such as SubtractThis,Bru!shCommand and SkiBoot employ clever techniques worth discussing.SubtractThisThe SubtractThis loader displays a technique that is quite clever. This loader received its name based on atechnique it uses to delay before carrying out its main func!onality, speciﬁcally by requiring the user to hit theminus (“-“) key. SubtractThis carries out this technique through the following steps:1. Calls LoadAcceleratorsA func!on to load the virtual key for the minus character “-“. Example:LoadAcceleratorsA(hInstance, VK_SUBTRACT);2. Calls SetTimer func!on to set up a callback func!on that will be called in the event that the LB_FINDSTRINGWindows message. Example: SetTimer(0, LB_FINDSTRING_, 10000u, TimerFunc);3. Creates a con!nuous loop that starts by calling GetMessageA to obtain Windows messages4. Calls TranslateAcceleratorA to check Windows message received is VK_SUBTRACT \"-\".5. Calls the callback func!on set up in the SetTimer func!on if the user enters the minus “-“ key.This technique requires user interac!on, which makes analysis in sandboxes more diﬃcult.Bru!shCommandThe Bru!shCommand loader uses a very interes!ng method to decrypt the FakeM func!onal code. The mainfunc!on in this loader checks the command line arguments passed to it, and if there are none present it will obtaina random number between 0-9 and create a new process using the same executable with this random number as acommand line argument.If the executable has a command line argument, the Trojan subjects the value to a hashing algorithm and comparesthe hash to 0x20E3EEBA. If the value matches the sta!c hash, the executable will subject the command line01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 10 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/argument to a second algorithm that will produce a value that the Trojan will use as the decryp!on key to decryptthe embedded FakeM shellcode. It essen!ally brute forces its own decryp!on key by rerunning itself over and overun!l it runs with the correct value is provided on the command line. Unit 42 had not seen this technique used byother malware families and it introduces a challenging hurdle when a\"emp!ng to analyze or debug the loaderTrojan.SkiBoot LoaderSkiBoot reads the master boot record (MBR) of the system to determine the XOR key that it will use to decryptthe FakeM shellcode. It carries out this func!onality by calling the ReadFile func!on to read 512-bytes from“\\\\.\\PHYSICALDRIVE0” and speciﬁcally uses the last byte of the MBR as the encryp!on key. The last byte of theMBR is “\\xAA”, or the second byte of “\\x55\\xAA”, which is the boot signature por!on of the MBR.Instead of using ReadFile, one variant of this loader reads the MBR using DeviceIOControl using the ID_CMDcontrol code, and accesses a speciﬁc oﬀset to obtain the value that it will rotate each byte in the ciphertext withinthe decryp!on algorithm. The signiﬁcance of using DeviceIOControl is that the VMware hypervisor responds tothis API call with a blank buﬀer instead of the MBR, whereas the Virtualbox hypervisor returns the MBR correctly.It appears that this loader is speciﬁcally using the DeviceIOControl API func!on as a VMware detec!on technique,sugges!ng that the developers are well versed in the nuances of the VMware hypervisor and virtual machineevasion.Evolving FakeM: VariantsSince being originally exposed in 2013, authors of FakeM have con!nuously made changes to the FakeMcodebase, resul!ng in mul!ple variants. Before elabora!ng on the diﬀerent variants of FakeM, there are manysimilari!es that remain throughout the various itera!ons. The architecture has not changed during the evolu!onof FakeM, as a modular framework exists in each variant, as seen in Figure 8. The FakeM main module isresponsible for launching embedded modules, such as a keylogger or for gathering sensi!ve ﬁles. The main moduleis also responsible for communica!ng with its C2 servers and handling commands issued by the C2 server. Figure 8: FakeM ArchitectureAll FakeM variants ini!ate communica!ons with its C2 server and check the C2’s response for a command. Also,all FakeM variants share a common command handler with the same capabili!es, as seen in Table 2. The limitedcommand set suggests that FakeM’s func!onality is obtained by addi!onal assembly code provided by the C2server with the 0x211 command. According to Trend Micro’s ini!al analysis on FakeM, threat actors delivered andran addi!onal code that provided further capabili!es to the Trojan, such as the ability to run shell commands, stealpasswords, capture the screen and upload ﬁles.01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 11 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/CommandDescrip!on0x211Run assembly code directly from the C2.0x212Idle. A\"empts to receive another command immediately instead of sleeping for 30 seconds.0x213Sets a ﬂag to end the session with the C2. This will force the Trojan to reestablish a session with theC2.0x214Exit process.Table 2: Command handler within all variants of FakeMNow that we have covered the commonali!es between FakeM variants, the following sec!ons will dive into thespeciﬁc variants of FakeM. Unit 42 categorizes the diﬀerent varia!ons of FakeM based on the method used tocommunicate with the C2 server, which has changed drama!cally over the years.Original FakeMThe original variant of FakeM generates network beacons to its C2 server that begin with a 32-byte header that inmost cases is meant to blend into network traﬃc generated by legi!mate applica!ons. Following this 32-byteheader, the original variant of FakeM includes data encrypted using a custom encryp!on cipher that uses an XORkey of “YHCRA” and bit rota!on between each XOR opera!on.The original variant includes the FakeM discovered and published by Trend Micro in 2013, in which the authors ofFakeM ﬁrst a\"empted to evade detec!on of its C2 communica!ons by pretending to be generated by legi!matemessenger applica!ons, such as MSN and Yahoo! messengers. Figures 9 and 10 show FakeM a\"emp!ng toresemble MSN or Yahoo! Messenger traﬃc, as the ﬁrst 32-bytes contain data that resemble legi!mate traﬃcgenerated by these chat programs. Figure 9: FakeM using fake MSN messenger traﬃc for C2 communica!on Figure 10: FakeM using fake Yahoo! Messenger for C2 communica!onIn addi!on to emula!ng chat programs, FakeM has also included HTML code within the 32-byte header. As youcan see in Figure 11, the overall structure of the beacon did not change, rather the only diﬀerences is the data in01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 12 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/the header contains HTML tags. The HTML data in the header led Unit 42 to a whitepaper published byMalware.lu that suggested the MSN, Yahoo, and HTML versions of the original variant of FakeM all share acommon server applica!on that the threat actors use to build samples and control infected systems. Figure 11: FakeM HTML tags in C2 headerIn October 2013, FireEye published a blog about a sample of FakeM that did not use fake messenger or HTMLdata in the ﬁrst 32 bytes of the C2 traﬃc, but instead used four repea!ng bytes to ﬁll this por!on of the packet, asseen in Figure 12. Unit 42 tracks this under the original variant, as it uses the same algorithm to encrypt the dataand otherwise shares a common structure to the MSN, Yahoo, and HTML versions with the excep!on of themodiﬁca!on to the ﬁrst 32 bytes. Figure 12: FakeM C2 beacon with four repea!ng bytesFakeM SSLWhile performing infrastructure analysis on FakeM original variants, we came across shared infrastructure withdomains that hosted C2 servers for malware samples that did not match the known FakeM communica!onprotocols. Palo Alto Networks WildFire had analyzed many samples associated with these related C2 domains, allof which communicated with the C2 server using secure sockets layer (SSL). To determine the malware family thatwas genera!ng this traﬃc, Unit 42 analyzed these samples and found that the func!onal code was the same asthe original FakeM variant.This discovery indicates the authors of FakeM introduced new code to the Trojan in order to use SSL tocommunicate with its C2 server. The dras!c change in C2 channel warranted a new variant name, and we dubbedit “FakeM SSL”. During the analysis of these samples we did not ﬁnd any opera!onal C2 servers to complete ahandshake to establish a SSL session. During the handshake, the FakeM SSL samples will tell the server it supports36 diﬀerent cipher suites even though the samples appear to only support one. Unit 42 believes the cipher suitewithin the FakeM SSL variants uses Diﬃe-Hellman for key exchange and the RC4 cipher to encrypt the C2communica!ons.FakeM Custom SSLIn July 2015, Scarlet Mimic delivered a spear-phishing email to a branch of the Russian government withinten!ons of installing a payload that was undetected by any an!virus vendors on VirusTotal. The high proﬁle01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 13 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/target and the lack of an!virus detec!on prompted Unit 42 to perform an in-depth analysis and found that it is yetanother new variant of the FakeM Trojan. We also named this variant a$er it’s communica!on protocol (FakeMCustom SSL.)This new variant of FakeM shared the same func!onal code as its predecessors, but again the communica!onswith the C2 drama!cally diﬀered from the other variants. Communica!ons between this variant and the C2 serverleverage what Unit 42 believes is modiﬁed SSL code, as the code is very similar to the FakeM SSL variant. Thecode appears to use Diﬃe-Hellman for key exchange and the RC4 algorithm like FakeM SSL; however, the ini!alpacket sent to the C2 server did not contain a “client hello” message, which is required to ini!ate an SSLhandshake. Instead, the ini!al packet sent data as seen in Figure 13. Figure 13: Hexdump of FakeM custom SSL variantThis variant of FakeM skips the tradi!onal SSL handshake, which involves an agreement on a cipher suite to use toencrypt communica!ons. The FakeM code only supports one cipher suite, which makes the cipher suiteagreement por!on of the SSL handshake irrelevant. Instead, FakeM creates a session with its C2 server byexchanging keys. The lack of a valid handshake makes detec!on of this C2 stream diﬃcult, as the packets sentbetween the Trojan and the C2 to establish this session contain random binary data. Network devices will also beunable to perform any SSL decryp!on due to the lack of detec!on and the inability to determine the cipher suiteused to encrypt the data. Figure 14 below provides a visual depic!on of the handshake procedure and thesubsequent beacon and command messages. Figure 14: Communica!ons between system and C2 server, including the key exchangeThe handshake starts with a key exchange, which the Trojan ini!ates by crea!ng a 2048-byte buﬀer that it willstore its key (128-bytes, followed by null values as seen in Figure 13) and sending its key to the C2 server. The C2will respond with its own key (also 128-bytes, followed by null values) that the Trojan will store and use to encrypt01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 14 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/future communica!ons.Once this key exchange is complete, the Trojan acknowledges the receipt of the server’s key by sending another2048-byte packet to the server. To build the acknowledgement packet, the Trojan creates a 2048-byte buﬀer ﬁlledwith null values and copies the string “ws32.dll” to oﬀset 8 and encrypts the buﬀer with the server’s key.A$er sending the acknowledgement packet, the Trojan will gather local system informa!on and include it in abeacon to the C2 server. Like the packets sent in the key exchange, the beacon sent by the Trojan to the C2 serveris 2048-bytes in length; however, the system informa!on gathered by the Trojan is only 296 bytes followed by1752 are null values to ﬁll the 2048 byte buﬀer. The system informa!on follows the 296-byte structure seenbelow: The Trojan will encrypt this data using the key provided by the C2 and send it to the server. The Trojan will thenwait for the C2 to respond, which it will decrypt and parse for FakeM commands. Unit 42 has been unable extractany plug-ins from C2 network traﬃc; however, several FakeM custom SSL samples contain embedded plug-insthat run without interac!on with the C2 server. Also, Unit 42 was able to extract several modules from theoriginal FakeM server applica!on, as seen in Table 3. All of these modules are shellcode-based plug-ins that wouldwork with the custom SSL variant of FakeM with li\"le to no modiﬁca!on.MD5Size (bytes)Descrip!on7a1410b2eceb99ec268b50e9371e74c13724Process Plug-ins092085e76512f071cab12f76ed09b3482412Shell Plug-ins8f4cbb78356cb672bf2566e44315eb961768File Plug-ins16ab40f84fc47bab2c7874bb3164c5b42268Screen Plug-ins30337e99631a174d822dd3ea00a5f6cf2204Regedit Plug-ins1f3(b789bcbe9186a50c4f4db2697361996Service Plug-ins4313d9d5fc6a090e2abc41633cb2c1fd3196HostInfo Plug-insfe75dﬀ8b86dd8989d2ca00df19d51be2220KeyBoard Plug-ins3e184a7af74905f3d3acbec913252f721884Shell Plug-insb59e8751b9f61bd4f4b9b62de82427513896OE Pwd Plug-ins83ec457cba27e470404c942eb9242eeb2156U-Files Plug-insTable 3: Modules extracted from the original FakeM variant's server applica!on123456789struct beaconToC2 { DWORD static_value_130h; CHAR username[128]; CHAR computername[128]; DWORD static_value_70000h; DWORD os_codepage; DWORD campaign_code_1; DWORD campaign_code_2;};01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 15 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/Related to FakeM Original: CallMeCallMe is a Trojan designed to run on the Apple OSX opera!ng system. This Trojan was delivered in targeteda\"acks on Uyghur ac!vists in 2013 and used infrastructure associated with FakeM.In February 2013, AlienVault performed analysis on the CallMe Trojan and found that it is based on a tool calledTiny SHell, an OSX shell tool whose source code is available on the Internet. The Trojan uses AES to encrypt thecommunica!on channel its C2 server, which will provide one of three commands to carry out ac!vi!es on thecompromised system, as seen in Table 4.CommandDescrip!on1Get a ﬁle from the system and upload it to the C2 server.2Put a ﬁle on the system from the C2 server. File is saved to a speciﬁed ﬁlename in <HOMEdirectory>/downloads/.3Create a reverse shell to interact with the compromised system.Table 4: Commands Available in the CallMe OSX MalwareThe infrastructure overlap between FakeM and CallMe involves the fully qualiﬁed domain name (FDQN) of\"googmail.org\", which was used by both FakeM and CallMe samples. This suggests that not only do these threatactors have the ability to compromise vic!ms running the Microso$ Windows opera!ng system, but they can alsotarget individuals running Apple's OSX as well.Related to FakeM Custom SSL: PsyloDuring infrastructure analysis of FakeM Custom SSL variants, Unit 42 found infrastructure overlaps betweenFakeM and another new, previously unreported Trojan that we named “Psylo”. Psylo is a tool that allows threatactors to upload and download ﬁles to and from a compromised system, as well as execute commands andapplica!ons on the system. The name Psylo is an anagram from the mutex created when ini!ally running thispayload, which is 'hnxlopsyxt'.Psylo is similar to FakeM in that they are both shellcode-based, and they have similar conﬁgura!ons and C2communica!on channels. As you can see from the following two conﬁgura!on structures, Psylo and FakeM havesimilar conﬁgura!ons with only the array length of the C2 loca!ons being diﬀerent.struct psylo_c2_conﬁg {char[60] c2_host_1;char[60]c2_host_2;char[60] c2_host_3;DWORD c2_port_1;DWORDc2_port_2;DWORD c2_port_3;};struct fakem_customssl_c2_conﬁg {char[64]c2_host_1;char[64] c2_host_2;char[64] c2_host_3;DWORDc2_port_1;DWORD c2_port_2;DWORD c2_port_3;};Figure 15: Comparison between Psylo and FakeM custom SSL conﬁgura!onsBoth use SSL to communicate with their C2 servers, and it appears they share common code to carry out theDiﬃe Hellman key exchange. We compared the Diﬃe Hellman code from Psylo with FakeM custom SSL variantand found that they were very similar, but the FakeM samples had some of the func!onality within sub-func!ons,which rendered binary diﬃng between the two Trojans impossible.01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 16 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/Another slight diﬀerence involves how Psylo and FakeM generate random numbers for SSL. FakeM usesQueryPerformanceCounter to create a random number, whereas Psylo uses CryptGenRandom, both of whichgenerate random numbers 68 bytes long. Interes!ng enough is that CryptGenRandom calls RtlGenRandom, whichuses QueryPerformanceCounter along with other system a\"ributes to generate a random number.When communica!ng with its C2 server, Psylo will use HTTPS with a unique user-agent of (no!ce the lack of aspace between \"5.0\" and \"(Windows\"):Mozilla/5.0(Windows NT 6.1; WOW64; rv:24.0) Gecko/20100101 Firefox/24.0Unit 42 does not consider Psylo another variant of FakeM because Psylo has a command handler that diﬀersdrama!cally from FakeM. Table 5 shows the Psylo command handler, which suggests it is less modular andsupports more embedded func!onality when compared to FakeM. It is possible that the threat actors created thisTrojan as a standalone alterna!ve to FakeM.CommandDescrip!on0Idles for 10 seconds.2Enumerate all storage devices.3Find all ﬁles that starts with a par!cular string (%s*.*).5Creates a ﬁle to write to, dele!ng it if it already exists. Combined with 'E' command to download aﬁle to the system.EWrites data from C2 to a ﬁle opened using the '5' command. Combined with '5' command todownload a ﬁle to the system.6Reads a ﬁle, which eﬀec!vely uploads the ﬁle to the C2.7Delete a speciﬁed ﬁle.8Execute a command using WinExec. Responds to C2 with 's' if successful or 'r' if unsuccessful.9Timestomps. Sets a speciﬁed ﬁle's !mestamps to match that of a system ﬁle in the System32directory.Table 5: Command handler in Psylo that diﬀers drama!cally from FakeMMobileOrder: Mobile Devices the Next Fron!erAnother discovery we made while researching this blog is an overlap between Psylo infrastructure and a Trojanfocused on compromising Android mobile devices. Unit 42 tracks this mobile Trojan as MobileOrder, as theauthors speciﬁcally refer to commands within the app as orders. The connec!on between FakeM, Psylo, andMobileOrder suggest that Scarlet Mimic is now expanding their espionage eﬀorts from PCs to mobile devices,which marks a major shi$ in tac!cs.MobileOrder starts by registering itself as device administrator so that a normal user cannot uninstall it by simplyclicking “uninstall” in se'ngs. It will copy an embedded PDF ﬁle from “res/raw/rd.pdf” to SD card\"/android/9074ca3f18e201c204ec1d852264bb5432644ba46f54f361a146957.pdf\" and launches the mobiledevice’s default PDF viewer to display this PDF ﬁle, which acts as a decoy document. A$er displaying the decoy01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 17 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/document, the malicious code runs in background. The malicious code consists of the following parts:1. An Android geographical loca!on SDK provided by AMAP.2. Actor developed code that carries out Trojan’s func!onality.The malware uses the AMAP SDK to get accurate loca!on of infected devices by GPS, mobile network (such asbase sta!ons), WiFi and other informa!on. MobileOrder acts on instruc!ons provided by its C2 server, which itcommunicates with over TCP port 3728. All C2 communica!ons are encrypted with the AES algorithm using a keygenerated by compu!ng ﬁve MD5 hashes star!ng with the key \"1qazxcvbnm\", and adding a salt value of “.)1/” ineach itera!on.The C2 server will respond to requests from MobileOrder with commands that the Trojan refers to as “orders”.MobileOrder contains a command handler with func!onality that provides a fairly robust set of commands, asseen in Table 6. The ﬁrst byte of data provided by the C2 server is order number, which is followed by theencrypted data that needed to carry out the speciﬁc order.Order #Order NameBehaviors18Order_Folder_ListUpload names and a\"ributes of ﬁles under speciﬁed path20Order_Process_ListUpload all running processes informa!on24Order_HostInfoUpload device informa!on including IMEI, IMSI, SIM cardserial number, phone number, Android version, devicemanufacturer, device model, SD card size, network type,device locking status, country, carrier, !me zone, language,install app list, browser bookmarks, etc.26Order_FileDeleteDelete speciﬁed ﬁle27Order_DownLoadDownload speciﬁed ﬁle to SD card’s Android/data/tmp/directory.28Order_UpFileUpload speciﬁed ﬁle to C2 server51Order_SmsUpload all received and sent SMS addresses, content, date,!me to C2 server52Order_ContactUpload all contacts’ informa!on to C2 server53Order_CallUpload all phone calling history informa!on54Order_Camera_front_photoTake a picture by device’s front camera56Order_SetSleepTimeSet sleep !me interval57Order_SetOnlineStop sleep58Order_SetMediaRecorderStart audio recorder in speciﬁed !me59Order_GetLocUpload informa!on about network operator, MCC, MNC,network type, GSM cell loca!on, CID, LAS, BSSS, etc. Thisinforma!on can be used to locate the device.60Order_GetGpsUpload GPS loca!on by AMAP SDK.61Order_SetTelRecorderOnAc!vate phone calling recording01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 18 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/62Order_SetTelRecorderOﬀDeac!vate phone calling recording81Order_InstallInstall speciﬁed APK ﬁle. May install silently or install tosystem app according to C2 command data82Order_UninstallUninstall speciﬁed app84Order_StartAppLaunch speciﬁed app85Order_SendBroadcastSend speciﬁed Android broadcast to launch other apps86Order_ShellExecute speciﬁed shell commands87Order_OpenTrackStart geoloca!on tracking in AMAP SDK88Order_CloseTrackStop geoloca!on tracking in AMAP SDK90Order_CheckScreenCheck whether phone screen is on (or said whether the phoneis used by its owner)Table 6: MobileOrder command handlerInfrastructure Overlap and Related T oolsThere is some infrastructure overlap in the C2 servers used by almost all of the FakeM variants, as well otherTrojans such as MobileOrder, Psylo, and CallMe. There are also infrastructure !es between some FakeM variantsand older ac!vity using Trojans such as Elirks, Poison Ivy, and BiFrost, which were used in a\"acks as old as 2009.The domain names used to host C2 servers are a mix of actor-registered and Dynamic DNS (DDNS,) though mostare DDNS. The DDNS domains in turn are linked to a small grouping of ASNs, with one ASN o$en largely !ed toone FakeM variant. Most of the FakeM MSN C2s resolve to IP addresses associated with ASN 22781 (RBLHST -Reliablehos!ng.com). However, we found one MSN sample that shared infrastructure with some FakeM CustomSSL variants.There is a similar overlap between FakeM MSN, FakeM HTML, and FakeM SSL. The registrant emailxsldmt@xj163[.]cn was used to register several domains used as C2s: yourturbe[.]org, websurprisemail[.]com andgoogmail[.]org. One of these domains was also used in the 2013 CallMe ac!vity at the same !me it was beingused for FakeM MSN samples. The targe!ng and decoy style also matches with the FakeM ac!vity.There is PE resource overlap between some FakeM MSN samples and some samples of the BiFrost and Poison IvyTrojan. This may indicate that the same developer who created the par!cular BiFrost and Poison Ivy samples wasalso involved in developing FakeM MSN. Unit 42 found an overlap between the RT_VERSION resources, whichcontains the version informa!on of a Portable Executable (PE) ﬁle, shared amongst the three diﬀerent Trojans. Theshared RT_VERSION resource (MD5: 55b7a118203a831cc69b37b785015c54) contained the followinginforma!on:Comments: ReleaseCompanyName: Develop TeamFileDescription: Utility ApplicationFileVersion: 4.0InternalName: UtilityLegalCopyright: Copyright (C) 2008LegalTrademarks: DT.Inc01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 19 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/OriginalFilename: Utility.EXEPrivateBuild: 4.0bProductName: Utility ApplicationProductVersion: 4.0The overlap between Elirks, FakeM SSL, Psylo, and MobileOrder exists en!rely in their command and controlinfrastructure, through domain names and/or IP resolu!on. Samples of these three used some of the same C2domains, notably lenovositegroup[.]com, ufoneconference[.]com, and websurprisemail[.]com, while someresolu!on overlap includes 118.193.212[.]12, 210.206.219[.]241, and 59.188.239[.]117. Similarly, some FakeMYahoo C2 domains and FakeM Custom SSL C2 domains also have overlapping IP resolu!ons, notably95.154.204[.]198.Scarlet Mimic also uses the infamous HTRAN tool on at least some of their C2 servers. HTRAN is a proxying toolthat allows actors to conceal the true loca!on of their C2 server. Actors will run HTRAN on a server and conﬁguretheir malware to interact with that server; however, the actor will conﬁgure HTRAN to forward traﬃc to anotherserver where the actual C2 server exists. For example, the FakeM C2 domain of “muslim.islamhood[.]net”resolved to the IP address 59.188.239.117 during analysis, but the server responded with the following errormessage:[SERVER]connec!on to 68.71.35.135:8081 errorThis error message suggests that the HTRAN applica!on running on 59.188.239.117 was unable to connect tothe real C2 server hosted at 68.71.35.135.Prior Publica!onsThroughout this report, we have referenced mul!ple previous blogs and white papers, from Unit 42 and others,that have documented elements of this threat in the past. In addi!on to those documents readers may also ﬁndthe following publica!ons interes!ng.In 2014, Ci!zen Lab released a paper on threats against civil society that referenced some of these a\"acks as the“Domain Name Family” or DNF.Kaspersky Lab has produced excellent research on a\"acks against Uyghur and Tibetan ac!vists. In 2013, theyiden!ﬁed an Android Trojan that was also targe!ng these groups. Our analysis indicates this malware is diﬀerentfrom the MobileOrder Trojan described above, but they serve very similar purposes.On January 12, 2016, Cylance published a blog linking an exploit document to the group Mandiant refers to asAPT2 and CrowdStrike as “Pu\"er Panda.” While there does appear to be a small overlap between IP addressesused in a\"acks from this group and those of Scarlet Mimic, our team has not concluded that these groups are onein the same.ConclusionThe informa!on discovered by Unit 42 and shared here indicates Scarlet Mimic is likely a well-funded and skillfullyresourced cyber adversary. Scarlet Mimic has carried out a\"acks using both spear-phishing and watering holessince at least 2009 with increasingly advanced malware, and has deployed malware to a\"ack mul!ple opera!ngsystems and pla&orms. Despite the apparent technical acumen, their decoy documents are typically not well[1]01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 20 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/cra$ed regardless of the use of the target’s language, though they do use !mely subject lures.The primary source of data used in this analysis is Palo Alto Networks WildFire, which analyzes malware used ina\"acks from around the globe. The system is also fed with malware samples collected through sharing partnershipwith other security vendors, including our partners in the Cyber Threat Alliance. To connect a\"acks to each otherbased on malware behavior and command and control infrastructure, we relied on Palo Alto Networks AutoFocusthreat intelligence. AutoFocus users can view all of the ﬁles related to Scarlet Mimic and the malware associatedwith the group using the following links:ScarletMimicFakeMPsyloMobileOrderPalo Alto Networks customers are protected from Scarlet Mimic a\"acks through many components of ourpla&orm.Threat Preven!on signatures for the so$ware vulnerabili!es listed in this report are available to detect theexploit ﬁles during delivery.Traps, our advanced endpoint solu!on, can prevent the so$ware vulnerabili!es listed in this report from beingexploited on a Windows host.WildFire classiﬁed all of the Android and Windows malware described in this report as malicious.We have released an!-malware signatures for the ﬁles listed in this report.The domain names used for command and control have been classiﬁed as malicious in PANDB.Scarlet Mimic Indicator DataFakeM Custom SSL Samples12dedcdda853da9846014186e6b4a5d6a82ba0cf61d7fa4cbe444a010f682b5d33e50c44804d4838dba6627b08210029ﬀ9106fa7fd16cd7255271e153f58b053d9bd26f5bd5401efa17690357f40054a3d7b438ce8c91367dbf469f0d9bd5205182dc8667432d76a276dc4f864cdfcef3e481783ebaf46d3b1397080b798f4a523ad50b498b(5ab688d9b1958c8058f905b634befc65e96f9f947e40893e5b5dade00db195087aa336ce190b5fd1c22992c49556c623b42a9f742d73241a7f7156f6416e7116e52f9c67f4e716b1dbea17387e61009c7f2825debbbb4dcb7379aca57905cca1e56b0cedf48a4d81812639c333ee6532d90a074d64b3852d6f879edf0417c4a9759040b51bf83b2fc918a6644a7c29a52252003a63036aea5c9b77bbb620f50632fae17c40c7469fc93ﬀdbc4136a6d893a9a10a44bc435da5a1b7fe2acdb7a5b0c52b7c1960cfad531a7ca85b602fc90044c57a2b2531699fa268cc4931781d1d8094a4f8f596c2de3d662f2581c735b0810ﬀ0ecefe3f859a4abbcfdbf4a6c52349a843eac0396e6d8abb05f1324223980d824629a42ef7aa569f3b02a4be99e0b4a9f1cﬀ43115da803f0660dd4df114b624316f3f63dc6b4c1e9c99f861a4dd7654dcc3548ab5ddc15ee5feb9690b9f716c4849714b20dbbdedcfe789641e7f244700e8c028ef51094b66508f503876eb0d6aa16df6aa8c7b9e6b5ab07e6da404af9894c8422d9a0c9586334ddc0a3c1ea6bf23ef97(201/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 21 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/caeace73a17e220634525d2a4117525fd60cb86a06873c86571e89d156f8d72dcaf76e19a2681dd000c96d8389afc749e774c083aef09f023d4f42(c49d4d3de96097826179a66cc3061be0f99f7b55cc9692a6378b5c4364699327823098abf511b13341c9(4ec9ecfcfe5a5813b964c362d7c709c402ead4e010d857bf6cfa08a498da0b31e77669d51a28dﬀ166d84983fa6af693063c08f312fdce93e3df9872d1dc1dbb101bf83c7e7d689d2d6df09966481a365f92cd451ef55f047dFakeM SSL Samples0aab09bf0db30a4be28d19475082fd5e7f75879bf9029fdd8dfc3a1e1f072b0c2e1472a65a8df43c8bc9b0aﬀ954(c1a093c4214f6a718a08e1321db83ca6833209ab95ca7ee7d8c0140f95bdb61a37d69810a7a23d90d63ecc69cc8c51db9041948c73b776b673f954f497e09cc469d55f27e7b6e19acb41b77f7e64c50a334a4dﬀfae6fc8be77ac9b2c67da547f0d57ﬀae59e0687a356f5105fdddc88a35154511a439bb367b7dd56232eb15281cb6dc4d64ea3a06e7(be6b176e385d45fae5750797ebe7e7a6a6919a7d66de)141ec28737bd72a1f7da8edd330b60aa8a302a53bd39b2d2a6e3d8497575e2a5f9757b248e34c8e0821ce9eee5cc32b3c9bb22fa1bc358dc23a1a4bdaf85ad1add4d812b107b7ab887a)f689933acd506679fd32dab16dee6(f1cfdfe0836e092a4f5669418a199d99c9cd33abdd1dd4469c7b5c462e5ﬀ2dcef5d22775250e9ebf395f65da624f18ea7144e173d698008e417da867d02e2f5cdcc80ﬀ92af753dd585fada42fc611c2d7332c3aFakeM Original Samples53af257a42a8f182e97dcbb8d22227c27d654bea756d7f34a80cc7982b70aa609adda3d95535c6cf83a1ba08fe83f718f5c722e06d0caﬀ8eab4a564185971c553cecc0d0f6924eacd23c49d0d95a6381834360(be2356778feb8dd396d723e631fc66e57acd52284aba2608e6f31ba19e2807367e33d8704f572f6af6bd9c37b(f49aa71b8235a16792ef721b7e4195df11cb75371f651595b37690d108c87c9421a4605decfa1b3e22addbca98d86ea757dcd8ﬀ8e075d13228c99618637202975d10ba417cf441e8f9986d2496807fe39e057d3226ec3b2713f0c218cd822e7517d8996e92998eb996416f9d8ef06b3b1c220c1a5d29ccd5aaef7b10c72435df30d139ccbe5ce4e5ca6fe072e42e96d5ea1efd5317deebce462ecccc7ab47d9ba5f7bf70c5d2b7a832e070957cc7ebdcfd0a6ee75851df16dc45971ce8a4a3d0df9fa198a7ebe45db5239d22067e74924b1aace52029b3acc9b51af691e4d539f638ed476ca08da838cd(f710dae82b582256d60a009e9d304f6822e65be0e8da7e261ec7d08eaa78e79ceb1be47c324b8e142097bf6569f9471c98a4ec30d03750458bb5f2b03d6bd399ﬀca6d378a3adb5a74bee3b6ba4b982dbf273cc7db456825e266849090b6fa95a94ad8c4c717712b610b0d39077af5222f4bed6d2a77f8ed2fe9fed9ee6dcb4cc0b339ba47a575c717c35815243c752d8f60cdb8338e6b883fdceaa02c10ad683547a26ae32e0d4641cc24c7bd3b45154abb0e8e5ecf525c5259651b(df1923215729ec67658225eca1b02519f5f6279eacbec4deb761b09ddc706804ef669836cf4b199f1d74b14ad623a6f6cc2f38190b8669ce0975c133d54e414dbf1de546aed742e76fe3e60568e2bd4747b7e0f8b700d77f5f1d4c0f02(88ac33fa365b17d28d1521cea59329ca4b3dd0b7031a60e363d9557861fab2d83d04847b967996361e670e571b335c7a535bc6278cba1497(2c37431fd7b05414b134732ba0b29cd7dad17fc176627ee0815aac60c1ab977e4ef9e08f1095487b4fa27492b4c9b8e833f29598f99a0d10f7c85b4254761a4ﬀca5f1c3d9c21629fa98a1e91121d954ab9347e86ac3c9613dae61bf30393428121c421bf81a0d689014cf21ec7951b0c32add86198e06f7d636981f68755a195f564aa2(66db119e2(ec93e319a973e5cf50(f9fc08bd81f9b7ee8af8c1e8ﬀ8ebe3754bc7d14509ef3678edf7551d876d3fa847d07d469c09bceae9101/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 22 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/53238f67ac7e4cc27264e(acc8712bd97a5775feaf633c63adaa0785d038e8a508a7cab0f2a69ba66e92e86817a49ecd1b9c8ae11a995147944995fc868dfad(60d14de4dba022f11437845d465a661d0c78d3d097a38770816f06992bf0af8da2f9afd914a4318a97f4d74809c0c383f8ebf0d3d6e3d3715e(d71a66a52f6fe33c672fd30bba9bbc89dc7d88993d8783382c9f9c510677b1bb068a5f1e516a1c7999b4ba92899d3364fc729d0f052680be5a71dd0f13cbabdb19b82bf8585db51f2f7c31de7d165ec4892ae7dcedaa036caedeef718b57953d7935582f0427167a9d63f5ddc68a12decb1a1e0a2a29c72fe0681dca2c4f3d169f048a9d386f10c892133b5dac6c40cfe77ca32b42572bc56909481b236080dfc143ef9afdde12cd8d11478d17342c60239837c1afcc9fee72df6ﬀdf9943802640d43f77a0f2db64b8283b76d49c9bb272beafab8323f941b6dc3888b42ﬀ02f08634d016Psylo Samples19bbee954ac1a21595e63cb86d1a596236aed353804aec5cb8adfa62e70280d3a9f0bddc3d3516af8355e8ac17309528cd018347e5f56a347c14da0a83b0028a00bb399c429e0f1f7de751103fe92b5f820d1686d01662a08583b7a94aaed94eMobileOrder Sample03004ccc23033a09532bea7dfa08c8dfa85814a15f5e3aedb924a028bcd6f908CallMe Samples071c34b9701dd84f9590ba899a8af3eeec228a928f2d98a80dbc780e396ee01ad1f0658bbb15ab2bccc210d7e1f21b96e14ae22de8494ca95b12e182f3d0f6939ﬀ687a813a5cb5ﬀ10374c86f852534c1aa3e5a221123214bf52b2ﬀ455a5da8c423506c0c7ebe1e61071374ecf0806463a02a2100b5daa1bd942129ﬀ8a23591e36e720477146f1a0c050d3bc74bc6683a03e7631317ded3c598a10465dcc8c981db20d588ba2d0f437b4e5459e7c6763f52a97841450c94591ca28a9a2d6995dba004f949e44cb447246f3d2420b01db4541d0e4fa7b00d798f38a3d251e4FakeM Custom SSL C2 Serversaaa123.spdns[.]deadmin.spdns[.]orgdetail43.myﬁrewall[.]orgeconomy.spdns[.]deﬁrefox.spdns[.]deﬁrewallupdate.ﬁrewall-gateway[.]netintersecurity.ﬁrewall-gateway[.]comkaspersky.ﬁrewall-gateway[.]netkasperskysecurity.ﬁrewall-gateway[.]comkissecurity.ﬁrewall-gateway[.]netmail.ﬁrewall-gateway[.]comnews.ﬁrewall-gateway[.]comopero.spdns[.]orgsys.ﬁrewall-gateway[.]net01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 23 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/FakeM SSL C2 Serversaccount.websurprisemail[.]comaddi.apple.cloudns[.]orgbailee.alanna.cloudns[.]bizbee.aoto.cloudns[.]orgbook.websurprisemail[.]comdesk.websurprisemail[.]comdolat.diyarpakzimin[.]comdolat.websurprisemail[.]comdolet.websurprisemail[.]comgithub.ignorelist[.]comislam.youtubesitegroup[.]commareva.catherine.cloudns[.]usmuslim.islamhood[.]netp.klark.cloudns[.]inppcc.vasilevich.cloudns[.]infopress.ufoneconference[.]comvip.yahoo.cloudns[.]infoFakeM Original C2 Servers207.204.225[.]117accounts.yourturbe[.]orgaddnow.zapto[.]orgbits.githubs[.]netclean.popqueen.cloudns[.]orgeconomy.spdns[.]eueemete.freetcp[.]comemail.googmail[.]orgﬁsh.seafood.cloudns[.]orgfreeavg.sytes[.]netfreeonline.3d-game[.]comibmcorp.slyip[.]comlemondtree.freetcp[.]comliumingzhen.my$p[.]orgliumingzhen.zapto[.]orgn.popqueen.cloudns[.]orgnews.googmail[.]orgoic-oci.3-a[.]netpolat.googmail[.]orgqq.ufoneconference[.]comqq.yourturbe[.]orgsisiow.slyip[.]comupdate.googmail[.]orguprnd.ﬂnet[.]orgvideo.googmail[.]orgwebmail.yourturbe[.]orgworldwildlife.eﬀers[.]comwww.angleegg.ddns[.]uswww.angleegg.xxxy[.]infowww.googmail[.]orgyouturbe.co[.]cc01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 24 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/yycc.mrbonus[.]comzjhao.dtdns[.]netPsylo C2 Serversapple.lenovositegroup[.]commm.lenovositegroup[.]com$p112.lenta.cloudns[.]pwwww.gorlan.cloudns[.]prootcgk.border.cloudns[.]pwMobileOrder C2 Serversziba.lenovositegroup[.]comCallMe C2 Serversapple12.crabdance[.]comupdate.googmail[.]orgapple12.crabdance[.]comalma.apple.cloudns[.]org Get updates from Palo Alto Networks!Sign up to receive the latest news, cyber threat intelligence and research from usEmail addressSubscribeBy submi'ng this form, you agree to our Terms of Use and acknowledgeour Privacy Statement.01/04/24, 11:36Scarlet Mimic: Years-Long Espionage Campaign Targets Minority Activists Pagina 25 di 25https://unit42.paloaltonetworks.com/scarlet-mimic-years-long-espionage-targets-minority-activists/  2024 Palo Alto Networks, Inc. All rights reserved.Popular ResourcesResource CenterBlogCommuni!esTech DocsUnit 42SitemapLegal NoticesPrivacyTerms of UseDocumentsAccountManage Subscrip!onsReport a Vulnerability"
}