{
    "title": "spy of the tiger _ fireeye inc",
    "text": " PREVIOUS POST nEXT POSTThreat Research Spy of the Tige r July 31, 2014 | by nart Villene uve, Joshua Homan  | Threat Intelligence THREaT InTELLIGEnCE  aDVanCED MaLWaR E a recent report documents a group of attacke rs known as “PittyTige r” that appea rs to have been active since at least 2011; however, they may have been ope rating as far back a s 2008 . We have been monito ring the activitie s of this group and believe they a re operating from China. This group leverages social enginee ring to deliver spearphishing email s, in a va riety of lang uages including English, French an d Chinese, and email phi shing page s to thei r targets. The attacke rs use a variety of different malware and tools to maintain comman d and control (C2) and move late rally through their targets’ networks. In a recent attack again st a French company, the attacke rs sent simple, straightforward messages in English and French from free email a ddresses using name s of actual employee s of the ta rgeted company. We have al so observed this group using a Yahoo ! email phi shing kit, with phishing page s for multiple regions and in multiple lang uages. The malicio us documents exploit v ulnerable ve rsions of Microsoft Office. The attacke rs used two different exploits CVE-2012 -0158  and CVE-2014-1761. The documents that exploit CV E-2012 -0158  were built using a tool that leave s behind the meta data which indicates that the a uthor is “Tran Duy Linh ”. (This builder has been shared across multiple th reat groups that are otherwise unconnecte d). The documents that exploit CV E-2014-1761 contain meta data that matche s malicio us documents created by both the Jdoc builder and the Meta sploit Framework, however, the exact b uilder tool used by the attacke rs remains unclear. This threat group uses a first-stage mal ware known as Backdoor.aPT.Pgift   (aka T roj/ReRol.a), which is dropped via malicio us documents and connect s back to a C 2 server. This malware comm unicates some info rmation abo ut the comp romised computer; however, its primary function i s to deliver the second-stage mal ware to the compromised computer. Backdoor.aPT.Pgift B uilder During our investigation, we discovered a builder used in conjunction with the Back door.aPT.Pgift mal ware. This builder is used to create an d test files placed on the C 2 server.  The builder creates three files: 25dd831 ae7d720998 a3e3a8d205 ab684  dr.asp 4b89c31d1d 7744bcf 5049d582d35 e717  Install-Dll.bat e738286 a0031621d50 aeb5fc1d95d 7a4  JHttpSrv.dll The dr.asp file is placed on a web server, and malware on comp romised systems will beacon to it. The file can retrieve the comp romised host’s IP address and returns either a 32-bit or 64-bit second-stage exec utable depending on the comp romised host’s environment. The Install-Dll.bat file simply in stalls JHttpSrv.dll by running the comman d: regsrv jhttpsrv The JHttpSrv.dll handles the incoming, enco ded data from comp romised hosts. This data is written to a text file in a directory name d “log” with the follo wing format: IP address-YYYYMMDD- HHMMSS.[ 3 digits].txt This data contain s information abo ut the comp romised system incl uding: Hostname Username System Type ( 32-bin or 64-bit) Operating Sy stem Organization Owner Ports and Processes Running Soft ware Installed Software network Config uration although this tool ha s some info rmation-gathe ring capabilitie s, it is primarily a “downloader” designed to push second-stage mal ware to a comp romised system. Previous attack s It appea rs the Back door.aPT.Pgift mal ware was used in an ea rlier attack again st a target in Tai wan. altho ugh the email date shows Septembe r 2010 , the act ual email appea rs to have been sent in Jan uary 2014. The malicious attachment  秋節酒品禮薈萃 .doc (4c350726bb7773f0ac98bdd665 ef93dc) exploit s CVE-2012 -0158  to drop f3b1a1c18c783c2e949e68f0dd0 47eae. The net work comm unication i s: POST /pgift.asp HTTP/1.1 Content-Length: 9637 User-Agent: Mozilla/4.0 (compatible;) Host: 113.10.221.196:8080 Connection: Keep-Alive Cache-Control: no-cache although the mal ware is the same, thi s version uses the filename “pgift.a sp” instead of “dr.asp.” We have ob served attacks against targets in Taiwan using phishing email s written in T raditional Chine se, and the repeated use of .tw domains as comman d and control servers may in dicate an inte rest in Taiwan as well. Malware The PittyTige r group uses various other malware including: Backdoor.aPT.PittyTige r1.3 (aka CT RaT) – Thi s malware is likely used as a second-stage back door. The behavio r of this sample i s similar to the “ol d” PittyTige r but is distinct. The attacke rs labeled it as PittyTige r v. 1.3 and use an inte rface that displays the system info rmation a ssociated with a comp romised computer and provides the attacke r with a remote shell. The attacke rs may be using this as second-stage mal ware. Backdoor.aPT.PittyTige r – This malware is the cla ssic “PittyTige r” malware (PittyTige rV1.0) that was heavily used by this group in 2012 -2013 . This malware allows the attacke rs to use a remote shell, upload and download files and capture screenshots. Backdoor.aPT.Lurid (aka MM RaT / T roj/Goldsun-B) – Thi s malware is a variant of the Enfal/Lurid malware used by a va riety of different groups since at lea st 2006 . This variant has the same functionality, b ut the file names have been change d. We have ob served the Enfal/Lurid malware in use since 2011 and in conjunction with Back door.aPT.Pgift a s the payloa d of a malicio us document used in spearphishing attack s. It also appears the attacke rs use this as second-stage mal ware. Gh0st variants – a report by Cassidian Cybe r Security reveals the attacke rs also use variants of Gh0st RaT, a well-known RaT used by a va riety of attacke rs. These variants are known as Paladin RaT an d Leo RaT. PoisonIvy – Thi s group also used the Poi son Ivy malware during 2008 -2009 . We analy zed PoisonIvy samples that connect to domain name s used by this group. The samples were compile d in 2008  and 2009  (one of the samples with a 2008  compile date was also submitted to Virustotal in 2008 , leading us to believe the timestamps have not been alte red). The PittyTige r group uses a variety of mal ware to achieve thei r objective s. We have not ob served these attacke rs using 0day exploit s; rather, they appea r to acq uire access to builders that are more widely distributed that can be used to create malicio us documents. ackno wledgement s We would like to thank alex Lan stein, Jen Kol de, Jonathan W rolstad, ned Moran and Thoufique Haq. Sample s Backdoor.aPT.Pgift 5e2360 a8c4a0cce1ae22919d8 bff49fd f74a7a7f4 3dfce7ff2851baefe19ef63 05de3bfb5da1dcf08f9ca0bd58936 4bf 5e2360 a8c4a0cce1ae22919d8 bff49fd 79e48961d1 ee982a466d2226 71a42ccb bf95e89906 b8a17fd611002660 ffff32 ed35e43142b42b57f51819 7d930 471d9 5e2360 a8c4a0cce1ae22919d8 bff49fd Backdoor.aPT.PittyTige r1.3 f65dc0b3eeb3c393e89ab49a3fac95a8 Backdoor.aPT.L urid b72cf03822 cd03a4923195 cb7db9ac41 eb658d398 ac5423656 4dd52 b23943736 728d6d3 c98b17de3261eaf76b9c3eb7a 735d3 7a1fde0f8d892 4a70e9101c45b1 9712235 ba979ef5a23db3ebdc41d9a02 d4be094c7f767fc6d9eda1665d536 484 Backdoor.aPT.PittyTige r 1097a30d91 b0e8adaec8951fb639ffe0 1f7796e76427c96d5 7086fcf797518f7 0618961 c6abf67670658 c659a4b3897f 370e2ebe5d72678affd3926 4a0d2fedd 55e456339936 a56c73a7883ea1ddb672 55e456339936 a56c73a7883ea1ddb672 7fade5e7576cc72559 c626603 71279e8 fa53ca3339 bb5619 f6e39215 a4697b52 1cea8afd101ab5008 7122231 acf88407 26be2cbb00158d fab6c81976d93 748e8 ce15fa3338 b7fe780e85c511d5 e49a98 a494010a51705f7720d3 cd378a31733a PoisonIvy ae35a23cb418af084d10820 bb0eae1d8 99a5fd0eba39efc9cba880d962921 7e0 a2494e1e528c4a973232d02 7172bee44  Email Up dates Information an d insight on to day's advanced threats from FireEye. SHaRE Recent Po sts 17 Mar 2020 16 Mar 2020 09 Mar 2020 RSS FEED: STaY CO nnECTED  First name Last name Email address Company name Threat Research Blog FireEye Stories Blog Industry Perspective s Blog Yes, I would like to receive communication s from FireEye. Please read more about our information collection an d use. SUBSCR IBE Six Fact s about address Space Layout Randomization on Windows  They Come in the night: Ransomware Deployment T rends  Crescendo: Real Time Event Vie wer for macOS    Home  FireEye Blog s Threat Research  July 2014 Threat Research Blog Po sts  Spy of the Tige r     Company Why Fi reEye? Customer Stories Careers Certification s and Compliance Investor Relation s Supplier Documents news and Events newsroom Press Releases Webina rs Events awards and Honors Email Preferences Technical S upport Incident? Report Security Issue Contact S upport Customer Portal Communities Documentation Po rtal FireEye Blog s Threat Research FireEye Stories Industry Perspective s Threat Map View the Late st Threats Contact U s +1 877-347-3393   Stay Connecte d  Copyright   2020  FireEye, Inc. all rights reserved.  Privacy & Cookie s Policy  | Privacy Shiel d | Legal Doc umentationSite Lang uage English Solutions Services Customers Partners Resources Company  "
}