{
    "title": "Thamar Reservoir – An Iranian cyber-attack campaign against targets in the Middle East – ClearSky Cyber Security",
    "text": "01/04/24, 14:55Thamar Reservoir – An Iranian cyber-attack campaign against targets in the Middle East – ClearSky Cyber Security Pagina 1 di 6https://www.clearskysec.com/thamar-reservoir/BlogThamar Reservoir – An Iranian cyber-attack campaign against targets in theMiddle EastPosted on June 3, 2015 by ClearSky Research TeamThis report reviews an ongoing cyber-attack campaign dating back to mid-2014. Additionalsources indicate it may date as far back as 2011. We call this campaign Thamar Reservoir,named after one of the targets, Thamar E. Gindin, who exposed new information about theattack and is currently assisting with the investigation.The campaign includes several di\"erent attacks with the aim of taking over the target’scomputer or gain access to their email account. We estimate that this access is used forespionage or other nation-state interests, and not for monetary gain or hacktivism. In somecases, the victim is not the ﬁnal target; the attackers use the infected computer, email, orstolen credentials as a platform to further attack their intended target.The attackers are extremely persistent in their attempts to breach their targets.  Theseattempts include:Breaching trusted websites to set up fake pagesMulti-stage malwareMultiple spear phishing emails based on reconnaissance and information gathering.SERVICESBLOGCOMPANYPARTNERSCONTACT US01/04/24, 14:55Thamar Reservoir – An Iranian cyber-attack campaign against targets in the Middle East – ClearSky Cyber Security Pagina 2 di 6https://www.clearskysec.com/thamar-reservoir/Phone calls to the target.Messages on social networks.While very successful in their attacks – the attackers are clearly not technically sophisticated.They are not new to hacking, but do make various mistakes – such as grammatical errors,exposure of attack infrastructure, easy to bypass anti analysis techniques, lack of codeobfuscation, and more.These mistakes enabled us to learn about their infrastructure and methods. Moreimportantly, we have learned of 550 targets, most of them in the Middle East, from variousﬁelds: research about diplomacy,  Middle East and Iran, international relations, and otherﬁelds; Defense and security; Journalism and human rights; and more.Below is the target distribution by country (click the image for full size): Various characteristics of the attacks and their targets bring us to the conclusion that thethreat actors are Iranian. In addition, we note that these attacks share characteristics withpreviously documented activities:Attacks conducted using the Gholee malware, which we discovered.Attacks reported by Trend Micro in Operation Woolen-Goldﬁsh.Attacks conducted by the Ajax Security Team as documented by FireEye.Attacks seen during Newscaster as documented by iSight.01/04/24, 14:55Thamar Reservoir – An Iranian cyber-attack campaign against targets in the Middle East – ClearSky Cyber Security Pagina 3 di 6https://www.clearskysec.com/thamar-reservoir/Read the full report: Thamar Reservoir – An Iranian cyber-attack campaign against targetsin the Middle East Posted in: Incidents SearchCategoriesCampaignscat2Cryptocyber attackCyber-CrimeDisinformationGeneralIncidentsThreat actorsUncategorizedArchiveFebruary 2024January 2024May 2023June 202201/04/24, 14:55Thamar Reservoir – An Iranian cyber-attack campaign against targets in the Middle East – ClearSky Cyber Security Pagina 4 di 6https://www.clearskysec.com/thamar-reservoir/April 2022August 2021May 2021February 2021January 2021December 2020October 2020August 2020June 2020April 2020February 2020January 2020October 2019September 2019August 2019July 2019June 2019May 2019April 2019February 2019November 2018July 2018February 2018January 2018December 2017November 2017October 2017August 2017July 2017May 2017April 2017March 201701/04/24, 14:55Thamar Reservoir – An Iranian cyber-attack campaign against targets in the Middle East – ClearSky Cyber Security Pagina 5 di 6https://www.clearskysec.com/thamar-reservoir/January 2017November 2016October 2016June 2016January 2016November 2015September 2015June 2015May 2015September 201401/04/24, 14:55Thamar Reservoir – An Iranian cyber-attack campaign against targets in the Middle East – ClearSky Cyber Security Pagina 6 di 6https://www.clearskysec.com/thamar-reservoir/  Cyber SolutionsThreat IntelligenceCyber strategyCyber architecturePay per report – APT Group researchCyber Tabletop ExerciseContact usHead o#ce:HaTa’asiya St 4Tel Aviv-YafoPhone: +972 586 277684Email: info [at] clearskysec.comSitemap xml | Copyright 2024   ClearSky Cyber Security"
}