{
    "title": "Tracking ‘Kimsuky’, the North Korea-based cyber espionage group - Part 1",
    "text": "01/04/24, 21:04Tracking ‘Kimsuky’, the North Korea-based cyber espionage group: Part 1 Pagina 1 di 7https://www.pwc.co.uk/issues/cyber-security-services/research/tracking-kimsuky-north-korea-based-cyber-espionage-group-part-1.htmlTracking ‘Kimsuky’, the North Korea-based cyber espionage group: Part 1 18 February, 2020For years, we have tracked the espionage threat actor we call BlackBanshee (also known in open source as Kimsuky). In 2019, it launchedmultiple parallel cyber espionage campaigns, from large-scalecredential harvesting to narrowly targeted espionage and exfiltrationoperations.The foundations for this activity began in August 2018, when weobserved Black Banshee setting up a substantial number of domainsimpersonating organisations across the government, academia, andpolicy sectors. This formed the basis for multiple spear-phishing andcredential harvesting campaigns.In tracking Black Banshee, we have identified a number of highlycharacteristic elements of the threat actor’s tools, techniques, andprocedures (TTPs). In the two parts of this retrospective look at BlackBanshee’s 2019 activity, we will:Examine the overlaps in Black Banshee’s infrastructure and modusoperandi that have allowed us to connect multiple strands of itsoperations more clearly than detailed so far in open source;Connect its 2019 campaigns, linking to activity dating back to late2018; and,Highlight how it has operated to achieve certain strategicobjectives.Tradecraft: most used domainsand naming conventionsInfrastructure connections: IP addressesSearchIndustriesServicesIssuesAbout usCareersMedia centreUnited KingdomUK homeIssuesCyber security servicesResearchTracking ‘Kimsuky’, the North Korea-based cyber espionage group: Part 101/04/24, 21:04Tracking ‘Kimsuky’, the North Korea-based cyber espionage group: Part 1 Pagina 2 di 7https://www.pwc.co.uk/issues/cyber-security-services/research/tracking-kimsuky-north-korea-based-cyber-espionage-group-part-1.htmlFirstly, let us dive into Black Banshee’s mannerisms in setting up itsinfrastructure. Across 2019, it was possible to tie together differentBlack Banshee campaigns through the IP addresses used. Forexample, on numerous occasions command and control domains forBlack Banshee malware resolved to IP addresses in following ranges -185.224.137[.]0/23 and 185.224.138[.]0/23The address 185.224.137[.]164, for one, has been used since at leastDecember 2018 and up to January 2020 to serve at least 24 maliciousBlack Banshee domains, including (but not limited to):user-daum-centre[.]pe[.]hu (from 2019-04-15 to 2019-05-21);rrnaver[.]com (from 2019-08-21 to 2020-01-01); and,nortice-centre[.]esy[.]es (from 2020-01-02 to 2020-01-28).It also hosted, between June and November 2019, the domain kakao-check[.]esy[.]es, which served as command and control (C2) for asample of a new malware family that we call MyDogs – a RAT thoughtto be unique to Black Banshee, and which was first reported on in opensource by AhnLab as part of its analysis on Operation Red Salt. Infrastructure connections: domains1 Figure 1. 185.224.137[.]164 is an example of an IP that has hosted numerous Black Bansheedomains – associated with different campaigns – throughout 2019 and into 2020. Some ofthese domains are shown here. 01/04/24, 21:04Tracking ‘Kimsuky’, the North Korea-based cyber espionage group: Part 1 Pagina 3 di 7https://www.pwc.co.uk/issues/cyber-security-services/research/tracking-kimsuky-north-korea-based-cyber-espionage-group-part-1.htmlAmong the domains used by Black Banshee, a few stood out forfrequency across its campaigns.pe[.]hu - numerous subdomains on this domain were used inOperation Kabar Cobra, Operation Kitty Phishing, and OperationWildCommand; additional subdomains were listed in a FinancialSecurity Institute VirusBulletin report detailing the tradecraft ofnumerous operations attributed to Black Banshee;hol[.]es - subdomains on this domain were used for both theWildCommand cluster and Operation MoneyHolic. Incidentally,some of the malware involved in Operation MoneyHolic weresamples of MyDogs malware, which was also used in OperationRed Salt;esy[.]es - subdomains on esy[.]es further strengthen theconnections in infrastructure setup between the WildCommandcluster and Operation MoneyHolic, as well as overlaps with theinfrastructure used for MyDogs malware used in Operation RedSalt; and,890m[.]com - subdomains on 890m[.]com were implicated in theWildCommand cluster, as well as in activity using KONNI that hadties to Black Banshee, and in other Black Banshee activity.While these domains are available for anyone to use, and not all of theirsubdomains are malicious, Black Banshee used subdomains on thesedomains multiple times across different operations. Other North Korea-based threat actors, especially APT37/Reaper, have also made use ofsome of the same domains (such as hol[.]es, 890m[.]com) throughout2019.2 3 4501/04/24, 21:04Tracking ‘Kimsuky’, the North Korea-based cyber espionage group: Part 1 Pagina 4 di 7https://www.pwc.co.uk/issues/cyber-security-services/research/tracking-kimsuky-north-korea-based-cyber-espionage-group-part-1.htmlInfrastructure connections: namingEven where the subdomains’ parent domain was not the same, ouranalysts noticed a pattern of naming in adversary-registeredinfrastructure. We saw Black Banshee go down three main routes fordomain naming:1. Naming highly specific to an organisation or institution beingtargeted or impersonated (and often used for credential phishing);2. Keywords referring to software used specifically in South Korea,often combined with more generic, office- or enterprise-relatedthemes; and,3. Seemingly generic names, including ones impersonating emailservices, or domains with similar or incremental numbering.Figure 2. A high-level overview of some of the connections between different 2019 BlackBanshee campaigns. 01/04/24, 21:04Tracking ‘Kimsuky’, the North Korea-based cyber espionage group: Part 1 Pagina 5 di 7https://www.pwc.co.uk/issues/cyber-security-services/research/tracking-kimsuky-north-korea-based-cyber-espionage-group-part-1.htmlBlack Banshee was also consistent in the setting up of command andcontrol server-side folders:“/Est/up” and “/Est/down” were server-side paths seen in OperationKabar Cobra, Operation Kitty Phishing, and OperationWildCommand – folders to stage files uploaded or downloaded byinfected machines. We observed a similar server-side path(http://nortice-centre[.]esy[.]es/down/) being referred to by a newsample of a Black Banshee Windows Script File downloader firstseen on 31 December 2019; this likely indicates that the threatactor is maintaining a consistent approach to infrastructuremanagement and naming.The server-side path “/bbs/data/temp” was observed in bothOperation Kabar Cobra and Operation Kitty Phishing.Its parent path, “/bbs/data”, was observed in the context ofOperation Red Salt, with one of the sub-folders associated withmalware that was later tied by ESTSecurity to KONNI. Additionally,the same path was also observed on APT37/Reaper command andcontrol servers.Finally, “/bbs/filter” was present on a C2 for MyDogs malwarerelated to Operation Red Salt.6In SummaryIn tracking North Korea-based threat actor Black Banshee (also knownas Kimsuky), we observed the threat actor display a series ofinfrastructure set-up habits. These included the use of specific IPranges to set up actor-controlled command and control domains, thenaming conventions used for such domains, and server-side foldernames consistently reused by Black Banshee across its C2s.Such habits and TTPs effectively allowed us to connect multiplecampaigns through direct links and similarities in command and controlinfrastructure.But that’s not all. Having connected multiple Black Banshee’soperations across 2019, we observed that distinct “clusters” of activityappeared – groups of campaigns and operations tied together byinfrastructure links, similar tradecraft, shared indicators, and matchingtargeting.In an upcoming blog, we will detail the connections betweencampaigns found across these clusters and offer strategic insight abouttheir coherence in terms of TTPs and objectives.01/04/24, 21:04Tracking ‘Kimsuky’, the North Korea-based cyber espionage group: Part 1 Pagina 6 di 7https://www.pwc.co.uk/issues/cyber-security-services/research/tracking-kimsuky-north-korea-based-cyber-espionage-group-part-1.html1. ‘Security Issue: Analysis Report on Operation Red Salt’, in ‘ASEC Report Vol. 96 Q32019’, AhnLab2. ‘Kimsuky: Tracking the King of the Spear-Phishing’, Jaeki Kim, Kyoung-Ju Kwak,Min-Chang Jang, VirusBulletin (4th October 2019)3. Commonalities found between APT Groups “Konni” and “Kimsuky”’, EST Security(10th June 2019)4. CTO-TIB-20181122-01A - Reaper's Hooks5. CTO-QRT-20190424-01A - NOKKI against Norway6. ‘Detailed Analysis of Red Eyes Hacking Group’, AhnLab, May 2018Related content Tracking ‘Kimsuky’, the NorthKorea-based cyber espionagegroup: Part 2In 2019, PwC observed an increase in activity byNorth Korea-based threat actor Black Banshee.Investigating Black Banshee’s 2019 activity, weidentified a...Contact us EmailKris McConkeyCyber Threat Operations Lead Partner, PwC UnitedKingdomTel: +44 (0)7725 707360 EmailSveva Vittoria ScenarelliCyber Threat Intelligence Analyst, PwC UnitedKingdom ×HideGet in touchGet in touchGet in touchGet in touch01/04/24, 21:04Tracking ‘Kimsuky’, the North Korea-based cyber espionage group: Part 1 Pagina 7 di 7https://www.pwc.co.uk/issues/cyber-security-services/research/tracking-kimsuky-north-korea-based-cyber-espionage-group-part-1.html   Please Click Here Submit reCAPTCHANon sono un robotPrivacy - TerminiFirst name (Required)Last name (Required)Job title (Required)Company (Required)Business email address (Required) By submitting your information, you acknowledge that we may sendyou material relevant to your interests.Please see our privacy statement for details of why and how we usepersonal data and your rights (including your right to object and to stopreceiving marketing communications from us). To stop receivingmarketing communications from us, click on the unsubscribe link in therelevant email received from us or send an email touk_emailconsent@pwc.com. AuditConsultingDealsRiskTaxIndustriesAbout usOfficesMedia centreCareersAlumniSitemap  2015 - 2024 PwC. All rights reserved. PwC refers to the PwC network and/or one or more of itsmember firms, each of which is a separate legal entity. Please see www.pwc.com/structure for furtherdetails.Terms and conditions Privacy Statement Cookie info Legal DisclaimerAbout Site Provider Provision of Services DiversityHuman rights and Modern Slavery Statement Web Accessibility"
}