{
    "title": "Trend Micro antivirus zero-day used in Mitsubishi Electric hack | ZDNET",
    "text": "01/04/24, 20:48Trend Micro antivirus zero-day used in Mitsubishi Electric hack | ZDNET Pagina 1 di 4https://www.zdnet.com/article/trend-micro-antivirus-zero-day-used-in-mitsubishi-electric-hack/techHome  Tech  SecurityTrend Micro antivirus zero-day used inMitsubishi Electric hackHackers exploited a Trend Micro OfficeScan zero-day toplant malicious files on Mitsubishi Electric servers. special feature Cyberwar and the Future ofCybersecurityToday's security threats have expanded inscope and seriousness. There can now bemillions -- or even billions -- of dollars at riskwhen information security isn't handledproperly.Read now Chinese hackers have used azero-day in the Trend MicroOfficeScan antivirus during theirattacks on Mitsubishi Electric,ZDNet has learned from sourcesclose to the investigation.Trend Micro has now patched thevulnerability, but the company didnot comment if the zero-day wasused in other attacks beyondMitsubishi Electric.Mitsubishi Electric hackNews of the Mitsubishi Electrichack became public on Monday,this week. In a press release published on its website, the Japanese Written by Catalin Cimpanu, ContributorJan. 24, 2020 at 12:51 p.m. PT ranktrend read full trend report1newGoogle nowshows AI2newGoogle Mapsintroduces3newMicrosoftintegrates4newClaude 3 LLMsurpasses Try it free for 14 days Lokaliserelated Are your smart homedevices secure? Somewill soon sport thissecurity seal of approval Everything you need toknow about theMicrosoft ExchangeServer hackNvidia chip, GPT-5,Microsoft AI devices,and Google healthredesign top ZDNET'sInnovation Indextrendingtechinnovationbusinesssecurityadvicetomorrowbelongs to those who embrace ittoday01/04/24, 20:48Trend Micro antivirus zero-day used in Mitsubishi Electric hack | ZDNET Pagina 2 di 4https://www.zdnet.com/article/trend-micro-antivirus-zero-day-used-in-mitsubishi-electric-hack/electronics vendor and defense contractor said it was hacked last year.The company said it detected an intrusion on its network on June 28, 2019.Following a months-long investigation, Mitsubishi said it discovered thathackers gained access to its internal network from where they stoleroughly 200 MB of files.While initially the company didn't reveal the content of these documents, inan updated press release, the company said the files contained primarilyinformation on employees, and not data related to its business dealingsand partners.According to Mitsubishi, the stolen documents contained:Data on employment applications for 1,987 peopleThe results of a 2012 employee survey that was filled in by 4,566 peoplefrom its head officeInformation on 1,569 Mitsubishi Electric workers that retired between2007 and 2019Files with corporate confidential technical materials, sales materials, andothers.The zero-dayThis week, Japanese media dug deeper into the hack. According toreports, the hack first originated at a Mitsubishi Electric Chinese affiliate,and then spread to 14 of the company's departments/networks.The intrusion was allegedly detected after Mitsubishi Electric staff found asuspicious file on one of the company's servers.None of this was confirmed by the Japanese company, but discovered byJapanese reporters. The only technical detail in relation to the hackMitsubishi Electric disclosed was the fact that hackers exploited avulnerability in one of the antivirus products the company was using.A source with knowledge of the attack told ZDNet that the hackersexploited CVE-2019-18187 , a directory traversal and arbitrary file uploadvulnerability in the Trend Micro OfficeScan antivirus.01/04/24, 20:48Trend Micro antivirus zero-day used in Mitsubishi Electric hack | ZDNET Pagina 3 di 4https://www.zdnet.com/article/trend-micro-antivirus-zero-day-used-in-mitsubishi-electric-hack/According to a security advisory Trend Micro sent out in October 2019,\"affected versions of OfficeScan could be exploited by an attacker utilizinga directory traversal vulnerability to extract files from an arbitrary zip file to aspecific folder on the OfficeScan server, which could potentially lead toremote code execution (RCE).\"In a case study on its website, Trend Micro lists Mitsubishi Electric as oneof the companies that run the OfficeScan suite.When it patched CVE-2019-18187 back in October, Trend Micro warnedcustomers that the vulnerability was being actively exploited by hackers inthe wild. Japanese media claimed that the intrusion was the work of a Chinesestate-sponsored cyber-espionage group known as Tick.The Tick hacking group is known for carrying out a large number of hackingcampaigns aimed at targets all over the world over the past few years.Currently, it is unclear if the group also used the OfficeScan zero-dayagainst other targets.Trend Micro declined to comment for this article.The world's most famous and dangerous APT (state-developed) malware Editorial standardssecurity Do you need antivirus on Linux?6 ways to protect yourself from gettingscammed online, by phone, or IRLThe best VPN free trials for 20248 habits of highly secure remoteworkers01/04/24, 20:48Trend Micro antivirus zero-day used in Mitsubishi Electric hack | ZDNET Pagina 4 di 4https://www.zdnet.com/article/trend-micro-antivirus-zero-day-used-in-mitsubishi-electric-hack/show comments  we equip you to harnessthe power of disruptiveinnovation, at work andat home.  2024 ZDNET, A Red Ventures company. All rights reserved. Privacy Policy | | Manage Preferences | Advertise |Terms of Usetopicsgalleriesvideosdo not sell or share mypersonal informationabout ZDNETmeet the teamsitemapreprint policy CLICK TO UNMUTE"
}