{
    "title": "triton actor ttp profile_ custom attack tools_ detections_ and att_ck mapping _ fireeye inc",
    "text": " PREVIOUS POST nEXT POSTThreat Research TRITOn actor TTP Profile, Custom attack Tool s, Detection s, and aTT&CK Mapping april 10, 2019  | by Steve Mille r, nathan B rubaker, Daniel Kapellmann Zaf ra, Dan Caban MaLWaR E  TTPS   ICS SECURITY Overview FireEye can no w confirm that we have uncovered and are responding to an additional int rusion by the attacke r behind TRITOn at a different critical inf rastructure facility . In Decembe r 2017, FireEye publicly released our first analysis on the TRITOn attack  where malicio us actors used the TRITOn custom attack f ramework to manip ulate industrial safety systems at a critical inf rastructure facility and inadvertently ca used a process shutdown. In subsequent research we examine d how the attacke rs may have gaine d access to critical component s needed to build the TR ITOn attack f ramework. In our most recent analysis, we attributed the intrusion activity that le d to the deployment of TR ITOn to a Russian gove rnment- owned technical research institute in Mo scow. The TRITOn intrusion is shrouded in mystery. There has been some public discussion surrounding the TR ITOn framework and its impact at the ta rget site, yet little to no info rmation ha s been shared on the tactic s, techniq ues, and procedures (TTPs) related to the int rusion lifecycle, o r how the attack ma de it deep eno ugh to impact the in dustrial processes. The TR ITOn framework itself and the intrusion tool s the acto r used were built and deployed by humans, all of whom ha d observable h uman strategies, preferences, and convention s for the custom tooling of the int rusion ope ration. It is our goal to discuss these adversary metho ds and highlight exactly how the develope r(s), operator(s) and others involve d used custom tool s in the int rusion. In this report we contin ue our research of the acto r’s operations with a specific foc us on a selection of c ustom information technology ( IT) tools and tactics the threat acto r leveraged during the ea rly stages of the ta rgeted attack lifecycle (Fig ure 1). The info rmation in thi s report is derived from multiple TR ITOn-related incident responses carried out by FireEye Man diant. Using the metho dologies described in this post, FireEye Man diant inci dent responders have uncovered additional int rusion activity f rom this threat acto r – including new custom tool sets – at a second critical infrastructure facility. a s such, we strongly enco urage industrial cont rol system (ICS) asset owners to leve rage the indicators, TTPs, and detection s included in this post to imp rove thei r defenses and hunt for related activity in their networks. For IT and operational technology (OT) inci dent response support, please contact FireEye Man diant. For more in-depth analy sis of TRITOn and other cyber threats, consider subscribing to FireEye Cybe r Threat Intelligence . FireEye’s SmartVision technology, which searches for attacke rs during late ral movement activitie s by monito ring east-west traffic in IT and OT net works, reduces the risk of an attack reaching sensitive ICS processes. This is particularly relevant fo r sophisticated ICS-related intrusions as attacke rs typically move f rom corporate IT to OT networks through systems that are accessible to both envi ronment s, far beyond perimeter defenses. Content s Tools and TTPs Hunting fo r ICS-focused threat acto rs across IT and OT Methodology an d discovery strategies appendix a: Discovery Rules appendix B: Technical analy sis of Custom attack Tool s appendix C: MITRE aTT&CK JSO n Raw Data Indicators of Comp romise Figure 1: The Fi reEye targeted attack lifecycle actor Leveraged a Variety of C ustom and Commo dity Intrusion Tool s Throughout the ta rgeted attack lifecycle, the acto r leveraged dozens of custom an d commo dity intrusion tool s to gain an d maintain acce ss to the ta rget's IT and OT net works. a selection of the c ustom tool s that Fi reEye Mandiant recovered are listed later in this post in Table 1, and hashes are listed in Table 2 at the en d of this post. Discovery rules for and technical analy sis of these tools, as well as MITRE aTT&CK JSO n raw data, is available in appendix a, appen dix B, an d appen dix C. Figure 2: Selection of c ustom tool s used by the acto r The acto r's custom tool s frequently mi rrored the functionality of commo dity tools and appear to be develope d with a foc us on anti-vi rus evasion. The g roup often leve raged custom tool s when they appea red to be struggling with anti-vi rus detection o r were at a c ritical pha se in the int rusion (e.g., they switched to custom backdoors in IT and OT DMZ right befo re gaining acce ss to the enginee ring workstation). In some instances, the actor leveraged custom an d commo dity tools for the same function. Fo r example, they used Mimikat z (public) and SecHack (custom) fo r credential ha rvesting; both tool s provide a very similar output (Figure 2). Figure 3: Default outputs for Mimikat z (left) an d SecHack (right) Tools and TTPs Indicate a Deep Interest in Ensuring Prolonged and Persistent access to the Ta rget Environment The targeted attack lifecycle of a sophisticated ICS attack i s often mea sured in years. attacke rs require a long time to p repare for such an attack in o rder to learn about the ta rget’s industrial processes and build custom tools. These attack s are also often ca rried out by nation states that may be inte rested in preparing for contingency ope rations rather than con ducting an imme diate attack (e.g., in stalling mal ware like TR ITOn and waiting fo r the right time to use it). During this time, the attacke r must ensure contin ued access to the ta rget environment o r risk losing yea rs of effo rt and potentially expen sive custom ICS malware. This attack was no exception. The acto r was present in the ta rget net works for almost a year before gaining acce ss to the Safety Instrumented System (SIS) enginee ring workstation. Th roughout that pe riod, they appea red to prioritize operational security. after establishing an initial foothol d on the co rporate net work, the TR ITOn actor focused most of thei r effort on gaining acce ss to the OT net work. They did not exhibit activitie s commonly a ssociated with espionage, such as using key logge rs and screenshot grabbers, browsing files, and/or exfiltrating la rge amo unts of information. Mo st of the attack tool s they used were focused on net work reconnai ssance, late ral movement, an d maintaining presence in the ta rget envi ronment. The acto r used multiple techniq ues to hide their activitie s, cover their tracks, and deter forensic examination of their tools and activitie s. They renamed their files to make them look like legitimate file s, for example, KB77 846376.exe, name d after Microsoft update files. They routinely used standard tools that would mimic legitimate a dministrator activitie s. This included heavy use of RDP an d PsExec/WinRM. When planting webshells on the O utlook Exchange servers, they mo dified already existing legitimate flogon.j s and logoff.a spx files. They relied on enc rypted SSH-based tunnels to transfer tools and for remote comman d/program execution. They used multiple staging fol ders and opted to use directories that were used infrequently by legitimate users or processes. They routinely deleted dropped attack tool s, execution log s, files staged for exfiltration, an d other files after they were finished with them. They renamed their tools' filename s in the staging fol der so that it would not be po ssible to i dentify the malware's purpose, even afte r it was deleted from the disk through the residual artifacts (e.g., ShimCache entries or WMI Recently U sed apps). They used timestomping to mo dify the $STanDaRD_ InFORMaT IOn attribute of the attack tool s. Once the acto r gained access to the ta rgeted SIS controllers, they appea red to focus solely on maintaining access while attempting to successfully deploy TR ITOn. This involve d strategically limiting thei r activitie s to mitigate the risk of being discovered. The acto r gained a foothol d on the distributed control system (DCS) b ut did not leve rage that acce ss to learn about plant ope rations, exfiltrate sensitive info rmation, tampe r with the DCS cont rollers, or manipulate the process. They then gaine d access to an S IS enginee ring workstation. F rom this point fo rward, they foc used most of their effort on delivering and refining a back door payloa d using the TR ITOn attack f ramework. They attempte d to reduce the chance of being ob served during highe r-risk activitie s by inte racting with target cont rollers during off-ho ur times. This would ensure fewer workers were on site to react to potential alarms caused by cont roller manipulation. They renamed their files to make them look like legitimate file s, for example, t rilog.exe, name d after a legitimate Schnei der Electric application. Operational Since at Lea st 2014 Based on analy sis of the acto r’s custom int rusion tool s, the group has been ope rating since as early as 2014. It is worth noting that Fi reEye had never before encountered any of the acto r's custom tool s, despite the fact that many of them date to several years before the initial comp romise. This fact an d the acto r's demonstrated interest in ope rational security suggests there may be othe r target envi ronment s – beyon d the second intrusion announced in this blog po st – where the acto r was or still is present. a sample of a C ryptcat-ba sed backdoor used to establish the initial foothol d was recovered during the investigation; the sample was compile d and uploaded to a mal ware testing envi ronment by the acto r in 2014. Cryptcat- an d PLInK-based backdoors were scheduled to exec ute daily starting from april 28, 2014, using ProgramDataUp dater and networkaccessProtectionUp dateDB ta sks. This date is unrelated to the ob served intrusion timeline an d may in dicate the date the th reat acto rs first created these persistence mechani sms. netExec.exe, a c ustom late ral movement an d remote comman d execution tool, i s self-titled \"netExec 2014 by OSa.\" SecHack.exe \"by OSa,\" a c ustom credential ha rvesting and reconnai ssance tool, was compile d on Oct. 23, 2014. The attacke rs used a pirated version of Wii.exe, a p ublic file in dexing tool that came with a licen se from 2010  and has not been updated since 2014. ICS asset Owners Should Prioritize Detection an d Defense across Windows Systems in Both IT and OT Most sophisticated ICS attack s leveraged Windows, Linux, and other traditionally \" IT\" systems (locate d in eithe r IT or OT net works) as a conduit to the ultimate ta rget. Some example s include leveraging comp uters to gain access to targeted PLCs (e.g., St uxnet), inte racting directly with internet-connecte d human machine inte rfaces (HMIs) (e.g., Black Energy), and gaining remote acce ss to an enginee ring station to manip ulate a remote te rminal unit (RTU) (e.g., InDUSTROY ER) or infect S IS programmable logic cont rollers (PLC) (e.g., TR ITOn). Defenders who focus on stopping an attacke r in these \"conduit\" systems benefit f rom a number of key advantage s. These advantage s will only g row as IT and OT systems continue to conve rge. attacke rs commonly leave a b road footprint in IT systems across most if not all the attack lifecycle. It is ideal to stop an attacke r as early in the attack lifecycle a s possible (aka \"left of boom\"). Once an attacke r reaches the targeted ICS, the potential of a negative o utcome an d its severity for the target increase dramatically. There are many mat ure security tools, services, and other capabilitie s already available that can be leveraged to defend and hunt in \"con duit\" systems. Leveraging Kno wn Tools and TTPs To Hunt For the TR ITOn actor Historic activity a ssociated with this actor demonstrates a strong development capability fo r custom tooling. The develope r(s) behind these toolsets leaned heavily on exi sting software frameworks and modified them to be st serve the int rusion ope rations. The develope r(s) had preferences regarding the po rts, protocols, persistence mechani sms, and other aspects of how the mal ware operated. While the p references of the development team supporting this activity will likely shift and change ove r time, learning abo ut them i s still useful to identify whether their TTPs are applicable to othe r malware develope rs and threat acto rs. additionally, the acto r possibly gaine d a foothol d on othe r target net works—beyon d the two intrusions discussed in this post – using similar strategies. In such cases, retrospective h unting would help defenders identify an d remediate malicio us activity. Based on the examination of develope r(s) preferences and abstracted adversary metho dologies, it is possible to build broader visibility of the TTP s using detection an d hunting rules of various fidelity an d threat density. The compilation of the se rules makes it possible to i dentify an d classify potentially malicio us samples while building new \"haystacks\" in which to h unt for adversary activity. The TTP s we extracted from this actor’s activitie s are not nece ssarily exclusive, nor are they nece ssarily malicio us in every circumstance. However, the TTP p rofile built by Fi reEye can be used to search for patterns of evil in subsets of network and endpoint activity. not only can the se TTPs be used to find evidence of int rusions, but identification of activity that ha s strong ove rlaps with the acto r's favored techniq ues can lea d to stronger assessments of acto r association, f urther bolstering incident response efforts. The follo wing table p rovides insights into notable metho dologies surrounding the use of custom tool s and tips for identifying evi dence of thi s and related activity. a dversary metho dologies are also expressed in terms of the MITRE aTT&CK f ramework (see appen dix C for MITRE aTT&CK JSO n raw data). adversary MethodologyDiscovery Tips Persistence by Sche duled Tasks by XML trigger aTT&CK: T1053Look fo r new and anomalo us Scheduled Tasks XML triggers referencing unsigned .exe file s. Persistence by IFEO injection aTT&CK: T1183Look fo r modification s and new entries referencing .exe file s under registry key HKEY_LOCaL_MaC HInE \\SOFTWaR E\\Microsoft\\Win dows nT\\CurrentVersion\\Image File Execution Option s. Comman d and control (C2) established using hard- coded DnS serversLook fo r PEs executions with run DnS lookups to 8.8.8.8:53. This may be applicable to sandbox and other malware processing technologie s. C2 using favored C2ports aTT&CK: T1043 aTT&CK: T1065Look fo r outbound connection s with port-protocol mi smatche s on common and uncommon po rts such as 443, 4444, 8531, and 50501 . C2 using favored Virtual Private Server (VPS) infrastructure aTT&CK: T1329Look fo r inbound and outbound connection s from and to non- standard IP ranges, especially f rom inte rnational VPS p roviders like OV H and UK-2 Limited (uk2.net). C2 domains with hyphenLook fo r newly observed 2LD and 3LD domains that contain hyphen s. C&C using dynamic D nS domains from afraid.org aTT&CK: T 1311Look fo r newly observed dynamic D nS domains owned or registered with afraid.org. C2 domains registered with vfemail.net email addressesLook fo r newly observed domains or DnS resolutions to domains with registrant email info rmation containing vfemail.net Tunneled RDP using PLInK aTT&CK: T1076Look fo r the presence of PL InK and non-standard RDP usage with event logs, firewall logs, and registry keys as described in the Fi reEye blog po st \"Bypassing network Restrictions Through RDP T unneling. \" Find internal RDP pivoting by looking fo r bitmap cache file s under user accounts that should not be acce ssing sensitive systems via RDP. Look fo r bitmap cache file s such as bcache 22.bmc under default, service, or administrator accounts or any acco unt not expecte d to be con ducting internal RDP acce sses to sensitive systems in a protected OT-connecte d zone, especially in the DMZ o r DCS areas like HMIs or enginee ring workstations. C2 using hard-coded SSH private keysLook fo r PEs with hard-coded OpenSS H private key s. Use of direct RDP aTT&CK: T1076Look fo r inbound RDP connection s with default host information, non- standard or unexpecte d locale IDs, or other metadata. See al so the FireEye blog po st on ba selining RDP  activity. C2 using source systems with default Windows hostnamesLook fo r default Windows hostnames that fit the structure WIn-[a-Z0-9]{11} (e.g., W In-aBCDEFGH1JK) in P E certificates, SSL an d SSH certificates, and RDP han dshakes. C2 using SSHLook fo r new, unique, or unusual SSH sessions. Logging of SS H keys and fingerprints would quickly an d easily identify an anomalo us session as a result of malware. Look fo r SSH over non-standard ports. Compromised VPn accounts aTT&CK: T1078Look fo r VPn logon anomalie s based on infea sible patte rns such as source account location, IP address, and hostname a ssociation s. Check o ut the FireEye blog po st and free toolset for VPn logon analy sis, GeoLogonaly zer. If you use SMS-ba sed MFa, look fo r phone n umbers registered outside the country where your employee s operate. Malware masquerading as Microsoft CorporationLook fo r PEs with mismatche d PE metadata such as contain s \"Bitvise\" strings and also \"Microsoft Corporation\" in the meta data. Look fo r unsigned \"Microsoft Corporation\" bina ries in the g roup's common staging directories. Use of customized Bitvise binariesLook fo r PEs with Bitvi se PDB path strings such as d:\\repos\\main\\ssh2\\. Use of customized OpenSS H binariesLook fo r PEs with content \"Mic rosoft openSS H client.\" Use of customized Cryptcat b ut with default passwordLook fo r PEs that drop Cryptcat bina ries or contain C ryptcat string content such as the default password \"metallica.\" Timestomping via PowerShell aTT&CK: T1099Look fo r timestomping comman d strings such as \".CreationTime=\" in PowerShell scripts or in PowerShell comman d-line ent ries. Look fo r PEs with nTFS creation time p rior to PE compile time. Deployment of binaries with debug information from develope r workstations with Visual Studio 2010Look fo r PEs with PDB path s containing default or generic paths such as \\Users\\user\\Documents\\Visual Studio 2010 \\ \\Documents\\Visual Studio 2010 \\. Use of Thinstall for packaging malwareLook fo r PE with content \"thin stall\\modules\\boot_loa der.pdb.\" Look fo r Thinstall bina ries that have c reated virtualized files in the context of the SYSTEM user \"C:\\Win dows\\SysWOW64\\config\\ systemprofile\\appData\\Roaming\\Thin stall\\.\" Use of favored directories for operating, staging an d executing file sLook fo r new, unexpecte d, or otherwise anomalo us binaries in the follo wing directories: C:\\Windows\\system32\\inetsrv\\ C:\\Windows\\temp\\ C:\\Windows\\SysWOW64\\wbem C:\\Windows\\SysWOW64\\drivers C:\\Windows\\SysWOW64 C:\\Windows\\system32\\wbem\\ C:\\Windows\\system32\\drivers\\ C:\\Windows\\system32\\ C:\\Windows\\ C:\\Users\\Public\\Lib raries\\ C:\\Users\\administrator\\appdata\\local\\temp\\ C:\\ssh\\ C:\\perflogs\\admin\\servermanage r\\ssh\\ C:\\perflogs\\admin\\servermanage r\\ C:\\perflogs\\admin\\ C:\\perflogs\\ C:\\cpqsystem\\ C:\\hp\\hp diags\\ C:\\hp\\bin\\log\\ Table 1: TRITOn actor methodology an d discovery strategies Outlook There is often a singular focus from the security comm unity on ICS malware largely due to its novel nat ure and the fact that the re are very few example s found in the wild. While thi s attention i s useful for a variety of reasons, we argue that defenders and incident responders should focus more attention on so-called \"conduit\" systems when trying to i dentify o r stop ICS-focused intrusions. In an attempt to raise comm unity awareness surrounding this actor’s capabilitie s and activitie s between 2014 and 2017—an effo rt compo unded in impo rtance by o ur discovery of the th reat acto r in a second critical infrastructure facility— we have shared a sampling of what we know about the group's TTPs and custom tooling. We enco urage ICS asset owners to leve rage the detection rules and other information incl uded in this report to hunt for related activity a s we believe the re is a good chance the th reat acto r was or is present in othe r target networks. For IT and OT inci dent response support, please contact FireEye Man diant. For more in-depth analy sis of TRITOn and other cyber threats, consider subscribing to FireEye Cybe r Threat Intelligence . FireEye’s SmartVision technology, which searches for attacke rs during late ral movement activitie s by monito ring east-west traffic in IT and OT net works, reduces the risk of an attack reaching sensitive ICS processes. This is particularly relevant fo r sophisticated ICS-related intrusions as attacke rs typically move f rom corporate IT to OT networks through systems that were accessible to both envi ronment s, far beyond perimeter defenses. appendices appendix a: Discovery Rules appendix B: Technical analy sis of Custom attack Tool s appendix C: MITRE aTT&CK JSO n Raw Data Indicators of Comp romise Filename Hash KB77846376.exeMD5: 47f9cc543905 a69a423f9110ae7deffb SHa256: 87648aad45d91 42d1d825d 728b7aa098f92aea38698209d038 ba58b7385f8df6 KB77846376.exe.x64MD5: ee477f dee8b6ad4fe778a6fa4058f9aa SHa256: 2141b526a81bb87b964880e69933 aad3932131 ccccee5949d2a16c1e124ccdbb netexec.exeMD5: aca94bb7bdfb735f267f083e28f4db37 SHa256: c55e63f8a3b328c3ba77cebf 821bdc5243b15a029805 7e75f7605d0922 c8d7cd runsvc.exeMD5: 1904cad4927541e47d453becbd934bf0 SHa256: 70efbd074326e7bbd4e851ded5c362fe5fe06282 ed4bbb4b 9f761f1b12ee32f7 svchostpla.exeMD5: 121772100 e46dde2d631 7b08c7a59e13 SHa256: 910b26c942c0cff8b1f5a57e1521801 bfd54c8cbcfd23d3d11 ea9fe27ca4a0e9 compattelp rerunner.exeMD5: 35f443608 fc4eeb7 8f9347a9dfc5aea1 SHa256: 133059 4c2685 fe6fc2c87439ef151dfacabc7 8402379a73be399530 48b144960 compattelp rerunner.exeMD5: 10fd713eb3bc6a8f7abd703010 4d0ce7 SHa256: 6ab948ec61f1f7e04119da85d5263d 428a1de070edad3a4e796bada2ab05cea7 compattelp rerunner.exeMD5: 64822303 4bda28c415a8deeb74dcb3ef SHa256: 4c2383 c8650112 e00cb8b52d0 faac7b9820 7073db081d bdcbb278f0470b869a1 ProgramDataUp dater.xmlMD5: c744006ebaaf25cd7fad0ebba56e4f84 SHa256: 6d2d9623 762f8229 49eef80b02f4ba2d2622 7eb23ad5b8d1a0a3d6d a3bc60d6 c napupdatedb.exeMD5: ba51f25db03a66c658d1 fd4396f32843 SHa256: 0fc391cdef0705f032109 e16f8f591e1e6f8ffccbc4 6f4eb4a 8fa0580 47c0adc alg.exeMD5: af5b9c9e4c6bfc6cb7fa5e4b04da8dc8 SHa256: 970fab66733ba594b435cf345c72814ee5f8443c44d28ef251f768ad66a6c052 userinit.exeMD5: 2d11be6755b80cfca5c2f5138881 ff25 SHa256: fc5b4c61f66beb58a62636 ab7c198e6ab7f38ce201f098f2818a5699 b8aa1138 csrss.exeMD5: de2e1d59 c81a2798a239baaa1edc0dd8 SHa256: 1848d26 e47ee4 937ef02e67a447b4 054d66f4d659 f1fbd8bda1482dc4f02c7c4 tquery.dllMD5: 31cd0738ec2e40ff086d fd84ac2510 fb SHa256: 98da0ce88de897e1b08733ac771edab5e5b2a2dda8aab0e73c1d41bade275ff6 txflog.dllMD5: 8db693f75a0cfe043a5810 f79965 4cf9 SHa256: f0dcbc83d911 c382d a7ba06a027bdd5861d1 a9b723ebe5d9d6 f6b79d7b70f29d cryptopp. dllMD5: 9a7234078559093 e06c9d321 48ed95a3 SHa256: 32f5d0a454c26e8aa6f4cad58f378233 7cc97cfe2305 bbfe564437e5f0d51 bbc DEFaULTMD5: 30a9ee20052 fcc34dee6b09f9210d 4ed SHa256: f7bdddbeae239305 ccca3b7eb1019b713bd0f7f0609 76494e81091 7a1e6ad5ee DEFaULT.BaKMD5: 519098 f3970d57b8429a9f6baeaf0f8c SHa256: 1f1902 e448252 7824ef2c0c2039162d b85e5a671caf0767a695116 b03cfc866d spl32.exeMD5: 62831 f960fe764f090d1201033202 438 SHa256: 1d359163 b6bd882 ae4c2685 4d69745136a23f3abb7c96341f6d17e18a546a5fd WinSaT.exeMD5: 685776e0020 ad9bfc4e2f4f7c7a 9c623 SHa256: 3b6fd091 b956b17476990 c6ca77dd8f77d203d31 70745d1b7c7894bfcf629b86 csrss.exeMD5: d05702c4c3924b08bac5079add4e2347 SHa256: 720ef3d5b5416974376ca4ea8bd536 e9eeb608f89e3b5b264e197266be8a9f4e clusapi.dllMD5: f985fd0d36 ab79bfccfae d6d6 4c5fc23 SHa256: 084c21e75fbfa5056 fec913c237ce7fba 314f88fbd687e8dcb1e777003f79b0e PolicMan. dllMD5: 6fbeb6a9f990402bf6f056c892fefcc6 SHa256: 9224c2b00e94e5c57d63820 aebe613843b5c851a027488148308 fac2d02206 f0 verifier2.dllMD5: 6f8b33cb1d101 c6bf0e9aeaf29b7e72d SHa256: 7633b4178611e28aedfa365a0de8ebe5f41ae8eeee71322f04d0e30e50ba2914 misc.mofMD5: 5efbd510 44fb90c6231438c51d8303 7f SHa256: 7bcca 38e43f3b37b1acea05899 a7c11dfb62de64531bd48af992d5 e400a1755f logoff.a spxMD5: 915efc70a812c1cb35b29ba0ecb7c4 8d SHa256: 0da4c0b83fa1ad4af9aad6c42feecc6c21c3fd0e660b9e5b3857ddeae3473d54 flogon.j sMD5: 0f144e79ea8d8b66fa973e0568 415501 SHa256: f81aa77d23ca6662 efb3e6e33538 a60e39abb5ca66102 e07ffa318a6d6cd78ec  Table 2: Indicators of comp romise  Email Up dates Information an d insight on to day's advanced threats from FireEye. SHaRE Recent Po sts 17 Mar 2020 16 Mar 2020 09 Mar 2020 RSS FEED: STaY CO nnECTED  First name Last name Email address Company name Threat Research Blog FireEye Stories Blog Industry Perspective s Blog Yes, I would like to receive communication s from FireEye. Please read more about our information collection an d use. SUBSCR IBE Six Fact s about address Space Layout Randomization on Windows  They Come in the night: Ransomware Deployment T rends  Crescendo: Real Time Event Vie wer for macOS    Home  FireEye Blog s Threat Research  TRITOn actor TTP P rofile, C ustom attack Tool s, Det...    Company Why Fi reEye? Customer Stories Careers Certification s and Compliance Investor Relation s Supplier Documents news and Events newsroom Press Releases Webina rs Events awards and Honors Email Preferences Technical S upport Incident? Report Security Issue Contact S upport Customer Portal Communities Documentation Po rtal FireEye Blog s Threat Research FireEye Stories Industry Perspective s Threat Map View the Late st Threats Contact U s +1 877-347-3393   Stay Connecte d  Copyright   2020  FireEye, Inc. all rights reserved.  Privacy & Cookie s Policy  | Privacy Shiel d | Legal Doc umentationSite Lang uage English COnTaCT US  REPORT a n InCIDEnT Solutions Services Customers Partners Resources Company  "
}