{
    "title": "Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog",
    "text": "01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 1 di 19https://www.group-ib.com/blog/cobalt/Secrets ofCobaltHow Cobalt hackers bypass your defensesAugust 15, 2017 · 11 min to read · Threat Intelligence ← Blog VestaMatveevaHead of theHigh-TechCrimeInvestigationDepartment(APAC)Moreposts ProductsServicesSolutionsSubscriptionPlansResourcesFreeToolsBlogCompany01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 2 di 19https://www.group-ib.com/blog/cobalt/ATMCobaltDigital ForensicsHackersIn June 2016, the first attack conducted bythe Cobalt group was tracked at a largeRussian bank, where hackers attempted tosteal money from ATMs. The attackersinfiltrated the bank’s network, gained controlover it, compromised the domainadministrator’s account, and reached the ATMcontrol server.The Bank’s Information Security teamdetected traces of malicious programs andsuspicious connections to the server. In orderto stop further unauthorized access, theentire bank was blocked from accessing theInternet. This turned out to be the bestsolution, as the Cobalt group set up acontrolled  botnet in the bank’s network whichwas very difficult to track and even harder tostop.The day after the attack, Group-IB expertscame to the bank’s central office and begansearching for the source of the attack;ascertaining the stages of its development,causes, and consequences; analyzing themalicious programs; and restoring the chain ofevents. The computers that were involved inthe attack were then examined.Group-IB forensic specialists immediatelyunderstood that they faced a new approach totargeted attacks on banks. They were notwrong. The June incident was a “test” of a newattack technique that the attackers would March 29, 2024 Hunting Rituals#4: Threathunting forexecution viaWindowsManagementInstrumentation March 15,2024 They’rewatchingus: Howto detectPegasusandotherspywareon youriOSdevice? February 21,2024 Extra credit:VietCredCareinformationstealer takesaim atVietnamesebusinesses View all01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 3 di 19https://www.group-ib.com/blog/cobalt/begin using in July in the CIS, Europe, andAsia. For example, over $2m USD was stolenfrom 34 ATMs operated by the First Bank, oneof Taiwan’s largest banks. In october 2016Group-IB published the  report about theCobalt group. Now, a year later, this group iscontinuing to attack banks, which is reportedmonthly by Group-IB’s  Threat Intelligenceteam.Initially the Cobalt group focused onjackpotting ATMs: they launched a programthat sent commands directly to thedispenser to issue cash. Then the groupshifted to other systems in the bank includingcard processing, payment systems, SWIFT.Once gaining access to such systems,attackers studied how payments and otherfinancial transactions are conducted to repeatthem. That said, the services, such as paymentprocessing systems or SWIFT are not actuallyhacked or the ‘weak point’. The actualvulnerability is the bank and the protectionmethods against such advanced attacks.The Cobalt group’s attacks are alwaysexecuted according to the same template. Thebasic principles of targeted attacks onfinancial institutions have not changed since2013 when the Anunak, Corkow, Buhtrap, andLurk groups began conducting the firstattacks on Russian banks. The only thing thathas changed is the tools. Attack stages areshown in fig. 1.01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 4 di 19https://www.group-ib.com/blog/cobalt/ Fig. 1 The Cobalt group’s stages of attackCurrently, the Cobalt group is attackinglarge financial organizations around theworld, that’s why it makes sense to talk aboutthe techniques used by this group to concealtheir traces in the network and circumventsecurity measures.NetworkpenetrationIn all cases investigated by Group-IB, theCobalt group used a set of spear phishingemails to gain initial access to the corporateinfrastructure. The attackers use mail serversto carry out mass mailing of phishingmessages containing attachments toemployees of the organization of interest.Message subjects and attachment names arewritten in such a way that the employees wantto open them (fig. 2).01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 5 di 19https://www.group-ib.com/blog/cobalt/Fig. 2 Examples of message subjects and attachmentnamesThe mailing is carried out on a mass scale: inany organization, messages are usually sent tobetween 10 and 40 employees. However, someof the email addresses belong to employeesthat no longer work at the organization, whichmeans that the Cobalt group likely uses out-of-date mailing lists. Each message containsan attachment that loads the payload – part ofCobalt Strike software – to the computer’soperating memory.In order to make this download possible,attackers have tried several differentformats of attachments and emails, as theirprimary task is to bypass mail filters,protection measures, and the company’ssecurity policy. First archives with .exe and.scr executables were used as an attachment(fig. 3).01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 6 di 19https://www.group-ib.com/blog/cobalt/Fig. 3 Example of a message with an executableattachment (.exe)The archive is password-protected in order tobypass anti-virus scans, security systems, andmail filters. However, when there is use of asecurity policy that prohibits the transfer ofencrypted archives, such an email messagemay be blocked, so the attackers would send.doc files that contain exploits for MicrosoftOffice (fig. 4). Fig. 4 The attackers would send .doc files thatcontain exploits for Microsoft Office.This scheme assumes the presence of a01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 7 di 19https://www.group-ib.com/blog/cobalt/vulnerable version of software. Companiescan protect themselves by updating allsoftware they use in a timely fashion. Ofcourse, the risk of zero-day vulnerabilitiesremains, but we have not yet seen their use inthese types of attacks. For organizations thatperform timely updates of their systems andadhere to strict security policies, the Cobaltgroup employs another method to delivermalicious code through emails with Worddocuments containing a malicious macro.When opening the document, the user mustclick on the “Enable content” button, whichenables macros (fig. 5). Fig. 5 Example of an email message with a Worddocument, which, when opened, requires the user toclick on the “Enable content” button to enable amalicious macro.One of Cobalt’s tasks when crafting spear-phishing emails is to conceal the sender. Inevents where of a simple substitution of thesender’s field, the majority of mail serversblock these messages. Therefore, the Cobaltgroup registered domains are similar to realones (for example, diebold.pw), and configured01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 8 di 19https://www.group-ib.com/blog/cobalt/their email server to distribute acting as theselegitimate domains (fig. 6). Fig. 6 Example of a message sent by attackers from adomain whose name is similar to the name of a realdomain.As soon as the attachment is launched andthe malicious code is executed, the CobaltStrike payload is loaded in the memory. Thistool is used for penetration testing, whichmeans that it isn’t available only to cyber-fraudsters. This software provides a full set offunctions for managing a downloaded module,and accordingly, an infected computer. Thisset includes a keylogger, screenshots, remoteaccess via VNC, injections into processes, theability to bypass the UAC security system, theMimikatz tool, which is used to compromiseaccess credentials for Windows OS accounts,the ability to scan open ports on an01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 9 di 19https://www.group-ib.com/blog/cobalt/organization’s computers, etc.Running in RAMCobalt Strike modules aren’t stored in the filesystem; their executable code can only befound in RAM. By default, the code runs in thecontext of rundll32.exe process, but can beinjected into any process, for example, toincrease the rights and number of privileges.In addition, Cobalt Strike enables users not toexpose a fragment of memory allocated in thecontext of another process, the RWX (Read,Write, Execute) attributes, which often revealinjected code. Finally, not all anti-virus toolscan scan RAM.Provision of themalwaresurvivabilityThe Cobalt group uses different methods toensure malware survivability on corporatenetworks. The goal is to set the startup path tothe executable file or program code, launchingit with the powershell.exe shell command to01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 10 di 19https://www.group-ib.com/blog/cobalt/access the Internet resource specified in thecode in order to download and install CobaltStrike module. In this way, the payload itself isnot saved in the system, but rather is reloadedeach time. Another bonus of this method isthat a different payload can be loaded eachtime.Startup is ensured only on several machinesthat have access to the Internet. As aresponse, the following startup methods havebeen recorded: through a service, startupregistry keys, and Windows OS tasks, byreplacing the legitimate executable softwarefiles prescribed in startup with the executablefile of the attackers. From our experience, theCobalt group uses a new method to provideits survivability in every attack. The dangerof OS tasks is that their startup can bedelayed. Even if the network is not infectednow, in a month the corresponding task maywork, and the payload will get into theorganization’s computers.01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 11 di 19https://www.group-ib.com/blog/cobalt/Fig. 7 Registry keys for startupBypassing anti-virus toolsUsually in spear-phishing emails, no exploitsor any executable modules are detected byanti-virus tools (this has been the case withall active groups). The attackers try toreassemble the loaded modules in order tobypass the signature analysis of anti-virustools. Cobalt Strike provides the ability to usethe Artifact Kit framework for these purposesand even modify it, as it is distributed in thesource code. Aside from that, startup isperformed by loading Cobalt Strike into themain memory without saving to the filesystem. Additional means of circumventinganti-virus tools include the use of exploits toincrease the level of rights and privileges,bypassing UAC, and injecting code intotrusted processes.Bypassing networksecurity01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 12 di 19https://www.group-ib.com/blog/cobalt/Cobalt Strike allows users to install two typesof modules: HTTP/HTTPS/DNS modules andSMB modules. The former module is installedon a system that has access to the Internetand provides interaction with the C&C serverusing HTTP/HTTPS/DNS protocols. After theemail message sent by the attackers isopened, such a module is downloaded to thesystem. Another module is installed even insystems that do not have Internet access, as,using SMB protocol (which is typically usedwithin a local network), the SMB module iscontrolled via infected computers running theHTTP/HTTPS/DNS module.To circumvent intrusion detection and prevention systems,as well as firewalls and proxy servers withsignature rules aimed at detecting requests ofa certain type, the Cobalt Strike modulesgenerate communication profiles using theHTTP protocol: the value of the protocol’sservice header and query parameters aregiven, the data can be forwarded as headervalue, as the value of the parameter sent withthe URI, as part of the URI, and sent in thebody of HTTP message. When interacting withthe C&C server, the data (executable files,commands, and the outputs of thosecommands) is encrypted. For interaction onHTTPS protocol, HTTP protocol profiles maybe used with an indicated SSL certificate, butfor data exchange on the DNS protocol, itrequires DNS A, AAAA, and TXT records. Inthis case, one may separately specify theinteraction intervals between the C&C serverand the module on the infected computer.01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 13 di 19https://www.group-ib.com/blog/cobalt/The Cobalt Strike module can use severalprofiles and switch between data exchangemethods on command from the C&C serverwithout the need to update the module. Theaddresses of the C&C servers change fromthe moment the intruders penetrate thecompany’s network until the moment themoney is stolen, thus avoiding blacklists of IPaddresses or domain names. In this way, acontrolled botnet is created within theorganization that has access to any computer,even those that do not have access to theInternet. Fig.8 Cobalt Strike infrastructureNetworkdistributionTo run malicious programs on other computers01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 14 di 19https://www.group-ib.com/blog/cobalt/on the network, including Cobalt Strikemodules, the following methods are used,which are provided by Microsoft products foradmin accounts to: After creation, the services are deleted.Remote access via RDP and using PsExec istypical for network administrators. Therefore,traces of programs that operate only in RAMare difficult to detect in a timely manner.Usually OS logs and memory dump can help.More detailed information can be obtainedduring an advanced security audit and byperiodically making backup copies of theselogs.Create a service on another computer to runthe program code, start the service, anddelete it. As for the command line, aprogram code is written and passed to theinput of the powershell.exe commandinterpreter; Connect to a shared directory (C$, ADMIN$)on another computer, copy the module to it,create the service, run it to start the module,and then delete the service; delete themodule. Connect to another computer usingPsExec.exe (the remote access program isincluded in the Microsoft SysInternals suite),copy the module, and run it; delete themodule. Connect to another computer via RDP, copythe module, and run it; delete the module. 01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 15 di 19https://www.group-ib.com/blog/cobalt/Use of standardtoolsCobalt Strike is publicly accessible, and can bedownloaded in order to learn and createdetection rules on the network. Aside fromthat, to work within an organization, the Cobaltgroup uses standard tools, including: To prevent this threat, the company shouldconfigure filter rules to detect the above-mentioned tools on the corporate network.TeamViewer calls can be controlled by ruleson the firewall, proxy server, etc.Conclusionremote connection via the RDP protocol(built-in capability of the OS); remote connection using PsЕxec; remote connection using TeamViewer, whichallows a user to preserve remote access incase control using the Cobalt Strike moduleis lost; network scanning using the SoftPerfectNetwork Scanner program; secure connection using the Plink program. 01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 16 di 19https://www.group-ib.com/blog/cobalt/After infecting one computer on anorganization’s network, the Cobalt groupanalyzes the programs used on it and searchfor critical servers and the computers fromwhich they are accessed. Financialorganizations usually spend a lot of money oninformation security and consider theirisolated subnets to be safe. However, all ofthese subnets are controlled by people, andthere is practically always access to a securesubnet from an unsecured one, even if it’s justfrom one computer with a unique account.This is exactly what attackers will be lookingfor. As we know from our experience, it takesfrom 2 weeks to 1.5 months to gain access tocritical infrastructure.This means that bank’s information securityspecialists have, on average, one month toidentify attackers on a network. Anti-virussolutions do not help, the only thing that canprotect your company is knowledge of how,who, and with what tools hackers areattacking. That’s why, it is critical to updatesoftware in a timely manner and study reportsfrom Threat Intelligence specialists thatprovide indicators of compromise and modernhacking techniques.Try Group-01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 17 di 19https://www.group-ib.com/blog/cobalt/IB ThreatIntelligencenow!Supercharge yourcybersecurity with arevolutionary cyber threatintelligence platform byGroup-IBShare this articleFound it interesting? Don't hesitate toshare it to wow your friends orcolleaguesRequest a demoRequest a demo 01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 18 di 19https://www.group-ib.com/blog/cobalt/ThreatIntelligenceFraudProtectionManagedXDRAttackSurfaceManagementDigital RiskProtectionBusinessEmailProtectionRansomwareProtectionPhishing andScamProtectionBotProtectionCISOData LeakDetectionRetail and e-CommerceResearchHubKnowledgeHubCertificatesWebinarsBlogAbout Group-IBCERT-GIBPartnerProgramMSSP andMDR PartnerProgramCareersInternshipMedia CenterContact Asia-Pacific:+65 3159 4398ProductsSolutionsServices SubscriptionplansResourcesCompany Subscribe to stay up to datewith the latest cyber threattrends Business Email* Contact 01/04/24, 20:52Uncover the modus operandi of the Cobalt group in targeted attacks on financial institutions | Group-IB Blog Pagina 19 di 19https://www.group-ib.com/blog/cobalt/Europe andNorthAmerica: +3120 226 90 90Middle Eastand Africa:+971 4 5681785info@group-ib.com  2003 – 2024 Group-IB is a global leaderin the fight against cybercrime, protectingcustomers around the world by preventingbreaches, eliminating fraud and protectingbrands.TermsPrivacyBusiness Email*I understand and agree that mypersonal data will be collected andprocessed according to the Privacyand Cookies Policy and unconditionallyagree and accept the Terms of Use*   This site uses cookiesWe use cookies on the website to makeyour browser experience more personal,convenient and secure. You may block ormanage the use of cookies, however, insome cases they’re essential to makethis site work properly. Learn more aboutcookies in Group-IB Privacy And CookiesPolicy.AcceptAcceptFind out moreFind out more"
}