{
    "title": "WIRTE Group attacking the Middle East",
    "text": "01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 1 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/The threat intelligence division of S2 Grupo (https://s2grupo.es/en/home/)For any incident, please contact us+34 902 882 992  (https://lab52.io/blog/)WIRTE Group attacking the Middle EastApril 02, 2019The Intelligence Development Group of S2 Grupo (https://s2grupo.es/en/home/) has carried out aninvestigation on an actor from whom LAB52 has not been able to ﬁnd references or similarities in opensources and who has been identiﬁed as WIRTE.The DFIR (Digital Forensics and Incident Response) team of S2 Grupo ﬁrst identiﬁed this actor in August2018 and since then the follow-up has been carried out during the last few months.This group attacks the Middle East and does not use very sophisticated mechanisms, at least in thecampaign started in August 2018 which was monitored. It is considered unsophisticated by the fact that thescripts are unobtrusive, communications go unencrypted by HTTP, they use Powershell (increasinglymonitored), and so on. Despite this apparently unsophisticated modus operandi compared to other actors,they manage to infect their victims and carry out their objectives. In addition, as will be seen during thereport, the detection rate of some of the scripts in December 2018 by the main antivirus manufacturers islow, an aspect that must be highlighted. We must be aware that once these scripts are executed, it is whenthe behavior analysis of many solutions will detect them, but this fact has not been studied by LAB52.This actor in all the artifacts analyzed shows his victims a decoy document in Arabic with different themes.During the report these documents will be analyzed and who could be the objectives depending on the topicdealt with in the document.Technical analysisAs indicated above, during the month of August 2018 S2 Grupo CERT we managed an incident aimed at thediplomacy of different Middle Eastern countries.The attackers used a malware made in Visual Basic Script (VBS) as a tool to control the victim. Starting fromthe study of this VBS from S2 Grupo CERT, the monitoring of this group was started, ﬁnding in other sourcesother artifacts from the same group but with different decoy documents and with different strategies ofexecution, persistence, and so on. S2 Grupo does not have enough information to make any type ofattribution or authorship. It is associated that these artifacts are related because they reﬂect similarities froma technical and temporal point of view and because of the decoy documents used, since sometimes they areidentical.One aspect observed during the investigation is that the attackers after running the VBS used it as anEmpire post-exploitation framework (https://github.com/EmpireProject/Empire(https://github.com/EmpireProject/Empire)).A total of ﬁve scripts plus the one involved in the incident could be collected. Below we detail the maincharacteristics of each.01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 2 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/Script 1: 617bbc71e5f0a645cbb8eeb6d4a1ece96ba0860c8ab5deda6a795e6ad244607aThis ﬁrst ﬁle can be seen in Virus Total and has a low detection (4/58). The last analysis took place on12/12/2018. In this case the ﬁle was uploaded from Palestine to Virus Total: In the image you can see that it was uploaded through the web, from PS (Palestine) and also that it wasuploaded for the ﬁrst time on 5 Aug. 2018.Network communication occurs over HTTP to the micorsoft[.]store domain to TCP/2082 port. This domainsince it exists has resolved to the following ip addresses:104.31.78.17104.31.79.17185.86.79.243Currently resolves to a Cloudﬂare address. Port 2082 is one of the ports allowed by Cloudﬂare for HTTPtrafﬁc. It should be noted that the ﬁrst IP address 185.86.79.243 is geolocated in Ukraine. This IP addresshas been assigned to different domains, among them the malicious one.Apparently the attackers changed their IP address and hid behind Cloudﬂare at some point.In this script this communication information is all in the RunPld() function. This function aims to downloadthe powershell code from the command and control server and execute it:01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 3 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/Another common function in these scripts is the writeDOC function. This function decodes the decoydocument, write it to disk and show it to the victim. This document is encoded in base64 and embedded inthe script itself in a variable. The VBS script copies itself to APPDATA through the copyVBS() function: The script itself does not establish persistence in its ﬁrst execution, so either the attackers deploy it laterwhen they execute powershell or ﬁx it by transporting this script. The script once copied to APPDATA willhave the following name: Update.vbs.01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 4 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/On the other hand, if the script is running from APPDATA it does not show the document and only executesthe RunPld() function which is the backdoor in powershell and that has been detailed previously. If it is notbeing executed from APPDATA it shows the DOC ﬁle “decoy”, it copies and executes the backdoor (script inpowershell).When the victim executes the VBS ﬁle, a Word document will be opened with the following content (you cansee on the left in Arabic and next to it the translation made by Google Translate): The document we have shown is intended to simulate that it was sent from the Ministry of Foreign Affairs ofSaudi Arabia. Presumably, it seems that the addressee was the Ministry of Awqaf and Islamic Affairs ofKuwait, since (Kuwait – Jeddah) appears in the very signature of the document. It was also apparentlyaddressed to the Kuwaiti Consulate of the Cooperation Council of the Arab States of the Gulf, a highlyimportant body within the countries of the Persian Gulf.The text mentions that attached, the recipient will ﬁnd a document from the Saudi Ministry of Foreign Affairscalled “Hajj affairs”, which is of interest to all those Arab countries that have citizens who have interests incarrying out the pilgrimage to the Mecca. In addition, it encourages recipients to forward the document toother government organizations in countries with interests linked to the “Hajj” that have been approved bythe same Ministry of Culture of Saudi Arabia. Presumably, the author intends to generate an infection amongthe “partner states” of Saudi Arabia; the “target” of the issuer could be the members of the diplomaticcorps of countries with interest in the “Hajj” and especially the diplomats who are part of the CooperationCouncil of the Arab States of the Gulf, since the issuer promotes the forwarding of the document to allinterested parties.There are ﬁve fundamental pillars within the religion of Islam. One of them is the “Hajj”, which implies that allMuslims must visit Mecca at least once in their lifetime. This monument is located in the Jeddah region withinSaudi Arabia. The “Hajj” is signiﬁcantly relevant to Muslims around the world. Consequently, this text isattractive and of interest to both Shi’ite and Sunni Muslims.The date of issuance of the document is relevant as it was held in August, approximately two weeksbefore the great pilgrimage, just when thousands of people of Muslim faith would begin the pilgrimage toJeddah in Saudi Arabia. Consequently, the chances of a possible victim opening the document increase01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 5 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/signiﬁcantly.Script 2: b4c20b56059a6c6762b4c99d04eb9177cb0a4707c58ef575817fb8b702f162aaThis ﬁle in Virus Total has a low detection, 2/56, and the last analysis took place on 1 Dec. 2018. In this case the ﬁle has been uploaded from Palestine to Virus Total: In the image you can see that it was uploaded through the web, from PS (Palestine) and also that it hasbeen uploaded for the ﬁrst time on 08/25/2018.The network communication in this case is also produced by HTTP to the domain micorsoft[.]store to theport tcp/2082.In this case the script has exactly the same code as the hash“617bbc71e5f0a645cbb8eeb6d4a1ece96ba0860c8ab5deda6a795e6ad244607a”. The only thing that variesis the decoy document that we can see below:01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 6 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/The information presented in the document is directly related to security issues and internal political affairs ofPalestine. The main actors mentioned in the text are Hamas, Al Fatah and the Palestinian government. Theinformation is an analytical summary of the current political situation in Palestine and even analyzes ingeostrategic terms some current aspects. In addition, the document informs about the potential politicalstrategies that the previously mentioned actors could undertake in the future. This type of information ishighly relevant for diplomats with political interests in the geographical area of Gaza and Palestine.Consequently, it might be feasible for the document’s target audience to be diplomats, politicians andprofessionals from the defense sector.Script 3: b906f3c19c19e1b20b2d00bfb82b5453d5386d63b4db901ecade0f33dd38326aThis ﬁle in Virus Total has a low detection, 3/56, and the last analysis took place on 1 Dec. 2018. In this case the ﬁle was uploaded from Sweden to Virus Total: In the image you can conﬁrm that it has been uploaded by the community, from SE (Sweden) and also that ithas been uploaded for the ﬁrst time on 6 Nov. 2018.The network communication in this case is also produced by HTTP to the micorsoft[.]store domain to theTCP/2082 port.In this case the script has exactly the same code as the previous two; the decoy document is identical to“617bbc71e5f0a645cbb8eeb6d4a1ece96ba0860c8ab5deda6a795e6ad244607a”, varying only from where itwas uploaded and the dates regarding the ﬁrst one.Script 4: 3d4a9466e9428ccb1cde05336f5366b29c7e5ae454ddaa4aa28c75c504c13d9601/04/24, 21:17WIRTE Group attacking the Middle East Pagina 7 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/This ﬁle in Virus Total has a low detection, 8/56, and the last analysis took place on 12/12/2018. We can seethat this document has a higher detection to the rest, although it is certain that some were not re-analyzed onDecember 12th. In this case the ﬁle was uploaded from Palestine to Virus Total: In the image you can see that it was uploaded through the web, from PS (Palestine) and also that it wasuploaded for the ﬁrst time on 08/25/2018. The upload date matches the hash date“b4c20b56059a6c6762b4c99d04eb9177cb0a4707c58ef575817fb8b702f162aa”.The network communication in this case is produced by HTTP to the domain ofﬁce365-update[.]co toTCP/2082 port. This hash changes the domain and then the structure of the script is different from theothers, although it maintains functions and similarities with the rest.The ip addresses to which the domain has resolved are:104.24.108.64104.24.109.64In this case, the domain has always resolved to CloudFlare and it has not been observed that it has resolvedto another IP address as in the previous case.The main of the script is simple and we are going to review its ﬂow:01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 8 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/We are going to see what logic each of the functions has.The ﬁrst function that we ﬁnd is writeTXT(): The function it does is to save, in a ﬁle named sys.txt and in a path set from the script, the content of theﬁleContent variable that is part of a powershell script. It should be noted that the write-to-ﬁle function used iswirteFile(), which as can be seen has produced a typographical error that has been seen in several of thescripts that implement this functionality.The function writeSCT(): The function creates an SCT (scriptlet) ﬁle on disk to execute through the JScript language a powershellwhose code is in the TXT ﬁle written by the writeTXT() function.01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 9 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/Regsvr32.exe is used to trigger the execution: The writeDOC() function performs the same logic as in the hash“617bbc71e5f0a645cbb8eeb6d4a1ece96ba0860c8ab5deda6a795e6ad244607a” and which has alreadybeen explained.In this case the decoy document shown to the victim is the same as that presented in“b4c20b56059a6c6762b4c99d04eb9177cb0a4707c58ef575817fb8b702f162aa”.Script 5: 4f5d633604b8a3cceb7d582bab640d47e8a5898458c5c2f0e28adcdf01aabf33This ﬁle has a higher detection rate than the previous ones: you can see that 20/58 antivirus identify it asharmful.01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 10 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/In the image you can see that it has been uploaded through API, from the US and also that it has beenuploaded for the ﬁrst time on 2 Sept. 2018. The date of upload is after the artifacts uploaded from Palestine,but close in time.In this case you can see a reference to this script in a tweet(https://twitter.com/ItsReallyNick/status/1036687952544448512(https://twitter.com/ItsReallyNick/status/1036687952544448512)) by Nick Carr (@ItsReallyNick), where hedetails all the technical aspects of the script: By viewing the tweet thread we can see how they indicate that in this case runs a VBScript #Houdini RATand that the command and control server is hxxp: //149.28.14[.]103:535/ is-ready.When looking for which domains have resolved to this IP address it is observed that the only onecategorized as malware is related to spdns.de and searching for this domain name we come to the analysishttps://gist.github.com/JohnLaTwC/ccdcbeb85649ef9feaae045482d694b9(https://gist.github.com/JohnLaTwC/ccdcbeb85649ef9feaae045482d694b9) (from @ JohnLaTwC) that showshow this domain is conﬁgured with port 535 and with HTTP requests from RAT Houdini. The domain wasresolving to IP addresses until August 30, 2018.The fact that in this case the actor uses a Houdini varies from the rest of VBS found, which based theirexecution on a powershell script that received commands from a remote server and executed them, but evenso there are several aspects that lead us to think that it is the same actor:• There are matching function names: writeTXT, writeDOC, wirteFile (this is a very important indicatorsince it is the same typographical error).• Then writeDOC has the same logic and, besides, the decoy document is also in Arabic.In this case the decoy document is different from the previous ones, so everything presupposes that theobjective is different:01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 11 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/The document refers to information related to the Security Forces in the territory of northern Gaza involved indefending of the border. The information refers to an accreditation and decoration by Palestiniangovernmental authorities for their members of the law enforcement and security forces. The target of thismalicious document could be soldiers, police, professionals linked to the Ministry of Defense andmembers of the diplomatic corps in Gaza. The current government within the Gaza Strip is Hamas, aparty that has a military arm considered by different countries as a terrorist group.Indicators of compromise01/04/24, 21:17WIRTE Group attacking the Middle East Pagina 12 di 12https://lab52.io/blog/wirte-group-attacking-the-middle-east/Copyright &copy Lab52 2019 by S2 Grupo (https://s2grupo.es/en/home/) | Legal notice (/legal_note) | Cookie policy (/cookie_policy) | Privacypolicy (/privacy_policy)Related ()Dex (https://lab52.io/blog/author/dex/) + posts (https://lab52.io/blog/pelmeni-wrapper-new-wrapper-of-kazuar-turla-backdoor/)Pelmeni Wrapper: New Wrapper ofKazuar (Turla Backdoor)(https://lab52.io/blog/pelmeni-wrapper-new-wrapper-of-kazuar-turla-backdoor/)February 19, 2024Tags: Backdoor(https://lab52.io/blog/tag/backdoor/),Kazuar (https://lab52.io/blog/tag/kazuar/),Pelmeni Wrapper(https://lab52.io/blog/tag/pelmeni-wrapper/), Trula(https://lab52.io/blog/tag/trula/), Wrapper(https://lab52.io/blog/tag/wrapper/) (https://lab52.io/blog/2344-2/)New invitation from APT29 to useCCleaner (https://lab52.io/blog/2344-2/)July 12, 2023Tags: APT29(https://lab52.io/blog/tag/apt29/), CCleaner(https://lab52.io/blog/tag/ccleaner/),DLLSide-Load(https://lab52.io/blog/tag/dllside-load/),phishing(https://lab52.io/blog/tag/phishing/), Russia(https://lab52.io/blog/tag/russia/), SVG(https://lab52.io/blog/tag/svg/) (https://lab52.io/blog/beyond-appearances-unknown-actor-using-apt29s-ttp-against-chinese-users/)Beyond appearances: unknown actorusing APT29’s TTP against Chineseusers (https://lab52.io/blog/beyond-appearances-unknown-actor-using-apt29s-ttp-against-chinese-users/)July 07, 2023"
}