{
    "title": "wp-dissecting-operation-troy",
    "text": "Dissecting Operation Troy:  Cyberespionage in South Korea 1 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER By Ryan Sherstobitoff and Itai Liba, McAfee  Labs   and James Walter, Office of the CTO2 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER Table of Contents 3 Executive Summary 3 Attack Timeline 4 State Sponsorship or Cyberterrorism? 4  The adversaries 5 The Analysis 5 The Malware  6  The dropper Trojan 6  MBR wiper 6  The remote-access Trojan 7 Linking to the Attackers 8 Code Analysis  9 Revealing “Operation Troy” 9  Persistent espionage campaign in South    Korea: 2009–2013 10  Tools and tactics17 Military Espionage Malware: 2009–2013 18  The encrypted network 20\t \t Data \texfiltration 21  The DLL relationship  24  Relationships to Http Dr0pper 24  Destroying the target 25  The campaigns 26 Conclusion 26 About the Authors 26 About McAfee Labs 27 About McAfeeExecutive Summary South Korea was hit by a major cyberattack on March 20, 2013, at 2:00 pm local time. This  cyberattack\tcaused\ta\tsignificant\tamount\tof\tdamage\tto\tthe\taffected\torganizations\tby\twiping\t the\thard\tdrives\tof\ttens\tof\tthousands\tof\tcomputers. McAfee \tLabs\tresearch\tprovides\tfurther\tinsight\tinto\tthe\tlikely\tsource\tof\tthese\tattacks.\t Though\tnot\tdefinitive,\tour\tanalysis\tprovides\ta \tmuch\tclearer\tpicture.\tThe\tresearch\talso\t indicates\tthat\tthere\tmay\thave\tbeen\ttwo\tdistinct\tgroups,\tattacking\tdifferent\ttargets. Our\tanalysis\tof\tthis\tattack—known\tfirst\tas\tDark\tSeoul\tand\tnow\tas\tOperation\tTroy—has \t revealed\tthat\tin\taddition\tto\tthe\tdata\tlosses\tof\tthe\tmaster\tboot\trecord\t(MBR)\twiping,\tthe \t incident was more than cybervandalism. The attacks on South Korean targets were actually  the\tconclusion\tof\ta\tcovert\tespionage\tcampaign. \tWHITE PAPER Dissecting Operation Troy:   Cyberespionage in South Korea 3 Dissecting Operation Troy: Cyberespionage in South KoreaConnect With UsAttack Timeline Our\tanalysis\tsuggests\tthe\tfollowing\torder\tof\tthese\tattacks. \t Later in this report we mention other elements that color  our\tview\tof\tthis\tevent,\tbut\tconsistent\tthroughout\tis\tour \t belief\tthat\tthe\tattackers\thad\taccess\tto\tthe\tenvironments \t prior to launching the wiping component. March 20 attack against banks and news agencies in  South Korea: 1. The remote-access Trojan was compiled January 26,  2013.2. The\tcomponent\tto\twipe\tthe\tmaster\tboot\trecord\t(MBR)\t of\tnumerous\tsystems\twas\tcompiled\tJanuary\t31. 3. An\tinitial\tvictim\twithin\tthe\torganization\t was\tspear-phished \t with\tthe\tremote-access\tTrojan.\tThis\tlikely\toccurred\tbefore \t March 20 and possibly weeks prior to the attack. 4. The\tdropper\twas\tcompiled\tMarch\t20,\thours\tbefore\t the attack occurred. 5. The dropper was distributed to systems across the  victim\torganizations,\tand,\twithin\tminutes\tof\texecution,\t the MBRs were wiped. This occurred around 2:00 pm  Seoul time on March 20.4 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER State Sponsorship or Cyberterrorism? Who conducted these attacks is still unclear, but our  research\tgives\tsome\tfurther\tinsight\tinto\tthe\tlikely\tsource.\t The\tclues\tleft\tbehind\tconfirm\tthat\tthe\ttwo\tgroups\t claiming\tresponsibility\twere\ta\tfabrication\tto\tthrow\t investigators\toff\tthe\ttrail\tand\tto\tmask\tthe\ttrue\tsource. The adversaries The two groups that appear to have been involved in the  attacks have had no prior connection until now.  ■NewRomanic Cyber Army Team: The samples  connected to this group are more convincing. The  majority\tof\tthe\twipers\t(found\tin\tthe\twild\tand\tretrieved\t from\tinfected\tsystems\tthrough\tother\tsources)\tcontain\t the strings “principes” and “hastati,” which also appear  in\ta\tmessage\tleft\ton\tone\tof\tthe\ttargeted\twebsites\tin\t the\tform\tof\ta\tweb\tpop-up.\tThe\twiper\tcomponent\talso\t overwrote\tthe\tMBR\twith\tone\tof\tthese\tstrings.\tThe\t following\tdata\t points\tsupport\tthis\tfact:  −The strings “principes”1 and “hastati”2\twere\tfound\t within\tthe\tcode\tof\tsome\tof\tthe\twiper\tcomponents.\t The\tsame\tstrings\twere\talso\tfound\tin\tthe\tweb\tpop- up\tmessage\tthat\twas\tleft\ton\tthe\tNocut\tNews\tKorea\t website. The strings are ancient Roman terms  that\tmake\treference\tto\tmilitary\tunits,\thence\ta\t “cyberarmy.”\tThe\tpop-up\teven\tstates\tsome\tof\tthe\t specific\tunits\tthat\twere\tpart\tof\thastati\twhich\twere\t involved in this attack.  −The\tremote-access\tTrojan\tthat\twas\tfound\thad\ta\t build\tpath\tthat\tincluded\tthe\treference\t“Make\tTroy,”\t a subdirectory\tof\tthe\tfolder\t“Work.”\tTroy3\trefers\tto\tan\tancient Roman region, again connecting the Roman  references\tto\tthis\tgroup,\twhich\tconsistently\tuses\t this theme.  ■The Whois Hacking Team: \tOn\tMarch\t20,\tthe\twebsite\tof\t the\tnetwork\tprovider\tLG\t+U\twas\tdefaced\tby\tthis\tgroup. \t Was it a coincidence that a second group was involved?  All\tof\tthe\tevidence\tindicates\t that\tthey\thad\ta\tstrong\t involvement, but there is no solid link to the group  because it did not claim involvement in the attacks.  However,\twe\tdo\thave\tthe\tcircumstantial\tlink\tof\ta\twiper\t component\tthat\tin\tpractice\toperated\tdifferently\tfrom\t the\twipers\temployed\tby\tthe\tNewRomanic\tCyber\tArmy\t yet also appears to be essentially the same wiper. The  Whois Hacking Team MBR wiper component includes  the\tsame\tgraphics\t(in\ta\tresource\tfile\tin\tthe\tbinary)\tthat\t appeared\ton\tthe\tdefaced\tLG\t+U\twebsite,\talthough\t the malware did not behave the same way. Within the  main\texecutable\tfile,\thowever,\twe\tdiscovered\ta\tsmall\t portion\tof\tthe\tcode\tthat\tmatched\tthe\tstructure\tof\tthat\t of\tthe\tNewRomanic\tCyber\tArmy\twipers\twe\tfound,\tso\t the Whois Team likely dropped the same wiper.  State sponsored or not, these attacks were crippling  nonetheless. The overall tactics were not that  sophisticated in comparison to what we have seen  before.\tThe\ttrend\tseems\tto\tbe\tmoving\ttoward\tusing\tthe\t following\ttechniques\tagainst\ttargets:  ■Stealing and holding data hostage and announcing the  theft—public\tnews\tmedia\thave\treported\tonly\tthat\ttens\t of\tthousands\tof\tcomputers\thad\ttheir\tMBRs\twiped\tby\t the malware. But there is more to this story. The main  group\tbehind\tthe\tattack\tclaims\tthat\ta\tvast\tamount\tof\t5 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER personal\tinformation\thas\tbeen\tstolen.\tThis\ttype\tof\ttactic \t is consistent with Anonymous operations and others  that\tfall\twithin\tthe\thacktivist\tcategory,\tin\twhich\tthey\t announce\tand\tleak\tportions\tof\tconfidential\tinformation.  ■Wiping the MBR to render systems unusable, creating  an instant slowdown to operations within the target The Analysis What were the motives behind these attacks, and why  did the attackers chose certain targets? The attacks  managed\tto\tcreate\ta\tsignificant\tdisruption\tof\tATM\t networks\twhile\tdenying\taccess\tto\tfunds.\tThis\twasn’t\tthe\t first\ttime\tthat\tthis\ttype\tof\tattack—in\twhich\tdestructive\t malware\twiped\tthe\tsystems\tbelonging\tto\ta\tfinancial\t institution—has\toccurred\tin\tSouth\tKorea.\tIn\t2011,\t the\tsame\tfinancial\tinstitution\twas\thit\twith\tdestructive\t malware\tthat\tcaused\ta\tDenial-of-Service.\t The\tattackers\tleft\ta\tcalling\tcard\ta\tday\tafter\tthe\tattacks\t in\tthe\tform\tof\ta\tweb\tpop-up\tmessage\tclaiming\tthat\tthe\t NewRomanic\tCyber\tArmy\tTeam\twas\tresponsible\tand\t had\tleaked\tprivate\tinformation\tfrom\tseveral\tbanks\tand\t media companies.  They\talso\treferenced\tdestroying\tthe\tdata\ton\ta\tlarge\tnumber \t of\tmachines\t(the\tMBR\twiping)\tand\tleft\ta\tmessage\tin\tthe\tweb \t pop-up\tidentifying\tthe\tgroup\tbehind\tthe\tattacks.\tThe\tpage \t title\tin\tInternet\tExplorer\twas\t“Hey,\tEverybody\tin\tKorea????” \t “Hi,\tDear\tFriends,\tWe\tare\tvery\thappy\tto\tinform\tyou\tthe\t following\tnews.\tWe,\tNewRomanic\tCyber\tArmy\tTeam,\t verified\tour\t#OPFuckKorea2003.\tWe\thave\tnow\ta\tgreat\t deal\tof\tpersonal\tinformation\tin\tour\thands.\tThose\tincludes; 2.49M \tmember\ttable\tdata,\tcms_info\t more\tthan\t50M\tfrom\t .\tMuch\tinformation\tfrom\t .\tWe\tdestroyed\tmore\tthan\t0.18M\tof\tPCs.\tMany\t auth Hope you are lucky. 11th, 12th, 13th, 21st, 23rd and  27th\tHASTATI\tDetachment.\tPart\tof\tPRINCIPES\tElements.\t p.s\tFor\tmore\tinformation,\tplease\tvisit\twww.dropbox. com\tlogin\twith\tjoseph.r.ulatoski@gmail.com::lqaz@ WSX3edc$RFV. Please also visit pastebin.com.” The Malware  A\tfew\ttypes\tof\t malware\twere\tinvolved\tin\tthese\tattacks.\t Each\tvariant\thad\ta\tparticular\tuse.\tSome\tpublic\treports\t mentioned\t only\tthe\tuse\tof\tthe\twiper\tcomponent.\t However, \t there\twere\tactually\tthree\tcomponents,\tall\twith\ta\tdifferent \t purpose, that assisted the attackers in the campaign. Component Purpose File Size Compile Date Dropper Trojan Installs the MBR  wiper418 Kb March 20, 2013 MBR Wiper Wipes the MBR of  the disk24 Kb January 31, 2013 Remote-Access  TrojanProvides backdoor  access to attackers46 Kb January 26, 2013 Table 1. Elements of the attack on South Korean targets.  There\twere\ttwo\tsubsequent\taspects\tto\tthis\tattack:  ■The\tdestruction\tof\tPCs\tusing\tthe\tMBR\twiper\t component, which occurred March 20.  ■Remote\taccess\tto\tthe\ttargets’\tenvironments\tfor\ta\t period\tprior\tto\tthe\tattack.\tThe\tduration\tof\tthis\taccess\t is unknown.6 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER The dropper Trojan The dropper Trojan was primarily used to download the  executable\tthat\tdestroyed\tthe\tsystems’\tMBRs.\tWe\tsuspect \t that\tthe\tdropper\tTrojan\twas\tdistributed\tat\tthe\ttime\tof\t the attacks via a compromised patch-management server  that pretended to run a legitimate update. The\tdropper\tTrojan\twas\tcompiled\tMarch\t20,\tthe\tday\tof\t the\tattack,\tand\tseveral\thours\tprior\tto\tthe\tdestruction\tof\t the systems. We suspect that the attackers had access  to\tthe\ttarget\tenvironment\tprior\tto\tMarch\t20.\tIt\tis\tunlikely\t that\ta\tlarge\tvolume\tof\tusers\t(some\t30,000+)\twere\tspear- phished on March 20 alone.  It’s\tlikely\ta\tmuch\tearlier\tcompromise\tled\tto\tthe\tattacks\t being staged internally. Thus, there was an initial victim  whose\tinfected\tsystem\tallowed\tthe\tattackers\tto\tgain\t access to other systems that let them distribute the  malware\tbroadly.\tThe\tinitial\tinfection\tcertainly\tcould\t have\tcome\tfrom\ta\tspear-phishing\tattack.\tThe\tbackdoor\t component was compiled in late January. The attackers  could have been inside the networks since February.  This timeline is plausible given that the attackers claim  to\thave\tstolen\ta\tvast\tamount\tof\tinformation\tfrom\tthese\t networks prior to wiping the MBRs. Our\tfurther\tanalysis\tled\tus\tto\tdiscover\tadditional\t components that support our conclusion:  ■A remote-access Trojan was discovered to have  compromised\tsome\tof\tthe\ttarget\tenvironments,\t specifically\tan\tinternal\tserver\tused\tto\tdistribute\t updates\tto\tthousands\tof\tPCs.\tThis\tTrojan\tvariant\twas\t compiled on January 26 and was detected by the  security\tindustry\ton\tMarch\t25.\tMcAfee\tdetected\tthis\tthreat\tas\tRDN/Generic\tPWS.y!io.\tThis\tTrojan\twas\tbuilt\t with\tthe\tMicrosoft\tVisual\tC++\tVersion\t2.9\tcompiler\twith\t a\tfile\tsize\tof\t47KB. MBR wiper We\thave\tseen\tseveral\twiper\tsamples\tto\tdate—all\twere\t compiled\ton\tJanuary\t31.\tThe\twiper\titself\tis\trelatively\t small\t(24\tKb)\tand\tis\tintroduced\tinto\tthe\tenvironment\tvia\t a dropper Trojan that is 418 Kb and was compiled the  day\tof\tthe\tattacks. Upon executing the malware, the main dropper  (9263e40d9823aecf9388b64de34eae54)\tcreates\tthe\t file\tAgentBase.exe,\tthe\tMBR\twiper\tcomponent.\tThis\tfile\t is\tplaced\tin\tthe\tinfected\tuser’s\tapplication\tdata\tfolder,\t executes, and immediately starts the countdown to wipe  the\tsystem\tand\trender\tit\tunbootable.\tThis\tfile\twas\tcompiled \t approximately\ttwo\tmonths\tprior\tto\tthe\tattack’s\ttaking\tplace. \t The\tmain\tdropper\tcomponent\twas\tcompiled\tthe\tday\tof\t the attack, March 20, at 4:07 am Seoul time. The dropper  installed the wiper, which destroyed the MBRs at around  2:00 pm Seoul time. Once the dropper executed,  the systems were wiped within minutes. Thus, these  components\tlikely\tweren’t\tdistributed\tuntil\tthe\ttime\t when the attackers wished to destroy these machines.  The remote-access Trojan It’s\tnot\twidely\tknown\tthat\tthe\tattackers\tused\ta\tremote- access Trojan to compromise an internal server. The  attackers used this internal server to distribute the wiper  component\tto\tthe\tthousands\tof\tPCs.\tThe\tremote-access \t Trojan\thad\ta\tfile\tsize\tof\t46\tKb\tand\twas\tcompiled\ton\t January\t26,\tfive\tdays\tbefore\tthe\tMBR\twiper\twas\tcompiled.7 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER As we concluded earlier, we have determined that  the attackers had access to the environment prior to  wiping the systems. The remote-access Trojan was  likely delivered to an internal PC via a spear-phishing  campaign. From this system, the attackers accessed  other internal resources. The Trojan was designed to  operate\twithin\tInternet\tExplorer—it\tlaunched\ta\thidden\t instance\tof\tInternet\tExplorer\tand\tinjected\titself\tinto\tthe\t running process. Figure 1. The process monitor shows the remote-access Trojan  spawning an instance of Internet Explorer. The\tTrojan\timmediately\tmodified\tthe\tproperties\tin\tthe\t registry\tto\tallow\tfor\tremote\tconnections\tto\tthe\tsystem.Linking to the Attackers Linking\tmalware\tto\tits\tdevelopers\tisn’t\talways\tan\teasy\t task.\tMost\tattackers\tare\tcareful\tenough\tto\tensure\tthey\t can’t\tbe\ttraced.\tThis\tis\tespecially\timportant\tin\tcases\t such as cyberespionage, in which the intent is to remain  invisible.  In\tour\tanalysis\twe\tobserved\ta\tnumber\tof\tunique\t attributes in the components involved in these attacks.  These\tmarkers\tallowed\tus\tto\tlink\tspecific\tsamples\tto\ta\t specific\tgroup. Two\tgroups\thave\ttaken\tcredit\tfor\tthese\tattacks,\tbut\twe\t can tell that the variants that wiped the systems link to  the\tNewRomanic\tCyber\tArmy\tTeam. Although the Whois Hacking Team is more public due  to\tits\tdefacement\tof\tthe\tnetwork\tprovider\tLG\t+U’s\t website,\twe\tcan\tlink\tthis\tgroup\tto\tonly\tone\tsample\tof\ta\t wiper,\twhich\toperates\tdifferently\tthan\tthe\tothers.\tThe\t Whois\twiper\tis\tmuch\tlarger,\twith\ta\tfile\tsize\tof\t236\tKb\t and was compiled March 19, whereas the other wiper  components\tare\ta\tmere\t24\tKb.\tThe\tlarger\tsize\tsuggests\t the\tWhois\twiper\tcontains\tmore\tfunctions.\tThus,\twe\t can\tdefinitively\tlink\tNewRomanic\tto\tthe\tsamples\tused\t to\twipe\tthe\tMBRs\tof\tsystems\twithin\tthe\tSouth\tKorean\t financial\tinstitution\tnetworks.\tNewRomanic\twill\tremain\t the prime suspect involved in the attacks. Confirming\tthe\tlink\tbetween\tNewRomanic\tand\tknown\t wiper\tsamples,\twe\tfound\ta\tnumber\tof\twiper\tsamples\t contained either the string “hastati” or “principes” in the  calling\tcards\tleft\tby\tthe\tattacker.8 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER Sample MD5 Compilation  DateDetection  Name db4bbdc36a78a8807ad9b15a   562515c4January 31, 2013 KillMBR-FBIA 5fcd6e1dace6b0599429d9138   50f0364January 31, 2013 KillMBR-FBIA f0e045210e3258dad91d7b6b   4d64e7f3January 31, 2013 KillMBR-FBIA Table 2. Wiper samples connected to the NewRomanic Cyber Army  Team. Not\tonly\tdid\tmost\tof\tthe\twiper\tsamples\tlink\tto\t NewRomanic,\tbut\tthe\tremote-access\tTrojan\tcan\talso\t be linked to the group. The Trojan contained a build  path that mentions Troy in the directory path, again  consistent\twith\tthe\tancient\tRoman\treferences\tused\tby\t this group. Figure 2. The remote-access Trojan names Troy. This reference links the  attack to the NewRomanic Cyber Army Team. Code Analysis  It\tis\thighly\tunusual\tthat\ttwo\tgroups\tclaim\tresponsibility\t for\tthese\tattacks.\tNo\tfurther\tinformation\thas\tbeen\t revealed as to who they are or what their motivations  are; this is another reason to suspect that these two  groups\tare\tthe\tsame\tand\tare\tactually\tfabricated.\tThe\t supporting\tevidence\tcomes\tin\tthe\tform\tof\tcode\tanalysis\t determining\tthe\tdegree\tof\tsimilarity\tbetween\tthe\t samples.The Whois Hacking Team sample was compiled on March  19\tat\t1:57\tpm\tlocal\ttime\tand\tthe\tNewRomanic \tdropper\twas\t compiled on March 20 at 4:07 am local time. The attacks on  South\tKorean\tbanks\tand\tmedia\tand\tthe\tdefacement\tof\tLG \t +U occurred approximately 2:00 pm local time on March 20. McAfee\tLabs\tinvestigated\tthe\tdifferences\tbetween\t the\ttwo\tsamples\tat\ta\tcode\tlevel\tto\tdetermine\tif\tthere\t were\tany\tsimilarities.\tIn\tspite\tof\tthe\tfact\tthat\tthe\twiper\t component\toriginating\tfrom\t NewRomanic\tCyber\tArmy\t Team\twas\t24\tKb\tin\tsize\tand\tthe\tcomponent\tfrom\tWhois\t was\t236KB,\twe\tdid\tfind\tsimilarities\twithin\tthe\tcode.\t The\tWhois\tsample\tis\ta\tdropper\tfor\ta\tcomponent\tthat\t closely\tresembles\tthe\tone\tused\tby\tthe\tNewRomanic\t Cyber\tArmy.\tWe\tfound\ta\tsignificant\tnumber\tof\tmatching\t subroutines\tand\ta\tlarge\tnumber\tof\tcode\tsegments\twith\t only\tminor\tdifferences.\tThese\tsimilarities\tlead\tus\tto\t conclude that the payload code is based upon the same  initial\tcode\tand\twas\tembedded\tinto\tdifferent\tdroppers. Whois Sample NewRomanic  Sample# of Different  Functions _alloca_probe _alloca_probe exact match sub_4078C0 loc_40291F 15 sub_4030A0 loc_302f40 17 loc_404f54 loc_403169 1 loc_4033a1 loc_4084ee exact match loc_4065f4 loc_403694 exact match start sub_401870 131 sub_402D02 sub_407BC9 0 sub_407c7a sub_402DB3 10 sub_4083F5 sub_40327D 4 sub_403770 sub_409980 exact match Table 3. Partial analysis of subroutine differences.9 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER Revealing “Operation Troy” Persistent espionage campaign in South Korea:  2009–2013 Public reports covering what is known as the Dark  Seoul incident, which occurred on March 20, 2013,  addressed\tonly\tthe\tMBR\twiper\tcomponents.\tMany\tof\t the\tdetails\tof\tthis\tincident\thave\tbeen\texamined,\tand\t most analysts conclude this was an isolated, though  clearly\tcoordinated,\tattack.\tHowever,\tMcAfee\tLabs\thas\t found\tthat\tthere\twas\tmore\tto\tthe\tincident\tthan\twhat\t was widely reported. Our analysis has revealed a covert  espionage campaign.  Typically,\tthis\tsort\tof\tadvanced\tpersistent\tthreat\t(APT)\t campaign\thas\t targeted\ta\tnumber\tof\tsectors\tin\tvarious\t countries, but Operation Troy, as these attacks are now  called, targets solely South Korea.  From\tour\tanalysis\tof\tunique\tattributes\twithin\tthe\t malware samples, we have determined that the initial  code\tbehind\tthe\t“Troy”\tfamily\tof\tTrojans\twas\tcreated\t in 2010, as was another component that was dropped  by the Trojan HTTP Troy. The malware used in these  attacks\twere\tcompiled\tto\tspecifically\ttarget\tSouth\tKorea\t and used Korean-language resources in the binaries.  The malware connected to legitimate Korean domains  that\twere\trunning\ta\tbulletin\tboard\tand\tsent\ta\tspecific\t command\tto\ta\tPHP\tpage\tto\testablish\tan\tIRC\tchannel\tand\t receive commands.2009 US/South  Korean  Military  Attacks DDoS  Attacks10 Days of Rain Media/Broadcast  Attacks Financial Industry  AttacksChang EagleXP NSTARHTTP Troy Mail AttackHttp Dr0pper TongConcealment  Troy MBR Wiper 3Rat Client TDrop Suspected Link Solid Link Highly Probable LinkOperation Troy—Domestic Spying PeriodEspionage Campaign Dark Seoul 2011 2012 2013March 20, 20132010 Figure 3. The targeted attack Dark Seoul reached its culmination in  March 2013, but its roots go back at least to 2009, when the Trojan’s  source code was first compiled. Subsequent variations of the malware  have also been involved in these threats.  McAfee\tLabs\thas\tdetermined\tthat\tdomestic\tespionage\t activities\toccurred\tbefore\tthe\tMarch\t20\tattacks,\tmost\t likely to gain intelligence regarding the targets to carry  out\tfurther\tattacks\t(such\tas\tthe\tMarch\t20\tincident)\tor\t to\tbenefit\tthe\tattackers\tin\tsome\tother\tways.\tThis\tspying\t operation had remained hidden and only now has been  discovered through diligent research and collaboration.  We\talso\tsuspect\tthe\tattackers\thad\tknowledge\tof\tthe\t security\tsoftware\trunning\twithin\tthe\tenvironment\tbefore\t they\twiped\tthe\tsystems,\tgiven\tthat\tsome\tof\tthe\tvariants\t used\tin\tthe\tattack\twere\tmade\tto\tlook\tas\tif\tthey\twere\t anti-malware\tupdate\tfiles\tfrom\tbefore\tMarch\t20.\t The attackers who conducted the operation remained  hidden\tfor\ta\tnumber\tof\tyears\tprior\tto\tthe\tMarch\t 20\tincident\tby\tusing\ta\tvariety\tof\tcustom\ttools.\tOur\t10 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER investigation\tinto\tDark\tSeoul\thas\tfound\ta\tlong-term\t domestic spying operation underway since at least  2009. The operation, all based on the same code, has  attempted\tto\tinfiltrate\tspecific\tSouth\tKorean\ttargets.\tWe\t call\tthis\tOperation\tTroy,\tbased\ton\tthe\tfrequent\tuse\tof\t the word Troy in the compile path strings in the malware.  The\tprime\tsuspect\tgroup\tin\tthese\tattacks\tis\tthe\tNew\t Romanic\tCyber\tArmy\tTeam,\twhich\tmakes\tfrequent\tuse\tof \t Roman\tand\tclassical\tterms\tin\ttheir\tcode.\tWhile\tanalyzing\t malware\tcomponents\tfrom\tbefore\tthe\tMarch\t20\t incident,\twe\tfound\tboth\tsimilar\tand\tidentical\tattributes\t of\tthe\tfiles\tinvolved\tthat\tenable\tus\tto\tlink\tthem\tto\tthe\t 3Rat remote administration tool client used on March  20, as well as to samples dating to 2010. Furthermore,  we\tdetermined\tthat,\tthrough\tprior\taccess\tto\tthe\tvictims’\t networks, the attackers were able to upload the MBR  wiper\tcomponent\tand\tdistribute\tit.\tIt\tis\talso\tpossible\tthat\t the\tcampaign\tknown\tas\t10\tDays\tof\tRain\tis\ta\tbyproduct\tof\t Operation\tTroy.\tSome\tof\tour\tanalysis\tsuggests\tthat\tthe\t malware Concealment Troy was present in these attacks. Tools and tactics NSTAR: 2010–2011  NSTAR\tappears\tto\tbe\tthe\tfirst\tproduction\tversion\tof\tthe\t Troy\tfamily.\tThis\tTrojan\tis\tbased\tupon\tmalware\tcreated\t for\ta\tmilitary\tespionage\tcampaign\tthat\tfirst\temerged\tin\t 2009.\tNSTAR\tis\tthe\tfirst\tto\tuse\tcomponents\tin\tthe\tsame\t way\tthat\tlater\tvariants\tof\tthe\tTroy\tfamily\tdo.\tIt\tincluded\t a\tshared\tDLL\t(bs.dll)\tthat\twas\tfound\tin\tthe\t2010\tand\t 2011\tvariants.\tLater\tvariants\tuse\ta\tmodified\tversion,\t HTTPSecurityProvider.dll, which employs nearly the  same\tfile-mapping\tfunction\tas\tused\tby\tbs.dll.\tMost\tof\t these\tvariants\tare\tcompiled\tfrom\tthe\tWork\tdirectory.\tThat’s\tfairly\tconsistent\tthroughout\tall\tversions.\tThe\t DLL\twas\tcompiled\tusing\tMicrosoft\tVisual\tC++\tVersion\t6.\t Those\titerations\twere\tfound\tin\t2010-2011.\t The\tcall\tgraph\tgenerated\tfor\tNSTAR’s\tbs.dll\tis\tidentical\t with\tthat\tof\tHTTP\tTroy.\tThey\twere\tcompiled\tat\tleast\ta\t year\tapart\tfrom\teach\tother. Figure 4. Call graph for bs.dll from the NSTAR variant of the Troy Trojan. Figure 5. Call graph for bs.dll from the HTTP Troy variant.11 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER The DLL was compiled March 3, 2011, and includes an OCX  component that was compiled in late 2010. The OCX used  a\tvery\tdifferent\tcompile\tpath,\tbut\tbs.dll,\tthe\tbackdoor,\tis\t essentially the same as those seen in later versions.  The Work directory, with path shown below, is also used  with Troy variants Concealment Troy and 3Rat Client,  which were both compiled in 2013. E:\\Work\\BackUp\\2011\\nstar_1103\\BackDoor\\BsDll- up\\Release\\BsDll.pdb We\talso\tfound\ta\tfile-mapping\tfunction\tin\tthis\tvariant\t similar\tto\tthose\tin\tmost\tof\tthe\tnewer\tversions.\tThe\t unique\tstring\tbeginning\twith\t“FFFFFFF”\tis\tidentical\tand\t occurs throughout the later variants. Figure 6. NSTAR’s file-mapping function. The\tmalware\testablishes\tan\tinternet\trelay\tchat\t(IRC)\t channel to receive real-time commands in the same  manner as the military espionage malware.  Figure 7. NSTAR communicates with its control server via HTTP as its  primary channel.Chang and EagleXP: 2010 Another\tvariant\tfrom\t2010,\tEagleXP,\tis\tclosely\trelated\tto\t NSTAR\tand\tHTTP\tTroy\tbased\ton\treused\tcomponents.\t EagleXP\tused\tthis\tcompile\tpath:\t D:\\VMware\\eaglexp(Backup)\\eaglexp\\vmshare\\ Work\\BsDll-up\\Release\\BsDll.pdb Again we see the Work directory involved as in the other  post-2010 malware used in this campaign. A variant  compiled on May 27, 2010, also contained a very similar  compile\tpath.\tWe\twere\table\tto\tobtain\tsome\ttraffic\tfrom\t the control server. D:\\\\Chang\\\\vmshare\\\\Work\\\\BsDll-up\\\\Release\\\\ BsDll.pdb  The May 27 variant, called Chang, operated in the same  manner as other Troy variants and used the same bs.dll.  A\tKorean\tmanufacturing\t website\thosted\tboth\tthe\tcontrol\t server\tand\tan\tIRC\tserver. Figure 8. Outbound traffic from an infected system. Figure 9. The malware establishes a channel with the control server via IRC.12 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER Both\tthe\tChang\tand\tEagleXP\tvariants\tare\tbased\ton\tthe\t same\tcode\tthat\tcreated\tNSTAR\tand\tlater\tTroy\tvariants.\t These\tsimilarities\tconfirm\tthe\tattackers\thave\toperated\t for\tmore\tthan\tthree\tyears\tagainst\tSouth\tKorean\ttargets. Inside the IRC botnet Concealment  TroyTong TDropDochang.pe.kr Mupa.co.krNowq.net NSTARHTTP  Troy Http Dr0pper Byonshop.comDong.a.jpTroy Botnet Toneharbor.comSujewha.com Qitaegyo.com Delmundo.kr Theumin.net Gcglobal.com Apsumo.co.krHanja.edu.comTraveler.foxlink.com Solarshare.co.krLawbookcenter.co.krBabcom-h1.bluethunder.co Figure 10. The malware family and its control servers. During\tour\tinvestigation\twe\tdug\tinto\tthe\tattackers’\t controlling botnet, which was used until 2013. The  infrastructure\trelied\tupon\ton\ta\tnetwork\tof\thacked\t South\tKorean\twebsites\thosting\tIRC\tservers.\tThe\tinfected\t clients,\tin\tturn,\tcommunicated\twith\tthe\tIRC\tservers\tusing\t RSA\tencryption\tand\tused\tfunctions\timported\tfrom\tthe\t Microsoft\tCryptography\tAPI\tlibrary.\t Figure 11. Some functions imported from the Microsoft Cryptography  API. The attackers hardcoded the control domains in bs.dll  and\tdistributed\tit\tin\tthe\tfinal\tcompiled\tTrojan\tcode.\tEach\t variant\tof\teach\tgeneration\tof \tTrojans\tcontained\tdifferent\t hardcoded strings pertaining to the control servers. This  shows\tthat\tthe\tattackers\tfirst\tcompromised\tthe\tfuture\t IRC\tserver\tsites\tand\tthen\tcompiled\tthe\tcomponent\tand\t distributed\tit\tto\tinfected\ttargets.\t Figure 12. Hardcoded addresses in bs.dll.13 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER The\tnickname\tfor\tthe\tbot\tcan\tbe\tdetermined\tby\tthe\t outbound\ttraffic\tand\tinformation\twritten\tto\tthe\tWindows\t registry. One variant operating in June 2010 used  the nickname BS^000C2918AB11 with the password  wodehaopeng.\tThe\tmalware\tjoined\tthe\tIRC\tchannel\t #god\tand\tsent\tseveral\tprivate\tmessages\tto\twhat\twas\t likely the control server to receive instructions.  PRIVMSG X^111112352643[1] : A5TbaKuqCO641tirNl51rFLdNHeUhMbUiJ93sO5rip9X   7AZG0Y8rlZVmItEEfDrmNL19OpJrv2khO5WbflTqxs7FV   gzUNfdvtnjbObWeNN VPlFyXPQIEDj/4YnidGDAqp7   m8lFpnC2Pyz2+6OOooEUMqG6rKImyFQLM/V7K69E= Variant Bot IRC Nickname Http Dr0pper YN^000E0C3CB868 HTTP Troy B9^E02E29C4 TDrop TE02E29C NSTAR H^E02E29C4 Tong CO^000E0C2892FA EagleXP B3^000C2918AB11 Chang X^000C295C5DEC Table 4. IRC bot nicknames used by variants. HTTP Troy: 2011 In\t2011\tthe\tattackers\tcreated\tthe\tTrojan\tHTTP\tTroy,\t named\tfrom\tits\tcompile\tpath\tstring.\tThis\twas\tthe\tfirst\tof\t the\tTroy\tfamily\tof\tTrojans.\tTo\tdate,\twe\thave\tfound\tonly\t one\tsample\tof \tHTTP\tTroy.\tUpon\texecution,\tthe\tmalware\t launches\ta\tcrippled\tGUI\tthat\tallows\tthe\tvictim\tto\tinstall\t a screen saver displaying politically sensitive images.  We\tdon’t\tknow\twhy\tthe\tdevelopers\ttook\tthe\trisk\tof\tmaking the Trojan visible. The screensaver component  (chonanship.scr)\tis\tnot\tmalicious\tand\twas\tcompiled\ton\t December\t12,\t2010.\tIt\tcontained\timages\trelated\tto\tthe\t sinking\tof\tthe\tSouth\tKorean\tNavy\tship\tCheonan.4 HTTP  Troy was compiled on March 20, 2011 and contained  the compile path Z:\\source\\1\\HttpTroy\\BsDll-up\\ Release\\BsDll.pdb . As we can see, HTTP Troy uses the  same\tDLL\tas\tthe\tNSTAR,\tChang,\tand\tEagleXP\tvariants\t did in 2010. This path was contained in a dropped DLL  component\tthat\twas\tused\tto\testablish\ta\thidden\tIRC\t channel\tto\tthe\tattackers’\tcontrol\tserver.\tThe\tprimary\t dropper\tfile\tfor\tthis\tremote-access\tTrojan\twas\tdisguised\t as\tAhnLab’s\tSmart\tUpdate\tUtility\tsetup\tprogram.\tThe\t original\tfilename\twas\tSUpdate.exe.\t After\texecuting,\tthe\tremote-access\tTrojan\tmakes\ta\t connection\tto\tsujewha.com,\tthe\tIRC\tcontrol\tserver.\t Figure 13. HTTP Troy communicates with its control server via IRC. Http Dr0pper: 2012 We\tfound\ta\tsecond-generation\tTrojan\tbased\ton\tHTTP \t Troy that included the compile path Z:\\1Mission\\Team_ Project\\[2012.6~]\\HTTP Troy\\HttpDr0pper\\Win32\\ Release . This Trojan, Http Dr0pper, was compiled in  2012\tfrom\tthe\tHTTP\tTroy\tdirectory,\tindicating\tthat\tit\tis\tan \t advancement\tof\tthe\toriginal\tHTTP\tTroy. \t14 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER All\tof\tthe\tvariants\tfrom\tthis\tpoint\treuse\ta\tspecific\tDLL,\t which in some instances is named HTTPSecurityProvider. dll\tand\tuses\tthe\tMicrosoft\tCryptography\tAPI\tto\tsecure\t communications.\tWe\tcan\ttrack\tthe\treuse\tof\tthis\tDLL\t based\ton\tthe\tconsistent\tfile -mapping\tfunction\tthat\t appears throughout the variants. Figure 14. The malware Http Dr0pper using the same file-mapping  function and DLL as other versions. We\tcan\tdetermine\tthat\tanother\tvariant,\tTong\t(based\ton\t the\tdirectory\tin\twhich\tit\twas\t compiled),\talso\treuses\tthis\t DLL\tand\tcontains\tthe\tsame\tfunction. Figure 15. The malware Tong using the same file-mapping function and  DLL as other versions. Furthermore, variants such as Concealment Troy that  were\tcompiled\tin\t2013\tcontain\tthe\tsame\tfunction\tonce\t decoded.\tStill,\tsome\tof\tthe\tbase\tcode\tis\treused\tin\tthe\t supporting\tDLL\tfor\tConcealment\tTroy. Figure 16. The malware Concealment Troy using the same function  (encoded function shown). After\texecution,\tthe\tTrojan\tmakes\ta\tconnection\tto\tthe\t control\tserver\tusing\tspecific\tparameters\tthat\tinclude\tthe\t IRC\tnickname.\tThis\tcommunication\tpattern\tis\tconsistent\t with\tother\tvariants\tthat\treference\tTroy. Figure 17. Communicating with the control server. Tong: 2012 The Tong variant contains the compile path E:\\Tong\\ Work\\Op\\1Mission\\Team_Project\\[2012.6~]\\HTTP  Trojan 2.0\\HttpDr0pper\\Win32\\Release .\tIt\talso\t communicated using the same methods. This Trojan was  compiled on August 28, 2012. Figure 18. Tong communicating with its control server. Compile Date Compile Path July 4, 2012 Z:\\1Mission\\Team_Project\\[2012.6~]\\HTTP Troy\\ HttpDr0pper\\Win32\\Release\\3HttpDropper.pdb July 7, 2012 Z:\\1Mission\\Team_Project\\[2012.6~]\\ HTTP Troy\\HttpDr0pper\\Win32\\Release\\ HttpSecurityProvider.pdb August 28, 2012 Z:\\1Mission\\Team_Project\\[2012.6~]\\ HTTP Troy\\HttpDr0pper\\Win32\\Release\\ HttpSecurityProvider.pdb August 29, 2012 Z:\\1Mission\\Team_Project\\[2012.6~]\\HTTP Troy\\ HttpDr0pper\\Release\\HttpSecurityProvider.pdb Table 5. Components dropped by Tong.15 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER TDrop: 2013 TDrop\tis\tthe\tthird\tgeneration\tof\tHTTP\tTroy.\tTDrop\tuses\t one\tof\ttwo\tDLL\tfiles,\tpayload32.dll\tand\tpayload64. dll, and injects one, depending on operating system,  into svchost.exe. Previous versions used bs.dll, which  contained\tthe\tcode\tfor\tcommunicating\twith\tthe\tIRC\t botnet.\tTDrop\thas\tsome\tfurther\tfunctionality\tnot\t present\tin\tHTTP\tTroy\tthat\textends\tthis\tTrojan’s\tability\tto\t operate on 64-bit machines and to evade automated  analysis systems and emulation technologies.  The\tevasion\troutines\tcheck\tfor\tthe\tpresence\tof\t debuggers and tracers that attach to the parent  process.\tThis\teffectively\tcauses\tthe\tparent\tprocess\t to immediately terminate when under analysis by  emulation or sandboxing systems that attempt to hook  and\tmonitor\tAPI\tcalls\tcoming\tfrom\tthat\tprocess. Figure 19. The antidebugging feature in payload32.dll.Furthermore, TDrop uses a DLL to run under  nonprivileged accounts on Windows 7. This variant  was compiled on January 15, 2013, and contained the  compile path D:\\Work\\Op\\Mission\\TeamProject\\ [2012.11~12]\\TDrop\\Dropper32\\Release\\Dropper. pdb. The main executable, which extracts the other  components,\twas\tcompiled\tfrom\tthe\tpath\tZ:\\Work\\ v3zip\\misc.c  and Z:\\Work\\v3unzip.c . This is likely a  compression\ttool\tto\textract\tthe\tfiles\tto\tthe\tdesktop. Just as Http Dr0pper, TDrop uses the disguised dropper  component\tAhnlabUpdate.exe.\tThe\tunique\tcode\tis\t nearly identical to that used in Http Dr0pper with the  exception\tof\tthe\tlast\ttwo\tcharacters. Figure 20. TDrop reusing code from Http Dr0pper. When\tthe\tmain\tTrojan\tfile\texecutes,\tit\tlaunches\tRunCmd. exe,\twhich\titself\tdoesn’t\tappear\tto\tbe\tmalicious.\t RunCmd.exe then launches AhnlabUpdate.exe based  on\tthe\tspecified\tfilename\tin\tthe\tassociated\tRunCmd.ini\t file.\tThese\tfiles\tare\tcreated\tin\tthe\tdirectory\t114719_507_ AhnlabUpdateKit, which sits in a temp directory  created\ton\tthe\tdesktop.\tIt\tis\t obvious\tthat\tthe\tattackers\t were\taware\tof\tthe\tsecurity\tproduct\tthat\tthe\ttarget\t environment used and attempted to make the malware  appear as legitimate as possible. AhnlabUpdate drops  and runs an additional executable, which is the RAT  payload that establishes a connection with the control  server.16 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER Main.EXE RunCmd.exe ~ERC6C8.tmpAhnlabUpdate.exe Figure 21. TDrop disguises its presence by appearing to be a security  product. Concealment Troy: 2013 Another\t third-generation\t Troy\tfamily\tTrojan\tis\tConcealment \t Troy.\tThis\tversion\twas\tcompiled\tfrom\tthe\tsame\tdirectory\t as\tthe\t3Rat\tclient\tfound\tin\tthe\tvictims’\tenvironments\ton\t March\t20.\tSome\tcomponents\tfrom\tConcealment\tTroy\t suggest that the source code was originally written in  2010\tand\twas\tlater\tcompiled\tfor\tuse\tin\tthis\tcampaign.\t The 64-bit component to install the backdoor on the  victims’\tsystems\tcontains\tan\tinteresting\tcompile\tpath\t and\twas\tfirst\tcreated\ton\tNovember\t28,\t2012. C:\\test\\BD_Installer_2010\\x64\\Release\\BD_ Installer_2010.pdb The 32-bit version was compiled January 23, 2013, and  contained this compile path:Z:\\\\Work\\\\Make Troy\\\\Concealment Troy\\\\ Exe_Concealment_Troy(Winlogon_Shell)\\\\ SetKey_WinlogOn_Shell_Modify\\\\BD_Installer\\\\ Release\\\\BD_Installer.pdb  Component Compile Path Compile Date   (all 2013) BDInstaller1 Z:\\\\Work\\\\Make Troy\\\\ Concealment Troy\\\\Exe_ Concealment_Troy(Winlogon_ Shell)\\\\SetKey_WinlogOn_Shell_ Modify\\\\BD_Installer\\\\Release\\\\ BD_Installer.pdbJanuary 23 BackdoorEXE Z:\\\\Work\\\\Make Troy\\\\ Concealment Troy\\\\Exe_ Concealment_Troy(Winlogon_ Shell)\\\\Concealment_Troy(exe)\\\\ Release\\\\Concealment_Troy.pdbFebruary 4 BackdoorDLL Z:\\\\Work\\\\Make Troy\\\\ Concealment Troy\\\\Exe_  Concealment_Troy(Winlogon_ Shell)\\\\Dll\\\\Concealment_Troy(Dll)  \\\\Release\\\\Concealment_Troy.pdbFebruary 22 BDInstaller2 Z:\\\\Work\\\\Make Troy\\\\ Concealment Troy\\\\Exe_ Concealment_Troy(Winlogon_ Shell)\\\\SetKey_WinlogOn_Shell_ Modify\\\\BD_Installer\\\\Release\\\\ BD_Installer.pdbFebruary 22 MainDropper2 None February 22 MainDropper3 None February 23 Table 6. Compilation timeline for Concealment Troy. Concealment\tTroy\tdoes\tnot\temploy\treal-time\tIRC\tcontrol\t as\tearlier\tversions\tdid.\t(Concealment\tTroy\tis\ta\ttypical\t HTTP\tbotnet.) Figure 22. Concealment Troy abandons the use of IRC for real-time  control and uses HTTP as its primary channel.17 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER Military Espionage Malware: 2009–2013 McAfee\tLabs\thas\tuncovered\ta\tsophisticated\tmilitary\t spying network targeting South Korea that has been in  operation since 2009. Our analysis shows this network  is connected to the Dark Seoul incident. Furthermore,  we have also determined that a single group has been  behind\ta\tseries\tof\tthreats\ttargeting\tSouth\tKorea\tsince\t October\t2009.\tIn\tthis\tcase,\tthe\tadversary\thad\tdesigned\t a sophisticated encrypted network designed to gather  intelligence\ton\tmilitary\tnetworks.\tWe\thave\tconfirmed\t cases\tof\tTrojans\toperating\tthrough\tthese\tnetworks\tin\t 2009, 2010, 2011, and 2013. This network was designed  to\tcamouflage\tall\tcommunications\tbetween\tthe\tinfected\t systems\tand\tthe\tcontrol\tservers\tvia\tthe\tMicrosoft\t Cryptography\tAPI\tusing\tRSA\t128-bit\tencryption.\t Everything\textracted\tfrom\tthese\tmilitary\tnetworks\t would be transmitted over this encrypted network once  the\tmalware\tidentified\tinteresting\tinformation.\tWhat\t makes\tthis\tcase\tparticularly\tinteresting\tis\tthe\tuse\tof\t automated\treconnaissance\ttools\tto\tidentify\twhat\tspecific\t military\tinformation\tinternal\tsystems\tcontained\tbefore\t the\tattackers\ttried\tto\tgrab\tany\tof\tthe\tfiles. The\tattacks\twould\thave\toccurred\tin\tfour\tgeneral\tstages:  ■Initial\tcompromise\tvia\ta\t“watering-hole\tattack,”\twhich\t would\tlead\tto\tthe\texploitation\tof\tthe\tinternal\tsystems\t (in\tthe\t2009\tcase).\t(The\tattacker\tplaced\ta\tzero-day\t exploit\ton\ta\tmilitary\tsocial\tnetworking\tsite.)\tLater\tcases\t were\tlikely\tspear\tphishing\tto\tmore\tquickly\tget\tto\tthe\t right targets. October 21, 2009  Military AttacksAugust 21, 2010  Military Attacks take.chu.jp seung.us sarangbang.us christkingchurch.us February 28, 2011  Military AttacksJanuary 13, 2013  Military Attacks djuna.cine21.com strider.pe.kr dochang.pe.kr kairoshairstory.com.au ejiweb.com dennisoneil.net daeilho.net Figure 23. Encrypted data exfiltration network.  ■Malware\tautomatically\tperforms\treconnaissance\ton\t target\tsystems\tlooking\tfor\tdocuments\tof\tinterest.\t Malware can also scrape out passwords and registry  information\talong\twith\tdirectory\tlisting\tof\tinteresting\t files.  ■The\tattacker\tcan\trequest\tdirectory\tcontents\tfrom\t infected\tsystems\tbased\ton\tthe\tnumber\tof\tinteresting\t files\tfound.\tThey\tcan\tselectively\tgrab\tspecific\tfiles\tas\t needed.  ■Stolen\tfiles\tare\ttransmitted\tvia\tHTTP-encrypted\t channel\tto\tthe\tattacker’s\tserver.18 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER The encrypted network The\tattacker’s\tencrypted\tnetwork\tuses\tMicrosoft’s\t Cryptography\tAPI\tlibrary\tVersion\t1.0\tto\tencrypt\t communication channels to the control servers over  both\tHTTP\tand\tIRC.\tThe\tencryption\tuses\ta\t128-bit\tRSA\t key,\tshown\tas\t imported\tand\tused\tby\tthe\tfollowing\tcode. Figure 24. Function to call the Microsoft Cryptography API library. Figure 25. RSA encryption key used to camouflage communications.This\tnetwork\toperates\tover\tboth\tHTTP\tand\tuses\tIRC\t as\tsecondary\tchannel\tfor\treal-time\toperations.\tThe\tIRC\t network is based on the open-source library libircclient5,  and\teverything\tsent\tover\tthis\tIRC\tchannel\tis\tencrypted\t via\tthe\tMicrosoft\tCryptography\tAPI. Figure 26. Establishing an IRC channel session. The\tfollowing\tcommands\tare\tsupported\tby\tIRC\tto\tcontrol \t infected\tsystems\tin\treal\ttime.\tThis\tfunctionality\tenables \t the\tattacker\tto\tsend\tand\treceive\tfiles\ton\tdemand\tand \t execute remote commands. The messages sent between  client and servers are base64 encoded and then  encrypted\tusing\tthe\tCryptography\tAPI—thus,\ta\tmessage \t must be decoded and decrypted to be visible. This highly  sophisticated\tmethod\tprovides\tfor\tgreat\tflexibility\tover\ta \t secure encrypted channel that is not SSL.  ■Get bot version and uptime  ■Get\tdirectory\tfile\tlisting,\tall\tdrives\tor\tfrom\tspecific\tpath  ■Stop\tactivities\tfor\ta\tgiven\tperiod  ■Download\tfile\t  ■Send\tlocal\tfile\tto\tthe\tserver19 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER  ■Execute\tshell\tcommand  ■Connect\tto\tIRC\tserver  ■Change\tnick\t(IRC)  ■Join\tchannel\t(IRC)  ■IRC\tdisconnect  ■Remove\tbot\tfrom\tsystem Figure 27.  Functions for IRC commands.The\tHTTP\tportion\tis\tdesigned\tto\tget\tconfiguration\tdata\t used\tin\tthe\tIRC\tbotnet\tand\tto\tsend\tstolen\tdocuments\t back to the control server. Figure 28. HTTP Get command with parameters. Figure 29. HTTP Get command continued.20 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER Figure 30. HTTP Get command continued. The\tencrypted\tnetwork\toperates\tby\tscanning\tinfected\t systems\tand\tcategorizing\tthose\tsystems\tthat\tcontain\t interesting documents. The malware does not extract  every\tdocument\tthat\tis\tfound\tas\ta\tmatch\tthrough\tdrive\t scanning—rather\tit\tassigns\ta \tunique\tsignature\tto\tthe\t infected\tsystem\taccording\tto\twhat\tit\tcontains.\tLess\t interesting systems are less likely to have documents  extracted\tfrom\tthem.\tThe\tdirectory\tcontents\tare\t uploaded\tto\tthe\tattacker’s\tserver,\twhich\tlets\tthe\tattacker\t grab\tdocuments\tat\twill\tand\tkeeps\tthe\tamount\tof\t network\ttraffic\tlow.Data exfiltration The\ttheft\tof\tclassified\tinformation\tis\tthe\tprimary\tpurpose \t of\tthis\tnetwork\tand\twould\toccur\tthrough\tdrive\tscanning. \t Drive\tscanning\tlocates\tclassified\tinformation\ton\ttarget\t systems\tand\tgives\tthe\tattacker\tan\toverall\tidea\tof\twhat\t these military networks have. The malware searches  the\troot\tdisk,\tcounts\tthe\tnumber\tof\tinteresting\tfiles,\t and\tdetermines\tthe\tlevel\tof\tthat\tsystem’s\timportance\t to\tthe\tattacker.\tThe\tsearch\tcriteria\tare\tprimarily\tspecific\t file\textensions\tand\tkeywords\tin\tdocument\ttitles.\tThe\t keywords\tare\tall\tmilitary\tspecific.\tSome\trefer\tto\tspecific\t military units and programs that operate in South Korea.  This\tfunction\twould\tdetermine\tonly\tthe\tnumber\tof\t interesting\tfiles\tthat\tare\tcontained\ton\tany\tgiven\tsystem;\t another\tfunction\twould\textract\tthe\tlist\tof\tfiles\tthat\t match these search criteria. Figure 31. The drive scan function.21 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER In\taddition\tto\tsearching\tfor\tEnglish\tkeywords,\tthe\t function\tsearches\tfor\tKorean\tASCII\tcharacters\tthat\t represent\ta\tsubset\tof\tmilitary\tterms.\tMost\tkeywords\t specific\tto\tmilitary\toperations\tin\tSouth\tKorea\tare\tin\t English.\tThere\tis\talso\ta\tset\tof\tabbreviations. Figure 32. Google translation of ASCII characters. The\tfiles\tto\tbe\tsent\tto\tthe\tattacker’s\tserver\tare\tzipped\t using the open-source Zip Utils.6 The component  uses\tthe\tpassword\t“dkwero38oerA^t@#.”\tWe\thave\t consistently\tfound\tthis\tpassword\tin\tthe\tmalware\tdating\t back\tto\t2009.\tIt\tis\tused\tprimarily\tto\tarchive\titems\tto\tbe\t stolen\tfrom\tinfected\tsystems. Figure 33. The function to zip stolen documents. The DLL relationship  In\tall\tof\tthese\tthreats,\twe\thave\tseen\tthe\tconsistent\tuse\t of\tbs.dll,\ta\tstripped-down\tversion\tof\tip6ld.dll,\twhich\t we\thave\tfound\tin\tthe\tmilitary\tespionage\tcases.\tWe\tcan\t connect\tnot\tonly\tsimilar\tfunctions\twithin\tbs.dll\tfrom\t 2011\tto\tdate\twith\tthose\tof\tthe\tmilitary\tcases\tin\t2009\t and\t2010,\tbut\talso\tthe\tshared\tencryption\tkey\tfor\tzipping\t classified\tinformation\tto\tbe\tsent\tto\tthe\tcontrol\tserver. This\tip6ld.dll\tis\tthe\tsame\tas\tanother\tfile,\t~81923.dll.\tBoth\t operate in the same manner. Bs.dll appears to be used  primarily\tfor\tIRC\tbotnet\tcommunications. The\tcomponent\tbs.dll\thas\tbeen\tseen\tin\ta\tnumber\tof\t Troy-era\tmalware\tsamples:\tChang,\tEagleXP,\tNSTAR,\tMail\t Attack, HTTP Troy, Tong, Http Dr0pper, and others. The  file\tIp6ld.dll,\twhich\tcontains\tmuch\tof\tthe\tlogic\tdescribed\t22 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER in\tthese\tattacks,\tshares\ta\tnumber\tof\tcommon\tfunctions\t with\tbs.dll,\tincluding\tthe\tzip\tencryption\tpassword.\tIn\t addition,\tthe\tIRC\tand\tencryption\tfunctions\tare\tthe\tsame\t in\tboth\tfiles,\tindicating\tthat\tthey\twere\tbuilt\tby\tthe\tsame\t individual\tor\tgroup.\tThe\ttwo\tfunctions\tare\tlikely\tthe\t same\tsource\tcode\tin\tdifferent\tversions.\tThe\tprimary\t difference\tbetween\tthem\tis\tbs.dll’s\tlack\tof\tsearching\tfor\t specific\textensions\tand\tterms\tthat\tIp6ld.dll\tand\t~81923. dll\tcontain.\tThis\tsuggests\tbs.dll\trequires\ta\tsecond\t module, and we have seen that with the Mail Attack  variant, compiled in February 2011, which contained  both bs.dll and payload.dll, with the latter containing the  military-specific\tsearch\tand\textraction\tfunctions. Figure 34. The bs.dll function to scan all drives based on a specified  extension. The\tfollowing\tfunction\tfound\tin\tbs.dll\tlists\tthe\tcontents\t of\tspecified\tdirectories\tand\tzips\tthose\tcontents\tinto\tan\t archive\tfile\twith\ta\tpassword.\tThis\tfunction\tdoesn’t\thave\tany criteria and is likely disabled in some cases, such as  with HTTP Troy, which downloads a payload module to  search\tfor\tdata. Figure 35. A bs.dll function to list and send directory contents. Figure 36. A bs.dll function to send directory contents to remote server.23 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER Payload.dll appears to combine both drive searching and  directory\tlisting\tinto\ta\tsingle\tfunction.\tA\tseparate\taction\t puts\tthe\tdirectory\tcontents\tinto\ta\tseparate\tfile\tand\t prepares it to be sent to the remote server. Figure 37. A payload.dll drive-search function. Figure 38. A function to zip contents.24 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER Relationships to Http Dr0pper We\thave\tdetermined\tthat\tsome\tvariants\tof\tHttp\tDr0pper\t will execute payload32.dll, which is essentially the same  DLL\tthat\tis\tfound\tin\tTDrop.\tThis\tcomponent\tcontains\t military\tkeywords.\tOne\tvariant\tof\tHttp\tDr0pper\tmade\t use\tof\tpayload32.dll,\twhich\twas\tcompiled\ton\tAugust\t 23, 2012. The TDrop version was compiled on January  13,\t2013.\tThis\tconsistency\tconfirms\tfurther\tthat\tthe\t operations\tagainst\tSouth\tKorea\tare\tprimarily\tfocused\t on military intelligence gathering and have attempted to  break in since 2009. Destroying the target The espionage malware has the capability to destroy  systems in the same way that the March 20, 2013  attacks\tdisabled\tthousands\tof\tsystems\tin\tSouth\tKorea.\t This\tcapability\tcould\tbe\tdevastating\tif\tmilitary\tnetworks\t were\tto\tsuddenly\tbe\twiped\tafter\tan\tadversary\thad\t gathered intelligence. This was clearly the case with the  March\t20\tDark\tSeoul\tincident,\tin\twhich\twe\tconfirmed\t that the 3Rat Trojan gained access prior to the MBR- wiping event. There was at least one limitation, however:  we\tfound\tthe\tmalware\tof\tFebruary\t2011\tcould\twipe\tits\t targets\tonly\tif\tit\tdetected\tthat\tit\twas\tbeing\tdebugged\tor\t analyzed\tby\ta\tsecurity\tproduct. Figure 39. The malware’s function to wipe the MBR.25 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER The campaigns Through\tour\tresearch,\twe\thave\tdiscovered\ta\tnumber\tof\t distinct\tsubcampaigns\tas\tpart\tof\tthe\toverall\tOperation\t Troy,\twhich\thas\ttargeted\tmilitary\tforces\tin\tSouth\tKorea\t to\textract\tclassified\tinformation.\tThese\toperations\twere\t designed to occur in 2009 through 2013. Recently, we  uncovered evidence to suggest that they continued just  prior\tto\tDark\tSeoul.\tWe\tcan\tlink\tthe\tactor(s)\tresponsible\t for\tDark\tSeoul\tto\tthese\tparticular\tespionage\tcampaigns\t through various technical means.   ■The Troy-era malware is based on the same source  code\tto\tcreate\tthese\tspecialized\tversions\t(components\t shared\tover\tthe\tyears). ■The\tzip\tencryption\tpassword\tis\tfound\tin\talmost\tall\t instances,\twith\tthe\texception\tof\tConcealment\tTroy.  ■Consistent\tterms\tin\tthe\tmalware\tcompile\tpaths\t(for\t example,\tTroy,\tWork,\tand\tmore).  ■The\tsame\tIRC\tbotnet\tchannel\tand\tencryption\tmethod\t are used throughout the variants.   ■Military\tkeywords\tare\tconsistently\tfound\tthrough\tthe\t components\tspanning\t2009–2013,\tconfirming\tthe\t intent\tof\tthis\tadversary.  ■The\tsame\tstring-obfuscation\ttechniques\twere\tused \t in the 2009–2010 campaigns and the 2012–2013  campaigns. Malware from 2009  Military AttacksMalware from 2012  Military AttacksMalware from 2013  Military Attacks dkwero38oerA^t@# Mail Attack HTTP Troy NSTAR Chang EagleXP Http Dr0pper Tong TDropMalware from 2010  Military AttacksMalware from 2011  Military Attacks Figure 40. Shared encryption password.26 Dissecting Operation Troy: Cyberespionage in South KoreaWHITE PAPER Conclusion McAfee\tLabs\tcan\tconnect\tthe\tDark\tSeoul\tand\tother\t government attacks to a secret, long-term campaign that  reveals\tthe\ttrue\tintention\tof\t the\tDark\tSeoul\tadversaries:\t attempting\tto\tspy\ton\tand\tdisrupt\tSouth\tKorea’s\tmilitary\t and government activities. The Troy-era malware is  based on the same source code used to create these  specialized\tvariants\tand\tshares\tmany\tcommonalities,\t such\tas\tbs.dll\tand\tpayload.dll,\twhich\tare\tfound\t consistently\tthroughout\tthe\tfamilies.\tThe\tattackers\thave\t attempted since 2009 to install the capability to destroy  their targets using an MBR wiper component, as seen  in the Dark Seoul incident. From our analysis we have  established\tthat\tOperation\tTroy\thad\ta\tfocus\tfrom\tthe\t beginning to gather intelligence on South Korean military  targets.\tWe\thave\talso\tlinked\tother\thigh-profile\tpublic\t campaigns conducted over the years against South  Korea to Operation Troy, suggesting that a single group  is responsible.  About the Authors Ryan\tSherstobitoff\tis\ta\tthreats\tresearcher\twith\tMcAfee\t Labs.\tFormerly,\the\twas\tChief\tSecurity\tStrategist\tat\tPanda\t Security, where he managed the US strategic response  for\tnew\tand\temerging\tthreats.\tSherstobitoff\tis\twidely\t recognized\tas\ta\tsecurity\tand\tcloud\tcomputing\texpert. Itai\tLiba\tis\ta\tsenior\tsecurity\tresearcher\twith\tMcAfee\t Labs.\tHe\tis\ta\tmember\tof\tthe\tbotnet\tresearch\tteam.\tItai\t has worked in mobile vulnerability research as well as  large-scale reverse-engineering projects and display  driver\tdevelopment.\tHe\thas\tmore\tthan\t10\tyears\tof\t experience in reverse engineering. James\tWalter\tis\tthe\tdirector\tof\tGlobal\tThreat\tIntelligence \t Operations\tand\tmanages\tthe\tMcAfee \tThreat\tIntelligence \t Service\t(MTIS)\tfor\tthe\tOffice\tof\tthe\tCTO.\tHe\tfocuses \t on new threats research, as well as the cataloging  and\tmaintenance\tof\tvulnerabilities\tand\tassociated \t countermeasures.\tWalter\thas\tbeen\twith\tMcAfee\tfor\tmore \t than\t14\tyears\tand\tleads\ta\tglobal\tteam\tof\tthreats\tanalysts \t who\tcreate\tSecurity\tAdvisories, \tcountermeasure/detector \t feeds,\tMcAfee \tGlobal\tThreat\tIntelligence\tapplications, \t and\tmore.\tHe\tis\ta\tfrequent\tspeaker\tat\tindustry\tevents \t and\tconferences,\tand\tcohosts\t“AudioParasitics—The \t Official\tPodcast\tof\tMcAfee\tLabs.” About McAfee Labs McAfee\tLabs\tis\tthe\tglobal\tresearch\tteam\tof\tMcAfee.\t With\tthe\tonly\tresearch\torganization\tdevoted\tto\tall\t threat\tvectors—malware,\tweb,\temail,\tnetwork,\tand\t vulnerabilities—McAfee\tLabs\tgathers\tintelligence\tfrom\t its\tmillions\tof\tsensors\tand\tits\tcloud-based\tservice\t McAfee\tGlobal\tThreat\tIntelligence.\tThe\tMcAfee\tLabs\t team\tof\t500\tmultidisciplinary\t researchers\t in\t30\tcountries\t follows\tthe\tcomplete\trange\tof\tthreats\tin\treal\ttime,\t identifying\tapplication\tvulnerabilities,\tanalyzing\tand\t correlating risks, and enabling instant remediation to  protect enterprises and the public.  http://www.mcafee.com/labs 1. http://en.wikipedia.org/wiki/Principes 2. http://en.wikipedia.org/wiki/Hastati 3. http://en.wikipedia.org/wiki/Troy 4. http://en.wikipedia.org/wiki/ROKS_Cheonan_sinking 5. https://github.com/jonasschnelli/IRCClient 6. http://www.wischik.com/lu/programmer/zip_utils.htmlAbout McAfee McAfee\tis\tthe\tdevice-to-cloud\tcybersecurity\tcompany. \t Inspired\tby\tthe\tpower\tof\tworking\ttogether,\tMcAfee \t creates business and consumer solutions that make our  world\ta\tsafer\tplace.\tBy\tbuilding\tsolutions\tthat\twork\twith \t other\tcompanies’\tproducts,\tMcAfee\thelps\tbusinesses \t orchestrate cyber environments that are truly integrated,  where\tprotection,\tdetection,\tand\tcorrection\tof\tthreats \t happen simultaneously and collaboratively. By protecting  consumers\tacross\tall\ttheir\tdevices,\tMcAfee\tsecures\ttheir \t digital\tlifestyle\tat\thome\tand\taway.\tBy\tworking\twith\tother \t security\tplayers,\tMcAfee\tis\tleading\tthe\teffort\tto\tunite \t against\tcybercriminals\tfor\tthe\tbenefit\tof\tall. \t www.mcafee.com . McAfee and the McAfee logo are trademarks or registered trademarks of McAfee, LLC or its subsidiaries in the US and other countries.  Other marks and brands may be claimed as the property of others. Copyright   2018 McAfee, LLC. 3892_0418 APRIL 20182821 Mission College Blvd. Santa Clara, CA 95054 888.847.8766 www.mcafee.com 27 Dissecting Operation Troy: Cyberespionage in South Korea"
}